//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.80 - модуль "Платежный календарь"
// Отчеты по платежному календарю
//------------------------------------------------------------------------------

// установлен ли флаг (1..n) 0 - хотя бы один (ofpflag.vpp - то же)
#declare mIsFlag(_flags,_n)
  if (#_n = 0, (#_flags <> 0), (((#_flags shr (#_n - 1)) and word(1)) = 1))
#end

#doc
Отчеты - Платежный календарь (прототип).<br>
#end
.set name = 'ofpansee'
.hide
.Fields
  //----------------------------------------------------------------------------
  nstr_ViewField: word    // настройка видимости колонок
  //----------------------------------------------------------------------------
  PlanDates               // с по
  //----------------------------------------------------------------------------
  ModelName               // название модели
  //----------------------------------------------------------------------------
  TableType               // тип таблицы (cgOfpTable_Clearing or cgOfpTable_OfpPrihod)
  TableNRec               // NRec таблицы

  LevelName:string:'t:r'  // не удалит пробелы слева
  LevelVal                // валюта
  sOstBeg                 // остаток начальный
//  DoubleToStr( sOstBeg    , '&`&&&&&&&&&&&&&&&&&&')
  sPrihod                 // приход
  sRashod                 // расход
  sOborot                 // фин.поток
  sOstEnd                 // остаток конечный
  sDeficit                // дефицит : double
  sPrihodPlan             // план по приходу
  sRashodPlan             // план по расходу

  sPrihodFact             // фактический приход (по AktPerf)
  sRashodFact             // фактический расход (по AktPerf)
  sPlanDeviat             // отклонение от плана
  //----------------------------------------------------------------------------
  Perfomance:string:'t:r' // созданные документы
  //----------------------------------------------------------------------------

.endFields
 ^ ^

.{ OFP_Models CheckEnter
    ^
.}

.{

.{ OFP_Body CheckEnter
 ^ ^
 ^ ^  ^ ^ ^ ^ ^ ^ ^ ^  ^ ^ ^
.{ OFP_Perfomance CheckEnter
 ^
.}
.{ OFP_Line CheckEnter
.}
.}

.}
.endform

//*******************************************************************
#doc
Платежный календарь (полный).<br>
#end
.linkform 'ofpansee01' prototype is 'ofpansee'
.group 'Платежный календарь'
.NameInList 'Платежный календарь (полный)'
.p 55
.defo landscape
.set filler = '0'
.Fields
  CommonFormHeader       // название отчета
  PlanDates
  LevelName:'t:r'
  LevelVal
  sOstBeg
  sPrihod
  sRashod
  sOborot
  sOstEnd
  sDeficit
  sPrihodPlan
  sRashodPlan
.endFields
 Ш^
                                                                                                 Платежный календарь
                                                                                          @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{ OFP_Models CheckEnter
.}
.{
.[H
                                                                                                                                                                                                       лист @np@
──────────────────────────────────┬──────────┬─────────────────────┬────────────────────┬────────────────────┬─────────────────────┬─────────────────────┬────────────────────┬────────────────────┬────────────────────
           Наименование           │  Валюта  │       Остаток       │       Приход       │       Расход       │      Финансовый     │       Остаток       │       Дефицит      │       План по      │       План по
                                  │          │      начальный      │                    │                    │        поток        │       конечный      │                    │       приходу      │       расходу
──────────────────────────────────┴──────────┴─────────────────────┴────────────────────┴────────────────────┴─────────────────────┴─────────────────────┴────────────────────┴────────────────────┴────────────────────
.]H
.{ OFP_Body CheckEnter
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @~@@@@@  &'&&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&&
.{ OFP_Perfomance CheckEnter
.}
.{ OFP_Line CheckEnter
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
.}
.} Ш

.endform
//******************************************************************************
#doc
Отклонения от плана.<br>
#end

.linkform 'ofpansee02' prototype is 'ofpansee'
.group 'Отклонения от плана'
.NameInList 'Отклонения от плана'
.p 55
.defo landscape
.Fields
  CommonFormHeader       // название отчета
  PlanDates
  LevelName:'t:r'
  LevelVal
  sPrihod
  sRashod
  sPrihodFact
  sRashodFact
  sPlanDeviat

.endFields
 Ш^
                                                       Платежный календарь.Отклонения от плана.
                                                          @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{ OFP_Models CheckEnter
.}
.{
.[H
                                                                                                                                      лист @np@
──────────────────────────────────┬──────────┬────────────────────┬────────────────────┬────────────────────┬────────────────────┬─────────────────────
           Наименование           │  Валюта  │       Приход       │       Расход       │     Фактический    │     Фактический    │      Отклонение
                                  │          │                    │                    │       приход       │       расход       │
──────────────────────────────────┴──────────┴────────────────────┴────────────────────┴────────────────────┴────────────────────┴─────────────────────
.]H
.{ OFP_Body CheckEnter
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @~@@@@@  &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&&&
.{ OFP_Perfomance CheckEnter
.}
.{ OFP_Line CheckEnter
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
.}
.} Ш

.endform

//******************************************************************************
#doc
Исполнение финансовых операций.<br>
#end
.linkform 'ofpansee03' prototype is 'ofpansee'
.group 'Исполнение финансовых операций'
.NameInList 'Исполнение финансовых операций'
.p 55
.defo landscape
.Fields
  CommonFormHeader       // название отчета
  PlanDates
  LevelName:'t:r'
  LevelVal
  sPrihod
  sRashod
  sPrihodFact
  sRashodFact
  sPlanDeviat

  Perfomance:'t:r'

.endFields
 Ш^
                                                Платежный календарь.Исполнение финансовых операций
                                                        @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{ OFP_Models CheckEnter
.}
.{
.[H
                                                                                                                                      лист @np@
──────────────────────────────────┬──────────┬────────────────────┬────────────────────┬────────────────────┬────────────────────┬─────────────────────
           Наименование           │  Валюта  │       Приход       │       Расход       │     Фактический    │     Фактический    │      Отклонение
                                  │          │                    │                    │       приход       │       расход       │
──────────────────────────────────┴──────────┴────────────────────┴────────────────────┴────────────────────┴────────────────────┴─────────────────────
.]H
.{ OFP_Body CheckEnter
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @~@@@@@  &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&&&
.{ OFP_Perfomance CheckEnter
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.{ OFP_Line CheckEnter
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
.}
.} Ш

.endform

//******************************************************************************
#doc
Позиции риска неплатежеспособности.<br>
#end
.linkform 'ofpansee04' prototype is 'ofpansee' // отличие от 01-фильтр sDeficit>0
.group 'Позиции риска неплатежеспособности'
.NameInList 'Позиции риска неплатежеспособности'
.p 55
.defo landscape
.set filler = '0'
.Fields
  CommonFormHeader       // название отчета
  PlanDates
  LevelName:'t:r'
  LevelVal
  sOstBeg
  sPrihod
  sRashod
  sOborot
  sOstEnd
  sDeficit
  sPrihodPlan
  sRashodPlan
.endFields
 Ш^
                                                                               Платежный календарь.Позиции риска неплатежеспособности
                                                                                         @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{ OFP_Models CheckEnter
.}
.{
.[H
                                                                                                                                                                                                       лист @np@
──────────────────────────────────┬──────────┬─────────────────────┬────────────────────┬────────────────────┬─────────────────────┬─────────────────────┬────────────────────┬────────────────────┬────────────────────
           Наименование           │  Валюта  │       Остаток       │       Приход       │       Расход       │     Финансовый      │       Остаток       │       Дефицит      │       План по      │       План по
                                  │          │      начальный      │                    │                    │       поток         │       конечный      │                    │       приходу      │       расходу
──────────────────────────────────┴──────────┴─────────────────────┴────────────────────┴────────────────────┴─────────────────────┴─────────────────────┴────────────────────┴────────────────────┴────────────────────
.]H
.{ OFP_Body CheckEnter
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @~@@@@@  &'&&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&&& &'&&&#&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&&
.{ OFP_Perfomance CheckEnter
.}
.{ OFP_Line CheckEnter
.}
.}
.}
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Ш

.endform

//******************************************************************************
#doc
Рассогласование моделей.<br>
#end
.linkform 'ofpansee05' prototype is 'ofpansee' // пока то же, что и Позиции...
.group 'Рассогласование моделей'
.NameInList 'Рассогласование моделей'
.p 55
.defo landscape
.set filler = '0'
.Fields
  CommonFormHeader       // название отчета
  PlanDates
  ModelName
  LevelName:'t:r'
  LevelVal
  sOstBeg
  sPrihod
  sRashod
  sOborot
  sOstEnd
  sDeficit
  sPrihodPlan
  sRashodPlan
.endFields
 Ш^
                                                                               Платежный календарь.Рассогласование моделей
                                                                                     @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{ OFP_Models CheckEnter
    ^
.}
.{
.[H
                                                                                                                                                                                                       лист @np@
──────────────────────────────────┬──────────┬─────────────────────┬────────────────────┬────────────────────┬─────────────────────┬─────────────────────┬────────────────────┬────────────────────┬────────────────────
           Наименование           │  Валюта  │       Остаток       │       Приход       │       Расход       │     Финансовый      │       Остаток       │       Дефицит      │       План по      │       План по
                                  │          │      начальный      │                    │                    │       поток         │       конечный      │                    │       приходу      │       расходу
──────────────────────────────────┴──────────┴─────────────────────┴────────────────────┴────────────────────┴─────────────────────┴─────────────────────┴────────────────────┴────────────────────┴────────────────────
.]H
.{ OFP_Body CheckEnter
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @~@@@@@  &'&&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&&& &'&&&#&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&&
.{ OFP_Perfomance CheckEnter
.}
.{ OFP_Line CheckEnter
.}
.}
.}
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Ш

.endform
//******************************************************************************
#doc
Платежный календарь (по видимым колонкам).<br>
#end
.linkform 'ofpansee06' prototype is 'ofpansee'
.group 'Платежный календарь'
.NameInList 'Платежный календарь (по видимым колонкам)'
.p 55
.defo landscape
.set filler = '0'
.Var
    _Bit
  , _LastField: byte;
  aHeader   : array[1..6] of string;
  aFOb_Name : array[1..2] of string;
.EndVar
.Begin
   _LastField := 8; // кол- во проверяемых полей (последнее поле)
   _Bit := 1;
   aHeader[1] := '──────────────────────────────────┬──────────';
   aHeader[2] := '           Наименование           │  Валюта  │'
     + If( #mIsFlag( nstr_ViewField, 1 ), Pad( LPad( 'Остаток'   , 14 ), 21 ) + '│','')
     + If( #mIsFlag( nstr_ViewField, 2 ), Pad( LPad( 'Приход'    , 13 ), 21 ) + '│','')
     + If( #mIsFlag( nstr_ViewField, 3 ), Pad( LPad( 'Расход'    , 13 ), 21 ) + '│','')
     + If( #mIsFlag( nstr_ViewField, 4 ), Pad( LPad( 'Финансовый', 15 ), 21 ) + '│','')
     + If( #mIsFlag( nstr_ViewField, 5 ), Pad( LPad( 'Остаток'   , 14 ), 21 ) + '│','')
     + If( #mIsFlag( nstr_ViewField, 6 ), Pad( LPad( 'Дефицит'   , 14 ), 21 ) + '│','')
     + If( #mIsFlag( nstr_ViewField, 7 ), Pad( LPad( 'План по'   , 14 ), 21 ) + '│','')
     + If( #mIsFlag( nstr_ViewField, 8 ), Pad( LPad( 'План по'   , 14 ), 21 ) + '│','');
   aHeader[3] := '                                  │          │'
     + If( #mIsFlag( nstr_ViewField, 1 ), Pad( LPad( 'начальный', 15 ), 21 ) + '│','')
     + If( #mIsFlag( nstr_ViewField, 2 ), Pad( LPad( ''         , 10 ), 21 ) + '│','')
     + If( #mIsFlag( nstr_ViewField, 3 ), Pad( LPad( ''         , 10 ), 21 ) + '│','')
     + If( #mIsFlag( nstr_ViewField, 4 ), Pad( LPad( 'поток'    , 13 ), 21 ) + '│','')
     + If( #mIsFlag( nstr_ViewField, 5 ), Pad( LPad( 'конечный' , 14 ), 21 ) + '│','')
     + If( #mIsFlag( nstr_ViewField, 6 ), Pad( LPad( ''         , 10 ), 21 ) + '│','')
     + If( #mIsFlag( nstr_ViewField, 7 ), Pad( LPad( 'приходу'  , 14 ), 21 ) + '│','')
     + If( #mIsFlag( nstr_ViewField, 8 ), Pad( LPad( 'расходу'  , 14 ), 21 ) + '│','');

   aHeader[4] := '──────────────────────────────────┴──────────';
   aHeader[6] := '──────────────────────────────────────────────';

   while _Bit <= _LastField do
   {
     aHeader[1] := aHeader[1] + If( #mIsFlag( nstr_ViewField, _Bit ), '┬─────────────────────', '');
     aHeader[4] := aHeader[4] + If( #mIsFlag( nstr_ViewField, _Bit ), '┴─────────────────────', '');
     aHeader[5] := aHeader[5] + If( #mIsFlag( nstr_ViewField, _Bit ), '           ', '');
     aHeader[6] := aHeader[6] + If( #mIsFlag( nstr_ViewField, _Bit ), '──────────────────────', '');
     Inc( _Bit )
   }

   aHeader[1] := aHeader[1] + '┐';
   aHeader[4] := aHeader[4] + '┘';

!   aHeader[1] := aHeader[1] + Chr( 13);
!   aHeader[2] := aHeader[2] + Chr( 13);
!   aHeader[3] := aHeader[3] + Chr( 13);
!   aHeader[4] := aHeader[4] + Chr( 13);
!   aHeader[5] := aHeader[5] + Chr( 13);
!   aHeader[6] := aHeader[6] + Chr( 13);

End.
.Fields
  CommonFormHeader       // название отчета
  aHeader[5]
  aHeader[5]
  PlanDates
.endFields
 Ш^
                                    ^Платежный календарь
                              ^@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{ OFP_Models CheckEnter
.}
.{
!.[H
.Fields
!  aHeader[5]
!  aHeader[5]
  aHeader[1]
  aHeader[2]
  aHeader[3]
  aHeader[4]
.EndFields
!^^                                     лист @np@
^
^
^
^
!.]H
.Begin
  _Bit := 1;
  aFOb_Name[ 2] := '';
  // кол-во пробелов до имени
  while SubStr( LevelVal,_Bit,1) = ' '
  {
    aFOb_Name[ 2] := aFOb_Name[ 2] + ' ';
    Inc( _Bit);
  }
  // кол-во знаков до даты (34)
  aFOb_Name[ 1] := SubStr( LevelVal ,1 ,34);
  aFOb_Name[ 2] := aFOb_Name[ 2] + SubStr( LevelVal ,35 ,Length( LevelVal) - 34);
End.
.Fields
  LevelName:'t:r'
!  aFOb_Name[1]:'t:r'
!  aFOb_Name[2]:'t:r'
  LevelVal
.endFields
.{ OFP_Body CheckEnter
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @~@@@@@
.Begin _Bit := 1 End.
.{Horizontal margin while _Bit <= 1
.Fields
  If( #mIsFlag( nstr_ViewField, 1 ), LPad( DoubleToStr( Double(sOstBeg    ), '[|-]36`666`666`666.88'),21) + ' ','')
  If( #mIsFlag( nstr_ViewField, 2 ), LPad( DoubleToStr( Double(sPrihod    ), '[|-]36`666`666`666.88'),21) + ' ','')
  If( #mIsFlag( nstr_ViewField, 3 ), LPad( DoubleToStr( Double(sRashod    ), '[|-]36`666`666`666.88'),21) + ' ','')
  If( #mIsFlag( nstr_ViewField, 4 ), LPad( DoubleToStr( Double(sOborot    ), '[|-]36`666`666`666.88'),21) + ' ','')
  If( #mIsFlag( nstr_ViewField, 5 ), LPad( DoubleToStr( Double(sOstEnd    ), '[|-]36`666`666`666.88'),21) + ' ','')
  If( #mIsFlag( nstr_ViewField, 6 ), LPad( DoubleToStr( Double(sDeficit   ), '[|-]36`666`666`666.88'),21) + ' ','')
  If( #mIsFlag( nstr_ViewField, 7 ), LPad( DoubleToStr( Double(sPrihodPlan), '[|-]36`666`666`666.88'),21) + ' ','')
  If( #mIsFlag( nstr_ViewField, 8 ), LPad( DoubleToStr( Double(sRashodPlan), '[|-]36`666`666`666.88'),21) + ' ','')
.EndFields
^^^^^^^^
.Begin Inc( _Bit ) End.
.}

.{ OFP_Perfomance CheckEnter
.}
.{ OFP_Line CheckEnter
.Fields
  aHeader[6]
.EndFields
^
.}
.}
.} Ш
.endform
