/*
 ╔════════════════════════════════════════════════════════════════════════════╗
 ║                     (c) Корпорация ГАЛАКТИКА, 1997,98                      ║
 ║ Проект        : ГАЛАКТИКА                                                  ║
 ║ Система       : Бухгалтерский контур                                       ║
 ║ Версия        : 5.70                                                       ║
 ║ Назначение    : Печать реестров распределения платежа из договора уступки  ║
 ║                 долга                                                      ║
 ║ Ответственный : Попов Михаил Юрьевич                                       ║
 ╚════════════════════════════════════════════════════════════════════════════╝
*/
#doc
Печать реестров распределения платежа из договора уступки долга
#end
.Form 'Raspcessia'
.NameInList 'Реестр по платежу'
.fields
  hh
  nodoc
  pokup dolgn
  datevip dateob

  sumgolg
  sumall val
  dogtitle
  nameakt

  ddo stsum
  nmusl nomnak datnak kolvo kolopl ed sum1 sum2
  sumall1 sumall2
.endfields
 Р^

                            Реестр распределения платежного документа
                                    Договор продажи долга № ^
     Покупатель "^"   Должник "^"
     Выписано  ^      Обработано ^
     Сумма, за которую продан долг   &#'&&&&&&&&&&&&.&&
     Общая сумма долга по договору &#'&&&&&&&&&&&&&&.&& в ^
     Договор: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
     Содержание акта: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
┌─────────────────────────┬──────────┬──────────┬──────────┬──────────┬─────────┬────────────────────────────────────┐
│                         │   Номер  │   Дата   │          │  Кол-во  │ Единица │           Сумма оплаченного        │
│       Наименование      │накладной/│накладной/│  Кол-во  │ оплачен. │измерения├───────────────────┬────────────────┤
│                         │   акта   │  акта    │          │          │         │       в НДЕ       │    в валюте    │
├─────────────────────────┴──────────┴──────────┴──────────┴──────────┴─────────┴───────────────────┴────────────────┤ Р
.{
 Р│Документ-основание № @@@@@@@@@@                                               На сумму   &#'&&&&&&&&&&&&&&.&&       │ Р
.{checkenter
 Р│  @@@@@@@@@@@@@@@@@@@@@@@@  @@@@@@@@  @@@@@@@@@@@ &&&&&&.&&& &&&&&&.&&& @~@@@@@@@ &#'&&&&&&&&&&&&.&& &#'&&&&&&&&&.&&│ Р
.}
.}
 Р├───────────────────────────────────────────────────────────────────────────────┬────────────────────────────────────┤
│ ИТОГО                                                                         │                                    │
│   разнесено                                                                   │&#'&&&&&&&&&&&.&& &#'&&&&&&&&&&&&.&&│
│                                                                               │                                    │
└───────────────────────────────────────────────────────────────────────────────┴────────────────────────────────────┘ Р
.endform
