//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.84 - базовая форма
// Печать реестра справок по начислению процентов по векселям
// Внимание! Существует slk-отчет в формате Excel
//------------------------------------------------------------------------------

#doc
Печать реестра справок по начислению процентов по векселям
#end

.Set name='NalUchVeks'
.NameInList 'Базовая форма'
.Hide
.Fields
  Name_doc
  Nrec_App             // Nrec АПП
  Nrec_Veks            // Nrec Векселя
  B_doc     : date     // дата начала периода начисления (АПП)
  E_doc     : date     // дата окончания периода начисления (АПП)
  No_App               // номер справки (АПП)
  Status               // статус справки (АПП)
  Sum       : double   // сумма % дохода за период в нац.валюте (АПП)
  SumN      : double   // сумма ? принимаемая к расходу (АПП)
!  Val                 // валюта
  Prim                 // примечание АПП

.EndFields
! --------------------------------------------------------------------------
! Следующая строка нужна только для поддержки старого функционала,
! возможно реализованного пользователями и партнёрами.
! В формах написанных разработчиками Галактики использован новый подход,
! реализованный через объектную переменную iExcelFormat типа ExcelFormat.
#include ExcelFormat.frn
! объектная переменная
#include ExcelFormat.var
! --------------------------------------------------------------------------
.{
^
.{ CheckEnter AppVeks_cicle
    ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.}
.EndForm
!
!
!
.LinkForm 'NalUchVeksR01' Prototype Is 'NalUchVeks'
.NameInList 'Реестр налоговых справок по начислению процентов'
.Group 'Реестр налоговых справок'
.Hide
.p 80
.Var
  Sum_I : double;
.EndVar
.Fields
  CommonFormHeader
  Name_doc
  if (longint(B_doc)=0,'',DateToStr(longint(B_doc), 'DD/MM/YYYY'))
  if (longint(E_doc)=0,'',DateToStr(longint(E_doc), 'DD/MM/YYYY'))
  No_App
  Status
  Sum
  SumN
  Prim
  Sum_I
.EndFields
 Р^
.Begin
  Sum_I  := 0;
End.
.{

    БР Е Е С Т Р ^ Б

.{ CheckEnter AppVeks_cicle
.[h
──────────────────────┬────────────┬─────────────────┬─────────────────────────┬───────────────────────┬───────────────
 Б      Период          │  Номер АПП │    Статус       │ % доход за период в НДЕ │  Сумма расхода в НДЕ  │  Примечание Б
──────────────────────┴────────────┴─────────────────┴─────────────────────────┴───────────────────────┴───────────────
.]h
.Begin
  Sum_I  := Sum_I + Sum;
End.

@@@@@@@@@@ @@@@@@@@@@  @@@@@@@@@@@   @@@@@@@@@@@@@@@@   &'&&&&&&&&&&&&&&&&.&&     &'&&&&&&&&&&&&&&&&.&&  @@@@@@@@@@@@@@
.}
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                               БИтого:    &'&&&&&&&&&&&&&&&&.&& Б
.}
 Р
.EndForm
!
!
!
.LinkForm 'NalUchVeksR02' Prototype Is 'NalUchVeks'
.NameInList 'Реестр бухгалтерских справок по начислению процентов'
.Group 'Реестр бухгалтерских справок'
.Hide
.p 80
.Var
  Sum_I : double;
.EndVar
.Fields
  CommonFormHeader
  Name_doc
  if (longint(B_doc)=0,'',DateToStr(longint(B_doc), 'DD/MM/YYYY'))
  if (longint(E_doc)=0,'',DateToStr(longint(E_doc), 'DD/MM/YYYY'))
  No_App
  Status
  Sum
  Prim
  Sum_I
.EndFields
 Р^
.Begin
  Sum_I  := 0;
End.
.{

    БР Е Е С Т Р ^ Б

.{ CheckEnter AppVeks_cicle
.[h
──────────────────────┬────────────┬─────────────────┬─────────────────────────┬───────────────
 Б      Период          │  Номер АПП │    Статус       │ Сумма % за период в НДЕ │  Примечание Б
──────────────────────┴────────────┴─────────────────┴─────────────────────────┴───────────────
.]h
.Begin
  Sum_I  := Sum_I + Sum;
End.

@@@@@@@@@@ @@@@@@@@@@  @@@@@@@@@@@   @@@@@@@@@@@@@@@@   &'&&&&&&&&&&&&&&&&.&&    @@@@@@@@@@@@@@
.}
───────────────────────────────────────────────────────────────────────────────────────────────
                                               БИтого:    &'&&&&&&&&&&&&&&&&.&& Б
.}
 Р
.EndForm
