/*
 иммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм╩
 ╨                     (c) 1994,97 ╙╝Ю╞╝Ю═Ф╗О ┐─▀─┼▓┬┼─                      ╨
 ╨ ▐Ю╝╔╙Б        : ┐─▀─┼▓┬┼─                                                 ╨
 ╨ ▒╗АБ╔╛═       : ┤═Ю═║╝Б╜═О ╞╚═Б═                                          ╨
 ╨ ┌╔ЮА╗О        : 5.74                                                      ╨
 ╨ █═╖╜═Г╔╜╗╔    : ▒╞Ю═╒╙═ ╝ ╖═Ю═║╝Б╜╝╘ ╞╚═Б╔                                ╨
 ╨ ▌Б╒╔БАБ╒╔╜╜К╘ : ▐╗╒╔╜Л ┬Ю╗╜═ ┐Ю╗ё╝ЮЛ╔╒╜═                                  ╨
 хммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм╪*/
#doc
▒╞Ю═╒╙═ ╝ ╖═Ю═║╝Б╜╝╘ ╞╚═Б╔
#end
.set name = 'T60'
.hide
.fields
nRec
TabN FIO
Year1 Mes1 SredSumma1 Day Chas DaySumma
Year  Mes  SredSumma
MesTek  MesBud
DnT SummaT SummaDT SummaNT DnB SummaB SummaDB SummaNB SummaNach
NameUd1 NameUd2 NameUd3 NameUd4 NameUdProch
PodNalog Uder1 Uder2 Uder3 Uder4 UderProch SummaUd SummaItog : Double
.endfields
.{
Ъ░^
Ё &&&&&&&&&& Ё @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@               Ё
Ё@@@@ Ё @@@@@@@@@Ё&'&&&&&&&&&&&&&&&&&&Ё    &'&&&&&    Ё  &'&&&&& Ё  &'&&&&&&&&&&&    Ё
цдддддеддддддддддеддддддддддддддддддддедддддддддддддддаддддддддддаддддддддддддддддддды
.{ Table601 CheckEnter
Ё@@@@ Ё @@@@@@@@@Ё&'&&&&&&&&&&&&&&&&&&Ё
цдддддеддддддддддедддддддддддддддддддд╢
.}
зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
Ё                                                  █═Г╗А╚╔╜╝                                              Ё
цдддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддбддддддддддддд╢
Ё     ╖═ @@@@@@@@@@@@@@@@@ ╛╔АОФ              Ё          ╖═ @@@@@@@@@@@@@@@@@ ╛╔АОФ         Ё             Ё
Ё             Б╔╙ЦИ╗╘                         Ё                  ║Ц╓ЦИ╗╘                    Ё    ┌А╔ё╝,   Ё
цддддддбдддддддддддддддддддддддддбддддддддддддеддддддбдддддддддддддддддддддддддбдддддддддддд╢     ЮЦ║     Ё
Ё╙╝╚-╒╝Ё  АЦ╛╛═ ╖═ ╝Б╞ЦА╙, ЮЦ║.  Ё            Ё╙╝╚-╒╝Ё  АЦ╛╛═ ╖═ ╝Б╞ЦА╙, ЮЦ║.  Ё            Ё             Ё
Ё╓╜╔╘/ цддддддддддддбдддддддддддд╢  ╓ЮЦё╗╔    Ё╓╜╔╘/ цддддддддддддбдддддддддддд╢  ╓ЮЦё╗╔    Ё             Ё
ЁГ═А╝╒ Ё╗╖ Д╝╜╓═    Ё            Ё ╜═Г╗А╚╔╜╗О ЁГ═А╝╒ Ё╗╖ Д╝╜╓═    Ё            Ё ╜═Г╗А╚╔╜╗О Ё             Ё
Ё╝Б╞Ц- Ё╝╞╚═БК БЮЦ╓═Ё            Ё            Ё╝Б╞Ц- Ё╝╞╚═БК БЮЦ╓═Ё            Ё            Ё             Ё
ЁА╙═   Ё            Ё            Ё            ЁА╙═   Ё            Ё            Ё            Ё             Ё
цддддддеддддддддддддеддддддддддддеддддддддддддеддддддеддддддддддддеддддддддддддеддддддддддддеддддддддддддд╢
Ё   7  Ё      8     Ё     9      Ё     10     Ё  11  Ё     12     Ё     13     Ё     14     Ё      15     Ё
цддддддеддддддддддддеддддддддддддеддддддддддддеддддддеддддддддддддеддддддддддддеддддддддддддеддддддддддддд╢
Ё@@@@@@Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&Ё@@@@@@Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&&Ё
юддддддаддддддддддддаддддддддддддаддддддддддддаддддддаддддддддддддаддддддддддддаддддддддддддаддддддддддддды

зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддд©
Ё                                             ⌠╓╔Ю╕═╜╝, ЮЦ║                                Ё              Ё
цддддддддддддбддддддддддддбддддддддддддбддддддддддддбддддддддддддбддддддддддддбдддддддддддд╢ ▐Ю╗Г╗Б═╔БАО  Ё
Ё  ╜═╚╝ё ╜═  Ё@@@@@@@@@@@@Ё@@@@@@@@@@@@Ё@@@@@@@@@@@@Ё@@@@@@@@@@@@Ё@@@@@@@@@@@@Ё   ╒А╔ё╝    Ё  ╙ ╒К╞╚═Б╔   Ё
Ё   ╓╝Е╝╓    Ё            Ё            Ё            Ё            Ё            Ё            Ё  АЦ╛╛═, ЮЦ║  Ё
цддддддддддддеддддддддддддеддддддддддддеддддддддддддеддддддддддддеддддддддддддеддддддддддддедддддддддддддд╢
Ё     16     Ё     17     Ё     18     Ё     19     Ё     20     Ё     21     Ё     22     Ё      23      Ё
цддддддддддддеддддддддддддеддддддддддддеддддддддддддеддддддддддддеддддддддддддеддддддддддддедддддддддддддд╢
Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&&&Ё
юддддддддддддаддддддддддддаддддддддддддаддддддддддддаддддддддддддаддддддддддддаддддддддддддадддддддддддддды
------------------------------------------------------------------------------------------------------------------------------------------------Ъ░
.}
.endform

.Linkform 'T60_01' Prototype is 'T60'
.nameinlist '▌║╝Ю╝Б╜═О АБ╝Ю╝╜═ Д╝Ю╛К ▓-60'
.var
 SredSummaIt : Double;
 SummaProp : string;
.endvar
.fields
TabN FIO
Year1 Mes1 SredSumma1 Day Chas DaySumma
Year  Mes  SredSumma
.endfields
.begin
 SredSummaIt := 0
end.
.{
                                  Ъ░       ▌║╝Ю╝Б╜═О АБ╝Ю╝╜═ Д╝Ю╛К Э ▓-60
                       ░═АГ╔Б ╝╞╚═БК ╝Б╞ЦА╙═
зддддддддддддбддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
Ё▓═║.╜╝╛╔Ю   Ё ■═╛╗╚╗О ┬.▌.                                                          Ё
Ё@@@@@@@@@@@@Ё @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@               Ё
цддддддддддддадддбддддддддддддддддддддбдддддддддддддддбддддддддддбддддддддддддддддддд╢
Ё░═АГ╔Б╜К╘ ╞╔Ю╗╝╓Ё┌К╞╚═БК, ЦГ╗БК╒═╔╛К╔Ё┼╝╚╗Г╔АБ╒╝ ╓╜╔╘Ё┼╝╚╗Г╔АБ╒╝Ё▒Ю╔╓╜╗╘            Ё
цдддддбдддддддддд╢╞Ю╗ ╗АГ╗А╚╔╜╗╗ АЮ╔╓-ЁЮ═АГ╔Б╜╝ё╝ ╞╔- ЁГ═А╝╒     Ё╓╜╔╒╜╝╘            Ё
Ё ё╝╓ Ё   ╛╔АОФ  Ё╜╔ё╝ ╖═Ю═║╝Б╙═, ЮЦ║.ЁЮ╗╝╓═ (╙═╚╔╜╓═ЮЁЮ═АГ╔Б╜╝ё╝Ё(Г═А╝╒╝╘)          Ё
Ё     Ё          Ё                    Ё╜КЕ, Ю═║╝Г╗Е)  Ё╞╔Ю╗╝╓═   Ё╖═Ю═║╝Б╝╙,ЮЦ║.     Ё
цдддддеддддддддддеддддддддддддддддддддедддддддддддддддеддддддддддеддддддддддддддддддд╢
Ё  1  Ё     2    Ё         3          Ё       4       Ё    5     Ё        6          Ё
цдддддеддддддддддеддддддддддддддддддддедддддддддддддддеддддддддддеддддддддддддддддддд╢
.begin
  SredSummaIt := 0
  SredSummaIt :=  SredSummaIt + Double(SredSumma1);
end.
Ё@@@@ Ё @@@@@@@@@Ё&'&&&&&&&&&&&&&&&&&&Ё    &'&&&&&    Ё  &'&&&&& Ё  &'&&&&&&&&&&&    Ё
цдддддеддддддддддеддддддддддддддддддддедддддддддддддддаддддддддддаддддддддддддддддддды
.{ Table601 CheckEnter
.begin
  SredSummaIt :=  SredSummaIt + Double(SredSumma);
end.
Ё@@@@ Ё @@@@@@@@@Ё&'&&&&&&&&&&&&&&&&&&Ё
цдддддеддддддддддедддддддддддддддддддд╢
.}
.fields
SredSummaIt
.endfields
Ё       ┬Б╝ё╝    Ё&'&&&&&&&&&&&&&&&.&&Ё
юддддддддддддддддадддддддддддддддддддды
.fields
MesTek  MesBud
DnT SummaT SummaDT SummaNT DnB SummaB SummaDB SummaNB SummaNach
NameUd1 NameUd2 NameUd3 NameUd4 NameUdProch
PodNalog Uder1 Uder2 Uder3 Uder4 UderProch SummaUd SummaItog
.endfields

зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
Ё                                                  █═Г╗А╚╔╜╝                                              Ё
цдддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддбддддддддддддд╢
Ё     ╖═ @@@@@@@@@@@@@@@@@ ╛╔АОФ              Ё          ╖═ @@@@@@@@@@@@@@@@@ ╛╔АОФ         Ё             Ё
Ё             Б╔╙ЦИ╗╘                         Ё                  ║Ц╓ЦИ╗╘                    Ё    ┌А╔ё╝,   Ё
цддддддбдддддддддддддддддддддддддбддддддддддддеддддддбдддддддддддддддддддддддддбдддддддддддд╢     ЮЦ║     Ё
Ё╙╝╚-╒╝Ё  АЦ╛╛═ ╖═ ╝Б╞ЦА╙, ЮЦ║.  Ё            Ё╙╝╚-╒╝Ё  АЦ╛╛═ ╖═ ╝Б╞ЦА╙, ЮЦ║.  Ё            Ё             Ё
Ё╓╜╔╘/ цддддддддддддбдддддддддддд╢  ╓ЮЦё╗╔    Ё╓╜╔╘/ цддддддддддддбдддддддддддд╢  ╓ЮЦё╗╔    Ё             Ё
ЁГ═А╝╒ Ё╗╖ Д╝╜╓═    Ё            Ё ╜═Г╗А╚╔╜╗О ЁГ═А╝╒ Ё╗╖ Д╝╜╓═    Ё            Ё ╜═Г╗А╚╔╜╗О Ё             Ё
Ё╝Б╞Ц- Ё╝╞╚═БК БЮЦ╓═Ё            Ё            Ё╝Б╞Ц- Ё╝╞╚═БК БЮЦ╓═Ё            Ё            Ё             Ё
ЁА╙═   Ё            Ё            Ё            ЁА╙═   Ё            Ё            Ё            Ё             Ё
цддддддеддддддддддддеддддддддддддеддддддддддддеддддддеддддддддддддеддддддддддддеддддддддддддеддддддддддддд╢
Ё   7  Ё      8     Ё     9      Ё     10     Ё  11  Ё     12     Ё     13     Ё     14     Ё      15     Ё
цддддддеддддддддддддеддддддддддддеддддддддддддеддддддеддддддддддддеддддддддддддеддддддддддддеддддддддддддд╢
Ё@@@@@@Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&Ё@@@@@@Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&&Ё
юддддддаддддддддддддаддддддддддддаддддддддддддаддддддаддддддддддддаддддддддддддаддддддддддддаддддддддддддды

зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддд©
Ё                                             ⌠╓╔Ю╕═╜╝, ЮЦ║                                Ё              Ё
цддддддддддддбддддддддддддбддддддддддддбддддддддддддбддддддддддддбддддддддддддбдддддддддддд╢ ▐Ю╗Г╗Б═╔БАО  Ё
Ё  ╜═╚╝ё ╜═  Ё            Ё            Ё            Ё            Ё            Ё   ╒А╔ё╝    Ё  ╙ ╒К╞╚═Б╔   Ё
Ё   ╓╝Е╝╓    Ё@@@@@@@@@@@@Ё@@@@@@@@@@@@Ё@@@@@@@@@@@@Ё@@@@@@@@@@@@Ё@@@@@@@@@@@@Ё            Ё  АЦ╛╛═, ЮЦ║  Ё
цддддддддддддеддддддддддддеддддддддддддеддддддддддддеддддддддддддеддддддддддддеддддддддддддедддддддддддддд╢
Ё     16     Ё     17     Ё     18     Ё     19     Ё     20     Ё     21     Ё     22     Ё      23      Ё
цддддддддддддеддддддддддддеддддддддддддеддддддддддддеддддддддддддеддддддддддддеддддддддддддедддддддддддддд╢
Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&Ё&'&&&&&&&&&&&&Ё
юддддддддддддаддддддддддддаддддддддддддаддддддддддддаддддддддддддаддддддддддддаддддддддддддадддддддддддддды
.begin
  SummaProp := DoubleToString(0,SummaItog)
end.
.fields
  SummaProp
.endfields

┼ ╒К╞╚═Б╔ АЦ╛╛═ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

╞╝ ╞╚═Б╔╕╜╝╘ ╒╔╓╝╛╝АБ╗ (Ю═АЕ╝╓╜╝╛Ц ╝Ю╓╔ЮЦ) Э _______ ╝Б "___"_____________20   ё╝╓═

Ъ││ЦЕё═╚Б╔Ю Ъ│_________________  ________________________________________
             ╞╝╓╞╗АЛ                Ю═АХ╗ДЮ╝╒╙═ ╞╝╓╞╗А╗
------------------------------------------------------------------------------------------------------------------------------------------------- Ъ░
.fields
'true':'s'
.endfields
^
.}
.endform
