/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,97 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Заработная плата                                          ║
 ║ Версия        : 5.74                                                      ║
 ║ Назначение    : Справка о заработной плате                                ║
 ║ Ответственный : Пивень Ирина Григорьевна                                  ║
 ╚═══════════════════════════════════════════════════════════════════════════╝*/
#doc
Справка о заработной плате
#end
.set name = 'T61'
.hide
.fields
nRec
TabN FIO
Year1  Mes1  SredSumma1 Day Chas DaySumma
Year2  Mes2  SredSumma2
Year3  Mes3  SredSumma3
Year4  Mes4  SredSumma4
Year5  Mes5  SredSumma5
Year6  Mes6  SredSumma6
Year7  Mes7  SredSumma7
Year8  Mes8  SredSumma8
Year9  Mes9  SredSumma9
Year10 Mes10 SredSumma10
Year11 Mes11 SredSumma11
Year12 Mes12 SredSumma12 DnAv Dn SummaOt
NameNach1 NameNach2 NameNProch NameUdProch
Nach1 Nach2 NachProch SummaNach
PodNalog UderProch SummaUd
DolgO
DolgR
SummaItog : Double
.endfields
.{
 Р^
│@@@@@@@@@@@@│ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@               │
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&│    &'&&&&&    │  &'&&&&& │  &'&&&&&&&&&&&    │
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&├───────────────┴──────────┴───────────────────┘
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&│
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&├──────────────────────────┬───────────────────┐
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&│ Количество дней отпуска  │                   │
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&├─────────────┬────────────┤ Сумма за отпуск,  │
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&│использовано │не использо-│       руб.        │
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&│ авансом     │  вано      │                   │
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&├─────────────┼────────────┼───────────────────┤
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&│      7      │      8     │         9         │
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&├─────────────┼────────────┼───────────────────┤
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&│   &'&&&&&   │   &'&&&&&  │  &'&&&&&&&&&&&    │
├─────┼──────────┼────────────────────┼─────────────┴────────────┴───────────────────┘

                                                 Расчет выплат
┌───────────────────────────────────────────────┬─────────────────────────────────┬─────────────────────┬─────────────┐
│                Начислено, руб                 │         Удержано, руб           │ Задолженность, руб  │ Причитается │
├───────────┬───────────┬───────────┬───────────┼──────────┬──────────┬───────────┼──────────┬──────────┤  к выплате  │
│@@@@@@@@@@@│@@@@@@@@@@@│@@@@@@@@@@@│  всего    │ налог на │@@@@@@@@@@│   всего   │за органи-│    за    │  сумма, руб │
│           │           │           │           │  доходы  │          │           │ зацией   │работником│             │
├───────────┼───────────┼───────────┼───────────┼──────────┼──────────┼───────────┼──────────┼──────────┼─────────────┤
│     10    │     11    │    12     │     13    │    14    │    15    │    16     │    17    │    18    │      19     │
├───────────┼───────────┼───────────┼───────────┼──────────┼──────────┼───────────┼──────────┼──────────┼─────────────┤
│&'&&&&&&&&&│&'&&&&&&&&&│&'&&&&&&&&&│&'&&&&&&&&&│&'&&&&&&&&│&'&&&&&&&&│&'&&&&&&&&&│&'&&&&&&&&│&'&&&&&&&&│&'&&&&&&&&&&&│
└───────────┴───────────┴───────────┴───────────┴──────────┴──────────┴───────────┴──────────┴──────────┴─────────────┘
------------------------------------------------------------------------------------------------------------------------------------------------ Р
.}
.endform

.Linkform 'T61_01' Prototype is 'T61'
.nameinlist 'Оборотная сторона формы Т-61'
.var
 SredSummaIt, SumItRub, SumI : Double;
 SummaProp : string;
 SumItKop : word;
.endvar
.fields
TabN FIO
Year1  Mes1  SredSumma1 Day Chas DaySumma
Year2  Mes2  SredSumma2
Year3  Mes3  SredSumma3
Year4  Mes4  SredSumma4
Year5  Mes5  SredSumma5
Year6  Mes6  SredSumma6
Year7  Mes7  SredSumma7
Year8  Mes8  SredSumma8
Year9  Mes9  SredSumma9
Year10 Mes10 SredSumma10
Year11 Mes11 SredSumma11
Year12 Mes12 SredSumma12 DnAv Dn SummaOt
.endfields
.begin
 SredSummaIt := 0;
 SumItRub := 0;
 SumItKop := 0;
end.
.{
                                          РОборотная сторона формы № Т-61
                        БРасчет оплаты отпуска Б
┌────────────┬───────────────────────────────────────────────────────────────────────┐
│Таб.номер   │ Фамилия И.О.                                                          │
│@@@@@@@@@@@@│ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@               │
├────────────┴───┬────────────────────┬───────────────┬──────────┬───────────────────┤
│Расчетный период│Выплаты, учитываемые│Количество дней│Количество│Средний            │
├─────┬──────────┤при исчислении сред-│расчетного пе- │часов     │дневной            │
│ год │   месяц  │него заработка, руб.│риода (календар│расчетного│(часовой)          │
│     │          │                    │ных, рабочих)  │периода   │заработок,руб.     │
├─────┼──────────┼────────────────────┼───────────────┼──────────┼───────────────────┤
│  1  │     2    │         3          │       4       │    5     │        6          │
├─────┼──────────┼────────────────────┼───────────────┼──────────┼───────────────────┤
.begin
  SredSummaIt := 0;
  if Double(SredSumma1) <> 0
    SredSummaIt :=  SredSummaIt + Double(SredSumma1)
end.
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&│    &'&&&&&    │  &'&&&&& │  &'&&&&&&&&&&&    │
.begin
  if Double(SredSumma2) <> 0
    SredSummaIt :=  SredSummaIt + Double(SredSumma2)
end.
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&├───────────────┴──────────┴───────────────────┘
.begin
  if Double(SredSumma3) <> 0
    SredSummaIt :=  SredSummaIt + Double(SredSumma3);
end.
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&│
.begin
  if Double(SredSumma4) <> 0
    SredSummaIt :=  SredSummaIt + Double(SredSumma4);
end.
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&├──────────────────────────┬───────────────────┐
.begin
  if Double(SredSumma5) <> 0
    SredSummaIt :=  SredSummaIt + Double(SredSumma5);
end.
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&│ Количество дней отпуска  │                   │
.begin
  if Double(SredSumma6) <> 0
    SredSummaIt :=  SredSummaIt + Double(SredSumma6);
end.
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&├─────────────┬────────────┤ Сумма за отпуск,  │
.begin
  if Double(SredSumma7) <> 0
    SredSummaIt :=  SredSummaIt + Double(SredSumma7);
end.
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&│использовано │не использо-│       руб.        │
.begin
  if Double(SredSumma8) <> 0
    SredSummaIt :=  SredSummaIt + Double(SredSumma8);
end.
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&│ авансом     │  вано      │                   │
.begin
  if Double(SredSumma9) <> 0
    SredSummaIt :=  SredSummaIt + Double(SredSumma9);
end.
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&├─────────────┼────────────┼───────────────────┤
.begin
  if Double(SredSumma10) <> 0
    SredSummaIt :=  SredSummaIt + Double(SredSumma10);
end.
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&│      7      │      8     │         9         │
.begin
  if Double(SredSumma11) <> 0
    SredSummaIt :=  SredSummaIt + Double(SredSumma11);
end.
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&├─────────────┼────────────┼───────────────────┤
.begin
  if Double(SredSumma12) <> 0
    SredSummaIt :=  SredSummaIt + Double(SredSumma12);
end.
│@@@@ │ @@@@@@@@@│&'&&&&&&&&&&&&&&&&&&│   &'&&&&&   │   &'&&&&&  │  &'&&&&&&&&&&&    │
├─────┴──────────┼────────────────────┼─────────────┴────────────┴───────────────────┘
.fields
SredSummaIt
.endfields
│       Итого    │&'&&&&&&&&&&&&&&&.&&│
└────────────────┴────────────────────┘
.fields
NameNach1 NameNach2 NameNProch NameUdProch
Nach1 Nach2 NachProch SummaNach
PodNalog UderProch SummaUd
DolgO
DolgR
SummaItog
.endfields
┌───────────────────────────────────────────────┬─────────────────────────────────┬─────────────────────┬─────────────┐
│                Начислено, руб                 │         Удержано, руб           │ Задолженность, руб  │ Причитается │
├───────────┬───────────┬───────────┬───────────┼──────────┬──────────┬───────────┼──────────┬──────────┤  к выплате  │
│           │           │           │  всего    │ налог на │          │   всего   │за органи-│    за    │  сумма, руб │
│@@@@@@@@@@@│@@@@@@@@@@@│@@@@@@@@@@@│           │  доходы  │@@@@@@@@@@│           │ зацией   │работником│             │
├───────────┼───────────┼───────────┼───────────┼──────────┼──────────┼───────────┼──────────┼──────────┼─────────────┤
│     10    │     11    │    12     │     13    │    14    │    15    │    16     │    17    │    18    │      19     │
├───────────┼───────────┼───────────┼───────────┼──────────┼──────────┼───────────┼──────────┼──────────┼─────────────┤
│&'&&&&&&&&&│&'&&&&&&&&&│&'&&&&&&&&&│&'&&&&&&&&&│&'&&&&&&&&│&'&&&&&&&&│&'&&&&&&&&&│&'&&&&&&&&│&'&&&&&&&&│&'&&&&&&&&&&&│
└───────────┴───────────┴───────────┴───────────┴──────────┴──────────┴───────────┴──────────┴──────────┴─────────────┘
.begin
  SummaProp := DoubleToString(0,SummaItog);
  SumItRub := Trunc(Round(SummaItog,2));
  SumI := abs(SummaItog);
  SumItKop := word(Round((SumI - abs(SumItRub)) * 100,0));
end.
.fields
  SummaProp
  SumItRub
  SumItKop
.endfields

К выплате сумма @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                                                           ( @@@@@@@@@@ руб. @@ коп.)
по платежной ведомости (расходному ордеру) № _______ от "___"_____________20   года

 ББухгалтер Б _________________  ________________________________________
             подпись                расшифровка подписи
------------------------------------------------------------------------------------------------------------------------------------------------- Р
.fields
'true':'s'
.endfields
^
.}
.endform
