//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.8 - Бухгалтерский контур
// Список неоплаченных платежных документов
//------------------------------------------------------------------------------

#doc
Список неоплаченных платежных документов
#end
.set name = 'NoPlat'
.nameinlist 'Базовая форма'
.hide
.fields
d1 d2 v1 v2
data document nomer platpol nazplat s1 s1v
tot totv
.endfields
^ ^
^ ^
.{
^ ^ ^ ^ ^ ^ ^
.}
^ ^
.endform
!==============================================================================
.linkform 'NoPlat_01' prototype is 'NoPlat'
.group 'alldocs'
.fields
CommonFormHeader
d1 d2 v1 v2
.endfields
 Ш^
                        БНеоплаченные платежные документы Б
                        Бc @@@@@@@@@@ г. по @@@@@@@@@@ г. Б
──────────┬──────────────────────┬────────┬──────────────────────────────────┬────────────────────────────────┬───────────────────┬───────────────────
   Дата   │      Документ        │  Номер │     Плательщик/получатель        │        Назначение платежа      │       Сумма       │       Сумма
  выписки │                      │ док-та │                                  │                                │       @~@@@@      │       @~@@@@
──────────┴──────────────────────┴────────┴──────────────────────────────────┴────────────────────────────────┴───────────────────┴───────────────────
.{
.fields
data           document           nomer              platpol                              nazplat                      s1                  s1v
.endfields
@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
.}
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
                                                                                                                       tot                totv
.endfields
    БИТОГО по ведомости                                                                                          &'&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&& Щ
.endform
!==============================================================================
.linkform 'NoPlat_02' prototype is 'NoPlat'
.group 'nodocs'
.fields
CommonFormHeader
d1 d2 v1 v2
.endfields
 Р^
                        БНеоплаченные платежные документы Б
                        Бc @@@@@@@@@@ г. по @@@@@@@@@@ г. Б
──────────┬────────┬────────────────────────────────┬─────────────────────────────────────┬───────────────────┬───────────────────
   Дата   │  Номер │     Плательщик/получатель      │          Назначение платежа         │       Сумма       │       Сумма
  выписки │ док-та │                                │                                     │       @~@@@@      │       @~@@@@
──────────┴────────┴────────────────────────────────┴─────────────────────────────────────┴───────────────────┴───────────────────
.{
.fields
data      nomer              platpol                                nazplat                       s1                  s1v
.endfields
@@@@@@@@@@ @@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
.}
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
                                                                                                  tot                totv
.endfields
    БИТОГО по ведомости                                                                      &'&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&& С
.endform
!==============================================================================
