//--------------------------------------------------------------------------------
//                                                        (c) корпорация Галактика
// Галактика 8.1 - Касса/Ведомости депонирования
// Протокол формирования сводной платежной ведомости
//--------------------------------------------------------------------------------

#doc
Протокол формирования сводной платежной ведомости
#end

.Form 'Protocol'
.nameinlist 'Базовая форма'
.hide
.fields
FIO diff
.endfields
.{ CheckEnter Denial
  ^ ^
.}
.endform

.linkform 'Protocol_01' prototype is 'Protocol'
.nameinlist 'Протокол формирования сводной платежной ведомости'
.fields
CommonFormHeader
FIO diff
.endfields
 Й^
                ПРОТОКОЛ ФОРМИРОВАНИЯ СВОДНОЙ ПЛАТЕЖНОЙ ВЕДОМОСТИ

 БВ сводную платежную ведомость не были включены сотрудники, по которым есть различия
в исходных ведомостях депонирования: И
 И─────────────────────────────────────────────┬──────────────────────────────────────────────
             БНевключенные позиции Б             │       БОтличия в полях таблицы SpVedDepon Б
─────────────────────────────────────────────┼──────────────────────────────────────────────
.{ CheckEnter Denial
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
─────────────────────────────────────────────┴────────────────────────────────────────────── И
 И.endform
