!  ╔═════════════════════════════════════════════════════════════════════╗
!  ║    А О   "Н О В Ы Й   А Т Л А Н Т",    Н Т О  "T O P   S O F T"     ║
!  ║           Проект "БИЗНЕС-КАДРЫ" (с) 1999, 2000                      ║
!  ║      Версия : 5.71                                                  ║
!  ║      Разработал:  Герасимович А.А.                                  ║
!  ║      Назначение:  Форма для отчета по штатному наполнению           ║
!  ║      Изменения:                                                     ║
!  ╚═════════════════════════════════════════════════════════════════════╝

!-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-!
! SS_NapForm, modified 26/09/2000, 17:29 by BK                                !
!-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-!
#doc
Форма для отчета по штатному наполнению
#end
.form SS_NapForm
.namefrn 'nul'
.hide
.fields
  Заголовок1
  Заголовок2
  Заголовок3
  Заголовок4

  Тек_дата Тек_время
  Предприятие
  Название_отчета
  Группа_структурных_единиц

  Разделитель_доплат_1
  Имя_доплат
  Символ_разделителя Разделитель_доплат_2
  Имя1_доплаты
  Имя2_доплаты
  Номер_колонки_доплаты Номер_колонки_суммы_доплат Номер_колонки_суммы

  Подразделение

  сотрудник должность кол_шт_единиц коэф оклад_без_доплат
    доплата сумма_доплат общая_сумма

  итого_наименование итого_единиц итого_оклад итого_доплата
   итого_сумма_доплат итого_общая_сумма
.endfields
.[H
^ ^ ^ ^
.]H
^ ^ ^ ^ ^

 .{.?snFHCyc1;^.}
 .{.?snFHCyc2;^.}
 ^
 .{.?snFHCyc3;^.}
 .{.?snFHCyc4;^.}
 .{.?snFHCyc5;^.}
 .{.?snFHCyc6;.}
 .{.?snFHCyc7;^.}
 ^ ^
 .{.?snFHCyc8;.}

.{snMainCycle
.if snStartIf
^
.end
.{snStructCycle CheckEnter
^ ^ ^ ^ ^ .{.?RaisesCycle; ^.} ^ ^
.}
.if snFinishIf
^ ^ ^ .{.?snFCycle; ^.} ^ ^
.end
.}
.endform

!-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-!
! LinkForm "Штатное наполнение с доплатами и суммой доплат",                  !
! modified 26/09/2000, 17:21 by BK                                            !
!-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-!
.linkform "Штатное наполнение с доплатами и суммой доплат" prototype is SS_NapForm
.group "Штатное наполнение с доплатами и суммой доплат"
.defo landscape
.p 41
.var
  RecCounter : LongInt ;
.endvar
.fields
  Заголовок1
  Заголовок2
  Заголовок3
  Заголовок4

  Тек_дата Тек_время
  Предприятие
  Название_отчета : 'trim:-'
  Группа_структурных_единиц : 'trim:-'

  Разделитель_доплат_1: 'trim:-'
  Имя_доплат: 'trim:-'
  Разделитель_доплат_2: 'trim:-'
  Имя1_доплаты
  Имя2_доплаты
  Номер_колонки_доплаты Номер_колонки_суммы_доплат Номер_колонки_суммы

  Подразделение : 'trim:-'

  RecCounter
    сотрудник должность кол_шт_единиц коэф оклад_без_доплат
    доплата сумма_доплат общая_сумма

  итого_наименование итого_единиц итого_оклад итого_доплата
   итого_сумма_доплат итого_общая_сумма

.endfields
.[H SKIP
 Ш
^ @NP@
^
^
^ Ш
.]H

 Ш  @@@@@@@@@@@@  @@@@@@@

  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б

 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
 Ш
 Ш┌───┬──────────────────────────────┬──────────────────────────┬──────┬───────┬──────────────┬.{.?snFHCyc1;@@@@@@@@@@@@@@@.}──────────────┬──────────────┐
│   │                              │                          │      │       │              │.{.?snFHCyc2;@@@@@@@@@@@@@@@.}              │              │
│ N │         Фамилия И.О.         │ Наименование структурных │Кол-во│Коэффи-│   Оклад без  ├.{.?snFHCyc3;@@@@@@@@@@@@@@@.}     Сумма    │     Сумма    │
│поз│                              │подразделений и должностей│един. │ циент │     доплат   │.{.?snFHCyc4;@~@@@@@@@@@@@@│.}     доплат   │     общая    │
│   │                              │                          │      │       │              │.{.?snFHCyc5;@~@@@@@@@@@@@@│.}              │              │
├───┼──────────────────────────────┼──────────────────────────┼──────┼───────┼──────────────┼.{.?snFHCyc6;──────────────┼.}──────────────┼──────────────┤
│ 1 │ 2                            │ 3                        │ 4    │ 5     │ 6            │.{.?snFHCyc7; @@@@@@@@@@@@@│.} @@@@@@@@@@@@@│ @@@@@@@@@@@@@│
└───┴──────────────────────────────┴──────────────────────────┴──────┴───────┴──────────────┴.{.?snFHCyc8;──────────────┴.}──────────────┴──────────────┘ Ш

.{snMainCycle
.if snStartIf
 Щ@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Щ

.end
.begin RecCounter := 0 ; end.
.{snStructCycle CheckEnter
.begin
  RecCounter := RecCounter + 1 ;
end.
 Ш &&. @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@  &&.&&& &&&.&&& &&&&&&&&&&&.&& .{.?RaisesCycle;&&&&&&&&&&&.&& .}&&&&&&&&&&&.&& &&&&&&&&&&&.&& Ш
.}
.if snFinishIf

 Ш      Б@@@@@@@@@@@@@@@@@@@@@@@ Б                                   &&&&&&         &&&&&&&&&&&.&& .{.?snFCycle;&&&&&&&&&&&.&& .}&&&&&&&&&&&.&& &&&&&&&&&&&.&& Ш

.end
.}
.endform

!-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-!
! LinkForm "Штатное наполнение с доплатами", modified 26/09/2000, 17:26 by BK !
!-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-!
.linkform "Штатное наполнение с доплатами" prototype is SS_NapForm
.group "Штатное наполнение с доплатами"
.defo landscape
.p 41
.var
  RecCounter : LongInt ;
.endvar
.fields
  Заголовок1
  Заголовок2
  Заголовок3
  Заголовок4

  Тек_дата Тек_время
  Предприятие
  Название_отчета : 'trim:-'
  Группа_структурных_единиц : 'trim:-'

  Разделитель_доплат_1: 'trim:-'
  Имя_доплат: 'trim:-'
  Символ_разделителя: 'trim:-' Разделитель_доплат_2: 'trim:-'
  Имя1_доплаты
  Имя2_доплаты
  Номер_колонки_доплаты Номер_колонки_суммы

  Подразделение : 'trim:-'

  RecCounter
    сотрудник должность кол_шт_единиц коэф оклад_без_доплат
     доплата общая_сумма

  итого_наименование итого_единиц итого_оклад итого_доплата
   итого_общая_сумма

.endfields
.[H SKIP
 Ш
^ @NP@
^
^
^ Ш
.]H

 Ш  @@@@@@@@@@@@  @@@@@@@

  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б

 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
 Ш
 Ш┌───┬──────────────────────────────┬──────────────────────────┬──────┬───────┬──────────────┬.{.?snFHCyc1;@@@@@@@@@@@@@@@.}──────────────┐
│   │                              │                          │      │       │              │.{.?snFHCyc2;@@@@@@@@@@@@@@@.}              │
│ N │         Фамилия И.О.         │ Наименование структурных │Кол-во│Коэффи-│   Оклад без  @.{.?snFHCyc3;@@@@@@@@@@@@@@@.}     Сумма    │
│поз│                              │подразделений и должностей│един. │ циент │     доплат   │.{.?snFHCyc4;@~@@@@@@@@@@@@│.}     общая    │
│   │                              │                          │      │       │              │.{.?snFHCyc5;@~@@@@@@@@@@@@│.}              │
├───┼──────────────────────────────┼──────────────────────────┼──────┼───────┼──────────────┼.{.?snFHCyc6;──────────────┼.}──────────────┤
│ 1 │ 2                            │ 3                        │ 4    │ 5     │ 6            │.{.?snFHCyc7; @@@@@@@@@@@@@│.} @@@@@@@@@@@@@│
└───┴──────────────────────────────┴──────────────────────────┴──────┴───────┴──────────────┴.{.?snFHCyc8;──────────────┴.}──────────────┘ Ш

.{snMainCycle
.if snStartIf
 Щ@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Щ

.end
.begin RecCounter := 0 ; end.
.{snStructCycle CheckEnter
.begin
  RecCounter := RecCounter + 1 ;
end.
 Ш &&. @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@  &&.&&& &&&.&&& &&&&&&&&&&&.&& .{.?RaisesCycle;&&&&&&&&&&&.&& .}&&&&&&&&&&&.&& Ш
.}
.if snFinishIf

 Ш      Б@@@@@@@@@@@@@@@@@@@@@@@ Б                                   &&.&&&         &&&&&&&&&&&.&& .{.?snFCycle;&&&&&&&&&&&.&& .}&&&&&&&&&&&.&& Ш

.end
.}
.endform

!-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-!
! LinkForm "Штатное наполнение", modified 26/09/2000, 17:27 by BK             !
!-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-!
.linkform "Штатное наполнение" prototype is SS_NapForm
.group "Штатное наполнение"
.defo landscape
.p 41
.var
  RecCounter : LongInt ;
.endvar
.fields
  Тек_дата Тек_время
  Предприятие
  Название_отчета : 'trim:-'
  Группа_структурных_единиц : 'trim:-'

  Подразделение : 'trim:-'

  RecCounter
    сотрудник должность кол_шт_единиц коэф оклад_без_доплат

  итого_наименование итого_единиц итого_оклад

.endfields
.[H SKIP
 Ш
 Ш                                                                              Страница @NP@
┌───┬──────────────────────────────┬──────────────────────────┬──────┬───────┬──────────────┐
│ 1 │ 2                            │ 3                        │ 4    │ 5     │ 6            │
└───┴──────────────────────────────┴──────────────────────────┴──────┴───────┴──────────────┘
.]H
 .{.?snFHCyc1;.} .{.?snFHCyc2;.}  .{.?snFHCyc3;.}  .{.?snFHCyc4;.}  .{.?snFHCyc5;.}  .{.?snFHCyc6;.}  .{.?snFHCyc7;.}  .{.?snFHCyc8;.}
  @@@@@@@@@@@@  @@@@@@@

  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б

 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б

┌───┬──────────────────────────────┬──────────────────────────┬──────┬───────┬──────────────┐
│ N │         Фамилия И.О.         │ Наименование структурных │Кол-во│Коэффи-│   Оклад без  │
│поз│                              │подразделений и должностей│един. │ циент │     доплат   │
├───┼──────────────────────────────┼──────────────────────────┼──────┼───────┼──────────────┤
│ 1 │ 2                            │ 3                        │ 4    │ 5     │ 6            │
└───┴──────────────────────────────┴──────────────────────────┴──────┴───────┴──────────────┘

.{snMainCycle
.if snStartIf
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б

.end
.begin RecCounter := 0 ; end.
.{snStructCycle CheckEnter
.begin
  RecCounter := RecCounter + 1 ;
end.
 &&. @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@  &&.&&& &&&.&&& &&&&&&&&&&&.&& .{.?RaisesCycle;.}
.}
.if snFinishIf

      Б@@@@@@@@@@@@@@@@@@@@@@@ Б                                   &&.&&&         &&&&&&&&&&&.&& .{.?snFCycle;.}

.end
.}
.endform