/*
  ╔═════════════════════════════════════════════════════════════════════╗
  ║      Н Т О  "T O P   S O F T",  А О   "Н О В Ы Й   А Т Л А Н Т"     ║
  ║           Проект "КАДРЫ" (с) 2000                                   ║
  ║      Версия    : 5.72                                               ║
  ║      Разработал:  Антонович А.К.     06/12/2000                     ║
  ║      Назначение:  Сервисная функция: Проверка данных в Кадрах       ║
  ║      Изменения :                                                    ║
  ╚═════════════════════════════════════════════════════════════════════╝
*/

#doc
Сервисная функция: Проверка данных в Кадрах
#end
.form StaffTestDat4KadrForm
.hide

.{ SFA_PersonsCycleTestDat4KadrForm CheckEnter
.fields
NUM ИМЯ CSYSCODE
.endfields
NUM: @@@@@@@@@@@@@@@@@@@@@@@@@
ИМЯ: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
CSYSCODE: @@@@@@@@@@@@@@@@@@@@@@@@@
.}
.endform

.linkform "Проверка корректности данных" prototype is StaffTestDat4KadrForm
.[H skip
                                                                                             Страница @NP@
 Р──────┬─────────────────────────────────────────┬─────────────────────  Р
 Р N п/п│              Имя записи                 │   Системный код       Р
 Р──────┴─────────────────────────────────────────┴─────────────────────  Р

.]H

 Р                                   Отчет                                Р
 Р              о записях, содержащих повторяющиеся системные коды.       Р
 Р                                                                        Р
 Р──────┬─────────────────────────────────────────┬─────────────────────  Р
 Р N п/п│              Имя записи                 │   Системный код       Р
 Р──────┴─────────────────────────────────────────┴─────────────────────  Р
.{ SFA_PersonsCycleTestDat4KadrForm CheckEnter
.fields
 NUM ИМЯ CSYSCODE
.endfields Р
 Р&&&&   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  @@@@@@@@@@@@@@@@@@@  Р
.}
.endform