//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 8.00 - модуль "Платежный календарь"
// Печать каталога назначения
//------------------------------------------------------------------------------

#doc
Отчеты - Печать каталога назначения (прототип).<br>
#end
.set name = 'hPrior'
.NameInList 'Базовая форма - Каталог приоритетов обязательств'
.hide
.fields
  Номер                :String
  Краткое_наименование:String
  Наименование         :String
.endfields
.{
  ^^^
.}
.endform

//------------------------------------------------------------------------------
#doc
Каталог назначений.<br>
#end
.LinkForm 'hPrior_01' Prototype is 'hPrior'
.group 'Каталог приоритетов обязательств'
.fields
  CommonFormHeader
  Номер
  Краткое_наименование
  Наименование
.endfields
.[H SKIP
                                                        Лист @np@
 Номер    │ Краткое  наименование │ Наименование
──────────┼───────────────────────┼────────────────────────────────────────────
.]H
^
            Каталог приоритетов обязательств
                                                        Лист @np@
 Номер    │ Краткое  наименование │ Наименование
──────────┼───────────────────────┼────────────────────────────────────────────
.{
 &&&&&&&&&│ @@@@@@@@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
 ─────────┴───────────────────────┴────────────────────────────────────────────
.endform
