//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.80 - модуль "Платежный календарь"
// Реестр финансовых обязательств
//------------------------------------------------------------------------------

#doc
Отчеты - Реестр финансовых обязательств (прототип).<br>
#end
.set name = 'ofpaktse'
.hide
.Fields
  dates                  // с по

  AktOfpNRec

  DocName:string:'t:r'   // не удалит пробелы слева
  Valuta                 // валюта
  Summa1                 // сумма обязательства по приходу
  Summa2                 // сумма обязательства по расходу
  Summa3                 // сумма исполнения по приходу
  Summa4                 // сумма исполнения по расходу
  Summa5                 // сумма факта по приходу
  Summa6                 // сумма факта по расходу
  Summa7                 // сумма отклонения

  Perfomance:string:'t:r' // созданные документы

.endFields
 ^
.{
.{ AktOFP_Body CheckEnter
 ^
 ^ ^  ^ ^ ^ ^ ^ ^ ^
.{ AktOFP_Perfomance CheckEnter
 ^
.}
.{ AktOFP_Line CheckEnter
.}
.}
.}
.endform

//------------------------------------------------------------------------------
#doc
Реестр финансовых обязательств.<br>
#end
.linkform 'ofpaktse01' prototype is 'ofpaktse'
.nameinlist 'Реестр финансовых обязательств'
.p 55
.defo landscape
.Fields
  CommonFormHeader       // название отчета
  dates
  DocName:'t:r'
  Valuta
  Summa1
  Summa2
  Summa5
  Summa6
  Summa7

.endFields
 Ш^
                                                            Реестр финансовых обязательств
                                                           @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{
.[H
                                                                                                                                      лист @np@
──────────────────────────────────┬──────────┬────────────────────┬────────────────────┬────────────────────┬────────────────────┬─────────────────────
           Наименование           │  Валюта  │       Приход       │       Расход       │ Фактический приход │ Фактический расход │      Отклонение
──────────────────────────────────┴──────────┴────────────────────┴────────────────────┴────────────────────┴────────────────────┴─────────────────────
.]H
.{ AktOFP_Body CheckEnter
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @~@@@@@  &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&&&
.{ AktOFP_Perfomance CheckEnter
.}
.{ AktOFP_Line CheckEnter
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
.}
.} Ш

.endform

//------------------------------------------------------------------------------
#doc
Исполнение финансовых обязательств.<br>
#end
.linkform 'ofpaktse02' prototype is 'ofpaktse'
.nameinlist 'Исполнение финансовых обязательств'
.p 55
.defo landscape
.Fields
  CommonFormHeader       // название отчета
  dates
  DocName:'t:r'
  Valuta
  Summa1
  Summa2
  Summa5
  Summa6
  Summa7

  Perfomance:'t:r'

.endFields
 Ш^
                                                           Исполнение финансовых обязательств
                                                            @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{
.[H
                                                                                                                                      лист @np@
──────────────────────────────────┬──────────┬────────────────────┬────────────────────┬────────────────────┬────────────────────┬─────────────────────
           Наименование           │  Валюта  │       Приход       │       Расход       │ Фактический приход │ Фактический расход │      Отклонение
──────────────────────────────────┴──────────┴────────────────────┴────────────────────┴────────────────────┴────────────────────┴─────────────────────
.]H
.{ AktOFP_Body CheckEnter
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @~@@@@@  &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&&&
.{ AktOFP_Perfomance CheckEnter
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.{ AktOFP_Line CheckEnter
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
.}
.}
 Ш
.endform
