//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 6.0 - Бухгалтерский контур
// Реестр распределения платежей
//------------------------------------------------------------------------------

#doc
Реестр распределения платежей
#end
.set name = 'Specif'
.hide
.p 60
.defo landscape
.lm 20
.tm 3
.fields
  DocType  Flag1  Flag2  Flag3  db  de
  Date  DocNo  Sum  SumVal  Val1 Prim1  Prim2
  Nakl  MC  Summ1  Summ2  Val2  Num1  Num2  Price  
  Itog
.endfields
^ ^ ^ ^ ^ ^
.{
.{ DocSpec CheckEnter
^ ^ ^ ^ ^ ^ ^ 
.{ Nakl CheckEnter
^ ^ ^ ^ ^ ^ ^ ^
.}
.}
^
.}
.endform
!==============================================================================
.linkform 'Specif01' prototype is 'Specif'
.nameinlist 'Спецификации'
.p 60
.defo landscape
.lm 20
.tm 3
.fields
CommonFormHeader
  DocType    Flag1  Flag2  Flag3  db  de
  Date  DocNo  Sum  SumVal  Val1  Prim1  Prim2
  Nakl  MC  Summ1  Summ2  Val2  Num1  Num2  Price
  Itog
.endfields
^
      БРеестр распределения платежей Б                          регистр   Б"Оплата МЦ и услуг" Б
                                                            документ  Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
    Включены платежи, для которых:
    ^- платеж расределен    ^- платеж не распределен    ^- распределен не полностью  

    за период с @@@@@@@@@@@@@@ по @@@@@@@@@@@@@@
.{
.[h
                                                                                                     лист @np@
────────────┬──────────┬────────────────────┬────────────────────┬───────────────────────────────────────────────
    Дата    │  N док.  │    Сумма в НДЕ     │   Сумма в валюте   │                Примечание
────────────┴──────────┼────────────────────┼────────────────────┼──────────────┬──────────────┬─────────────────
  Наименование МЦ/усл. │    Сумма в НДЕ     │   Сумма в валюте   │    Кол-во    │    Кол-во    │       Цена  
                       │      позиции       │       позиции      │   к оплате   │  оплаченного │      за ед. 
───────────────────────┴────────────────────┴────────────────────┴──────────────┴──────────────┴─────────────────
.]h
.{ DocSpec CheckEnter                                                                                     
 Б@@@@@@@@@@   @@@@@@@@@ Б      &'&&&&&&&&&&&.&& &'&&&&&&&&&&&.&& @@@   ^
 ^                                                               
.{ Nakl CheckEnter
 В^ В @@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&.&& &'&&&&&&&&&&&.&& @@@ &&&&&&&&.&&&   &&&&&&&&.&&&   &'&&&&&&&&&&&.&&
.}
.}                                                                                                          
.[f
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                                                          
.]f
.}
.endform

!=======================================================================================
