/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 2002 корпорация ГАЛАКТИКА                         ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Бухгалтерский контур                                      ║
 ║ Версия        : 5.84                                                      ║
 ║ Назначение    : Утилита для анлиаз состояния БД (протокол))               ║
 ║ Ответственный : Ларин Михаил Николаевич                                   ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/

.form fRescueDB1
.fields
  curdate    : date
  FilialName : string
  TiDkUser   : word
  TiDkUserBug: string
  TiDkGal    : word
  TiDkGalBug : string
  DocName    : string
  ScanDate   : date
  KolShAll   : longint
  KolShGood  : longint
  KolShBNum  : longint
  KolShBDoc  : longint
  KolShObor  : longint
  KolShSchF  : longint
  KolShSpSop : longint
  KolShNoBf  : longint
  KolShDubl  : longint
  ItogShAll  : longint
  ItogShGood : longint
  ItogShBNum : longint
  ItogShBDoc : longint
  ItogShObor : longint
  ItogShSchF : longint
  ItogShSpSop: longint
  ItogShNoBf : longint
  ItogShDubl : longint
.endfields

              Протокол проверки состояния БД на [^]
              Расчет по филиалу ^
┌───────┬───────┬────────────────────────────┬──────────┬───────┬───────┬───────┬───────┬───────┬───────┬───────┬────────┬───────┐
│Тип    │ Тип   │Наименование документа      │ Дата     │Кол-во │Кол-во │Не тот │ Нет   │Из них │Из них │Из них │Не синхр│Кол-во │
│Польз  │ Гал   │                            │ Расчета  │SoprHoz│хороших│номер в│ПХД для│c прово│с рас- │со Счет│BaseFin │задвое-│
│       │       │                            │          │       │SoprHoz│SoprHoz│SoprHoz│ дками │ пред. │ Факт. │SoprHoz │ нных  │
├───────┼───────┼────────────────────────────┼──────────┼───────┼───────┼───────┼───────┼───────┼───────┼───────┼────────┼───────┤
.{
│&&&&& @│&&&&& @│@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&│&&&&&&&│&&&&&&&│&&&&&&&│&&&&&&&│&&&&&&&│&&&&&&&│&&&&&&&&│&&&&&&&│
.}
├───────┴───────┼────────────────────────────┼──────────┼───────┼───────┼───────┼───────┼───────┼───────┼───────┼────────┼───────┤
│               │                            │Итого     │&&&&&&&│&&&&&&&│&&&&&&&│&&&&&&&│&&&&&&&│&&&&&&&│&&&&&&&│&&&&&&&&│&&&&&&&│
└───────────────┴────────────────────────────┴──────────┴───────┴───────┴───────┴───────┴───────┴───────┴───────┴────────┴───────┘
.endform
