//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.8 - Бухгалтерский контур
// Реестр бухгалтерских проводок по ДО
//------------------------------------------------------------------------------

#doc
Реестр бухгалтерских проводок по ДО
#end
.set name='TXOPrnBP'
.nameinlist 'Базовая форма'
.hide
.fields
       RegUch
// Поля таблицы документов BaseDoc :
       dDoc  NomDes  BaseDok_Name  KatOrg_Name  SummaDoc
// Поля таблицы спецификаций SpStep:
       NameMCUSL  KatPartyName  KatOtpEd_Name  Price  KolSkl
// Поля таблицы хозопераций SoprHoz :
       SoprHoz_DatOb   NoDoc  SummaSopr   NameOper
// Поля таблицы проводок
       DebetSch  KreditSch SummaProv VhProp ProvAvto
.endfields
^
.{ TxoLoopDocum1 CheckEnter    // Цикл по документам
  ^  ^  ^  ^  ^
.if ExistSpec1
.{ TxoLoopSpec1 CheckEnter     // Цикл по спецификациям
  ^  ^  ^  ^  ^
.}
.else
  --- Спецификация отсутствует ---
.end
.if ExistHozOper1
.{ TxoLoopHozOper1  CheckEnter // Цикл по хозоперациям
   ^  ^  ^  ^
.if ExistProvod1
.{ TxoLoopProvod1 CheckEnter   // Цикл по проводкам
  ^  ^  ^  ^  ^
.}
.else
  --- Проводки отсутствуют ---
.end
.}
.else
  --- Хозяйственные операции отсутствуют ---
.end
.}
.endform


.linkform 'TXOPRNBP_1' prototype is 'TXOPRNBP'
.nameinlist 'Документ-Спецификация-ХозОперации-Проводки'
.fields
 CommonFormHeader
 RegUch
// Поля таблицы документов BaseDoc :
    dDoc NomDes BaseDok_Name KatOrg_Name SummaDoc
// Поля таблицы спецификаций SpStep:
    NameMCUSL  KatPartyName  KatOtpEd_Name  Price  KolSkl
// Поля таблицы хозопераций SoprHoz :
    SoprHoz_DatOb   NoDoc  NameOper  SummaSopr
// Поля таблицы проводки Oborot :
    DebetSch  KreditSch  VhProp ProvAvto SummaProv
.endfields
 Р^
 Б                                              Операции по документам-основаниям в разрезе
                                           Документ - Спецификация - Хозоперации - Проводки С
 Р
Регистр учета: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Б──────────┬───────────┬────────────────────────────────────────────┬───────────────────────────────────────────┬─────────────────
   Дата   │ Номер ДО  │            Примечание                      │              Контрагент                   │            Сумма
──────────┴───────────┼────────────────────────────────────────────┼─────────────┬───────────┬─────────────────┼─────────────────
                      │            МЦ/Услуга                       │    Партия   │   Ед.Изм. │      Цена       │            Сумма
                      ├──────────┬───────────┬─────────────────────┴─────────────┴───────────┴─────────────────┼─────────────────
                      │    Дата  │   Номер   │                         Хозяйственная операция                  │Сумма хозоперации
                      ├──────────┴───────────┴─────────────────────┬────────────────────────────────────┬───┬──┼─────────────────
                      │           Дебет счета                      │             Кредит счета           │+/-│  │    Сумма оборота
──────────────────────┴────────────────────────────────────────────┴────────────────────────────────────┴───┴──┴───────────────── С
 Р.{  TxoLoopDocum1 CheckEnter         // Цикл по документам
@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&
                      ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────
.if ExistSpec1
.{ TxoLoopSpec1 CheckEnter           // Цикл по спецификациям
                      │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@ @@@@@@@@@@@ &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&&
.}
.else
                      │ --- Спецификация отсутствует ---
.end
                      └──────────────────────────────────────────────────────────────────────────────────────────────────────────
.if ExistHozOper1
.{ TxoLoopHozOper1  CheckEnter       // Цикл по хозоперациям
                      ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────
                      │@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&
                      ├──────────────────────────────────────────────────────────────────────────────────────────────────────────
.if ExistProvod1
.{ TxoLoopProvod1 CheckEnter         // Цикл по проводкам
                      │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@ @@ &'&&&&&&&&&&&&.&&
.}
.else
                      │ --- Проводки отсутствуют ---
.end
                      └──────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
.else
                      ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────
                      │ --- Хозяйственные операции отсутствуют ---
                      └──────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.} Р
.endform

.linkform 'TXOPRNBP_2' prototype is 'TXOPRNBP'
.nameinlist 'Документ-Спецификация'
.fields
 CommonFormHeader
 RegUch
// Поля таблицы документов BaseDoc :
    dDoc NomDes BaseDok_Name KatOrg_Name SummaDoc
// Поля таблицы спецификаций SpStep:
    NameMCUSL  KatPartyName  KatOtpEd_Name  Price  KolSkl
.endfields

 Р^
 Б                                              Операции по документам-основаниям в разрезе
                                                        Документ - Спецификация С
 Р
Регистр учета: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Б──────────┬───────────┬────────────────────────────────────────┬───────────────────────────────────────────────┬─────────────────
   Дата   │ Номер ДО  │            Примечание                  │                  Контрагент                   │            Сумма
──────────┴───────────┼────────────────────────────────────────┼─────────────────┬───────────┬─────────────────┼─────────────────
                      │            МЦ/Услуга                   │      Партия     │   Ед.Изм. │      Цена       │            Сумма
──────────────────────┴────────────────────────────────────────┴─────────────────┴───────────┴─────────────────┴───────────────── С
 Р.{  TxoLoopDocum1 CheckEnter         // Цикл по документам
@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&
                      ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────
.if ExistSpec1
.{ TxoLoopSpec1 CheckEnter           // Цикл по спецификациям
                      │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@ @@@@@@@@@@@ &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&&
.}
.else
                      │ -- Спецификация отсутствует ---
.end
                      └──────────────────────────────────────────────────────────────────────────────────────────────────────────
.if ExistHozOper1
.{ TxoLoopHozOper1  CheckEnter       // Цикл по хозоперациям
.if ExistProvod1
.{ TxoLoopProvod1 CheckEnter         // Цикл по проводкам
.}
.else
.end
.}
.else
.end
.} Р
.endform

.linkform 'TXOPRNBP_3' prototype is 'TXOPRNBP'
.nameinlist 'Документ-ХозОперации-Проводки'
.fields
 CommonFormHeader
 RegUch
// Поля таблицы документов BaseDoc :
   dDoc NomDes BaseDok_Name KatOrg_Name SummaDoc
// Поля таблицы хозопераций SoprHoz :
   SoprHoz_DatOb   NoDoc  NameOper SummaSopr
// Поля таблицы проводки Oborot :
   DebetSch  KreditSch VhProp ProvAvto SummaProv
.endfields

 Р^
 Б                                              Операции по документам-основаниям в разрезе
                                                   Документ - Хозоперации - Проводки С
 Р
Регистр учета: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Б──────────┬───────────┬────────────────────────────────────────────┬───────────────────────────────────────────┬─────────────────
   Дата   │ Номер ДО  │            Примечание                      │              Контрагент                   │            Сумма
──────────┴───────────┼──────────┬───────────┬─────────────────────┴───────────────────────────────────────────┼─────────────────
                      │   Дата   │   Номер   │                      Хозяйственная операция                     │Сумма хозоперации
                      ├──────────┴───────────┴─────────────────────┬────────────────────────────────────┬───┬──┼─────────────────
                      │           Дебет счета                      │             Кредит счета           │+/-│  │    Сумма оборота
──────────────────────┴────────────────────────────────────────────┴────────────────────────────────────┴───┴──┴───────────────── С
 Р.{  TxoLoopDocum1 CheckEnter         // Цикл по документам
@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&
.if ExistSpec1
.{ TxoLoopSpec1 CheckEnter           // Цикл по спецификациям
.}
.else
.end
.if ExistHozOper1
.{ TxoLoopHozOper1  CheckEnter       // Цикл по хозоперациям
                      ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────
                      │@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&
                      ├──────────────────────────────────────────────────────────────────────────────────────────────────────────
.if ExistProvod1
.{ TxoLoopProvod1 CheckEnter         // Цикл по проводкам
                      │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@ @@ &'&&&&&&&&&&&&.&&
.}
.else
                      │ --- Проводки отсутствуют ---
.end
                      └──────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
.else
                      ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────
                      │ --- Хозяйственные операции отсутствуют ---
                      └──────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.} Р
.endform

.linkform 'TXOPRNBP_4' prototype is 'TXOPRNBP'
.nameinlist 'Документ-ХозОперации'
.fields
 CommonFormHeader
 RegUch
// Поля таблицы документов BaseDoc :
    dDoc NomDes BaseDok_Name KatOrg_Name SummaDoc
// Поля таблицы хозопераций SoprHoz :
   SoprHoz_DatOb NoDoc NameOper SummaSopr
.endfields

 Р^
 Б                                              Операции по документам-основаниям в разрезе
                                                         Документ - Хозоперации С
 Р
Регистр учета: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Б──────────┬───────────┬────────────────────────────────────────┬───────────────────────────────────────────────┬─────────────────
   Дата   │ Номер ДО  │            Примечание                  │                  Контрагент                   │            Сумма
──────────┴───────────┼──────────┬───────────┬─────────────────┴───────────────────────────────────────────────┼─────────────────
                      │   Дата   │   Номер   │                      Хозяйственная операция                     │Сумма хозоперации
──────────────────────┴──────────┴───────────┴─────────────────────────────────────────────────────────────────┴───────────────── С
 Р.{  TxoLoopDocum1 CheckEnter         // Цикл по документам
@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&
.if ExistSpec1
.{ TxoLoopSpec1 CheckEnter           // Цикл по спецификациям
.}
.else
.end
                      ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────
.if ExistHozOper1
.{ TxoLoopHozOper1  CheckEnter       // Цикл по хозоперациям
                      │@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&
.if ExistProvod1
.{ TxoLoopProvod1 CheckEnter         // Цикл по проводкам
.}
.else
.end
.}
.else
                      │ --- Хозяйственные операции отсутствуют ---
.end
                      └──────────────────────────────────────────────────────────────────────────────────────────────────────────
.} Р
.endform

