//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 6.00 - Основные средства
// Печать отчета о целостности данных наличия драгметаллов
//------------------------------------------------------------------------------

#doc
Печать отчета о целостности данных наличия драгметаллов
#end

.form 'OSChkDrg'
.hide
.fields
   shapka Innum text1 text2
.endfields

^
.{
 ^ ^ ^
.}

.endform

.linkform 'OSChkDrg_01' prototype is 'OSChkDrg'
.NameInList 'Ошибки контроля целостности данных драгметаллов'
.fields
 CommonFormHeader
 Shapka
 Innum text1 text2
.endfields
^

^

──────────────┬───────────────────────────────┬─────────────────────────────────────
 Инвентарный  │     Обнаруженные ошибки       │    Действия по устранению
   номер      │                               │
──────────────┼───────────────────────────────┼─────────────────────────────────────
.{
@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
──────────────┴───────────────────────────────┴─────────────────────────────────────
.endform
