//******************************************************************************
//                                                      (с) корпорация Галактика
//  Галактика 7.12 - Управление персоналом
//  Прототип для разноски ШПЗ по сотрудникам
//******************************************************************************

#doc
Прототип для разноски ШПЗ по сотрудникам
#end
.form  CarryingShPZ_Pers
.hide
.fields
  Department   // Подразделение
  FIO_TabNmb   // ФИО/Табельный номер сотрудика
  // ---- старые значения ШПЗ ----
  OldSchet     // Счет
  OldSubSchet  // Субсчет
  OldKau       // Аналитика
  OldTXO       // Xозоперация
  OldParam     // Параметр
  // ---- новые значения ШПЗ ----
  NewSchet     // Счет
  NewSubSchet  // Субсчет
  NewKau       // Аналитика
  NewTXO       // Xозоперация
  NewParam     // Параметр
.endfields

.{ Cycle_PersShPZ CheckEnter
  ^ ^
  ^ ^ ^ ^ ^
  ^ ^ ^ ^ ^
.}

.endform
