/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1999 корпорация ГАЛАКТИКА                         ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Кадры                                                     ║
 ║ Версия        : 5.5, 5.7                                                  ║
 ║ Назначение    : Справка по обновлению тарифа  в ШР                        ║
 ║ Ответственный : Мохова Жанна Игоревна                                     ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
#doc
Справка по обновлению тарифа  в ШР
#end
.set name='tarstr'
.p 60
.hide
.fields
Name1
NamePost
OldTariff
разряд
профессия
NewTariff
.endfields
.{
.IF TARIF_DEPARTMENTNAME1
^
.ELSE
^ ^ ^ ^ ^
.END
.}
.endform

.LINKFORM 'tarstr_01' PROTOTYPE IS 'tarstr'
.nameinlist 'Полная форма отчета'
.p 47
.FIELDS
CommonFormHeader
.ENDFIELDS
.[H OVERWRITE
^
.]H
.FIELDS
Name1
NamePost
разряд
профессия
OldTariff
NewTariff
.ENDFIELDS
 И
                                 БСПРАВКА ПО ОБНОВЛЕНИЮ ТАРИФА Б

┌───────────────────────────┬──────┬───────────────────┬─────────────┬─────────────┐
│ БНаименование ставки        │Разряд│Профессия          │Старый таpиф │Новый таpиф   Б│
.{
.IF TARIF_DEPARTMENTNAME1
├───────────────────────────┴──────┴───────────────────┴─────────────┴─────────────┤
│ Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б│
├───────────────────────────┬──────┬───────────────────┬─────────────┬─────────────┤
.ELSE
│@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&│@@@@@@@@@@@@@@@@@@@│&&&&&&&&&&&&&│&&&&&&&&&&&&&│
.END
.}
└───────────────────────────┴──────┴───────────────────┴─────────────┴─────────────┘

.ENDFORM