/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,01 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Версия        : 7.xx                                                      ║
 ║ Назначение    : Отчеты по трудозатратам                                   ║
 ║ Ответственный : Короткин Ю.Н.                                             ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/

.form BrakCheckRep
.hide
.defo landscape
.fields

dtBeg   // начало периода
dtEnd   // окончание периода
Dept    // подразделение

TabN        // табельный номер
FIO         // ФИО
DetNom      // номер изделия
DetName     // наименование изделия
DetEI       // ед. изм. изделия
PlanQnt     // кол-во по плану
PlanBrakQnt // кол-во брака по плану
FactQnt     // кол-во по факту
FactBrakQnt // кол-во брака по факту
BrakReason  // причина брака
BrakPercent // процент брака
MassBrakQnt // вес брака
BrakEI      // весовая ед. изм. брака

.endfields
^ ^ ^
.{ CheckEnter lpBrakData
 ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.endform
//******************************************************************************
.linkform 'BrakCheckRepWB' prototype is BrakCheckRep
.nameinlist 'АНАЛИЗ БРАКА'
.group 'BrakCheckRep'
.fields

dtBeg
dtEnd
Dept

TabN        // табельный номер
FIO         // ФИО
DetNom      // номер изделия
DetName     // наименование изделия
DetEI       // ед. изм. изделия
PlanQnt     // кол-во по плану
PlanBrakQnt // кол-во брака по плану
FactQnt     // кол-во по факту
FactBrakQnt // кол-во брака по факту
BrakReason  // причина брака
BrakPercent // процент брака
MassBrakQnt // вес брака
BrakEI      // весовая ед. изм. брака

.endfields

 АНАЛИЗ БРАКА

 Период с ^ по ^ Подразделение: ^

────────────┬──────────────────────────────────┬────────────────────────────────────────┬───────────────────────┬───────────────────────┬─────────────────┬───────┬─────────────────
 Таб. номер │ Сотрудник                        │ Деталь                                 │ Количество (норма)    │ Количество (факт)     │ Причина         │ %     │ Вес брака
            │                                  │ номер    │ наименование                │ съем      │ брак      │ наработка │ брак      │                 │       │
────────────┼──────────────────────────────────┼──────────┼─────────────────────────────┼───────────┼───────────┼───────────┼───────────┼─────────────────┼───────┼─────────────────
.{ CheckEnter lpBrakData
 @@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │ @@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@ @@@@@ │ &&&&&&.&& │ &&&&&&.&& │ &&&&&&.&& │ &&&&&&.&& │ @@@@@@@@@@@@@@@ │ &&.&& │ &&&&&&.&& @@@@@
.}
────────────┴──────────────────────────────────┴──────────┴─────────────────────────────┴───────────┴───────────┴───────────┴───────────┴─────────────────┴───────┴─────────────────
.endform