/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,01 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Планирование                                              ║
 ║ Версия        : 6.00                                                      ║
 ║ Назначение    : Отчет о рассогласованиях                                  ║
 ║ Ответственный : Барановский Алексей Леонидович (Aleksis)                  ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
!=============================================================================
.Form 'DocConf'
!Группировка до документу
!=============================================================================
.Hide
.Fields
wDiapason : Word
Настр_диапазон
wRepFilter : Word
Настр_фильтр
wRepGroup : Word
Настр_группировка
Формат_сум
Формат_кол
//'-----------------------------------DocConf_Document
ObjAcct_NRec : Comp
ObjAcct_TypeObj : Word
Док_тип
ObjAcct_cObject : Comp
Док_наим
Док_прим
//'---------------------------------- DocConf_Object
SpObjAcc_NRec : Comp
SpObjAcc_TypePos :Word
SpObjAcc_cPos : Comp
Объект_тип
Объект_наим
ЕдИзм_сокр_наим_док
Кол_док : Double
Дата_док : Date
//'отп.ед.изм объекта по плану
KatOtpEd_NRec : Comp
ЕдИзм_наим_план
KatOtpEd_PrMC : Word
KatOtpEd_cMCUsl : Comp
KatOtpEd_Koef : Double
KatOtpEd_Akt  : Word
KatOtpEd_Diskret : Word
KatOtpEd_BKod
KatOtpEd_Skid : Double
ЕдИзм_сокр_наим_план
//'
Кол_план : Double
Дата_план : Date
.EndFields
^ ^ ^ ^ ^ ^ ^ ^
.{ CheckEnter DocConf_Common
.{ CheckEnter DocConf_Document
^ ^ ^ ^ ^ ^ 
.}
.{ CheckEnter DocConf_Object
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.}
.EndForm

!=============================================================================
.Form 'DocConf2'
!Группировка до объекту планирования
!=============================================================================
.Hide
.Fields
wDiapason : Word
Настр_диапазон
wRepFilter : Word
Настр_фильтр
wRepGroup : Word
Настр_группировка
Формат_сум
Формат_кол
wRepEd : Word
Настр_ЕдИзм
//'---------------------------------- DocConf_Object2
PrMC : Word
Объект_тип
cMCUsl : Comp
Объект_наим
//'-----------------------------------DocConf_Document2
ObjAcct_NRec : Comp
ObjAcct_TypeObj : Word
Док_тип
ObjAcct_cObject : Comp
Док_наим
Док_прим
SpObjAcc_NRec : Comp
SpObjAcc_TypePos :Word
SpObjAcc_cPos : Comp
ЕдИзм_сокр_наим_док
Кол_док : Double
Дата_док : Date
//'отп.ед.изм объекта по плану
KatOtpEd_NRec : Comp
ЕдИзм_наим_план
KatOtpEd_PrMC : Word
KatOtpEd_cMCUsl : Comp
KatOtpEd_Koef : Double
KatOtpEd_Akt  : Word
KatOtpEd_Diskret : Word
KatOtpEd_BKod
KatOtpEd_Skid : Double
ЕдИзм_сокр_наим_план
//'
Кол_план : Double
Дата_план : Date
//'---------------------------------- DocConf_Itogo2
Итого_PrMC : Word
Итого_Объект_тип
Итого_cMCUsl : Comp
Итого_Объект_наим
Итого_cEd : Comp
Итого_ЕдИзм
Итого_Кол_док : Double
Итого_Кол_план : Double
.EndFields
^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.{ CheckEnter DocConf_Common2
.{ CheckEnter DocConf_Object2
^ ^ ^ ^ 
.}
.{ CheckEnter DocConf_Document2
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.{ CheckEnter DocConf_Itogo2
^ ^ ^ ^ ^ ^ ^ ^ 
.}
.}
.EndForm

!=============================================================================
.LinkForm 'DocConf_01' Prototype is 'DocConf'
!=============================================================================
.NameInList 'Ведомость рассогласований'
.Group 'Ведомости рассогласований'
.p 80
.defo portrait
.Var
lOne : Boolean
.EndVar
.Fields
CommonFormHeader
Настр_диапазон
Настр_фильтр
Настр_группировка
//'-----------------------------------DocConf_Document
Док_тип
Док_наим
Док_прим
//'---------------------------------- DocConf_Object
if (Объект_тип='не определен', 'н/о', Объект_тип)
Объект_наим
if (ЕдИзм_сокр_наим_док='не определен', 'н/о', ЕдИзм_сокр_наим_док)
if (Объект_наим='не определен', '', Trim(DoubleToStr(Кол_док, Формат_кол)))
if (Объект_наим='не определен', '', DateToStr(Дата_док, 'DD/MM/YYYY'))
ЕдИзм_сокр_наим_план
Trim(DoubleToStr(Кол_план, Формат_кол))
DateToStr(Дата_план, 'DD/MM/YYYY')
.EndFields
 Р.[h
                                                Лист @Np@
.]h
.Begin
 lOne := false
End.
^

                                          ВЕДОМОСТЬ РАССОГЛАСОВАНИЙ

Диапазон:               ^
Тип(ы) рассогласований: ^
Группировка:            ^
.{ CheckEnter DocConf_Common
.[h
────┬──────────────────────────────┬──────────────────────────────────┬──────────────────────────────────  
    │                              │           По документу           │           К исполнению
 Тип│           Позиция            ├───────┬───────────────┬──────────┼───────┬───────────────┬──────────
    │                              │Ед.изм.│  Количество   │   Дата   │Ед.изм.│  Количество   │   Дата
────┴──────────────────────────────┴───────┴───────────────┴──────────┴───────┴───────────────┴────────── 
.]h
.{ CheckEnter DocConf_Document
 Б@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
.}
.{ CheckEnter DocConf_Object
.Begin
 lOne := true;
End.
 @@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@ &&&&&&&&&&&&&&& @@@@@@@@@@ @@@@@@@ &&&&&&&&&&&&&&& @@@@@@@@@@
.}
.}
.{?Internal;(Not lOne);
┌───────────────────────────────────────────────────┐    
│             РАССОГЛАСОВАНИЙ НЕТ                   │ 
└───────────────────────────────────────────────────┘                                                       
.}


Ответственный за выпуск Р
.EndForm

!=============================================================================
.LinkForm 'DocConf2_01' Prototype is 'DocConf2'
!=============================================================================
.NameInList 'Ведомость рассогласований'
.Group 'Ведомости рассогласований'
.p 80
.defo portrait
.Var
lOne : Boolean
.EndVar
.Fields
CommonFormHeader
Настр_диапазон
Настр_фильтр
Настр_группировка
Настр_ЕдИзм
//'---------------------------------- DocConf_Object
if (Объект_тип='не определен', 'н/о', Объект_тип)
Объект_наим
//'-----------------------------------DocConf_Document
Док_тип
Док_наим
Док_прим
if (ЕдИзм_сокр_наим_док='не определен', 'н/о', ЕдИзм_сокр_наим_док)
if (Объект_наим='не определен', '', Trim(DoubleToStr(Кол_док, Формат_кол)))
if (Объект_наим='не определен', '', DateToStr(Дата_док, 'DD/MM/YYYY'))
ЕдИзм_сокр_наим_план
Trim(DoubleToStr(Кол_план, Формат_кол))
DateToStr(Дата_план, 'DD/MM/YYYY')
//'---------------------------------- DocConf_Itogo2
if (Итого_Объект_тип='не определен', 'н/о', Итого_Объект_тип)
Итого_Объект_наим
if (Итого_ЕдИзм='не определен', 'н/о', Итого_ЕдИзм)
if (Итого_Объект_наим='не определен', '', Trim(DoubleToStr(Итого_Кол_док,  Формат_кол)))
if (Итого_Объект_наим='не определен', '', Trim(DoubleToStr(Итого_Кол_план, Формат_кол)))
.EndFields
 Р.[h
                                                Лист @Np@
.]h
.Begin
 lOne := false
End.
^

                                          ВЕДОМОСТЬ РАССОГЛАСОВАНИЙ

Диапазон:                     ^
Тип(ы) рассогласований:       ^
Группировка:                  ^
Единица измерения для итогов: ^
.{ CheckEnter DocConf_Common2
.[h
───────────┬────────────────────┬──────────┬──────────────────────────────────┬──────────────────────────────────                                       
           │                    │          │           По документу           │           К исполнению  
   Тип     │    Наименование    │Примечание├───────┬───────────────┬──────────┼───────┬───────────────┬──────────  
           │                    │          │Ед.изм.│  Количество   │   Дата   │Ед.изм.│  Количество   │   Дата  
───────────┴────────────────────┴──────────┴───────┴───────────────┴──────────┴───────┴───────────────┴──────────                                    
.]h
.{ CheckEnter DocConf_Object2
 Б@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  Б
.}
.{ CheckEnter DocConf_Document2
.Begin
 lOne := true;
End.
 @@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@ @@@@@@@ &&&&&&&&&&&&&&& @@@@@@@@@@ @@@@@@@ &&&&&&&&&&&&&&& @@@@@@@@@@
.}
.{ CheckEnter DocConf_Itogo2
 БИтого по @@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@ &&&&&&&&&&&&&&&                    &&&&&&&&&&&&&&& Б 
.}
.}
.{?Internal;(Not lOne);
┌───────────────────────────────────────────────────┐    
│             РАССОГЛАСОВАНИЙ НЕТ                   │ 
└───────────────────────────────────────────────────┘                                                       
.}


Ответственный за выпуск Р
.EndForm

