/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,09 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Модуль планирование производства                          ║
 ║ Версия        : 8.xx                                                      ║
 ║ Назначение    : Печать каталога "группы"         	                       ║
 ║ Ответственный : Новротский Алексей Артурович                              ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/


.set name='frmGrDoc'
.hide
.fields
  _Code _Name
.endfields
.{ CheckEnter frmGrDoc_Loop
^^
.}
.endform

.linkform 'frmGrDoc_01' prototype is 'frmGrDoc'
.group 'Планирование'

.fields
   _Code _Name
.endfields
        Список групп
────────────────┬───────────────────────────────────────────
      Код       │                 Наименование
────────────────┴───────────────────────────────────────────
.{ CheckEnter frmGrDoc_Loop
@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.endform

.linkform 'frmGrDoc_02' prototype is 'frmGrDoc'
.group 'Представление'

.fields
   _Code _Name
.endfields
        Список групп
────────────────┬───────────────────────────────────────────
      Код       │                 Наименование
────────────────┴───────────────────────────────────────────
.{ CheckEnter frmGrDoc_Loop
@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.endform

