/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,01 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Версия        : 7.xx                                                      ║
 ║ Назначение    : резервирование планового фонда производственных центров   ║
 ║ Ответственный : Гончаренко Анна                                           ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/

.set name= 'frmPrintRsvOper'
.hide
.fields

_Name
_BegDT
_EndDT
_Moshch
_Stat
_Sost
_Obj
_Kol
_EdIzm
_Party
_Oper
_Marsh
_Dlitelnost
_PZV
_typeIst
_NameIst
_StatIst
_Num
_TypePos
_NamePos
_StatPos
_KindW

.endfields
.{ CheckEnter frmPRO_Loop
^^^^^^^^^^^^^^^^^^^^^^
.}

.endform

//******************************************************************************

.linkform 'frmPrintRsvOper_Gyrnal' prototype is 'frmPrintRsvOper'
.group 'PrintRsvOper'
.NameInList 'Журнал резервирования планового фонда производственных центров'
.fields

_Name
_BegDT
_EndDT
_Moshch
_Stat
_Sost
_Obj
_Kol
_EdIzm
_Party
_Oper
_Marsh
_Dlitelnost
_PZV
_typeIst
_NameIst
_StatIst
_Num
_TypePos
_NamePos
_StatPos
_KindW

.endfields


           Журнал резервирования планового фонда производственных центров.
───────────────┬──────────┬──────────┬─────────────┬─────────┬───────────┬───────────────┬──────┬──────┬────────┬───────────┬─────────────────────┬───────┬───────────┬───────────┬──────────────┬───────────┬────────────────────────────────────────────────
 Объект        │   Дата   │ Дата     │ Необходимая │ Статус  │ Состояние │ Наименование  │Кол-во│ Ед.  │ Партия │           │       Маршрут       │ Длит. │ Подгот.-  │    Тип    │ Наименование │ Статус    │      Позиция документа-источника
               │  и время │ и время  │   мощность, │ позиции │           │   объекта     │      │ изм. │        │ Операция  │                     │ опер.,│ закл.     │ источника │ документа-   │ документа-├─────┬────┬──────────────┬─────────┬────────────
               │  начала  │ конца    │    час      │   ЖР    │           │ производства  │      │      │        │           │                     │ час   │ время, час│           │ источника    │ источника │ №   │Тип │ Наименование │ Статус  │ Вид работ
───────────────┴──────────┴──────────┴─────────────┴─────────┴───────────┴───────────────┴──────┴──────┴────────┴───────────┴─────────────────────┴───────┴───────────┴───────────┴──────────────┴───────────┴─────┴────┴──────────────┴─────────┴────────────
.{ CheckEnter frmPRO_Loop
@@@@@@@@@@@@@@  @@@@@@@@@@ @@@@@@@@@@    &&&&.&&     @@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@  &&&&   @@@@@  @@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@  &&&&.&    &&&&.&   @@@@@@@@@@@ @@@@@@@@@@@@@@  @@@@@@@@@  @@@@@ @@@@ @@@@@@@@@@@@@@ @@@@@@@@@  @@@@@@@@@@@
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
.endform

