/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,02 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Корпоративное планирование                                ║
 ║ Версия        : 7.10                                                      ║
 ║ Назначение    :                                                           ║
 ║ Ответственный :                                                           ║
 ║ Параметры     :                                                           ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/

.set name='frmPrM_OEC'
.hide
.fields _DateOfReport
        _KauObj
        _Obj
        _KauPrEd
        _PrEd
        _TypeMnCp
        _DateStart _cEd _CapQT _cEdTime
.endfields
^
.{ CheckEnter frmPrM_OEC_Loop1
^
.{ CheckEnter frmPrM_OEC_Loop2
^
.{ CheckEnter frmPrM_OEC_Loop3
^
.{ CheckEnter frmPrM_OEC_Loop4
^
.{ CheckEnter frmPrM_OEC_Loop5
^
.{ CheckEnter frmPrM_OEC_Loop6
^^^^
.}
.}
.}
.}
.}
.}
.endform


.linkform 'linkfrmPrM_OEC' prototype is 'frmPrM_OEC'
!.group 'ObjPar'
.NameInList 'Объекты - Производственные единицы - Тип мощности - Значения мощности'
.fields _DateOfReport
        _KauObj
        _Obj
        _KauPrEd
        _PrEd
        _TypeMnCp
        _DateStart _cEd _CapQT _cEdTime

.endfields

                                  Производственная мощность
                Объекты - Производственные единицы - Тип мощности - Значения мощности
                                 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 ───────────────────────────────────────────────────┬──────────┬────────────┬──────────────┬─────────
  Тип объекта                                       │          │            │              │
    Объект                                          │   Дата   │  Единица   │              │ Единица
      Тип производственной единицы                  │  начала  │ измерения  │   Мощность   │ времени
          Производственная единица                  │ действия │            │              │
              Тип мощности                          │          │            │              │
.{ CheckEnter frmPrM_OEC_Loop1
 ───────────────────────────────────────────────────┼──────────┼────────────┼──────────────┼─────────
  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │            │              │
.{ CheckEnter frmPrM_OEC_Loop2
    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │            │              │
.{ CheckEnter frmPrM_OEC_Loop3
      @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │            │              │
.{ CheckEnter frmPrM_OEC_Loop4
        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │            │              │
.{ CheckEnter frmPrM_OEC_Loop5
          Мощность: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │            │              │
.{ CheckEnter frmPrM_OEC_Loop6
                                                    │@@@@@@@@@@│@~@@@@@@@@@@│&&&&&&&&&&&&&&│@@@@@@@@@
.}
.}
.}
.}
.}
.}
 ───────────────────────────────────────────────────┴──────────┴────────────┴──────────────┴───────

.endform
