! ╔═════════════════════════════════════════════════════════════════════════╗
! ║  Разработал:  Юрьев Олег                                                ║
! ║  Назначение:  Особые ситуации - Объектов планирования                   ║
! ╚═════════════════════════════════════════════════════════════════════════╝

.FORM 'OPExceptOP'
.hide
.fields
  sPlan      : string
  dBegDate   : Date
  sAn1       : string
  sAn2       : string
  sAn3       : string
  sCode      : string
  sExeption  : string
  PosName    : string
  SpKod      : string
  SpObozn    : string
  EdIzm      : string
  fAnalSp1   : string
  fAnalSp2   : string
  fAnalSp3   : string
  InvOnHand  : Double
  SZ         : Double

.endfields
.{
план ^
даты ^
аналитики ОП ^ ^ ^
.{
Ситуация ^ ^
.{
   ОП ^ ^ ^ ^ ^ ^ ^
   Количества ^ ^
.}
.}
.}
.endform

.linkform 'OPExceptOP_001' prototype is 'OPExceptOP'
.NameInList 'Особые ситуации объектов планирования'
!.group 'Отчеты с сортировкой по номенклатурному номеру'
.PAPER PA4
.ORIENT LANDSCAPE
.LL 60
.LM 10
.TM 10
.BM 10
.RM 10
.P 40
.fields
  sPlan
  dBegDate
  sAn1
  sAn2
  sAn3
  sCode
  sExeption
  PosName
  SpKod
  SpObozn
  EdIzm
  fAnalSp1
  fAnalSp2
  fAnalSp3
  InvOnHand
  SZ

.endfields

.{
.[H SKIP
 Ш                                                                                                                      Лист Ш@NP@
 Ш ────────────────────────┬───────────┬─────────────┬──────────┬─────────────┬─────────────┬─────────────┬────────────────┬────────────────
          (1)            │    (2)    │     (3)     │    (4)   │     (5)     │     (6)     │     (7)     │      (8)       │       (9)
 ────────────────────────┴───────────┴─────────────┴──────────┴─────────────┴─────────────┴─────────────┴────────────────┴──────────────── Ш
.]H


 Б                  ОСОБЫЕ СИТУАЦИИ ОБЪЕКТОВ ПЛАНИРОВАНИЯ Б

 И Оперативный план :  Б^ Б
 Дата привязки  :  Б^ Б
 Р                                                                                                                      Лист Ш@NP@
 Ш ────────────────────────┬───────────┬─────────────┬──────────┬─────────────┬─────────────┬─────────────┬────────────────┬────────────────
 Б  Наименование           │ Ном номер │ Обозначение │ Ед. изм. │@@@@@@@@@@@@@│@@@@@@@@@@@@@│@@@@@@@@@@@@@│ Тек. остаток   │Страховой запас Щ
 Ш ────────────────────────┼───────────┼─────────────┼──────────┼─────────────┼─────────────┼─────────────┼────────────────┼────────────────
          (1)            │    (2)    │     (3)     │    (4)   │     (5)     │     (6)     │     (7)     │      (8)       │       (9)
 ────────────────────────┴───────────┴─────────────┴──────────┴─────────────┴─────────────┴─────────────┴────────────────┴──────────────── Ш
.{
 Э
 Д  Д0& @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Э
.{
 Ш @@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@@@ @@@@@@@@@@@@@ @@@@@@@@@@@@@ &&&&&&&&&&&&&.&& &&&&&&&&&&&&&.&& Ш
.}
 Б. Б}

.}
.endform
