//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.85 - Налоговый учет
// Печать реестра налоговых регистров
// Внимание! Существует slk-отчет в формате Excel
//------------------------------------------------------------------------------
#include FeeSigners.frn
#doc
Печать реестра налоговых регистров
#end

.Set Name = 'NalRegDoc'
.Hide
.Fields
  RegTypeStr : String  dFrom : Date  dTo : Date

  NalRegDc_NRec : comp DesGr  : String  Descr : String  NoDoc : String  DatDoc : Date  InFuture : Boolean
  UstDate: Date   InvNum : String  ObjName : String  DatEnd : Date  Srok : Word  SrokEd : String
  VidRashNRec : Comp  VidRashName : String   Refin : Double
  SumRs1 : Double  SumRs2 : Double  SumRs3 : Double  SumRs4 : Double  SumRs5 : Double
  SumPr  : Double
  #FeeSignersCycleFields
.endFields
! Подкачка Excel форматов
! Эта строчка нужна пока не будет решена 102.31867
#include ExcelFormat.frn

   ^ ^ ^
.{
   ^ ^ ^ ^ ^ ^
   ^ ^ ^ ^ ^ ^
   ^ ^ ^
   ^ ^ ^ ^ ^
   ^
.}
#FeeSignersCycle(NalRegDoc)
.endForm

//-----------------------------------------------------------------------------

.LinkFORM NalRegReest01 Prototype Is NalRegDoc
.NameInList 'Реестр налоговых регистров'
.Group 'Форма реестра по умолчанию'
.p 80
.Defo Portrait
.Fields
   CommonFormHeader
   '"'+RegTypeStr+'"' dFrom  dTo
.endFields
 Р.[h
                                        Лист @Np@
.]h
^
                                РЕЕСТР НАЛОГОВЫХ РЕГИСТРОВ
     @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                           за период c ^ по ^

.{
.[h
     ──────────┬──────────┬────────────────┬───────────────────┬─────────────┬─────┬────────
        Дата   │Дескриптор│ Номер регистра │  Принятая сумма   │Срок списания│Един.│ Будущ.
     ──────────┴──────────┴────────────────┴───────────────────┴─────────────┴─────┴────────
.]h
.Fields
  DatDoc  Descr  NoDoc  SumPr  Srok  SrokEd  if ( InFuture, '+', '-')
.endFields
     @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@@@@@@ &'#&&&&&&&&&&&&&.&& &#&&&&&&&&&&& @@@@@  @~@
.}

.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_NalRegDoc
.{ checkenter FeeSignersCycle_NalRegDoc
      Б@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
     ---------------------------     ----------   --------------------------------------------
               (должность)           (подпись)          (расшифровка подписи)

.}
.end Р
.endForm

//-----------------------------------------------------------------------------

.LinkFORM NalRegReest02 Prototype Is NalRegDoc
.NameInList 'Реестр убытков от реализации амортизируемого имущества'
.Group 'Форма реестра для амортизируемого имущества'
.p 60
.Defo Landscape
.Fields
  CommonFormHeader
  '"'+RegTypeStr+'"' dFrom  dTo
.endFields
 Р.[h
                                                                   Лист @Np@
.]h
^
                                                            РЕЕСТР НАЛОГОВЫХ РЕГИСТРОВ
                                   @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                                                          за период c ^ по ^

.{
.[h
──────────┬───────────────────┬─────────────────────────────────┬──────────────────┬───────────────────┬──────────────────┬───────────────────┬───────────────────┬──────────────────┬────────
   Дата   │                   │                                 │       Цена       │  Первоначальная   │      Сумма       │      Расходы,     │Общая величина рас-│      Убытки      │  Срок
 операции │ Инвентарный номер │          Наименование           │    реализации    │    стоимость      │   начисленной    │    связанные с    │ ходов, связанных с│        от        │списания
          │                   │                                 │                  │                   │   амортизации    │реализацией объекта│реализацией объекта│    реализации    │
──────────┴───────────────────┴─────────────────────────────────┴──────────────────┴───────────────────┴──────────────────┴───────────────────┴───────────────────┴──────────────────┴────────
.]h
.Fields
  DatDoc  InvNum  ObjName  SumRs4  SumRs1  SumRs2  SumRs3  SumRs1-SumRs2+SumRs3  SumRs1-SumRs2+SumRs3-SumRs4  String( Srok)+ LPad( SrokEd, 3)
.endFields
@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'#&&&&&&&&&&&&.&& &'#&&&&&&&&&&&&&.&& &'#&&&&&&&&&&&&.&& &'#&&&&&&&&&&&&&.&& &'#&&&&&&&&&&&&&.&& &'#&&&&&&&&&&&&.&& &&&&&&&&
.}

.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_NalRegDoc
.{ checkenter FeeSignersCycle_NalRegDoc
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
---------------------------     ----------   --------------------------------------------
          (должность)           (подпись)          (расшифровка подписи)

.}
.end Р
.endForm

//-----------------------------------------------------------------------------

.LinkFORM NalRegReest03 Prototype Is NalRegDoc
.NameInList 'Реестр уступок долга'
.Group 'Форма реестра для уступок долга'
.p 80
.Defo Portrait
.Fields
   CommonFormHeader
   '"'+RegTypeStr+'"' dFrom  dTo
.endFields
 Ш.[h
                                                                  Лист @Np@
.]h
^
                                                           РЕЕСТР НАЛОГОВЫХ РЕГИСТРОВ
                                @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                                                       за период c ^ по ^

.{
.[h
  ──────────┬───────────────────┬──────────────────┬──────────────────┬────────────────┬──────────────────┬───────────────────┬──────────────────
     Дата   │                   │                  │                  │ Дата погашения │ Убыток от уступки│Убыток, принимаемый│   Не принятый
    уступки │   Номер уступки   │   Сумма долга    │   Цена продажи   │  задолженности │ права требования │в уменьшение нало- │      убыток
            │                   │                  │                  │  по договору   │                  │ гооблагаемой базы │
  ──────────┴───────────────────┴──────────────────┴──────────────────┴────────────────┴──────────────────┴───────────────────┴──────────────────
.]h
.Fields
  DatDoc  InvNum  SumRs2  SumRs1  DatEnd  SumRs2-SumRs1  SumPr  SumRs2-SumRs1-SumPr
.endFields
  @@@@@@@@@@ @@@@@@@@@@@@@@@@@@@ &'#&&&&&&&&&&&&.&& &'#&&&&&&&&&&&&&.&&    @@@@@@@@@@   &'#&&&&&&&&&&&&.&& &'#&&&&&&&&&&&&&.&& &'#&&&&&&&&&&&&.&&
.}

.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_NalRegDoc
.{ checkenter FeeSignersCycle_NalRegDoc
   Б@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
  ---------------------------     ----------   --------------------------------------------
            (должность)           (подпись)          (расшифровка подписи)

.}
.end Ш
.endForm

//-----------------------------------------------------------------------------

.LinkFORM NalRegReest04 Prototype Is NalRegDoc
.NameInList 'Реестр резервов по сомнительным долгам'
.Group 'Форма реестра для резервов по сомнительным долгам'
.Fields
   CommonFormHeader
   '"'+RegTypeStr+'"' dFrom  dTo
.endFields
 Р.[h
                                   Лист @Np@
.]h
^
                           РЕЕСТР НАЛОГОВЫХ РЕГИСТРОВ
     @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                      за период c ^ по ^

.{
.[h
     ──────────┬──────────┬────────────────┬───────────────────┬────────
        Дата   │Дескриптор│ Номер регистра │  Принятая сумма   │ Будущ.
     ──────────┴──────────┴────────────────┴───────────────────┴────────
.]h
.Fields
  DatDoc  Descr  NoDoc  SumPr  if ( InFuture, '+', '-')
.endFields
     @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@@@@@@ &'#&&&&&&&&&&&&&.&&   @~@
.}

.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_NalRegDoc
.{ checkenter FeeSignersCycle_NalRegDoc
      Б@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
     ---------------------------     ----------   --------------------------------------------
               (должность)           (подпись)          (расшифровка подписи)

.}
.end Р
.endForm

//-----------------------------------------------------------------------------

.LinkFORM NalRegReest05 Prototype Is NalRegDoc
.NameInList 'Реестр регистров учета расходов на добровольное страхование'
.Group 'Форма реестра для расходов на добровольное страхование работников'
.p 80
.Defo Portrait
.Fields
   CommonFormHeader
   '"'+RegTypeStr+'"' dFrom  dTo
.endFields
 Р.[h
                                                            Лист @Np@
.]h
^
                                                    РЕЕСТР НАЛОГОВЫХ РЕГИСТРОВ
                         @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                                               за период c ^ по ^

.{
.[h
  ──────────┬──────────┬────────────────┬───────────────────┬───────────────────┬───────────────────┬─────────────┬─────┬────────
     Дата   │Дескриптор│ Номер регистра │Фактич.сумма страх.│  Принятая сумма   │ Непринятая сумма  │Срок списания│Един.│ Будущ.
  ──────────┴──────────┴────────────────┴───────────────────┴───────────────────┴───────────────────┴─────────────┴─────┴────────
.]h
.Fields
  DatDoc  Descr  NoDoc  SumRs1  SumPr  SumRs1- SumPr  Srok  SrokEd  if ( InFuture, '+', '-')
.endFields
  @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@@@@@@ &'#&&&&&&&&&&&&&.&& &'#&&&&&&&&&&&&&.&& &'#&&&&&&&&&&&&&.&& &#&&&&&&&&&&& @@@@@  @~@
.}

.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_NalRegDoc
.{ checkenter FeeSignersCycle_NalRegDoc
   Б@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
  ---------------------------     ----------   --------------------------------------------
            (должность)           (подпись)          (расшифровка подписи)

.}
.end Р
.endForm
