//---------------------------------------------------------------------------
//                                           (c) корпорация ГАЛАКТИКА
// Версия        : 5.70
// Назначение    : Результаты обработки банковской выписки
//---------------------------------------------------------------------------
#doc
 Форма выдает результаты обработки банковской выписки
#end
.set name='VypRes'
.hide
.fields
  header
  docSchet
  docType
  docNo
  docModif
  docNum
.endfields
^
.{ An_Docum CheckEnter
^ ^ ^
.{ An_Modif CheckEnter
^
.}
.}
 ^
.endform

.linkform 'VypRes01' prototype is 'VypRes'
.nameinlist 'Результаты модификации БВ'
.group 'Результаты модификации БВ'
.fields
CommonFormHeader       // название отчета
  header
  docType
  docNo
  docModif
  docNum
.endfields
^
       Б@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
─────────────────────┬────────┬───────────────────────────────────────────────
    Тип документа    │ Номер  │                 Модификация
                     │ док-та │
─────────────────────┴────────┴───────────────────────────────────────────────
.{ An_Docum CheckEnter
 @@@@@@@@@@@@@@@@@@@@  &&&&&&
.{ An_Modif CheckEnter
                                @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
──────────────────────────────────────────────────────────────────────────────
.}
 Обработано документов: &&&&&&
.endform


.linkform 'VypRes02' prototype is 'VypRes'
.nameinlist 'Результаты модификации БВ (с полем наш счет)'
.group 'Результаты модификации БВ (с полем наш счет)'
.fields
CommonFormHeader       // название отчета
  header
  docSchet
  docType
  docNo
  docModif
  docNum
.endfields
^
       Б@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
 И────────────────┬─────────────────────┬────────┬──────────────────────────────────────────────
      Наш       │    Тип документа    │ Номер  │                 Модификация
      счет      │                     │ док-та │
────────────────┴─────────────────────┴────────┴────────────────────────────────────────────── И
.{ An_Docum CheckEnter
 И@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@  &&&&&& И
.{ An_Modif CheckEnter
 И                                                @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И
.}
 И────────────────────────────────────────────────────────────────────────────────────────────── И
.}
 Обработано документов: &&&&&&
.endform
