//╔═══════════════════════════════════════════════════════════════════════════╗
//║                     (c) 2003 корпорация ГАЛАКТИКА                         ║
//║ Проект        : ГАЛАКТИКА                                                 ║
//║ Система       : Оперативный контур                                        ║
//║ Версия        : 5.84                                                      ║
//║ Назначение    : Отчет об объемах алкогольной продукции на акцизном складе ║
//║ Ответственный : Двинский Сергей Леонидович                                ║
//╚═══════════════════════════════════════════════════════════════════════════╝

#doc
Отчет об объемах алкогольной продукции на акцизном складе
#end
.set name = 'alc_nal'
.hide
.var
  npp : integer
.endvar
.fields
  SklName : string
  SklAddr : string
  RepDate : date

  MCName    : string
  ProizName : string
  PostName  : string
  PrihDate  : string
  KolBottle : double
  VolBottle : double
  KolDal    : double

  WholeKolB : double
  WholeKolD : double
  FIO       : string
.endfields
  ^ ^ ^
.{
  ^ ^ ^ ^ ^ ^ ^
.}
  ^ ^ ^
.endform

#doc
Отчет об объемах алкогольной продукции на акцизном складе
#end
.linkform 'Alcohol_sklnal' prototype is 'alc_nal'
.NameInList 'Отчет об объемах алкогольной продукции на акцизном складе'
.group 'Отчеты наличия на акцизных складах'
.PAPER PA4
.ORIENT PORTRAIT
.LL 80
.LM 10
.TM 10
.BM 10
.RM 10
.P 60
.fields
  CommonFormHeader
  'на акцизном складе ' + SklName
  SklAddr
  RepDate
!.{
  npp
  MCName
  ProizName
  PostName
  PrihDate
  KolBottle
  VolBottle
  KolDal
!.}
  WholeKolB
  WholeKolD
  FIO
.endfields
.[H SKIP
 И                                                                            Лист@NP@
 Р─────┬───────────────────────────┬───────────────────────────┬───────────────────────────┬──────────┬──────────────┬───────────────┬─────────
 (1) │           (2)             │            (3)            │            (4)            │   (5)    │     (6)      │      (7)      │   (8)
─────┴───────────────────────────┴───────────────────────────┴───────────────────────────┴──────────┴──────────────┴───────────────┴───────── Ш
.]H
^

 Й                                     Отчет
                    об объемах алкогольной продукции, хранящейся
 @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Й
 И
 по адресу ^
 по состоянию на ^ года
                                                                            Лист@NP@
 Р─────┬───────────────────────────┬───────────────────────────┬───────────────────────────┬──────────┬──────────────┬───────────────┬─────────
  №  │                           │       Наименование        │       Наименование        │   Дата   │Кол-во бутылок│  Вместимость  │ Кол-во,
 п/п │  Наименование продукции   │      производителя        │        поставщика         │ приемки  │  (емкостей), │    бутылки    │   дал
     │                           │        продукции          │        продукции          │ на склад │  тыс. штук   │(емкости), литр│
─────┼───────────────────────────┼───────────────────────────┼───────────────────────────┼──────────┼──────────────┼───────────────┼─────────
 (1) │           (2)             │            (3)            │            (4)            │   (5)    │     (6)      │      (7)      │   (8)
─────┴───────────────────────────┴───────────────────────────┴───────────────────────────┴──────────┴──────────────┴───────────────┴───────── Ш
.begin
  npp := 0;
end.
.{
.begin
  npp := npp + 1;
end.
 Ш@~@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@ &&&&&&&&&&&&&& &&&&&&&&&&&&&&& &&&&&&&&& Ш
.}

 Ш      ИТОГО ПО СКЛАДУ............................................................................... &&&&&&&&&&&&&&                 &&&&&&&&& Ш


 И Руководитель @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  ___________   МП
                                                                (подпись) И

.endform
