/*
 ╔════════════════════════════════════════════════════════════════════════════╗
 ║                     (c) Корпорация ГАЛАКТИКА, 1996,97                      ║
 ║ Проект        : ГАЛАКТИКА                                                  ║
 ║ Система       : Оперативный контур                                         ║
 ║ Версия        : 5.50                                                       ║
 ║ Назначение    : наличие в разрезе партий                                   ║
 ║ Ответственный : Бартош Евгений Анатольевич                                 ║
 ╚════════════════════════════════════════════════════════════════════════════╝
*/
// Аналог form 'NalParty', но для вызова из випа
// Если переделать паскаль производственного контура, то NALPARTY.FRM можно будет удалить
#doc
Наличие в разрезе партий
#end
.set name='NalP_V'
.hide
.fields
  date1 : date  // NalP_V. Поля: Общие
  NameOrg
  FilterInfo
  tar
  bas

  cParty : comp  // NalP_V. Поля: Партия
  nameparty
  kodparty
  dgodn
  nRecDogovor NDogovor NDogovor_Ext
  DDogovor DInput
  nvaluch
  cValUch : comp

  namepodr  // NalP_V. Поля: Подразделение
  kodpodr

  nRecMC : comp   // NalP_V. Поля: МЦ
  namemc
  nameed
  price   : double
  pricev  : double
  kol     : double
  sum     : double
  sumv    : double
  SizeX   : double
  SizeY   : double
  SizeZ   : double
  Value   : double
  Massa   : double

  podrsum  : double
  podrsumv : double

  parsum   : double
  parsumv  : double
  totsum   : double
  totsumv  : double

.endfields
^ ^
Фильтры
.{
  ^
.}
^
^
.{
// Партия
^
^
^
^
^
^ ^ ^
^ ^
^
.{
.if npBySklad_V1
// Подразделение
^
^
.end
.{
// МЦ
^
^
^
^
^
^
^
^
^
^
^
^
^
.}
.if npBySklad_V2
^
^
.end
.}
^
^
.}
^
^
.endform
!
!
!
#doc
Ведомость наличия товаров в рaзрезе партий
#end
.linkform 'NalP_V_01' prototype is 'NalP_V'
.nameinlist 'Ведомость наличия товаров в рaзрезе партий'
.group '001'
.fields
  CommonFormHeader
  date1
  FilterInfo
  tar bas tar bas
  nameparty kodparty dgodn nvaluch
  namepodr kodpodr
  namemc  nameed price  pricev  kol  sum  sumv
  namepodr podrsum podrsumv
  nameparty parsum  parsumv
  totsum  totsumv
.endfields
^
 Й              Ведомость наличия товаров в разрезе партий товаров
                         сформирована на ^ Й
 Ш
Фильтры
.{
  ^
.}
───────────────────────────────┬────────────┬───────────────────┬───────────────────┬─────────────┬────────────────────┬────────────────────
   Наименование матценности    │Единица изм.│   Цена,@~@@@@     │Цена,@~@@@@@@@@@@@@│ Количество  │  Стоимость,@~@@@@  │Стоимость,@~@@@@@@@@
───────────────────────────────┴────────────┴───────────────────┴───────────────────┴─────────────┴────────────────────┴──────────────────── Ш
 А.{
 Ш^ Ш, код:  Ш^ Ш, годность:  Ш^ Ш, валюта учета:  Ш^ Ш
.{
.if npBySklad_V1
склад  Ш^ Ш, код  Ш^ Ш
.end
.{
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@@@@@@@ &'&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&.&& &'&&&&&&&&&&& &'&&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&&.&& Ш
.}
.if npBySklad_V2
 Ш        ИТОГО по складу @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                          &'&&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&&.&& Ш

.end
.}
 Ш        ИТОГО по партии @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                          &'&&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&&.&& Ш

.}
 Ш────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
        ИТОГО по ведомости:                                                                        &'&&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&&.&& Ш
.endform
!
!
!
#doc
Ведомость наличия по партиям в  национальной валюте
#end
.linkform 'NalP_V_02' prototype is 'NalP_V'
.nameinlist 'Ведомость наличия по партиям в  национальной валюте'
.group '000'
.fields
  CommonFormHeader
  date1
  FilterInfo
  tar tar
  nameparty kodparty dgodn nvaluch
  namepodr kodpodr
  namemc nameed price kol sum
  namepodr podrsum
  nameparty parsum
  totsum
.endfields
^
 Й              Ведомость наличия товаров в разрезе партий товаров
                         сформирована на ^ Й
 Р
Фильтры
.{
  ^
.}
───────────────────────────────┬────────────┬───────────────────┬─────────────┬────────────────────
   Наименование матценности    │Единица изм.│    Цена,@~@@@@    │ Количество  │ Стоимость,@~@@@@
───────────────────────────────┴────────────┴───────────────────┴─────────────┴──────────────────── Р
 А.{
 Р^, код: ^, годность: ^, валюта учета: ^ Р
.{
.if npBySklad_V1
 Рсклад ^, код ^ Р
.end
.{
 Р@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@@@@@@@ &'&&&&&&&&&&&&&&.&& &'&&&&&&&&&&& &'&&&&&&&&&&&&&&&.&& Р
.}
.if npBySklad_V2
 Р        ИТОГО по складу @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@        &'&&&&&&&&&&&&&&&&&.&& Р

.end
.}
 Р        ИТОГО по партии @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@        &'&&&&&&&&&&&&&&&&&.&& Р

.}
 Р───────────────────────────────────────────────────────────────────────────────────────────────────
        ИТОГО по ведомости:                                                  &'&&&&&&&&&&&&&&&&&.&& Р

.endform
!
!
!
#doc
Краткая ведомость наличия товаров в рaзрезе партий
#end
.linkform 'NalP_V_03' prototype is 'NalP_V'
.nameinlist 'Краткая ведомость наличия товаров в рaзрезе партий'
.group '011'
.fields
  CommonFormHeader
  date1
  FilterInfo
  tar bas
  nameparty kodparty dgodn nvaluch parsum  parsumv
  totsum  totsumv
.endfields
^
 Й              Ведомость наличия товаров в разрезе партий товаров
                         сформирована на ^ Й
 Р
Фильтры
.{
  ^
.}
────────────────────────────────────┬──────────┬──────────┬───────────┬────────────────────┬────────────────────
   Наименование партии              │   Код    │Дата годн.│ Валюта    │  Стоимость,@~@@@@  │ Стоимость,@~@@@@@@@
────────────────────────────────────┴──────────┴──────────┴───────────┴────────────────────┴────────────────────
.{
.{
.if npBySklad_V1
.end
.{
.}
.if npBySklad_V2
.end
.}
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ &#'&&&&&&&&&&&&&&.&& &#'&&&&&&&&&&&&&&.&&
.}
────────────────────────────────────────────────────────────────────────────────────────────────────────────────
 Б        ИТОГО по ведомости:                                            &'&&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&&.&& С

.endform
!
!
!
#doc
Краткая ведомость наличия по партиям в валюте
#end
.linkform 'NalP_V_04' prototype is 'NalP_V'
.nameinlist 'Краткая ведомость наличия по партиям в валюте'
.group '010'
.fields
  CommonFormHeader
  date1
  FilterInfo
  tar
  nameparty kodparty dgodn nvaluch parsum
  totsum
.endfields
^
 Б              Ведомость наличия товаров в разрезе партий товаров
                         сформирована на ^ Б
 И
Фильтры
.{
  ^
.}
────────────────────────────────────┬──────────┬──────────┬───────────┬────────────────────
   Наименование партии              │   Код    │Дата годн.│ Валюта    │  Стоимость,@~@@@@
────────────────────────────────────┴──────────┴──────────┴───────────┴────────────────────
.{
.{
.if npBySklad_V1
.end
.{
.}
.if npBySklad_V2
.end
.}
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ &#'&&&&&&&&&&&&&&.&&
.}
───────────────────────────────────────────────────────────────────────────────────────────
 Б        ИТОГО по ведомости:                                            &'&&&&&&&&&&&&&&&.&& Й
.endform
