/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Назначение    : Отчёт по наличию МЦ в свободных приходах                  ║
 ║ Ответственный : Лазутин Андрей Викторович                                 ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/


#doc
Отчет по наличию МЦ в свободных приходах
#end
.set name='SklNalMCReport'
.NameInList 'Форма для протокола'

.fields
  begDat endDat

  podr
  mol
  mc
  party
  prih
  kol
  price
  dDoc
  nOrder
.endfields

Дата с ^ по ^
.{
  Подр: ^
  МОЛ: ^
  МЦ: ^
  Партия: ^
  Приход ^
  Остаток ^
  Цена ^
  Дата ^
  Ордер ^
.}
.endform



!------------------------------------------------------------------------
!------------------------------------------------------------------------
!------------------------------------------------------------------------
#doc
Форма для протокола
#end
.linkform 'SklNalMCReport_01' prototype is 'SklNalMCReport'
.NameInList 'Форма для протокола'
.fields
  CommonFormHeader
  begDat endDat
  podr mol mc party
  prih kol
  price
  dDoc
.endfields
^
     СВОБОДНЫЕ ОСТАТКИ МЦ В ПРИХОДНЫХ ОРДЕРАХ с ^ по ^

 Р───────────────────────────┬────────────────────────────────┬──────────────────────────────────┬───────────────────┬───────────────┬────────────┬────────────┬─────────────
     Склад                 │          МОЛ                   │       Наименование  МЦ           │   Партия          │ Количество    │  Остаток   │ Цена в НДЕ │ Дата прихода
                           │                                │                                  │                   │  прихода      │            │            │
───────────────────────────┴────────────────────────────────┴──────────────────────────────────┴───────────────────┴───────────────┴────────────┴────────────┴───────────── Р
 Р.{
@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@ &&&&&&&&&&&&.&& &&&&&&&&&.&& &&&&&&&&&.&&  @@@@@@@@@@@@ Р
.}
.endform
