//------------------------------------------------------------------------------
//                                                      (c) корпорация ГАЛАКТИКА
// ГАЛАКТИКА 7.11 - Производственное планирование
// Извещения за период
//------------------------------------------------------------------------------

#doc
Базовая форма 'Извещения за период'</brief>
#end

.form IzvDate
.HIDE
.defo landscape
.FIELDS
Дата_начала
Дата_окончания
Дата_ввода
Номер
СП_МК
Изделие
Обозначение_изделия
Документ
Обозначение_документа
.ENDFIELDS
  ^
  ^
.{
  ^
  ^
  ^
  ^
  ^
  ^
  ^
.}
.endform

.LinkForm 'IzvDate1' Prototype is IzvDate
.NameInList 'ИЗВЕЩЕНИЯ ЗА ПЕРИОД'
.FIELDS
Дата_начала
Дата_окончания
Дата_ввода
Номер
СП_МК
Изделие
Обозначение_изделия
Документ
Обозначение_документа
.ENDFIELDS
  Список извещений за период с ^ по  ^
────────────┬─────────┬──────────┬──────────────────────────┬────────────────┬─────────────────────┬───────────────
 Дата ввода │  Номер  │   Тип    │      Наименование        │   Обозначение  │   Наименование      │  Обозначение
 в действие │извещения│документа │        документ          │    документа   │     изделия         │    изделия
────────────┼─────────┼──────────┼──────────────────────────┼────────────────┼─────────────────────┼───────────────
.{
 @@@@@@@@@@ │@@@@@@@@@│@@@@@@@@@@│ @@@@@@@@@@@@@@@@@@@@@@@@ │@@@@@@@@@@@@@@@ │@@@@@@@@@@@@@@@@@@@@ │@@@@@@@@@@@@@@@
.}
.[F                                                                      
────────────┴─────────┴──────────┴──────────────────────────┴────────────────┴─────────────────────┴───────────────
.]F
.EndForm