//------------------------------------------------------------------------------
//                                                      (c) корпорация ГАЛАКТИКА
// ГАЛАКТИКА 7.11 - Производственное планирование
// Ведомость извещений
//------------------------------------------------------------------------------

#doc
Базовая форма ведомости извещений</brief>
#end

.form IzvList
.HIDE
.defo landscape
.FIELDS
Тип_изделия
Изделие
Обозначение_изделия
Номер_изделия
Тип_документа
Документ
Обозначение_документа
Номер
Дата_утверждения
Дата_ввода
Причина
Содержание
.ENDFIELDS

  ^
  ^
  ^
  ^
.{
  ^
  ^
  ^
.{
  ^
  ^
  ^
  ^
  ^
.}
.}
.endform

.LinkForm 'IzvList1' Prototype is IzvList
.NameInList 'ВЕДОМОСТЬ ИЗВЕЩЕНИЙ'
.FIELDS
Тип_изделия
Изделие
Обозначение_изделия
Номер_изделия
Тип_документа
Документ
Обозначение_документа
Номер
Дата_утверждения
Дата_ввода
Причина
Содержание
.ENDFIELDS

ВЕДОМОСТЬ ИЗВЕЩЕНИЙ

Изделие (^):
   наименование  : ^
   обозначение   : ^
   номенкл. номер: ^
.{
Документ (^):
   наименование  : ^
   код           : ^
────────────┬─────────────┬────────────┬──────────────────────────────────┬─────────────────────────────────────
   Номер    │    Дата     │ Дата ввода │ Причина изменений                │ Содержание изменений
 извещения  │ утверждения │ в действие │                                  │
────────────┼─────────────┼────────────┼──────────────────────────────────┼─────────────────────────────────────
.{
 @@@@@@@@@@ │ @@@@@@@@@@@ │ @@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
────────────┴─────────────┴────────────┴──────────────────────────────────┴─────────────────────────────────────
.}
.EndForm