//------------------------------------------------------------------------------
//                                                      (c) корпорация ГАЛАКТИКА
// ГАЛАКТИКА 7.11 - Маршрутно-операционные карты
// Ведомость применяемости
//------------------------------------------------------------------------------

#doc
Базовая форма 'Маршрутно-операционные карты'</brief>
#end

!==============================================================================
.Form MarshMap
.HIDE
.Fields
   Заголовок
   Общая_единица_нормирования: double
   Единица_измерения
   Наименование_изделия
   Литера
   Обозначение_изделия
   Код_технологической_класификации
   Номер_операции
   номер_цеха
   Код_Рабочего_места
   номер_операции_пп
   код_операции
   название_операции
   описание_операции
   Тип_элемента
!   Наименование_документа
   Обозначение_оборудования
   Наименование_оборудования
   Степень_механизации
   Код_профессии
   Разряд
   Код_условий_труда
   Количество_исполнителей
   Одновременно_обрабатываемых_деталей
   Единица_нормирования_труда
   Объем_партии
   Коэффициент_штучного_времени
   Р_норма_подг_закл_времени
   Р_норма_времени
   Обозначение_инструмента
   Наименование_инструмента
.EndFields
! Операция
   Заголовок                                 ^
   Общая_единица_нормирования                ^
   Единица_измерения                         ^
   Наименование_изделия                      ^
   Литера                                    ^
   Обозначение_изделия                       ^
   Код_технологической_класификации          ^
.{
.{MarshMap CheckEnter
   Номер_операции                            ^
   номер_цеха                                ^
   Код_Рабочего_места                        ^
   номер_операции_пп                         ^
   код_операции                              ^
   название_операции                         ^
   описание_операции                         ^
.}
   Тип_элемента                              ^
!   Наименование_документа                   ^
   Обозначение_оборудования                  ^
   Наименование_оборудования                 ^
   Степень_механизации                       ^
   Код_профессии                             ^
   Разряд                                    ^
   Код_условий_труда                         ^
   Количество_исполнителей                   ^
   Одновременно_обрабатываемых_деталей       ^
   Единица_нормирования_труда                ^
   Объем_партии                              ^
   Коэффициент_штучного_времени              ^
   Р_норма_подг_закл_времени                 ^
   Р_норма_времени                           ^
   Обозначение_инструмента                   ^
   Наименование_инструмента                  ^
.}
.EndForm
!==============================================================================
.LINKFORM 'MarshMap01' PROTOTYPE IS MarshMap
.Repeat All
.Group 'Док-Обор-Труд'
.NameInList "Маршрутная карта - оборудование и трудовые нормы"
.var
  Номер_строки:Longint
  Строка :String
  Номер_записи:String
.endvar
.[H
.begin
  Номер_строки := 0;
  Номер_записи := '';
  Строка :='';
end.
.fields
   Заголовок
! строка 1
   Общая_единица_нормирования
   Единица_измерения
   Наименование_изделия
   Литера
! строка 2
    Обозначение_изделия
    Код_технологической_класификации
.endfields
                              МАРШРУТНАЯ КАРТА

                       ^

*******************************************************************************
*                                                                             *
* --------------------------------------------------------------------------- *
* :&&&&.&&&& @@@@@: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@:   :@NP@:@@@ : *
* --------------------------------------------------------------------------- *
* :             : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@: @@@@@@@@@@@@@:      МК     : *
* --------------------------------------------------------------------------- *
* : В : Цех      : Уч.      :РМ: Опер. : Код, наименование операции         : *
* --------------------------------------------------------------------------- *
!* : Г :          Наименование (обозначение) документа                       : *
!* --------------------------------------------------------------------------- *
* : Д :             Код, наименование оборудования                          : *
* --------------------------------------------------------------------------- *
* : Е : СМ  : Проф : Р  : УТ  : КР  :КОИД :  ЕН :  ОП  : Кшт. : Тп.з. : Тшт.: *
* --------------------------------------------------------------------------- *
.]H
.{
.{MarshMap CheckEnter
.begin
  Номер_строки :=
    if (Номер_записи<>Номер_операции,
         (Номер_строки + 1), Номер_строки);
  Строка := LPadCH(String(Номер_строки),'0',2);
end.
.fields
   Строка
   номер_цеха
   Код_Рабочего_места
   номер_операции_пп
   код_операции
   название_операции
.endfields
.begin
Номер_записи:=Номер_операции;
end.
* --------------------------------------------------------------------------- *
* :В@@:@@@@@@@@@@:@@@@@@@@@@:  :@@@@@@@:@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@:*
.}
!.{?Internal;(Тип_элемента='Docs')
!.fields
!    Строка
!    Наименование_документа
!.endfields
!* :Г@@: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@:*
!.}
.{?Internal;(Тип_элемента='Equip')
.fields
    Строка
    Обозначение_оборудования
    Наименование_оборудования
.endfields
* :Д@@: @@@@@@@@@@@@@@@  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@: *
.}
.{?Internal;(Тип_элемента='Jobs')
.fields
    Строка
    Степень_механизации
    Код_профессии
    Разряд
    Код_условий_труда
    Количество_исполнителей
    Одновременно_обрабатываемых_деталей
    Единица_нормирования_труда
    Объем_партии
    Коэффициент_штучного_времени
    Р_норма_подг_закл_времени
    Р_норма_времени
.endfields
* :Е@@: @@@@:@@@@@@:@@@@:@@@@@:@@@@@:@@@@@:&&&&&:@@@@@@:&&&&&&:@@@@@@@:@@@@@: *
.}
.} //end
.[F
* --------------------------------------------------------------------------- *
* : МК :                                                                    : *
* --------------------------------------------------------------------------- *
*                                                                             *
*******************************************************************************
.]F
.EndForm

!==============================================================================
.LINKFORM 'MarshMap02' PROTOTYPE IS MarshMap
.Repeat All
.Group 'Док-Обор-Труд-Инстр'
.NameInList "Маршрутная карта - оборудование, инструменты и трудовые нормы"
.var
  Номер_строки:Longint
  Строка :String
  Номер_записи:String
.endvar
.[H
.begin
  Номер_строки := 0;
  Номер_записи := '';
  Строка :='';
end.
.fields
   Заголовок
! строка 1
   Общая_единица_нормирования
   Единица_измерения
   Наименование_изделия
   Литера
! строка 2
    Обозначение_изделия
    Код_технологической_класификации
.endfields
                              МАРШРУТНАЯ КАРТА

                          ^
*******************************************************************************
*                                                                             *
* --------------------------------------------------------------------------- *
* :&&&&.&&&& @@@@@: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@:   :@NP@:@@@ : *
* --------------------------------------------------------------------------- *
* :             : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@: @@@@@@@@@@@@@:      МК     : *
* --------------------------------------------------------------------------- *
* : В : Цех      : Уч.      :РМ: Опер. : Код, наименование операции         : *
* --------------------------------------------------------------------------- *
!* : Г :          Наименование (обозначение) документа                       : *
!* --------------------------------------------------------------------------- *
* : Д :             Код, наименование оборудования                          : *
* --------------------------------------------------------------------------- *
* : Е : СМ  : Проф : Р  : УТ  : КР  :КОИД :  ЕН :  ОП  : Кшт. : Тп.з. : Тшт.: *
* --------------------------------------------------------------------------- *
* --------------------------------------------------------------------------- *
* : Т :            Обозначение, наименование  инструмента                   : *
* --------------------------------------------------------------------------- *
.]H
.{
.{MarshMap CheckEnter
.begin
  Номер_строки :=
    if (Номер_записи<>Номер_операции,
         (Номер_строки + 1), Номер_строки);
  Строка := LPadCH(String(Номер_строки),'0',2);
end.
.fields
   Строка
   номер_цеха
   Код_Рабочего_места
   номер_операции_пп
   код_операции
   название_операции
.endfields
.begin
Номер_записи:=Номер_операции;
end.
* --------------------------------------------------------------------------- *
* :В@@:@@@@@@@@@@:@@@@@@@@@@:  :@@@@@@@:@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@:*
.}
!.{?Internal;(Тип_элемента='Docs')
!.fields
!    Строка
!    Наименование_документа
!.endfields
!* :Г  : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@: *
!.} //end
.{?Internal;(Тип_элемента='Equip')
.fields
    Строка
    Обозначение_оборудования
    Наименование_оборудования
.endfields
* :Д@@: @@@@@@@@@@@@@@@  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@: *
.}
.{?Internal;(Тип_элемента='Jobs')
.fields
    Строка
    Степень_механизации
    Код_профессии
    Разряд
    Код_условий_труда
    Количество_исполнителей
    Одновременно_обрабатываемых_деталей
    Единица_нормирования_труда
    Объем_партии
    Коэффициент_штучного_времени
    Р_норма_подг_закл_времени
    Р_норма_времени
.endfields
* :Е@@: @@@@:@@@@@@:@@@@:@@@@@:@@@@@:@@@@@:&&&&&:@@@@@@:&&&&&&:@@@@@@@:@@@@@: *
.}
.{ ?Internal;(Тип_элемента='Tools')
.fields
Строка
Обозначение_инструмента
Наименование_инструмента
.endfields
* :Т@@: @@@@@@@@@@@@@@@  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ : *
.} //end of internal (Tools)
.} //end
.[F
* --------------------------------------------------------------------------- *
* : МК :                                                                    : *
* --------------------------------------------------------------------------- *
*                                                                             *
*******************************************************************************
.]F
.EndForm

