/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,97 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Заработная плата                                          ║
 ║ Версия        : 6.0 и выше...                                             ║
 ║ Назначение    : Отчет "Распределение зарплаты по группам начислений"      ║
 ║                              суммарный отчет!                             ║
 ║ Ответственный : Мелех   Василий  Евгеньевич                               ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
#doc
Отчет "Распределение зарплаты по группам начислений"
суммарный отчет!
#end
.set name = 'raszn_Sm'
.hide
.DEFO LANDSCAPE
.fields
Организация
МесяцС ГодС
МесяцПо ГодПо
ЧегоСДоходом
фио Подразел
! шапка
НазваниеЭл
СтатьяЗатрат11 СтатьяЗатрат12
СтатьяЗатрат21 СтатьяЗатрат22
! E_шапка
! футер
ИтогоГрафа1 ИтогоГрафа2
ИтогоРаздел
! Е_футер
.endfields

  ОРГАНИЗАЦИЯ:  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

                         ЗАРАБОТНАЯ ПЛАТА ПО ГРУППАМ НАЧИСЛЕНИЙ
                за период  с @@@@@@@@@@@@@@@ @@@@  по  @@@@@@@@@@@@@@@ @@@@
                @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

.{ SAllPersCir CheckEnter
  @@@@@@@@@@@@@@@@@@@@@@@@@@@@/@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{ SAllTabCir CheckEnter
╔═════════════════╦.{.?SShap1;══════════════════════.}╗
║ Наименование    ║.{.?SShap2;@@@@@@@@@@@@@@@@@@@@@@.}║
╠─────────────────╬.{.?SShap3;──────────────────────.}╣
║ Статья затрат   ║.{.?SShap41;@@@@@@@@@@@@@@@@@@@@@@.}.{.?SShap42; ^.}║
║                 ║.{.?SShap51;@@@@@@@@@@@@@@@@@@@@@@.}.{.?SShap52; ^.}║
╠═════════════════╬.{.?SShap6;══════════════════════.}╣
║ Итого по графе: ║.{.?SFutr21;@@@@@@@@@@@@@@@@@@@@@@.}.{.?SFutr22;@@@@@@@@@@@@@@@@@@@@@@.}║
╠─────────────────╬.{.?SFutr3;──────────────────────.}╗
║Итого по разделу:║.{.?SFutr4;@@@@@@@@@@@@@@@@@@@@@@.}║
╚═════════════════╩.{.?SFutr5;══════════════════════.}╝
.}// AllTabCir
.}// AllPersCir
.endform
!*****************************************************************************
.Linkform 'raszn_Sm_L' Prototype is 'raszn_Sm'
.nameinlist 'Распределение зарплаты по группам начислений'
!.DEFO LANDSCAPE
.var
  Gr1, Gr2 : string;
   Counter : word;
.endvar
.begin
Counter := 0;
end.
.fields
Организация
МесяцС ГодС
МесяцПо ГодПо
ЧегоСДоходом
фио Подразел
! шапка
НазваниеЭл
СтатьяЗатрат11 СтатьяЗатрат12
СтатьяЗатрат21 СтатьяЗатрат22
! E_шапка
! футер
ИтогоГрафа1 ИтогоГрафа2
ИтогоРаздел
! Е_футер
.endfields

   БОРГАНИЗАЦИЯ: Б   Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д

                          БЗАРАБОТНАЯ ПЛАТА ПО ГРУППАМ НАЧИСЛЕНИЙ Б
                за период  с  Б@@@@@@@@@@@@@@@ Б  Б@@@@ Б  по   Б@@@@@@@@@@@@@@@ Б  Б@@@@ Б
                @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

.{ SAllPersCir CheckEnter
   Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@/@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
.{ SAllTabCir CheckEnter
.begin
 Counter := Counter + 1;
end.
 Р╔═════════════════╦.{.?SShap1;═══════════════════════.}╗ Р
 С║ наименование    ║.{.?sshap2;@#~@@@@@@@@@@@@@@@@@@@@.}║ С
 Р╠─────────────────╬.{.?SShap3;───────────────────────.}╣ Р
 Р║  БСтатья затрат  Б  ║.{.?SShap41;@#~@@@@@@@@@@@@@@@@@@@│.}.{.?SShap42;@#~@@@@@@@@@@@@@@@@@@@@.}║ Р
 Р║                 ║.{.?SShap51;@#~@@@@@@@@@@@@@@@@@@@│.}.{.?SShap52;@#~@@@@@@@@@@@@@@@@@@@@.}║ Р
 Р╠═════════════════╬.{.?SShap6;═══════════════════════.}╣ Р
 С║ Итого по графе: ║.{.?SFutr21;&#~&&&&&&&&&&&&&&&&.&&│.}.{.?SFutr22;&#~&&&&&&&&&&&&&&&&.&& .}║ С
 Р╠─────────────────╬.{.?SFutr3;───────────────────────.}╣ Р
 С║Итого по разделу:║.{.?SFutr4;&~&&&&&&&&&&&&&&&&&&.&&.}║ С
 Р╚═════════════════╩.{.?SFutr5;═══════════════════════.}╝ Р
.{?internal;(Counter = 4)
.begin
Counter := 0;
end.
.fields
'true':'s'
.endfields
^
.}
.}// AllTabCir

.}// AllPersCir
.endform
