/*
 ╔═════════════════════════════════════════════════════════════════════════╗
 ║              Проект Галактика (с) 1995-2006 TOP SOFT Ltd.               ║
 ║      Версия :   8.00                                                    ║
 ║      Разработал:  Быковская М. Е.                                       ║
 ║      Назначение:  Печать Внешней классификации                          ║
 ║                                                                         ║
 ╚═════════════════════════════════════════════════════════════════════════╝
*/
#doc
  Печать Внешней классификации.
#end
.form PrintClass
.hide
.fields
  CLASSName
  TableName
  TableTitle
  ClassValue
  CLASSCODE
.endfields
 ^ ^ ^
.{
 ^ ^
.}
.endform

.linkform 'PrintClass01' prototype is PrintClass
.NAMEINLIST 'Внешняя классификация'
.fields
  CommonFormHeader
  CLASSName
  TableName
  TableTitle
  ClassValue
  CLASSCODE
.endfields
  Б^ Б

        Внешний классификатор :  Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б

            Заголовок таблицы :  Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
            Имя таблицы       :  Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б

┌───────────────────────────────────────────────┬─────────────────────────┐
│           Значение классификатора             │    Код классификатора   │
├───────────────────────────────────────────────┼─────────────────────────┤
.{
│ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │  @@@@@@@@@@@@@@@@@@@@   │
.}
└───────────────────────────────────────────────┴─────────────────────────┘
.endform
