//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Версия     : 8.10
// Назначение : Отчет об изменениях настроек
//------------------------------------------------------------------------------

#doc
Базовая форма отчета об изменениях настроек.
#end
.Form 'TuneValProtoc'
.Hide
.Fields
Дата
Время
Пользователь
Тип_Настройки
Настройка
Значение
.EndFields
.{
^ ^ ^ ^ ^ ^
.}
.EndForm

#doc
Форма отчета об изменениях настроек.
#end
.LinkForm 'TuneValProtoc01' Prototype is 'TuneValProtoc'
.NameInList 'Протокол изменения настроек'
.DEFP PA4
.P 60
.Fields
CommonFormHeader
Дата
Время
Пользователь
Тип_Настройки
Настройка
Значение
.EndFields
 Ш ^

                                                          БПротокол изменения настроек Б

┌───────────────────────────────┬───┬────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┬───────────────────────────┐
│ Дата, время, кто изменил      │Тип│  Наименование настройки, номер                                                                                                                 │      Значение             │
├───────────────────────────────┴───┴────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼───────────────────────────┤
.{
│@@@@@@@@@@ @@@@@ @@@@@@@@@@@@@ │@@@│ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│ @@@@@@@@@@@@@@@@@@@@@@@@@@│
.}
└───────────────────────────────┴───┴────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┴───────────────────────────┘

 Р
.endform
