/*
 ╔════════════════════════════════════════════════════════════════════════════╗
 ║                     (c) Корпорация ГАЛАКТИКА, 1996,2002                    ║
 ║ Проект        : ГАЛАКТИКА                                                  ║
 ║ Система       : Оперативный контур                                         ║
 ║ Версия        : 5.8x                                                       ║
 ║ Назначение    : Просмотр таблицы остатков матценностей                     ║
 ║ Ответственный : Лебедев С.В.                                               ║
 ╚════════════════════════════════════════════════════════════════════════════╝
*/

#doc
Просмотр таблицы остатков матценностей
#end
.set name = 'SeeSalMC'
.hide
#include format.frn
.fields
 fDate  Kol_Pr1: string
 fType MCnrec fMC fPodr fMOL fParty
 fKol:Double  EdIzm  fPrice:Double sumMC:Double   fPriceV:Double vSumMC:Double fVal
.endfields
^ ^
.{
^ ^^^^^^ ^ ^^ ^^ ^
.}
.endform




//-----------------------------------------------------------------------
#doc
Просмотр таблицы остатков матценностей
#end
.linkform 'seesalmc0' prototype is 'SeeSalMC'
.NameInList 'Остатки МЦ'
.fields
  CommonFormHeader
  fDate + ' г.'

  fMC fPodr fMOL fParty
  DoubleToStr(fKol, Kol_Pr) EdIzm fPrice sumMC fPriceV vSumMC fVal

  fMC
  DoubleToStr(fKol, Kol_Pr) EdIzm fPrice sumMC fPriceV vSumMC fVal

.endfields
^
                         БОСТАТКИ МАТЦЕННОСТЕЙ  НА ^ Б
 Р────────────────────────┬────────────────────┬──────────────┬──────────────┬─────────────┬────────┬─────────────┬────────────────┬─────────────┬─────────────┬────
Наименование матценности│        Склад       │      МОЛ     │    Партия    │  Количество │  ЕдИзм │ Средняя цена│    Стоимость   │средн. в вал.│стоим. в вал.│вал.
────────────────────────┴────────────────────┴──────────────┴──────────────┴─────────────┴────────┴─────────────┴────────────────┴─────────────┴─────────────┴──── Р
.{
.{?INTERNAL;fType='';
 Р @@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@ @@@@@@@@@@@@@@ &'&&&&&&&&&&& @@@@@@@@ &'&&&&&&&&.&& &'&&&&&&&&&&&.&& &'&&&&&&&&.&& &'&&&&&&&&.&& @@@@ Р
.}
.{?INTERNAL;fType='=';
 С ИТОГО ПО @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                             &'&&&&&&&&&&& @@@@@@@@ &'&&&&&&&&.&& &'&&&&&&&&&&&.&& &'&&&&&&&&.&& &'&&&&&&&&.&& @@@@ С
.}
.}

.endform
