 /*
  ╔═════════════════════════════════════════════════════════════════════╗
  ║      Н Т О  "T O P   S O F T",  А О   "Н О В Ы Й   А Т Л А Н Т"     ║
  ║           Проект "КАДРЫ" (с) 2003                                   ║
  ║      Версия : 5.85                                                  ║
  ║      Разработал:  Артамонов Д.С.                                    ║
  ║      Назначение:  Журнал учёта аттестаций                           ║
  ╚═════════════════════════════════════════════════════════════════════╝
*/

!-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-!
! StaffAtt
!-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-!
#doc
Журнал учёта аттестаций
#end
.form StaffAtt
.hide
.fields
 Название
 Дата_Начала
 Дата_Окончания
.endfields

 Наименование отчетной формы: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Дата_начала_формирования: @@@@@@@@@@
 Дата_окончания_формирования: @@@@@@@@@@

.fields
 NrecPersons : comp
 ФИО
 табельный
 подразделение_внутр
 должность
 дата_аттестации
 номер_аттестации
 тип
 результат
 рекомендация
 пл_должность
 пл_подразд
 NrecAtt : comp
.endfields

.{ StaffAtt_ReportPersCycle CheckEnter
NrecPersons: @@@@@@@@@@@@@@@@@@@@
ФИО сотрудника: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
табельный: @@@@@@@@
Подразделение: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Должность: @@@@@@@@@@@@@@@@@@@@@@@@@
дата_аттестации: @@@@@@@@@@@@@@@@@@@@
Номер_аттестации: @@@@@@@@@@@@@@@@@@@@
тип: @@@@@@@@@@@@@@@@@@@@
результат: @@@@@@@@@@@@@@@
РЕКОМЕНДАЦИЯ: @@@@@@@@@@@@@@@
пл_должность: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
пл_подразд:   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
NrecApp: @@@@@@@@@@@@@@@@@@@@
.}
.fields
 Руководитель
.endfields
Руководитель: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.endform

/*
.linkform "Журнал регистрации аттестаций" prototype is StaffAtt
.defo landscape
.var
 CurRec : Word ;
.endvar
.fields
 Название
.endfields
.[H skip
 Ш                                                                                                                                                                                                          Страница @NP@
┌─────┬────────────────────────────────┬──────────┬────────────────────────┬───────────────────┬───────────┬─────────────┬───────────────────┬───────────────────┬───────────────────┬───────────────────┬───────────────────┐
│N п/п│         Фамилия, имя,          │Табельный │      Структурное       │     Должность     │   Дата    │    Номер    │       Тип         │     Результат     │  Рекомендация     │    Планируемое    │    Планируемая    │
│     │           отчество             │  номер   │     подразделение      │    (профессия)    │аттестации │   приказа   │    аттестации     │    аттестации     │                   │   подразделение   │     должность     │
├─────┼────────────────────────────────┼──────────┼────────────────────────┼───────────────────┼───────────┼─────────────┼───────────────────┼───────────────────┼───────────────────┼───────────────────┼───────────────────┤
│  1  │               2                │     3    │            4           │         5         │     6     │      7      │         8         │         9         │        10         │         11        │         12        │
├─────┼────────────────────────────────┼──────────┼────────────────────────┼───────────────────┼───────────┼─────────────┼───────────────────┼───────────────────┼───────────────────┼───────────────────┼───────────────────┤ Ш
.]H

 Ш                                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

┌─────┬────────────────────────────────┬──────────┬────────────────────────┬───────────────────┬───────────┬─────────────┬───────────────────┬───────────────────┬───────────────────┬───────────────────┬───────────────────┐
│N п/п│         Фамилия, имя,          │Табельный │      Структурное       │     Должность     │   Дата    │    Номер    │       Тип         │     Результат     │  Рекомендация     │    Планируемое    │    Планируемая    │
│     │           отчество             │  номер   │     подразделение      │    (профессия)    │аттестации │   приказа   │    аттестации     │    аттестации     │                   │   подразделение   │     должность     │
├─────┼────────────────────────────────┼──────────┼────────────────────────┼───────────────────┼───────────┼─────────────┼───────────────────┼───────────────────┼───────────────────┼───────────────────┼───────────────────┤
│  1  │               2                │     3    │            4           │         5         │     6     │      7      │         8         │         9         │        10         │         11        │         12        │
├─────┼────────────────────────────────┼──────────┼────────────────────────┼───────────────────┼───────────┼─────────────┼───────────────────┼───────────────────┼───────────────────┼───────────────────┼───────────────────┤ Ш
.begin CurRec := 0 ; end.
.{ StaffAtt_ReportPersCycle CheckEnter
.fields
 CurRec ФИО табельный подразделение должность дата_аттестации номер_аттестации тип результат рекомендация пл_должность пл_подразд
.endfields
.begin CurRec := CurRec + 1 ; end.
 Ш│&&&&.│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@│@~@@@@@@@@@│@~@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@│ Ш
.}
 Ш└─────┴────────────────────────────────┴──────────┴────────────────────────┴───────────────────┴───────────┴─────────────┴───────────────────┴───────────────────┴───────────────────┴───────────────────┴───────────────────┘ Ш
.endform
*/
