/*
  ╔═════════════════════════════════════════════════════════════════════╗
  ║      Н Т О  "T O P   S O F T",  А О   "Н О В Ы Й   А Т Л А Н Т"     ║
  ║           Проект "КАДРЫ" (с) 2002                                   ║
  ║      Версия : 5.8 -7.1                                              ║
  ║      Разработал:  Магниченко А.В.                                   ║
  ║      Назначение:  Журнал регистрации взысканий работающих           ║
  ╚═════════════════════════════════════════════════════════════════════╝
*/

!-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-!
! StaffReportPunish
!-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-!


#doc
Журнал регистрации взысканий работающих
#end
.form StaffReportPunish
.hide
.fields
 Название
 Дата_Начала
 Дата_Окончания
 Дата_Начала_Str
 Дата_Окончания_Str
.endfields

 Наименование отчетной формы: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Дата_начала_формирования: @@@@@@@@@@
 Дата_окончания_формирования: @@@@@@@@@@
 Дата_начала_формирования_Str: @@@@@@@@@@
 Дата_окончания_формирования_Str: @@@@@@@@@@

.fields
 NrecPersons : comp
 NrecApp : comp
 ФИО
 табельный
 должность
 подразделение_внутр
 Номер_Приказа
 Дата_приказа
 Дата_взыскания
 Вид_взыскания
.endfields

.{ ReportPunishCycle CheckEnter
NrecPersons: @@@@@@@@@@@@@@@@@@@@
NrecApp: @@@@@@@@@@@@@@@@@@@@
ФИО сотрудника: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
табельный: @@@@@@@@
Должность: @@@@@@@@@@@@@@@@@@@@@@@@@
Подразделение: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Номер_Приказа : @@@@@@@@@@@
Дата_приказа: @@@@@@@@
Дата_взыскания: @@@@@@@@
Вид_взыскания: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.endform

/*.form StaffReportPunish
.hide
.fields
 Название
.endfields

 Наименование отчетной формы: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

.{ ReportPunishCycle CheckEnter
.fields
 NrecPersons : comp NrecApp : comp
 ФИО табельный должность подразделение Номер_Приказа Дата_приказа Дата_взыскания Вид_взыскания
.endfields
NrecPersons: @@@@@@@@@@@@@@@@@@@@
NrecApp: @@@@@@@@@@@@@@@@@@@@
ФИО сотрудника: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
табельный: @@@@@@@@
Должность: @@@@@@@@@@@@@@@@@@@@@@@@@
Подразделение: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Номер_Приказа : @@@@@@@@@@@
Дата_приказа: @@@@@@@@
Дата_взыскания: @@@@@@@@
Вид_взыскания: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.endform

.linkform "Журнал регистрации взысканий сотрудников" prototype is StaffReportPunish
.defo landscape
.p 40
.var
 CurRec : Word ;
.endvar
.fields
 Название
.endfields
.[H skip
 Р                                                                                              Страница @NP@ Р
 Р┌─────┬────────────────────────────────┬──────────┬───────────────────┬─────────────────────────┬───────────┬──────────┬──────────┬──────────────────────────────────┐ Р
 Р│N п/п│         Фамилия, имя,          │Табельный │     Должность     │      Структурное        │   Номер   │  Дата    │   Дата   │             Вид                  │ Р
 Р│     │           отчество             │  номер   │    (профессия)    │     подразделение       │  приказа  │ приказа  │ взыскания│          взыскания               │ Р
 Р├─────┼────────────────────────────────┼──────────┼───────────────────┤─────────────────────────┼───────────┼──────────┼──────────┼──────────────────────────────────┤ Р
 Р│  1  │               2                │     3    │         4         │            5            │     6     │     7    │    8     │              9                   │ Р
 Р├─────┼────────────────────────────────┼──────────┼───────────────────┤─────────────────────────┼───────────┼──────────┼──────────┼──────────────────────────────────┤
├─────┼────────────────────────────────┼──────────┼───────────────────┤─────────────────────────┼───────────┼──────────┼──────────┼──────────────────────────────────┤ Р
.]H

 Р                                                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Р

 Р┌─────┬────────────────────────────────┬──────────┬───────────────────┬─────────────────────────┬───────────┬──────────┬──────────┬──────────────────────────────────┐ Р
 Р│N п/п│         Фамилия, имя,          │Табельный │     Должность     │      Структурное        │   Номер   │  Дата    │   Дата   │             Вид                  │ Р
 Р│     │           отчество             │  номер   │    (профессия)    │     подразделение       │  приказа  │ приказа  │ взыскания│          взыскания               │ Р
 Р├─────┼────────────────────────────────┼──────────┼───────────────────┤─────────────────────────┼───────────┼──────────┼──────────┼──────────────────────────────────┤ Р
 Р│  1  │               2                │     3    │         4         │            5            │     6     │     7    │    8     │               9                  │ Р
 Р├─────┼────────────────────────────────┼──────────┼───────────────────┤─────────────────────────┼───────────┼──────────┼──────────┼──────────────────────────────────┤ Р
.begin CurRec := 0 ; end.
.{ ReportPunishCycle CheckEnter
.fields
 CurRec ФИО табельный должность подразделение Номер_Приказа Дата_приказа Дата_взыскания Вид_взыскания
.endfields
.begin CurRec := CurRec + 1 ; end.
 Р│&&&&.│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@│@~@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@ │@~@@@@@@@@│@~@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│ Р
.}
 Р└─────┴────────────────────────────────┴──────────┴───────────────────┴─────────────────────────┴───────────┴──────────┴──────────┴──────────────────────────────────┘ Р
.endform*/