//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 8.1 - базовый интерфейс выбора
// Справка
//------------------------------------------------------------------------------
#doc
Справка
#end

.form SpravkiRB
.hide
.fields
ДатаТек
НаименованиеОрг
Подразделение
ГородОрг
АдресОрг

ФИО
ДатаПриема
Должность
ОсновнаяПрофессия

ДеньПрПриказа
МесяцПрПриказа
ГодПрПриказа
НомПрПриказа
ОсновПрием

ДеньУвПриказа
МесяцУвПриказа
ГодУвПриказа
НомУвПриказа
ДатаУвол
ОсновУвол
СтатьяКЗОТ

ДеньОтпускПриказа 
МесяцОтпускПриказа
ГодОтпускПриказа  
НомОтпускПриказа  
ДеньНачОтпуск
МесяцНачОтпуск
ГодНачОтпуск
ОсновОтпуск       

ДеньРасч
МесяцРасч
ГодРасч

.endfields
ДатаТек           ^
НаименованиеОрг   ^
Подразделение     ^
ГородОрг          ^
АдресОрг          ^

ФИО               ^
ДатаПриема        ^
Должность         ^
ОсновнаяПрофессия ^

ДеньПрПриказа     ^
МесяцПрПриказа    ^
ГодПрПриказа      ^
НомПрПриказа      ^
ОсновПрием        ^

ДеньПриказа       ^
МесяцПриказа      ^
ГодПриказа        ^
НомПриказа        ^
ДатаУвол          ^
ОсновУвол         ^
СтатьяКЗОТ        ^

ДеньОтпускПриказа  ^
МесяцОтпускПриказа ^
ГодОтпускПриказа   ^
НомОтпускПриказа   ^
ДеньНачОтпуск      ^
МесяцНачОтпуск     ^
ГодНачОтпуск       ^
ОсновОтпуск        ^

ДеньРасч          ^
МесяцРасч         ^
ГодРасч           ^
.endform
