//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.80 - модуль "Управление бюджетом"
// Форма печати : Реестр группы/слоя аналитик
//------------------------------------------------------------------------------
#doc
Форма печати : Реестр группы/слоя аналитик
#end
.set name='RepGr'
.hide
.fields
  coTab nTab NamRep
  nrec nam kod Attr1 Attr2
.endfields
  ^  ^  ^
.{CycleOfRepGr CheckEnter
 ^ ^ ^ ^ ^

.}

.endform
!
!
!
.linkform 'RepGr1' prototype is 'RepGr'
.Nameinlist 'Реестр групп аналитик'
.P 55
.fields
  CommonFormHeader
  NamRep
  nam kod Attr1 Attr2
.endfields
.[H Skip
 P                                                                        лист @np@ P
 P────────────────────────────────────────────────────────┬────────────┬─────┬─────
                  Наименование                          │    Код     │  C  │  Б
                                                        │            │     │
────────────────────────────────────────────────────────┼────────────┼─────┼───── P
.]H
^

 Р      @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@     лист @np@
────────────────────────────────────────────────────────┬────────────┬─────┬─────
                  Наименование                          │    Код     │  C  │  Б
                                                        │            │     │
────────────────────────────────────────────────────────┼────────────┼─────┼───── Р
.{CycleOfRepGr CheckEnter
 Р@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&&&&&│  &&&│  &&&
.[F
────────────────────────────────────────────────────────┴────────────┴─────┴───── Р
.]F
.}

 PАтрибуты групп аналитик:
С - Существуют подчиненные слои данных
Б - Используется в бюджете P

.endform
!
!
!

