//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.80 - модуль "Управление бюджетом"
// Форма печати : Реестр групп аналитик и их слои
//------------------------------------------------------------------------------
#doc
Форма печати : Реестр групп аналитик и их слои
#end
.set name='RepGrSl'
.hide
.fields
  coTab nTab NamRep
  nrec nam kod Attr1 Attr2
  NameSl CodeSl UsedSl
.endfields
  ^  ^  ^
.{CycleOfRepGr1 CheckEnter
 ^ ^ ^ ^ ^

.{CycleOfRepGrSl CheckEnter
 ^ ^ ^
.}

.}

.endform
!
!
!
.linkform 'RepGrSl1' prototype is 'RepGrSl'
.Nameinlist 'Группы аналитик и их слои'
.P 55
.fields
  CommonFormHeader
  NamRep
  nam kod Attr1 Attr2
  NameSl CodeSl UsedSl
.endfields
.[H Skip
 P                                                                         лист @np@ P
 Р Б──────────────────────────────────────────────────────────────┬────────┬────┬────
                  Наименование                                │  Код   │ C  │ Б
                                                              │        │    │
──────────────────────────────────────────────────────────────┼────────┼────┼──── Б Р
.]H
^
 Р     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@       лист @np@
 Б──────────────────────────────────────────────────────────────┬────────┬────┬────
                        Наименование                          │  Код   │ C  │ Б
                                                              │        │    │
──────────────────────────────────────────────────────────────┼────────┼────┼──── Б Р
.{CycleOfRepGr1 CheckEnter
 Р Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&│&&&&│&&&& Б P
.{CycleOfRepGrSl CheckEnter
.[H
 P══════════════════════════════════════════════════════════════╪════════╪═════════
                        Наименование                          │  Код   │ Б
──────────────────────────────────────────────────────────────┼────────┼───────── P
.]H
 P@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&│&&&&&&& P
.}
 P══════════════════════════════════════════════════════════════╪════════╪═════════ P
.}

 PАтрибуты групп аналитик:
С - Существуют подчиненные слои данных
Б - Используется в бюджете P

.endform

