//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.80 - модуль "Управление бюджетом"
// Форма печати: Настройка : "Соответствие аналитик"
//------------------------------------------------------------------------------
#doc
Форма печати: Настройка : "Соответствие аналитик"
#end
.set name='RepImpRel'
.hide
.fields
  coTab nTab
  SrcKauName
  sImpMean DstKodAn DstAnName sImpStatus
.endfields
  ^  ^
.{CycleOfKau CheckEnter
 ^
.{CycleOfKauMean CheckEnter
 ^ ^ ^ ^
.}

.}

.endform
!
!
!
.linkform 'RepImpRel1' prototype is 'RepImpRel'
.Nameinlist 'Отчет настройки : "Соответствие аналитик"'
.P 55
.fields
  CommonFormHeader
  SrcKauName
  sImpMean DstKodAn DstAnName sImpStatus

.endfields
.[H Skip
 P                                                                                                      лист @np@ P
 P─────────────────────────────────────────┬─────────────┬────────────────────────────────────────────────┬──────
        Аналитика в источнике            │   Код КАУ   │        Аналитика в приемнике                   │Импорт
                                         │  приемника  │                                                │  
─────────────────────────────────────────┴─────────────┴────────────────────────────────────────────────┴────── P
.]H
^

 Р                                     Настройка : "Соответствие аналитик"                            лист @np@
─────────────────────────────────────────┬─────────────┬────────────────────────────────────────────────┬──────
        Аналитика в источнике            │   Код КАУ   │        Аналитика в приемнике                   │Импорт
                                         │  приемника  │                                                │  
─────────────────────────────────────────┴─────────────┴────────────────────────────────────────────────┴────── Р
.{CycleOfKau CheckEnter
 Р@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Р
 Р─────────────────────────────────────────┬─────────────┬────────────────────────────────────────────────┬────── Р
.{CycleOfKauMean CheckEnter
 Р@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@ Р
.}
 P─────────────────────────────────────────┴─────────────┴────────────────────────────────────────────────┴────── Р
.}

.endform
!
!
!

