//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
//------------------------------------------------------------------------------
// Галактика 7.1 - Бухгалтерский контур
// Печать пользовательских аналитик и системных каталогов
//------------------------------------------------------------------------------

#doc
Печать пользовательской аналитики.
#end
.set name='UserKAU'
.hide
.fields
  mTitle
!--------------
  KatKAU_Code
  KatKAU_KodGroup
  KatKAU_Name
  KatKAU_Int_Name
!--------------
  SpKau_NRec
  SpKAU_Code
  SpKAU_Name
  SpKau_vData_Str
  SpKAU_LevelCode
.endfields
 ^
.{
  ^ ^ ^ ^
.{CheckEnter
 ^ ^ ^ ^ ^
.}
.}
.endform
!
!
!=====================================================================
.linkform 'UserKAU01' prototype is 'UserKAU'
.Nameinlist 'Краткий отчет'
.fields
  CommonFormHeader
  mTitle
!--------------
  KatKAU_Name
!--------------
  SpKAU_Code
  SpKAU_Name
.endfields
^

    ^

.{
   ^
.{CheckEnter
    ^ ^
.}

.}
.endform


!=====================================================================
.linkform 'UserKAU02' prototype is 'UserKAU'
.Nameinlist 'Подробный отчет'
.fields
  CommonFormHeader
  mTitle
!--------------
  KatKAU_Code
  KatKAU_KodGroup
  KatKAU_Name
  KatKAU_Int_Name
!--------------
  SpKAU_Code
  SpKAU_Name
  SpKau_vData_Str
  SpKAU_LevelCode
.endfields
^

                         ^

.{
    Аббревиатура         :  Б@@@@@@@@@@@@@@@@@@@@@@@@@ Б  Код:  Б@@@@@@@@@@@ Б
    Наименование         :  Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
    Используемый интервал:  Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
 ───────────────────┬──────────────────────────┬────────────────┬────────────────────────
         Код        │         Значение         │    Параметр    │     Уровневый код
 ───────────────────┴──────────────────────────┴────────────────┴────────────────────────
.{CheckEnter
 @@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@
.}
 ────────────────────────────────────────────────────────────────────────────────────────


.}
.endform
