//******************************************************************************
//                                                      (c) корпорация Галактика
// Галактика 8.1 - Управление производственной логистикой
// Ведомости сверки производственных запасов МЦ
//******************************************************************************

#doc
  Ведомости сверки производственных запасов МЦ</brief>
#end
.Set Name = 'MnfRepStock'
.Hide
.Fields
  dDate  sEdMode  sFilter
  sKolName sCurVal
  sMC sBarKod sCurEd fKolMtr fSumMtr fKolRes fSumRes fKolSkl fSumSkl fKolRst fSumRst
.EndFields
  ^^^^^
.{
  ^^^^^^^^^^^
.}
.EndForm

!-----------------------------------------------------------------------------
#doc
Ведомость сверки запасов МЦ</brief>
#end
.LinkForm 'MnfRepStock_01' prototype is 'MnfRepStock'
.NameInList 'Ведомость сверки запасов МЦ'
.Group 'WithEd'
.Fields
  dDate
.EndFields

                       БВЕДОМОСТЬ Б
         остатков ресурсов по целевому учету
         по состоянию на ^ г.

.{?Internal;sEdMode <> ''
.Fields
  sEdMode
.EndFields
 В^ В
.}// Internal
.{?Internal;sFilter <> ''
.Fields
  sFilter
.EndFields
 ВФильтр : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ В
.}// Internal
.Fields
  sKolName : 'P:C' sCurVal : 'P:C'
  sKolName : 'P:C' sCurVal : 'P:C'
  sKolName : 'P:C' sCurVal : 'P:C'
  sKolName : 'P:C' sCurVal : 'P:C'
  sMC : 'T:R' sBarKod sCurEd fKolMtr fSumMtr fKolRes fSumRes fKolSkl fSumSkl fKolRst fSumRst
.EndFields
 Ш───────────────────────────────┬────────────┬───────────┬────────────────────────────┬────────────────────────────┬────────────────────────────┬────────────────────────────
   Наименование матценности    │ Номенклат. │  Единица  │       Целевой учет         │       Зарезервировано      │     Остатки  в  пр-ве      │       Свободные остатки
                               │   номер    │ измерения ├──────────┬─────────────────┼──────────┬─────────────────┼──────────┬─────────────────┼──────────┬─────────────────
                               │            │           │@@@@@@@@@@│Стоимость в @@@@@│@@@@@@@@@@│Стоимость в @@@@@│@@@@@@@@@@│Стоимость в @@@@@│@@@@@@@@@@│Стоимость в @@@@@
───────────────────────────────┴────────────┴───────────┴──────────┴─────────────────┴──────────┴─────────────────┴──────────┴─────────────────┴──────────┴─────────────────
.{
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@ @@@@@@@@@@@ &&&&&&.&&& &'&&&&&&&&&&&&.&& &&&&&&.&&& &'&&&&&&&&&&&&.&& &&&&&&.&&& &'&&&&&&&&&&&&.&& &&&&&&.&&& &'&&&&&&&&&&&&.&&
.} Ш
.EndForm

!-----------------------------------------------------------------------------
#doc
Ведомость сверки запасов МЦ</brief>
#end
.LinkForm 'MnfRepStock_02' prototype is 'MnfRepStock'
.NameInList 'Ведомость сверки запасов МЦ'
.Group 'WithoutEd'
.Fields
  dDate
.EndFields

                       БВЕДОМОСТЬ Б
           остатков ресурсов по целевому учету
           по состоянию на ^ г.

.{?Internal;sEdMode <> ''
.Fields
  sEdMode
.EndFields
 В^ В
.}// Internal
.{?Internal;sFilter <> ''
.Fields
  sFilter
.EndFields
 ВФильтр : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ В
.}// Internal
.Fields
  sKolName : 'P:C' sCurVal : 'P:C'
  sKolName : 'P:C' sCurVal : 'P:C'
  sKolName : 'P:C' sCurVal : 'P:C'
  sKolName : 'P:C' sCurVal : 'P:C'
  sMC : 'T:R' sBarKod fKolMtr fSumMtr fKolRes fSumRes fKolSkl fSumSkl fKolRst fSumRst
.EndFields
 Ш───────────────────────────────┬────────────┬─────────────────────────────┬─────────────────────────────┬─────────────────────────────┬─────────────────────────────
   Наименование матценности    │ Номенклат. │       Целевой учет          │      Зарезервировано        │      Остатки  в  пр-ве      │      Свободные остатки
                               │   номер    │@@@@@@@@@@│Стоимость в @@@@@@│@@@@@@@@@@│Стоимость в @@@@@@│@@@@@@@@@@│Стоимость в @@@@@@│@@@@@@@@@@│Стоимость в @@@@@@
───────────────────────────────┴────────────┴──────────┴──────────────────┴──────────┴──────────────────┴──────────┴──────────────────┴──────────┴──────────────────
.{
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@ &&&&&&.&&& &'&&&&&&&&&&&&&.&& &&&&&&.&&& &'&&&&&&&&&&&&&.&& &&&&&&.&&& &'&&&&&&&&&&&&&.&& &&&&&&.&&& &'&&&&&&&&&&&&&.&&
.} Ш
.EndForm