/*
 ╔════════════════════════════════════════════════════════════════════════════╗
 ║                     (c) Корпорация ГАЛАКТИКА, 1996,97                      ║
 ║ Проект        : ГАЛАКТИКА                                                  ║
 ║ Система       : Оперативный контур                                         ║
 ║ Версия        : 5.70                                                       ║
 ║ Назначение    : Просмотр наличия остатков МЦ в производстве по МОЛ         ║
 ║ Ответственный : Зайцев Александр Владимирович (AXE)                        ║
 ╚════════════════════════════════════════════════════════════════════════════╝
*/
.set name = 'MnOstPodr'
.hide
.fields
  hdr
  dateStart dateRec
  podr1
  mc bar gr typ
  vhost ost:Double
  res svob perem db4
.endfields
^
^ ^
.{

^

^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.endform
.linkform 'MnOstPodr_1' prototype is 'MnOstPodr'
.var
 SumKol :Double;
 SumKolPr:double;
.endvar
.begin
 SumKol:=0;
 SumKolPr:=0;
end.
.fields
!  CommonFormHeader
  dateStart dateRec
  podr1
  mc bar gr typ vhost ost res svob perem db4
.endfields
!^


            БВЕДОМОСТЬ ДВИЖЕНИЯ ТМЦ В ПРОИЗВОДСТВЕ Б

           с: @@@@@@@@@@@@@@@@ по: @@@@@@@@@@@@@@@@@@

 Р─────────────────────────────┬────────┬─────────┬─────────┬────────────┬────────────┬────────────┬──────────┬──────────┬────────
   Наименование матценности  │ Баркод │ Группа  │   Тип   │ Вх.остаток │ Поступило  │Переработано│Возвращено│Перемещено│Остаток
─────────────────────────────┴────────┴─────────┴─────────┴────────────┴────────────┴────────────┴──────────┴──────────┴──────── Р
.{
 Й @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Й

 Р @@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@ @@@@@@@@@ @@@@@@@@@ &'&&&&&&.&&& &'&&&&&&.&&& &'&&&&&&.&&& &'&&&&.&&& &'&&&&.&&& &'&&&&.&&& Р
.begin
sumKol:=sumKol+ost;
end.
.}

.endform
