! ╔═════════════════════════════════════════════════════════════════════════╗
! ║  Разработал: Сенькевич Ю.И.                                             ║
! ║  Назначение: Обороты по возврату ТМЦ из производства                    ║
! ╚═════════════════════════════════════════════════════════════════════════╝
.Set Name = 'motpmol'
.NameInList 'Базовая форма'
.hide
.fields
  НачДата  ОконДата

  Получат

  МЦ Партия Постав  едИзм  Кол:Double  Вес:Double   Вес_Итого:Double

  Цена:Double Стоим:double ЦенаБаз:Double СтоимБаз:double

  ЦенаПр:Double СтоимПр:double ЦенаБазПр:Double СтоимБазПр:double

.endfields

 ^  ^
.{
 Отправитель  ^
.{
 ^ ^ ^  ^ ^  ^ ^  ^ ^ ^ ^ ^ ^ ^ ^
.}
.}
.endform

.linkform 'motpmol_1' prototype is motpmol
.group 'Uch'
.fields
CommonFormHeader  НачДата  ОконДата
.endfields

.fields
  Получат
.endfields

.var
 ItogPodr:Double
 ItogPred:Double
.endVar
^

 Б                             ВЕДОМОСТЬ ПО ВОЗВРАТУ ПРОДУКЦИИ
                                 c @@@@@@@@@@@ по  @@@@@@@@@@@ Б

───────────────────────────┬──────────┬─────────────┬─────────────┬─────────────┬─────────────────┬───────────────
     Наименование ТМЦ      │ Ед. изм. │    Вес      │ Количество  │    Вес      │      Цена       │   Стоимость
                           │          │  единицы    │             │             │     учетная     │ в учетных ценах
───────────────────────────┴──────────┴─────────────┴─────────────┴─────────────┴─────────────────┴───────────────
.{
 Б Отправитель:  ^ Б
.{
.fields
 МЦ едИзм Вес Кол   Вес_Итого  Цена  Стоим

.endfields
.begin
 ItogPodr := ItogPodr + Стоим
 ItogPred := ItogPred + Стоим
end.
 @@@@@@@@@@@@@@@@@@@@@@@@@@  @@@@@@@@@ &'&&&&&&&&&&& &'&&&&&&&&&&& &'&&&&&&&&&&& &'&&&&&&&&&&&&.&& &'&&&&&&&&&&.&&
.}
.fields  ItogPodr .endfields

 Б                   Итого по МОЛ :                                                                  &'&&&&&&&&&&.&& Б
.begin
ItogPodr := 0
end.
.}
.fields  ItogPred .endfields

 Б                   Итого по ведомости     :                                                        &'&&&&&&&&&&.&& Б
.endform

.linkform 'motpmol_2' prototype is motpmol
.group 'Fact'
.fields
 CommonFormHeader НачДата  ОконДата
.endfields

.fields
  Получат
.endfields

.var
 ItogPodr:Double
 ItogPred:Double
.endVar
^

 Б                          ВЕДОМОСТЬ ПО ВОЗВРАТУ ПРОДУКЦИИ ПО МОЛ
                                 c @@@@@@@@ по  @@@@@@@@ Б

───────────────────────────┬──────────┬─────────────┬─────────────┬─────────────┬─────────────────┬───────────────
     Наименование ТМЦ      │ Ед. изм. │    Вес      │ Количество  │    Вес      │      Цена       │   Стоимость
                           │          │  единицы    │             │             │                 │
───────────────────────────┴──────────┴─────────────┴─────────────┴─────────────┴─────────────────┴───────────────
.{
 Б Отправитель:  ^ Б
.{
.fields
 МЦ   едИзм Вес Кол   Вес_Итого  ЦенаПр СтоимПр

.endfields
.begin
 ItogPodr := ItogPodr + СтоимПр
 ItogPred := ItogPred + СтоимПр
end.
 @@@@@@@@@@@@@@@@@@@@@@@@@@  @@@@@@@@@ &'&&&&&&&&&&& &'&&&&&&&&&&& &'&&&&&&&&&&& &'&&&&&&&&&&&&.&& &'&&&&&&&&&&.&&
.}
.fields  ItogPodr .endfields

 Б                   Итого по МОЛ :                                                                  &'&&&&&&&&&&.&& Б
.begin
ItogPodr := 0
end.
.}
.fields  ItogPred .endfields

 Б                   Итого по ведомости     :                                                        &'&&&&&&&&&&.&& Б
.endform