/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,97 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Производство                                              ║
 ║ Версия        : 5.70                                                      ║
 ║ Назначение    : Остаток (перерасход) лимита в разрезе                     ║
 ║                 лимитированных МЦ                                         ║
 ║ Ответственный : Левченко Андрей Александрович(Andrew)                     ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
.set name = 'OstLimNb'
.hide
.fields
  dateRec  dateend
  Sklad   Podr
  NameLimit  bar  numDO  Limit  PerLimit  OstLimit Prim
  NameLimitItogo   LimitItogo  PerLimitItogo OstLimitItogo
.endfields
^ ^
.{

^ ^
.{
^ ^ ^ ^ ^ ^ ^
.}
^ ^ ^ ^
.}
.endform

.linkform 'OstLimNb_1' prototype is 'OstLimNb'
.fields
  dateRec dateend
.endfields


            Отчет об отпуске по всем стоимостным лимитам в разрезе склад
            отгрузки - подразделение за период с ^ по ^
 P─────────────────────────┬─────────┬──────────┬───────────────┬────────────────┬──────────────┬─────────────────────────────────
Наименование лимитиро-   │  Код    │  Номер   │   Лимит       │  Перерасход    │  Остаток     │        Примечание
 ванного набора МЦ       │  набора │   ДО     │               │    лимита      │  лимита      │
─────────────────────────┴─────────┴──────────┴───────────────┴────────────────┴──────────────┴─────────────────────────────────
.{
.fields
              Sklad                                           Podr
.endfields
    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{
.fields
      NameLimit             bar       numDO         Limit         PerLimit        OstLimit          Prim
.endfields
@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@ @@@@@@@@@@ &'&&&&&&&&&&.&& &'&&&&&&&&&&&.&& &'&&&&&&&&&.&& @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.fields
   NameLimitItogo                                   LimitItogo   PerLimitItogo  OstLimitItogo
.endfields
Итого по: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&.&& &'&&&&&&&&&&&.&& &'&&&&&&&&&.&&
-------------------------------------------------------------------------------------------------------------------------------- P
.}

.endform
