//********************************************************************************
//                                                        (c) корпорация Галактика
// Галактика 7.12 - Управление производственной логистикой
// Форма соответствия документа-основания на отпуск в пр-во и накладных
//********************************************************************************

#doc
Форма соответствия документа-основания на отпуск в производство и накладных</brief>
#end

.Set Name = 'SchManuf4'
.NameInList 'Базовая форма'
.hide
.fields
  CommonFormHeader
  OrgOKPO
  NameOrganization

  nomer ddoc
  poluchat
  sklad
  naznach
  np barkod mc ed kol cena summa kol_nakl summa_nakl otkl_kol otkl_sum
  party posRec posTyp posZak NamZak NamIzd
  mc2
  Analit
  ed2 kol2 cena21 summa2 kolIzd2 kolIzd2_nakl edIzd2 kol2_nakl summa2_nakl otklP_kol otklP_sum
  Summa_All SummaALL_Nakl Summa_Otkl
  PagePrn
.endfields
.{
    ^ ^ ^
        СООТВЕТСТВИЕ ДОКУМЕНТА №  ^  от  @@@@@@@@@@ И НАКЛАДНЫХ НА ОТПУСК В ПРОИЗВОДСТВО

    Получатель : ^
    Склад отгрузки: ^
    Назначение: ^

 Р───┬────────────────────┬───────────────────────────────────┬─────────┬────────────┬─────────┬────────────────┬───────────────────────────────────┬─────────────┬────────────────┬──────────────────────────────
 № │    Номенклатурный  │            Наименование           │ Единица │ Количество │ Цена по │   Сумма по     │   Распределено на изделия по      │  Количество │    Сумма       │  Остаток/перерасход МЦ (+/-)
п/п│       номер        │                                   │измерения│по документу│документу│   документу    ├────────────┬────────────┬─────────┤ по накладным│ по накладным   │─────────────┬────────────────
   │                    │                                   │   МЦ    │    МЦ      │   МЦ    │                │  документу │ накладным  │ ед.изм. │      МЦ     │                │ по кол-ву   │  на сумму
───┴────────────────────┴───────────────────────────────────┴─────────┴────────────┴─────────┴────────────────┴────────────┴────────────┴─────────┴─────────────┴────────────────┴─────────────┴────────────────
.{
&&& @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@ &&&&&&&.&&&& &&&&&&.&& &'&&&&&&&&&&&.&&                                     &&&&&&&&.&&&& &'&&&&&&&&&&&.&& &&&&&&&&.&&&& &'&&&&&&&&&&&.&&
.if spparty4
.{
  ^ ^ ^ ^ ^ ^
   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@ &&&&&&&.&&&& &&&&&&.&& &'&&&&&&&&&&&.&& &&&&&&&.&&&& &&&&&&&.&&&& @@@@@@@@@ &&&&&&&&.&&&& &'&&&&&&&&&&&.&& &&&&&&&&.&&&& &'&&&&&&&&&&&.&&
.}
.end
.}
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                                                             &'&&&&&&&&&&&.&&                                                   &'&&&&&&&&&&&.&&               &'&&&&&&&&&&&.&& Р

.if PrintPage4
^
.else
 Р······································································································································································································ Р
.end

.}
.endform

/*
.linkform 'SchManuf4_01' prototype is SchManuf4
.NameInList 'ДОКУМЕНТ НА ОТПУСК В ПРОИЗВОДСТВО'

.fields
  nomer ddoc
  poluchat
  sklad
        naznach
  np barkod mc ed kol summa kol_nakl summa_nakl otkl_kol otkl_sum
  party mc2 ed2 kol2 summa2 kolIzd2 kolIzd2_nakl edIzd2 kol2_nakl summa2_nakl otklP_kol otklP_sum
  Summa_All SummaALL_Nakl Summa_Otkl
  PagePrn
.endfields
.{
        СООТВЕТСТВИЕ ДОКУМЕНТА №  ^  от  @@@@@@@@@@ И НАКЛАДНЫХ НА ОТПУСК В ПРОИЗВОДСТВО

    Получатель : ^
    Склад отгрузки: ^
                Назначение: ^

 Р───┬────────────────────┬───────────────────────────────────┬─────────┬────────────┬────────────────┬───────────────────────────────────┬─────────────┬────────────────┬──────────────────────────────
 № │    Номенклатурный  │            Наименование           │ Единица │ Количество │   Сумма по     │   Распределено на изделия по      │  Количество │    Сумма       │  Остаток/перерасход (+/-)
п/п│       номер        │                                   │измерения│по документу│   документу    ├────────────┬────────────┬─────────┤ по накладным│ по накладным   │─────────────┬────────────────
   │                    │                                   │         │            │                │  документу │ накладным  │ ед.изм. │             │                │ по кол-ву   │  на сумму
───┴────────────────────┴───────────────────────────────────┴─────────┴────────────┴────────────────┴────────────┴────────────┴─────────┴─────────────┴────────────────┴─────────────┴────────────────
.{
&&& @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@ &&&&&&&.&&&& &'&&&&&&&&&&&.&&                                     &&&&&&&&.&&&& &'&&&&&&&&&&&.&& &&&&&&&&.&&&& &'&&&&&&&&&&&.&&
.if spparty4
.{
   @@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@ &&&&&&&.&&&& &'&&&&&&&&&&&.&& &&&&&&&.&&&& &&&&&&&.&&&& @@@@@@@@@ &&&&&&&&.&&&& &'&&&&&&&&&&&.&& &&&&&&&&.&&&& &'&&&&&&&&&&&.&&
.}
.end
.}
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                                                   &'&&&&&&&&&&&.&&                                                   &'&&&&&&&&&&&.&&               &'&&&&&&&&&&&.&& Р

.if PrintPage4
^
.else
 Р······································································································································································································ Р
.end

.}
.endform
.linkform 'SchManuf4_02' prototype is SchManuf4
.NameInList 'ДОКУМЕНТ НА ОТПУСК В ПРОИЗВОДСТВО C УЧЕТОМ АНАЛИТИКИ'

.fields
  nomer ddoc
  poluchat
  sklad
        naznach
  np barkod mc ed kol summa kol_nakl summa_nakl otkl_kol otkl_sum
  Party Analit ed2 kol2 summa2 kolIzd2 kolIzd2_nakl edIzd2  kol2_nakl summa2_nakl otklP_kol otklP_sum
  Summa_All SummaALL_Nakl Summa_Otkl
  PagePrn
.endfields
.{

        СООТВЕТСТВИЕ ДОКУМЕНТА  №  ^  от  @@@@@@@@@@ И НАКЛАДНЫХ НА ОТПУСК В ПРОИЗВОДСТВО.

    Получатель : ^
    Склад отгрузки: ^
                Назначение: ^

 Р───┬────────────────────┬───────────────────────────────────┬─────────┬────────────┬────────────────┬───────────────────────────────────┬─────────────┬────────────────┬──────────────────────────────
 № │    Номенклатурный  │            Наименование           │ Единица │ Количество │   Сумма по     │   Распределено на изделия по      │  Количество │    Сумма       │  Остаток/перерасход (+/-)
п/п│       номер        │                                   │измерения│по документу│   документу    ├────────────┬────────────┬─────────┤ по накладным│ по накладным   │─────────────┬────────────────
   │                    │                                   │         │            │                │  документу │ накладным  │ ед.изм. │             │                │ по кол-ву   │  на сумму
───┴────────────────────┴───────────────────────────────────┴─────────┴────────────┴────────────────┴────────────┴────────────┴─────────┴─────────────┴────────────────┴─────────────┴────────────────
.{
&&& @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@ &&&&&&&.&&&& &'&&&&&&&&&&&.&&                                     &&&&&&&&.&&&& &'&&&&&&&&&&&.&& &&&&&&&&.&&&& &'&&&&&&&&&&&.&&
.if spparty4
.{
   @@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@ &&&&&&&.&&&& &'&&&&&&&&&&&.&& &&&&&&&.&&&& &&&&&&&.&&&& @@@@@@@@@ &&&&&&&&.&&&& &'&&&&&&&&&&&.&& &&&&&&&&.&&&& &'&&&&&&&&&&&.&&
.}
.end
.}
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                                                   &'&&&&&&&&&&&.&&                                                   &'&&&&&&&&&&&.&&               &'&&&&&&&&&&&.&& Р

.if PrintPage4
^
.else
 Р······································································································································································································ Р
.end

.}
.endform
*/