//********************************************************************************
//                                                        (c) корпорация Галактика
// Галактика 7.12 - Управление производственной логистикой
// Форма требования на отпуск в производство с распределением
//********************************************************************************

#doc
Форма требования на отпуск в производство с распределением</brief>
#end

.Set Name = 'SchManuf2'
.NameInList 'Базовая форма'
.hide
.fields
  NRec_DO
  nomer ddoc
  NRec_Zakaz
  Nomer_Zakaz Name_Zakaz
  poluchat
  sklad
  NRec_Nazna  Name_Nazna //10

  kompl KodKompl Name_kompl sost_kompl
  izd

  np barkod mc ed kol cena summa //11
  //21

  summ_Kol2
  kodparty party
  Analit
  mc2 ed2 kol2 cena2 summa2 //8
  //29

  Summa_All
  Itogo Sim_Val
  po curse NacVal za KolVal Val1
  Summa_Propis
  day
  PagePrn  //12
  //41
.endfields

.{
^
        ТРЕБОВАНИЕ НА ОТПУСК В ПРОИЗВОДСТВО №  ^  от  @@@@@@@@@@
^
    Заказ: № ^ @@@@@@@@@@@@@@@@@@@@@@@@@@@@
    Получатель : ^
    Склад отгрузки: ^
^ ^
^ ^ ^ ^
.{
   ^
.}
───┬────────────────────┬───────────────────────────────────┬─────────┬────────────┬────────────────┬───────────────────
 № │    Номенклатурный  │                                   │ Единица │            │                │
п/п│       номер        │   Наименование, сорт, размер      │измерения│ Количество │    Цена        │     Сумма
───┴────────────────────┴───────────────────────────────────┴─────────┴────────────┴────────────────┴───────────────────
.{
    ^ ^ ^ ^ ^ ^ ^
.if spparty
  ^
.{
    ^ ^ ^ ^ ^ ^ ^
  ^
.}
.end

.}
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
  ^

Итого к оплате (с учетом скидок) : ^ ^
    ^ ^ ^ ^ ^ ^
                 ^
Счет действителен в течение ^ дней

   Руководитель ___________          Гл.(старший) бухгалтер ___________

.if PrintPage2
^
.else
························································································································
.end

.}
.endform


.linkform 'SchManuf2_01' prototype is SchManuf2
.NameInList 'ТРЕБОВАНИЕ НА ОТПУСК В ПРОИЗВОДСТВО'

.fields
  nomer ddoc
  poluchat
  sklad
  Name_Nazna
  Kompl KodKompl Name_kompl Sost_kompl
  izd

  np barkod mc ed kol cena summa  //18

  summ_Kol2
  kodparty party mc2 ed2 kol2 cena2 summa2  //8

  Summa_All
  Itogo Sim_Val
  po curse NacVal za KolVal Val1
  Summa_Propis
  day
  PagePrn   //12
.endfields

.{

 Б        ТРЕБОВАНИЕ НА ОТПУСК В ПРОИЗВОДСТВО №  ^  от  @@@@@@@@@@ Б

    Получатель : Б ^ Б
    Склад отгрузки: Б ^ Б
^
 Р^ ^ ^ ^ Р
.{
   ^
.}
 Р───┬────────────────────┬──────────────────────────────────────────┬─────────┬────────────┬────────────────┬───────────────────
 № │    Номенклатурный  │                                          │ Единица │            │                │
п/п│       номер        │       Наименование, сорт, размер         │измерения│ Количество │    Цена        │     Сумма
───┴────────────────────┴──────────────────────────────────────────┴─────────┴────────────┴────────────────┴───────────────────
.{
 Б&&& @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@ &&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&& С
 Р.if spparty
                                                  Всего распределено по поз.: &&&&&&&&&&&&
.{
 В         @@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@ &&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&& Т
 Р.}
.end

.}
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                                                                            &'&&&&&&&&&&&&&&&&& Р

 ЙИтого к оплате (с учетом скидок) : ^ ^
    ^ ^ ^ ^ ^ ^
                 ^ Й
Счет действителен в течение ^ дней

   Руководитель ___________          Гл.(старший) бухгалтер ___________

.if PrintPage2
^
.else
 Р························································································································ Р
.end


.}
.endform

.linkform 'SchManuf2_02' prototype is SchManuf2
.NameInList 'ТРЕБОВАНИЕ НА ОТПУСК В ПРОИЗВОДСТВО C УЧЕТОМ АНАЛИТИКИ '

.fields
  nomer ddoc
  poluchat
  sklad
  Name_Nazna
  Kompl KodKompl Name_kompl Sost_kompl
  izd

  np barkod mc ed kol cena summa  //18

  summ_Kol2
  Analit  ed2 kol2 cena2 summa2  //8

  Summa_All
  Itogo Sim_Val
  po curse NacVal za KolVal Val1
  Summa_Propis
  day
  PagePrn   //12
.endfields

.{

 Б        ТРЕБОВАНИЕ НА ОТПУСК В ПРОИЗВОДСТВО №  ^  от  @@@@@@@@@@ Б

    Получатель : Б ^ Б
    Склад отгрузки: Б ^ Б
^
 Р^ ^ ^ ^ Р
.{
   ^
.}
 Р───┬────────────────────┬──────────────────────────────────────────┬─────────┬────────────┬────────────────┬───────────────────
 № │    Номенклатурный  │                                          │ Единица │            │                │
п/п│       номер        │       Наименование, сорт, размер         │измерения│ Количество │    Цена        │     Сумма
───┴────────────────────┴──────────────────────────────────────────┴─────────┴────────────┴────────────────┴───────────────────
.{
 Б&&& @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@ &&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&& С
 Р.if spparty
                                                  Всего распределено по поз.: &&&&&&&&&&&&
.{
 В         @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@ &&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&& Т
 Р.}
.end

.}
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                                                                            &'&&&&&&&&&&&&&&&&& Р

 ЙИтого к оплате (с учетом скидок): ^ ^
    ^ ^ ^ ^ ^ ^
                 ^ Й
Счет действителен в течение ^ дней

   Руководитель ___________          Гл.(старший) бухгалтер ___________

.if PrintPage2
^
.else
 Р························································································································ Р
.end


.}
.endform