//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
// Галактика 8.1 - Бухгалтерский контур
// Ошибки контроля целостности данных спецоборудования
//------------------------------------------------------------------------------
#doc
  Форма для печати ошибок контроля целостности данных спецоборудования
#end
.set name = 'ErrSpec'
.hide
.fields
   shapka cSposob Innum text1 text2
.endfields


                ^

┌──────────────────┬─────────┬───────────────────────────┬─────────────────────────────────┐
│     Группа       │Инвентарн│   Обнаруженные ошибки     │    Действия по устранению       │
│ спецоборудования │  номер  │                           │                                 │
.{
├──────────────────┼─────────┼───────────────────────────┼─────────────────────────────────┤
│@@@@@@@@@@@@@@@@@@│@~@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
.}
└──────────────────┴─────────┴───────────────────────────┴─────────────────────────────────┘
.endform

.linkform 'Errspec_01' prototype is 'Errspec'
.NameInList 'Ошибки контроля целостности данных спецоборудования '
.fields
 CommonFormHeader
 Shapka
 cSposob Innum text1 text2
.endfields
^

                     ^

┌──────────────────┬─────────┬────────────────────────────┬─────────────────────────────────┐
│     Группа       │Инвентарн│   Обнаруженные ошибки      │    Действия по устранению       │
│ спецоборудования │  номер  │                            │                                 │
.{
├──────────────────┼─────────┼────────────────────────────┼─────────────────────────────────┤
│@@@@@@@@@@@@@@@@@@│@~@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
.}
└──────────────────┴─────────┴────────────────────────────┴─────────────────────────────────┘
.endform