//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
// Галактика 8.1 - Бухгалтерский контур
// Каталог дополнительных признаков ОС
//------------------------------------------------------------------------------
#doc
  Форма для печати каталога дополнительных признаков ОС
#end
.set name = 'KatKl'
.NameInList ' Каталог дополнительных признаков ОС базовая форма '
.hide
.fields
  KlassOs_nRec   : comp
  НАИМЕНОВАНИЕ1  : string : 'T:-'
  КОД1           : string

  НАИМЕНОВАНИЕ2  : string : 'T:-'
  КОД2           : string
.endfields
.{
^
.{ CheckEnter
.case
.when KlassOsMaster
^^
.when KlassOsSlave
^^
.END
.}
.}
.endform

!------------------------------------------------------------------------------------------------------------------------------------------------------
.linkform 'KatKl_01' prototype is 'KatKl'
.NameInList ' Каталог дополнительных признаков ОС '
.group 'Каталог дополнительных признаков'
.fields
 CommonFormHeader
  НАИМЕНОВАНИЕ1 : 'T:-'
  КОД1
  НАИМЕНОВАНИЕ2 : 'T:-'
  КОД2
.endfields
.[H Skip
                        лист @np@
──────────────────────────────────────────────────────────────────┬──────────
                      Наименование                                │    Код
──────────────────────────────────────────────────────────────────┼──────────
.]H
 ^
                     Б Каталог дополнительных признаков ОС Б
                                  лист @np@
──────────────────────────────────────────────────────────────────┬──────────
                      Наименование                                │    Код
──────────────────────────────────────────────────────────────────┼──────────
.{
.{ CheckEnter
.case
.when KlassOsMaster
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б│ Б@@@@@@@@@@ Б
.when KlassOsSlave
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@
.END
.}
.}
──────────────────────────────────────────────────────────────────┴──────────
.endform
!------------------------------------------------------------------------------------------------------------------------------------------------------
.linkform 'KatKl_02' prototype is 'KatKl'
.NameInList 'Каталог типов документа'
.group 'Каталог типов документа'
.fields
 CommonFormHeader
  НАИМЕНОВАНИЕ1 : 'T:-'
  КОД1
  НАИМЕНОВАНИЕ2 : 'T:-'
  КОД2
.endfields
.[H Skip
                        лист @np@
──────────────────────────────────────────────────────────────────┬──────────
                      Наименование                                │    Код
──────────────────────────────────────────────────────────────────┼──────────
.]H
 ^
                     Б Каталог типов документа Б
                                  лист @np@
──────────────────────────────────────────────────────────────────┬──────────
                      Наименование                                │    Код
──────────────────────────────────────────────────────────────────┼──────────
.{
.{ CheckEnter
.case
.when KlassOsMaster
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б│ Б@@@@@@@@@@ Б
.when KlassOsSlave
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@
.END
.}
.}
──────────────────────────────────────────────────────────────────┴──────────
.endform
