//******************************************************************************
//                                                      (c) ª®à¯®à æ¨ï ƒ « ªâ¨ª 
// ƒ « ªâ¨ª  7.12 - ‹®£¨áâ¨ª 
// ®¤à®¡­ë© ¯à®â®ª®« ä®à¬¨à®¢ ­¨ï æ¥­ë
//******************************************************************************

#doc
®¤à®¡­ë© ¯à®â®ª®« ä®à¬¨à®¢ ­¨ï æ¥­ë
#end
.Set name = 'ShPriceD'
.Hide
#include format2.frn
.fields
  KatSoprNRec
  KatSoprNoDoc
  KatSoprDDoc : date
  KatOrgName
  KatOrgUNN
  KatOrgAddr
  KatOrgPostAddr

  ValSym

  Npp
  MCName
  MCKod
  EdName
  SpKol       : double
  SpPrice     : double
  SpSumm      : double

  ItogoName
  OrgName
  UslName
  UslSumm     : double
  NalName
  NalSumm     : double
.endfields
^ ^ ^
^ ^ ^ ^
^
.{
^ ^ ^ ^
^ ^ ^
.{
^ ^ ^ ^ ^ ^
.}
.}
.endform

#doc
®¤à®¡­ë© ¯à®â®ª®« ä®à¬¨à®¢ ­¨ï æ¥­ë
#end
.LinkForm 'ShPriceD_1' prototype is 'ShPriceD'
.NameInlist '®¤à®¡­ë© ¯à®â®ª®« ä®à¬¨à®¢ ­¨ï æ¥­ë'
.Defo landscape
.P 55
.Set Filler ='-'
.fields
  CommonFormHeader
.endfields
^
.fields
  '’Š‹ ”Œˆ‚€ˆŸ –…'
  '¯® á¯¥æ¨ä¨ª æ¨¨ ­ ª« ¤­®© ü ' + KatSoprNoDoc + ' ®â ' +  DateToStr(KatSoprDDoc, 'DD mon YYYY')
  KatOrgName + ', ' + KatOrgPostAddr

  ValSym
  valSym
.endfields


ÿ™@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@



à£ ­¨§ æ¨ï: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ÿ™
.{
.fields
  Npp
  MCName
  MCKod
  EdName
  DoubleToStr(SpKol, Kol_Pr)
  DoubleToStr(SpPrice, Cena_Pr)
  DoubleToStr(SpSumm, Cena_Pr)
.endfields
.[h
ÿ˜ÚÄÄÄÂÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÂÄÄÄÄÄÄÄÄÄÂÄÄÄÄÄÄÄÄÄÄÂÄÄÄÄÄÄÄÄÄÄÂÄÄÄÄÄÄÄÄÄÄÄÄÄÄÂÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÂÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÂÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿ÿ˜
ÿ˜³ ü ³                    ’®¢ à                      ³ …¤¨­¨æ  ³          ³          ³              ³                                   ³                 “á«ã£                   ³              «®£               ³ÿ˜
ÿ˜³¯/¯ÃÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÂÄÄÄÄÄÄÄÄÄÄÄÄÄ´¨§¬¥à¥­¨ï³Š®«¨ç¥áâ¢®³   –¥­ ,  ³    ‘ã¬¬ ,    ³            Š®­âà £¥­â             ÃÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÂÄÄÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÂÄÄÄÄÄÄÄÄÄÄÄÄ´ÿ˜
ÿ˜³   ³          ¨¬¥­®¢ ­¨¥            ³     Š®¤     ³         ³          ³@~@@@@@@@@³@~@@@@@@@@@@@@³                                   ³         ¨¬¥­®¢ ­¨¥        ³   ‘ã¬¬     ³     ¨¬¥­®¢ ­¨¥    ³   ‘ã¬¬     ³ÿ˜
ÿ˜ÃÄÄÄÅÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÄÄ´ÿ˜
ÿ˜³ 1 ³               2                 ³      3      ³    4    ³    5     ³    6     ³      7       ³                8                  ³             9              ³     10     ³         11         ³     12     ³ÿ˜
ÿ˜ÀÄÄÄÁÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÁÄÄÄÄÄÄÄÄÄÄÄÄÄÁÄÄÄÄÄÄÄÄÄÁÄÄÄÄÄÄÄÄÄÄÁÄÄÄÄÄÄÄÄÄÄÁÄÄÄÄÄÄÄÄÄÄÄÄÄÄÁÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÁÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÁÄÄÄÄÄÄÄÄÄÄÄÄÁÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÁÄÄÄÄÄÄÄÄÄÄÄÄÙÿ˜
.]h
ÿ˜ &&& @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &&&&&&&&&&&&& @~@@@@@@@ &'&&&&&&&& &'&&&&&&&& &'&&&&&&&&&&&&ÿ˜
.{
.{?internal; ( (UslSumm > 0.0001) and (NalSumm > 0.0001) )
.fields
  ItogoName
  OrgName
  UslName
  DoubleToStr(UslSumm, Cena_Pr)
  NalName
  DoubleToStr(NalSumm, Cena_Pr)
.endfields
ÿ˜                                                                           ÿ@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&& @@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&ÿÿ˜
.}
.{?internal; ( (UslSumm > 0.0001) and not (NalSumm > 0.0001) )
.fields
  ItogoName
  OrgName
  UslName
  DoubleToStr(UslSumm, Cena_Pr)
.endfields
ÿ˜                                                                           ÿ@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&                                  ÿÿ˜
.}
.{?internal; ( not (UslSumm > 0.0001) and (NalSumm > 0.0001) )
.fields
  ItogoName
  OrgName
  UslName
  NalName
  DoubleToStr(NalSumm, Cena_Pr)
.endfields
ÿ˜                                                                           ÿ@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@                @@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&ÿÿ˜
.}
.{?internal; ( not (UslSumm > 0.0001) and not (NalSumm > 0.0001) )
.fields
  ItogoName
.endfields
ÿ˜                                                                           ÿ@@@@@@@@@@@@@@@@@@@@@@@@                 ÿÿ˜
.}
.}
.}
.endform