//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.80 - модуль "Управление бюджетом"
// Форма печати : Атрибуты аналитик бюджетирования
//------------------------------------------------------------------------------
#doc
Форма печати : Атрибуты аналитик бюджетирования
#end
.form FpBudAnAttr_base
.NameInList 'Атрибуты аналитик бюджетирования базовая форма'
.Hide
.fields
title
wAn:word
anname
hieran:boolean
virtagrmode:boolean
autosynchan:boolean
.endfields

 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@~ Б

.{ FpBudAnAttrCycle CheckEnter     // цикл по аналитикам
@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@│@@@@│@@@@│
.}

.endform // FpBudAnAttr_base

//------------------------------------------------------------------------------
.linkform FpBudAnAttr prototype is FpBudAnAttr_base
.NameInList 'Атрибуты аналитик бюджетирования'
.P 60
.fields
title
wAn:'p:r'
anname
if(hieran, 'Иер', '')
if(virtagrmode, 'Вирт', '')
if(autosynchan, 'Авто', '')
.endfields
.[H skip
                                                                    лист @np@
─────┬───────────────────────────────────┬───────────────────────────────────
 Код │          Наименование             │              Атрибуты
─────┼───────────────────────────────────┼───┬────┬────┬─────────────────────
.]H

 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@~ Б

─────┬───────────────────────────────────┬───────────────────────────────────
 Код │          Наименование             │              Атрибуты
─────┼───────────────────────────────────┼───┬────┬────┬─────────────────────
.{ FpBudAnAttrCycle CheckEnter     // цикл по аналитикам
@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@│@@@@│@@@@│
.}

Атрибуты аналитик:
   БИер     Б- Иерархический каталог
   БВирт    В- Виртуальные агрегаты
   БАвто    Б- Автосинхронизация каталога

.endform // FpBudAnAttr
