//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.80 - модуль "Управление бюджетом"
// Форма печати : Иерархический отчет спецификации оси ТФ
//------------------------------------------------------------------------------
#doc
Форма печати : Иерархический отчет спецификации оси ТФ
#end
.set name='REPSPAX'
.hide
.fields
  coTab nTab
  nrec nam kod gran abbr
.endfields
  ^  ^
.{
 ^ ^ ^ ^ ^
.}
.endform
!
!
!
.linkform 'REPSPAX1' prototype is 'REPSPAX'
.Nameinlist 'Иерархический отчет спецификации оси ТФ'
.fields
  CommonFormHeader
  nTab
  kod nam gran abbr
.endfields
 Ш^

   ^
────────────────────────┬──────────────────────────────────────────────────────────┬────────────────────────────┬───────────────
     Код в иерархии     │                       Наименование                       │      Группа аналитик       │ Аббревиатура
────────────────────────┼──────────────────────────────────────────────────────────┼────────────────────────────┼───────────────
.{
 @@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@
.}
────────────────────────┴──────────────────────────────────────────────────────────┴────────────────────────────┴─────────────── Ш
.endform
