//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.80 - модуль "Управление бюджетом"
// Форма печати : Использование групп аналитик по статьям бюджета
//------------------------------------------------------------------------------
#doc
Форма печати : Использование групп аналитик по статьям бюджета
#end
.set name='RepGrSt'
.hide
.fields
  coTab nTab NamRep
  nrec nam kod Attr1 Attr2
  CodeSt NameSt AbbrSt
.endfields
  ^  ^  ^
.{CycleOfRepGr2 CheckEnter
 ^ ^ ^ ^ ^

.{CycleOfRepGrStBud CheckEnter
 ^ ^ ^
.}

.}

.endform
!
!
!
.linkform 'RepGrSt1' prototype is 'RepGrSt'
.Nameinlist 'Использование групп аналитик по статьям бюджета'
.P 55
.fields
  CommonFormHeader
  NamRep
  nam kod Attr1 Attr2
  CodeSt NameSt AbbrSt
.endfields
.[H Skip
 P                                                                        лист @np@ P
 Р Б──────────────────────────────────────────────────────────────┬────────┬────┬─────
                  Наименование                                │  Код   │ C  │ Б
                                                              │        │    │
──────────────────────────────────────────────────────────────┼────────┼────┼───── Б Р
.]H
^
 Р     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@        лист @np@
 Б──────────────────────────────────────────────────────────────┬────────┬────┬─────
                        Наименование                          │  Код   │ C  │ Б
                                                              │        │    │
──────────────────────────────────────────────────────────────┼────────┼────┼───── Б Р
.{CycleOfRepGr2 CheckEnter
 Р Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&│&&&&│&&&& Б P
.{CycleOfRepGrStBud CheckEnter
.[H
 P═══════════════╤══════════════════════════════════════════════╧════════╪════╧═════
      Код      │                 Наименование                          │Сокращение
───────────────┼───────────────────────────────────────────────────────┼────────── P
.]H
 P&&&&&&&&&&&&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&& P
.}
 P══════════════════════════════════════════════════════════════╤════════╪════╤════ P
.}

 PАтрибуты групп аналитик:
С - Существуют подчиненные слои данных
Б - Используется в бюджете P

.endform

