//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.80 - модуль "Управление бюджетом"
// Форма печати : Использование групп/слоев аналитик в типовых формах
//------------------------------------------------------------------------------
#doc
Форма печати : Использование групп/слоев аналитик в типовых формах
#end
.set name='RepGrTF'
.hide
.fields
  coTab nTab NamRep
  nrec nam kod Attr1 Attr2
  TFName TFCode
  TFName1 TFCode1
.endfields
  ^  ^  ^
.{CycleOfRepGr4 CheckEnter
 ^ ^ ^ ^ ^

.{CycleOfRepGrTFForAx CheckEnter
 ^ ^
.}

.{CycleOfRepGrTF CheckEnter
 ^ ^
.}


.}

.endform
!
!
!
.linkform 'RepGrTF1' prototype is 'RepGrTF'
.Nameinlist 'Отчет об использовании групп аналитик в типовых формах'
.P 55
.fields
  CommonFormHeader
  NamRep
  nam kod Attr1 Attr2
  TFName TFCode
  TFName1 TFCode1

.endfields
.[H Skip
 P                                                                        лист @np@ P
 Р Б──────────────────────────────────────────────────────────────┬────────┬────┬────
                  Наименование                                │  Код   │ C  │ Б
                                                              │        │    │
──────────────────────────────────────────────────────────────┼────────┼────┼──── Б Р
.]H
^

 Р      @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@      лист @np@
 Б──────────────────────────────────────────────────────────────┬────────┬────┬────
                        Наименование                          │  Код   │ C  │ Б
                                                              │        │    │
──────────────────────────────────────────────────────────────┼────────┼────┼──── Б Р
.{CycleOfRepGr4 CheckEnter
 Р Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│  &&&&&&│ &&&│ &&& Б P
.{CycleOfRepGrTFForAx CheckEnter
.[H //OVERWRITE
 Р══════════════════════════════════════════════════════════════╪══════════════════ Р
 Р      Используется в типовых формах непосредственно:            │
══════════════════════════════════════════════════════════════╪══════════════════
                                    Наименование              │       Код
──────────────────────────────────────────────────────────────┼────────────────── Р
.]H
 Т    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│ Г   Б&&&&&&&&&&&&&& Р
.}
.{CycleOfRepGrTF CheckEnter
.[H //OVERWRITE
 Р──────────────────────────────────────────────────────────────┼────────────────── Р
 Р       Используется в типовых формах косвенно                 │
══════════════════════════════════════════════════════════════╪══════════════════
                                    Наименование              │       Код
──────────────────────────────────────────────────────────────┼────────────────── Р
.]H
 Т    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│ Г   Б&&&&&&&&&&&&&& Р
.}
 С──────────────────────────────────────────────────────────────┼────────────────── С
.}
.endform

