/*
 ╔════════════════════════════════════════════════════════════════════════════╗
 ║                     (c) Корпорация ГАЛАКТИКА, 1996,97                      ║
 ║ Проект        : ГАЛАКТИКА                                                  ║
 ║ Система       : Оперативный контур(Производство)                           ║
 ║ Версия        : 5.50                                                       ║
 ║ Назначение    : Просмотр таблицы остатков матценностей                     ║
 ║ Ответственный : Сенькевич Игорь Казимирович (IGORS)                        ║
 ║ Использует    : Юрий Журбенко(YURI)  о добавлении полей просьба сообщать   ║
 ╚════════════════════════════════════════════════════════════════════════════╝
*/
.Set Name = 'SeeSmnMC'
.Hide
.Fields
 f1 f2  f3 f11 f4 f5 f6 f7 f8 f9 f10
.Endfields
.{
^^^^^^^^^^^
.}
.Endform
!
!
!
.Linkform 'seesmnmc_00' prototype is 'SeeSmnMC'
.Group 'OSTMN2'
.Fields
  CommonFormHeader
  f2  f3 f11 f4 f5 f6 f7 f8 f9 f10
.Endfields
^
                                ОСТАТКИ МАТЦЕННОСТЕЙ В ПРОИЗВОДСТВЕ
──────────┬────────────────────────┬────────────────┬─────────────────────┬───────────┬──────────┬─────────────┬─────────────┬─────────────┬────────
  Дата    │Наименование матценности│ Номенкл. номер │   Подразделение     │    МОЛ    │  Партия  │Количество   │Средняя цена │... в валюте │ валюта
──────────┴────────────────────────┴────────────────┴─────────────────────┴───────────┴──────────┴─────────────┴─────────────┴─────────────┴────────
.{
@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@ &'&&&&&&&.&&& &'&&&&&&&&.&& &'&&&&&&&.&&& @@@@@@@@
.}
.Endform

.Linkform 'seesmnmc_01' prototype is 'SeeSmnMC'
.Group 'OSTMN01'
.Fields
  CommonFormHeader
  f2  f3 f11 f4 f7 f8 f9 f10
.Endfields
^
                           ОСТАТКИ МАТЦЕННОСТЕЙ В ПРОИЗВОДСТВЕ
──────────┬────────────────────────┬────────────────┬─────────────────────┬─────────────┬─────────────┬─────────────┬────────
  Дата    │Наименование матценности│ Номенкл. номер │   Подразделение     │Количество   │Средняя цена │... в валюте │ валюта
──────────┴────────────────────────┴────────────────┴─────────────────────┴─────────────┴─────────────┴─────────────┴────────
.{
@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&.&&& &'&&&&&&&&.&& &'&&&&&&&.&&& @@@@@@@@
.}
.Endform

.Linkform 'seesmnmc_02' prototype is 'SeeSmnMC'
.Group 'OSTMN_ERR'
.Fields
  CommonFormHeader
  f3 f4 f5 f6 f7 f8
.Endfields
^
                           ОСТАТКИ МАТЦЕННОСТЕЙ В ПРОИЗВОДСТВЕ
────────────────────┬─────────────┬────────────┬─────────────┬─────────────
   Подразделение    │     МОЛ     │   Партия   │ Количество  │По накладной
────────────────────┴─────────────┴────────────┴─────────────┴─────────────
.{
 ^
@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@ @@@@@@@@@@@@ &'&&&&&&&.&&& &'&&&&&&&.&&&
.}
.Endform
