!╔═════════════════════════════════════════════════════════════════════╗
!║      Проект ГАЛАКТИКА (c) 1994,95 TOP SOFT Ltd., АО НОВЫЙ АТЛАНТ    ║
!║  Версия :     5.7x                                                  ║
!║  Разработал: Голец Д.И.                                             ║
!║  Назначение: возврат на оптовый склад  - форма прототип             ║
!║  Изменения:                                                         ║
!╚═════════════════════════════════════════════════════════════════════╝

#INCLUDE actopt.pro
!#INCLUDE th2_rec.frn

#doc
Строгая отчетность - бланк ТН-2
#end
.linkform 'aktopt_TN2' prototype is aktopt
.nameinlist 'Строгая отчетность - бланк ТН-2'
.var
   akol     : double
   akol_uch : double
.endvar
#include mfo.frn
.fields
Контрагент1УНН    Контрагент2УНН
Контрагент1_ОКПО  Контрагент2_ОКПО

Номер_с_дескриптором

DateToStr(Дата,'DD mon YYYY г. (day)')

Контрагент1
  + ' ОКПО '     + Контрагент1_ОКПО
  + unn_         + Контрагент1УНН
  + ' Адрес:'    + Контрагент1_Адрес
  + ' Банк:'     + Контрагент1_БАНК_Имя
  + ' р/с '      + Контрагент1_БАНК_Счет
  + mfo_         + Контрагент1_БАНК_Мфо
Контрагент2
  + ' ОКПО '     + Контрагент2_ОКПО
  + unn_         + Контрагент2УНН
  + ' Адрес:'    + Контрагент2_Адрес
  + ' Банк:'     + Контрагент2_БАНК_Имя
  + ' р/с '      + Контрагент2_БАНК_Счет
  + mfo_         + Контрагент2_БАНК_Мфо
 Примечание
!.{
 Название_МЦ
 Номенклатурный
 ЕдиницаУч
 Количество*Коеф
 ЦенаНац/Коеф/1000

 (ЦенаНац - if(Подр_без_Налогов, 0, Сумма_Вход_Налогов_по_Специф) -
            Цена_ордера_нац)/(Цена_ордера_нац)*100
 Цена_ордера_нац/коеф/1000
 ЦенаНац*Количество/1000

 if (ЕдиницаУч<>Единица,Единица,'')
 Количество
 коеф
!.}
akol_uch
СуммаНац/1000
akol
стр_СуммаНац
стр_КолНаименований
.endfields
.begin
  akol     := 0 ;
  akol_uch := 0 ;
 end.
 Ш







                                                             @@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@

                                                             @@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@


                                                                                   ^



 Ш
 Р дата: ^
 С
 НАКЛАДНАЯ НА ВОЗВРАТ  Б
 Р
 Отправитель: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Получатель: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Примечание: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Основание отпуска:
 Кому выданы МЦ:
─────────────────────────────────────────────────┬───────────┬───────────┬─────────────┬──────────┬─────────────┬────────────────┬──────────┬────────┬──────────
 Наименование товара               Номенклатурный│  Единица  │ Количество│Расчетно-отп.│ % оптовой│Оптовая Цена │   Стоимость    │Виды тары,│ Кол-во │ Кол-во
                                     номер       │ измерения │   товара  │    цена     │ наценки  │ поставщика  │   продукции    │упаковки  │упаковок│продукции
                                                 │           │           │  тыс.руб.   │поставщика│  тыс.руб.   │   тыс.руб.     │          │        │в упаковке
─────────────────────────────────────────────────┴───────────┴───────────┴─────────────┴──────────┴─────────────┴────────────────┴──────────┴────────┴──────────
.{
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@ @@@@@@@@@@@ &&&&&&&&.&& &&&&&&&&&&&.& &&&&&&.&&& &&&&&&&&&&&.& &&&&&&&&&&&&&&.& @@@@@@@@@@ &#&&&.&& &&#&&&&.&&
.begin
   akol     := akol     + Количество ;
   akol_uch := akol_uch + Количество*коеф ;
 end.
.}
                                                             ┌───────────┐                                      ┌────────────────┐          ┌────────┐
Итого........................................................│&&&&&&&&.&&│......................................│&&&&&&&&&&&&&&.&│..........│&&#&&.&&│
                                                             └───────────┘                                      └────────────────┘          └────────┘
Всего отпущено на сумму @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Всего отпущено наименований @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ № пломбы ________
С товаром переданы документы __________________________________________________________________________________________________________________________________
Отпуск разрешил _______________________________________________________________________________________________________________________________________________
Отпуск произвел _______________________________________________________________________________________________________________________________________________
Товар получил _________________________________________________________________________________________________________________________________________________
Указаный товар сдал ___________________________________________________________________________________________________________________________________________
Принятое количество и стоимость товара____________________________________________________________________________ № Пломбы ___________________________________
Принял ________________________________________________________________________________________________________________________________________________________

.endform

#doc
СТАНДАРТНАЯ ФОРМА НАКЛАДНОЙ НА ВОЗВРАТ НА ОПТОВЫЙ СКЛАД
#end
.linkform 'aktopt_01' prototype is aktopt
.nameinlist 'СТАНДАРТНАЯ ФОРМА НАКЛАДНОЙ НА ВОЗВРАТ НА ОПТОВЫЙ СКЛАД'
.fields
 CommonFormHeader
 Контрагент1 Номер_с_дескриптором Дата //Контрагент2
 Р Подразделение_откуда Р
 Р МОЛ_откуда Р
 Р Подразделение_куда Р
 Р МОЛ_куда Р
 Р Примечание Р
 СимволНак СимволНак
!.{
 Название_МЦ Номенклатурный Единица
 Количество КолНак Цена Стоимость РЦена РСтоимость Накладная
!.}
 Сумма СуммаРеализ стр_КолНаименований Сумма СимНак стр_Сумма СуммаРеализ стр_СуммаРеализ
.endfields
 ^

 Организация :  Б^ Б

   НАКЛАДНАЯ НА ВОЗВРАТ НА ОПТОВЫЙ СКЛАД №   Б^ Б
         от @@@@@@@@@@
! Контрагент :  Б^ Б
 Откуда
   Подразделение розничной торговли: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
   Материально ответственное лицо  : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Куда
   Склад                           : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ 
 И   Материально ответственное лицо  : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И

 Примечание @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
─────────────────────┬──────────────┬─────────┬────────────┬────────────┬────────────┬──────────────┬────────────┬──────────────┬──────────────
    Название МЦ      │Номенклатурный│ Единица │ Количество │ Количество │   Цена в   │  Стоимость в │ Цена в НДЕ │ Стоим. в НДЕ │ По документу
                     │     номер    │измерения│            │по документу│ @~@@@@@@@@ │ @~@@@@@@@@@@ │(реализации)│ (реализации) │
─────────────────────┴──────────────┴─────────┴────────────┴────────────┴────────────┴──────────────┴────────────┴──────────────┴──────────────
.{
@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@ @@@@@@@@@ &&&&&&&&&&&& &&&&&&&&&&&& &&&&&&&&&&&& &&&&&&&&&&&&&& &&&&&&&&&&&& &&&&&&&&&&&&&& @@@@@@@@@@@@@@
.}
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
Итого :                                                                          &&&&&&&&&&&&&&&&&&& Ш  Ш        &&&&&&&&&&&&&&&&&&& Ш

 Всего наименований : ^
  на сумму &&&&&&&&&&&&&&&&&&&& @@@@@@@@@
    прописью : ^ Р
 Р В ценах реализации : Р
 Р  на сумму &&&&&&&&&&&&&&&&&&&& Р
 Р    прописью : ^ Р


.endform
