!╔═══════════════════════════════════════════════════════════════════════════╗
!║                     (c) 1994, 2000 корпорация ГАЛАКТИКА                   ║
!║ Проект        : ГАЛАКТИКА                                                 ║
!║ Система       : Имущество                                                 ║
!║ Версия        : 5.80                                                      ║
!║ Назначение    : Печать информации о выносе имущества                      ║
!║ Ответственный : Макс Голдин                                               ║
!╚═══════════════════════════════════════════════════════════════════════════╝


#doc
Печать информации о выносе имущества
#end
.form  'imGap'
.hide
.fields
  Дата_начала :Date
  Дата_окончания :Date

  Организация
  Организация_УНН
  Организация_ОКПО
  Организация_ОКДП
  Организация_Банк

  Корпус0
  Этаж0

  ФИО0
  Таб_N0

!.{
   Название_МЦ
   БарКод_МЦ

   ЕдиницаОтп
   Количество :Double

   Цена       :Double


   Дата_выноса  :Date
   Время_выноса :Time

   ФИО
   Таб_N

   Дата_действия_пропуска  :Date
   Время_действия_пропуска :Time

   Корпус
   Этаж
!.}
.endfields
! --- Описание структуры формы
Дата_начала        ^
Дата_окончания     ^

Организация        ^
Организация УНН    ^
Организация ОКПО   ^
Организация ОКДП   ^
Организация Банк   ^


для корпуса        ^
для этажа          ^

для ФИО            ^
для Таб. №         ^

.{
===============================================================================
  Название МЦ   ^
  БарКод МЦ     ^

  ЕдиницаОтп    ^
  Количество    ^

  Цена          ^


  Дата выноса   ^
  Время выноса  ^

  ФИО           ^
  Таб. №        ^

  Дата действия пропуска  ^
  Время действия пропуска ^

  Корпус             ^
  Этаж               ^
.}
===============================================================================
.endform


#doc
Печать информации о выносе имущества
#end
.LinkForm 'Отчет о выносе имущества (0)' prototype is imGap
.Group 'K_E_FIO'
.DEFO PORTRAIT
.p 68
.var
  NomPp :Word;
  Sum :Double;
.endvar
.fields
  CommonFormHeader

  Организация

  Корпус0
  Этаж0
  ФИО0 + '(табельный номер №' + Таб_N0 + ')'

  'с '  + DateToStr(Дата_начала,    'DD mon YYYY г.') +
  ' по ' + DateToStr(Дата_окончания, 'DD mon YYYY г.')

!.{
   String(NomPp) + '.'

   БарКод_МЦ
   Название_МЦ

   ЕдиницаОтп

   Цена

   DateToStr(Дата_действия_пропуска,  'DD/MM/YYYY')
   TimeToStr(Время_действия_пропуска, 'HH:MM')
!.}
.endfields
^

 ИОрганизация      З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ П
 ИКорпус           З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ П
 ИЭтаж             З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ П
 ИВынос произвел   З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ П


                 ОТЧЕТ О ВЫНОСЕ ИМУЩЕСТВА №____________
 И@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И


.{
.[h OverWrite
 Р┌─────╥───────────────┬────────────────────────────────────────────────┬─────────┬──────────────────╥──────────┬──────┐ Р
 Р│  №  ║ Учетный номер │             Наименование имущества             │ Единица │    Стоимость     ║   Дата   │Время │ Р
 Р│ п/п ║   имущества   │                                                │измерения│                  ║  выноса  │выноса│ Р
 Р├─────╫───────────────┼────────────────────────────────────────────────┼─────────┼──────────────────╫──────────┼──────┤ Р
.]h
.begin
   NomPp :=NomPp + 1;
   Sum   :=Sum   + Цена;
end.
 Р│&&&&&║&&&&&&&&&&&&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@│&'#&&&&&&&&&&&&.&&║@@@@@@@@@@│@@@@@@│ Р
.[f
 Р└─────╨───────────────┴────────────────────────────────────────────────┴─────────┴──────────────────╨──────────┴──────┘ Р
.]f
.}
.fields
  DoubletoString(0, FRoundRub5(Sum))
.endfields

 ИИмущество на сумму  З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ П

 РОтчет с документами принял и проверил _____________________________  ___________________  ____________________________ Р
 Р                                                должность                  подпись             расшифровка подписи Р

 РМатериально ответственное лицо        _____________________________  ___________________  ____________________________ Р
 Р                                                должность                  подпись             расшифровка подписи Р
.endform


#doc
Печать информации о выносе имущества
#end
.LinkForm 'Отчет о выносе имущества (1)' prototype is imGap
.Group 'All_K'
.DEFO PORTRAIT
.p 68
.var
  NomPp :Word;
  Sum   :Double;
.endvar
.fields
  CommonFormHeader

  Организация
  'все корпуса'
  Этаж0
  ФИО0 + '(табельный номер №' + Таб_N0 + ')'

  'с '  + DateToStr(Дата_начала,    'DD mon YYYY г.') +
  ' по ' + DateToStr(Дата_окончания, 'DD mon YYYY г.')

!.{
   String(NomPp) + '.'

   БарКод_МЦ
   Название_МЦ

   ЕдиницаОтп

   Цена

   Корпус

   DateToStr(Дата_действия_пропуска,  'DD/MM/YYYY')
   TimeToStr(Время_действия_пропуска, 'HH:MM')
!.}
.endfields
^

 ИОрганизация      З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ П
 ИКорпус           З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ П
 ИЭтаж             З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ П
 ИВынос произвел   З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ П


                 ОТЧЕТ О ВЫНОСЕ ИМУЩЕСТВА №____________
 И@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И


.{
.[h OverWrite
 Ш┌─────╥─────────────┬────────────────────────────────────────────────┬───────┬──────────────────╥──────────────────────────────┬──────────┬──────┐ Ш
 Ш│  №  ║Учетный номер│              Наименование имущества            │Единица│    Стоимость     ║            Корпус            │   Дата   │Время │ Ш
 Ш│ п/п ║  имущества  │                                                │измер. │                  ║                              │  выноса  │выноса│ Ш
 Ш├─────╫─────────────┼────────────────────────────────────────────────┼───────┼──────────────────╫──────────────────────────────┼──────────┼──────┤ Ш
.]h
.begin
   NomPp :=NomPp + 1;
   Sum   :=Sum   + Цена;
end.
 Ш│&&&&&║&&&&&&&&&&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@│&'#&&&&&&&&&&&&.&&║@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@│@@@@@@│ Ш
.[f
 Ш└─────╨─────────────┴────────────────────────────────────────────────┴───────┴──────────────────╨──────────────────────────────┴──────────┴──────┘ Ш
.]f
.}

.fields
  DoubletoString(0, FRoundRub5(Sum))
.endfields
 ИИмущество на сумму  З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ П

 РОтчет с документами принял и проверил _____________________________  ___________________  ____________________________ Р
 Р                                                должность                  подпись             расшифровка подписи Р

 РМатериально ответственное лицо        _____________________________  ___________________  ____________________________ Р
 Р                                                должность                  подпись             расшифровка подписи Р
.endform


#doc
Печать информации о выносе имущества
#end
.LinkForm 'Отчет о выносе имущества (2)' prototype is imGap
.Group 'All_E'
.DEFO PORTRAIT
.p 68
.var
  NomPp :Word;
  Sum   :Double;
.endvar
.fields
  CommonFormHeader

  Организация
  Корпус0
  'все этажи'
  ФИО0 + '(табельный номер №' + Таб_N0 + ')'

  'с '  + DateToStr(Дата_начала,    'DD mon YYYY г.') +
  ' по ' + DateToStr(Дата_окончания, 'DD mon YYYY г.')

!.{
   String(NomPp) + '.'

   БарКод_МЦ
   Название_МЦ

   ЕдиницаОтп

   Цена

   Этаж

   DateToStr(Дата_действия_пропуска,  'DD/MM/YYYY')
   TimeToStr(Время_действия_пропуска, 'HH:MM')
!.}
.endfields
^

 ИОрганизация      З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ П
 ИКорпус           З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ П
 ИЭтаж             З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ П
 ИВынос произвел   З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ П


                 ОТЧЕТ О ВЫНОСЕ ИМУЩЕСТВА №____________
 И@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И


.{
.[h OverWrite
 Ш┌─────╥─────────────┬────────────────────────────────────────────────┬───────┬──────────────────╥──────────────────────────────┬──────────┬──────┐ Ш
 Ш│  №  ║Учетный номер│              Наименование имущества            │Единица│    Стоимость     ║             Этаж             │   Дата   │Время │ Ш
 Ш│ п/п ║  имущества  │                                                │измер. │                  ║                              │  выноса  │выноса│ Ш
 Ш├─────╫─────────────┼────────────────────────────────────────────────┼───────┼──────────────────╫──────────────────────────────┼──────────┼──────┤ Ш
.]h
.begin
   NomPp :=NomPp + 1
end.
 Ш│&&&&&║&&&&&&&&&&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@│&'#&&&&&&&&&&&&.&&║@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@│@@@@@@│ Ш
.[f
 Ш└─────╨─────────────┴────────────────────────────────────────────────┴───────┴──────────────────╨──────────────────────────────┴──────────┴──────┘ Ш
.]f
.}

.fields
  DoubletoString(0, FRoundRub5(Sum))
.endfields
 ИИмущество на сумму  З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ П

 РОтчет с документами принял и проверил _____________________________  ___________________  ____________________________ Р
 Р                                                должность                  подпись             расшифровка подписи Р

 РМатериально ответственное лицо        _____________________________  ___________________  ____________________________ Р
 Р                                                должность                  подпись             расшифровка подписи Р
.endform


#doc
Печать информации о выносе имущества
#end
.LinkForm 'Отчет о выносе имущества (3)' prototype is imGap
.Group 'All_FIO'
.DEFO LANDSCAPE
.p 55
.var
  NomPp :Word;
  Sum   :Double;
.endvar
.fields
  CommonFormHeader

  Организация

  Корпус0
  Этаж0
  'все лица'

  'с '  + DateToStr(Дата_начала,    'DD mon YYYY г.') +
  ' по ' + DateToStr(Дата_окончания, 'DD mon YYYY г.')

!.{
   String(NomPp) + '.'

   БарКод_МЦ
   Название_МЦ

   ЕдиницаОтп

   Цена

   ФИО
   Таб_N

   DateToStr(Дата_действия_пропуска,  'DD/MM/YYYY')
   TimeToStr(Время_действия_пропуска, 'HH:MM')
!.}
.endfields
^

Организация      З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З
Корпус           З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З
Этаж             З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З
Вынос произвел   З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З


                                   ОТЧЕТ О ВЫНОСЕ ИМУЩЕСТВА №____________
 И@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И


.{
.[h OverWrite
 Р┌─────╥─────────────┬────────────────────────────────────────────────┬─────────┬──────────────────╥────────────────────────────────────────────────────┬────────┬──────────┬──────┐ Р
 Р│  №  ║Учетный номер│             Наименование имущества             │ Единица │    Стоимость     ║                   Вынос произвел                   │ Табель-│   Дата   │Время │ Р
 Р│ п/п ║  имущества  │                                                │измерения│                  ║               фамилия, имя, отчество               │  ный № │  выноса  │выноса│ Р
 Р├─────╫─────────────┼────────────────────────────────────────────────┼─────────┼──────────────────╫────────────────────────────────────────────────────┼────────┼──────────┼──────┤ Р
.]h
.begin
   NomPp :=NomPp + 1;
   Sum   :=Sum   + Цена;
end.
 Р│&&&&&║&&&&&&&&&&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@│&'#&&&&&&&&&&&&.&&║@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@│@@@@@@@@@@│@@@@@@│ Р
.[f
 Р└─────╨─────────────┴────────────────────────────────────────────────┴─────────┴──────────────────╨────────────────────────────────────────────────────┴────────┴──────────┴──────┘ Р
.]f
.}

.fields
  DoubletoString(0, FRoundRub5(Sum))
.endfields
 ИИмущество на сумму  З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ П

 ИОтчет с документами принял и проверил _____________________________  ___________________  ____________________________ И
 И                                                должность                  подпись             расшифровка подписи И

 ИМатериально ответственное лицо        _____________________________  ___________________  ____________________________ И
 И                                                должность                  подпись             расшифровка подписи И
.endform


#doc
Печать информации о выносе имущества
#end
.LinkForm 'Отчет о выносе имущества (4)' prototype is imGap
.Group 'All_K_E'
.DEFO LANDSCAPE
.p 55
.var
  NomPp :Word;
  Sum   :Double;
.endvar
.fields
  CommonFormHeader

  Организация

  'все корпуса'
  'все этажи'
  ФИО0 + '(табельный номер №' + Таб_N0 + ')'

  'с '  + DateToStr(Дата_начала,    'DD mon YYYY г.') +
  ' по ' + DateToStr(Дата_окончания, 'DD mon YYYY г.')

!.{
   String(NomPp) + '.'

   БарКод_МЦ
   Название_МЦ

   ЕдиницаОтп

   Цена

   Корпус
   Этаж

   DateToStr(Дата_действия_пропуска,  'DD/MM/YYYY')
   TimeToStr(Время_действия_пропуска, 'HH:MM')
!.}
.endfields
^

Организация      З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З
Корпус           З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З
Этаж             З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З
Вынос произвел   З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З


                                   ОТЧЕТ О ВЫНОСЕ ИМУЩЕСТВА №____________
 И@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И


.{
.[h OverWrite
 Р┌─────╥─────────────┬────────────────────────────────────────────────┬─────────┬──────────────────╥──────────────────────────────┬──────────────────────────────┬──────────┬──────┐ Р
 Р│  №  ║Учетный номер│             Наименование имущества             │ Единица │    Стоимость     ║            Корпус            │             Этаж             │   Дата   │Время │ Р
 Р│ п/п ║  имущества  │                                                │измерения│                  ║                              │                              │  выноса  │выноса│ Р
 Р├─────╫─────────────┼────────────────────────────────────────────────┼─────────┼──────────────────╫──────────────────────────────┼──────────────────────────────┼──────────┼──────┤ Р
.]h
.begin
   NomPp :=NomPp + 1;
   Sum   :=Sum   + Цена;
end.
 Р│&&&&&║&&&&&&&&&&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@│&'#&&&&&&&&&&&&.&&║@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@│@@@@@@│ Р
.[f
 Р└─────╨─────────────┴────────────────────────────────────────────────┴─────────┴──────────────────╨──────────────────────────────┴──────────────────────────────┴──────────┴──────┘ Р
.]f
.}

.fields
  DoubletoString(0, FRoundRub5(Sum))
.endfields
 ИИмущество на сумму  З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ П

 ИОтчет с документами принял и проверил _____________________________  ___________________  ____________________________ И
 И                                                должность                  подпись             расшифровка подписи И

 ИМатериально ответственное лицо        _____________________________  ___________________  ____________________________ И
 И                                                должность                  подпись             расшифровка подписи И
.endform


#doc
Печать информации о выносе имущества
#end
.LinkForm 'Отчет о выносе имущества (5)' prototype is imGap
.Group 'All_K_FIO'
.DEFO LANDSCAPE
.p 55
.var
  NomPp :Word;
  Sum   :Double;
.endvar
.fields
  CommonFormHeader

  Организация

  'все корпуса'
  Этаж0
  'все лица'

  'с '  + DateToStr(Дата_начала,    'DD mon YYYY г.') +
  ' по ' + DateToStr(Дата_окончания, 'DD mon YYYY г.')

!.{
   String(NomPp) + '.'

   БарКод_МЦ
   Название_МЦ

   ЕдиницаОтп

   Цена

   ФИО
   Таб_N

   Корпус

   DateToStr(Дата_действия_пропуска,  'DD/MM/YYYY')
   TimeToStr(Время_действия_пропуска, 'HH:MM')
!.}
.endfields
^

Организация      З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З
Корпус           З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З
Этаж             З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З
Вынос произвел   З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З


                                   ОТЧЕТ О ВЫНОСЕ ИМУЩЕСТВА №____________
 И@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И


.{
.[h OverWrite
 Ш┌─────╥─────────────┬────────────────────────────────────────────────┬─────────┬──────────────────╥────────────────────────────────────────────────────┬────────┬──────────────────────────────┬──────────┬──────┐ Ш
 Ш│  №  ║Учетный номер│             Наименование имущества             │ Единица │    Стоимость     ║                   Вынос произвел                   │ Табель-│            Корпус            │   Дата   │Время │ Ш
 Ш│ п/п ║  имущества  │                                                │измерения│                  ║               фамилия, имя, отчество               │  ный № │                              │  выноса  │выноса│ Ш
 Ш├─────╫─────────────┼────────────────────────────────────────────────┼─────────┼──────────────────╫────────────────────────────────────────────────────┼────────┼──────────────────────────────┼──────────┼──────┤ Ш
.]h
.begin
   NomPp :=NomPp + 1;
   Sum   :=Sum   + Цена;
end.
 Ш│&&&&&║&&&&&&&&&&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@│&'#&&&&&&&&&&&&.&&║@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@│@@@@@@│ Ш
.[f
 Ш└─────╨─────────────┴────────────────────────────────────────────────┴─────────┴──────────────────╨────────────────────────────────────────────────────┴────────┴──────────────────────────────┴──────────┴──────┘ Ш
.]f
.}

.fields
  DoubletoString(0, FRoundRub5(Sum))
.endfields
 ИИмущество на сумму  З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ П

 ИОтчет с документами принял и проверил _____________________________  ___________________  ____________________________ И
 И                                                должность                  подпись             расшифровка подписи И

 ИМатериально ответственное лицо        _____________________________  ___________________  ____________________________ И
 И                                                должность                  подпись             расшифровка подписи И
.endform


#doc
Печать информации о выносе имущества
#end
.LinkForm 'Отчет о выносе имущества (6)' prototype is imGap
.Group 'All_E_FIO'
.DEFO LANDSCAPE
.p 55
.var
  NomPp :Word;
  Sum   :Double;
.endvar
.fields
  CommonFormHeader

  Организация

  Корпус0
  'все этажи'
  'все лица'

  'с '  + DateToStr(Дата_начала,    'DD mon YYYY г.') +
  ' по ' + DateToStr(Дата_окончания, 'DD mon YYYY г.')

!.{
   String(NomPp) + '.'

   БарКод_МЦ
   Название_МЦ

   ЕдиницаОтп

   Цена

   ФИО
   Таб_N

   Этаж

   DateToStr(Дата_действия_пропуска,  'DD/MM/YYYY')
   TimeToStr(Время_действия_пропуска, 'HH:MM')
!.}
.endfields
^

Организация      З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З
Корпус           З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З
Этаж             З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З
Вынос произвел   З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З


                                   ОТЧЕТ О ВЫНОСЕ ИМУЩЕСТВА №____________
 И@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И


.{
.[h OverWrite
 Ш┌─────╥─────────────┬────────────────────────────────────────────────┬─────────┬──────────────────╥────────────────────────────────────────────────────┬────────┬──────────────────────────────┬──────────┬──────┐ Ш
 Ш│  №  ║Учетный номер│             Наименование имущества             │ Единица │    Стоимость     ║                   Вынос произвел                   │ Табель-│             Этаж             │   Дата   │Время │ Ш
 Ш│ п/п ║  имущества  │                                                │измерения│                  ║               фамилия, имя, отчество               │  ный № │                              │  выноса  │выноса│ Ш
 Ш├─────╫─────────────┼────────────────────────────────────────────────┼─────────┼──────────────────╫────────────────────────────────────────────────────┼────────┼──────────────────────────────┼──────────┼──────┤ Ш
.]h
.begin
   NomPp :=NomPp + 1;
   Sum   :=Sum   + Цена;
end.
 Ш│&&&&&║&&&&&&&&&&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@│&'#&&&&&&&&&&&&.&&║@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@│@@@@@@│ Ш
.[f
 Ш└─────╨─────────────┴────────────────────────────────────────────────┴─────────┴──────────────────╨────────────────────────────────────────────────────┴────────┴──────────────────────────────┴──────────┴──────┘ Ш
.]f
.}

.fields
  DoubletoString(0, FRoundRub5(Sum))
.endfields
 ИИмущество на сумму  З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ П

 ИОтчет с документами принял и проверил _____________________________  ___________________  ____________________________ И
 И                                                должность                  подпись             расшифровка подписи И

 ИМатериально ответственное лицо        _____________________________  ___________________  ____________________________ И
 И                                                должность                  подпись             расшифровка подписи И
.endform


#doc
Печать информации о выносе имущества
#end
.LinkForm 'Отчет о выносе имущества (7)' prototype is imGap
.Group 'All_K_E_FIO'
.DEFO LANDSCAPE
.p 55
.var
  NomPp :Word;
  Sum   :Double;
.endvar
.fields
  CommonFormHeader

  Организация

  'все корпуса'
  'все этажи'
  'все лица'

  'с '  + DateToStr(Дата_начала,    'DD mon YYYY г.') +
  ' по ' + DateToStr(Дата_окончания, 'DD mon YYYY г.')

!.{
   String(NomPp) + '.'

   БарКод_МЦ
   Название_МЦ

   ЕдиницаОтп

   Цена

   ФИО
   Таб_N

   Корпус
   Этаж

   DateToStr(Дата_действия_пропуска,  'DD/MM/YYYY')
   TimeToStr(Время_действия_пропуска, 'HH:MM')
!.}
.endfields
^

Организация      З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З
Корпус           З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З
Этаж             З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З
Вынос произвел   З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З


                                   ОТЧЕТ О ВЫНОСЕ ИМУЩЕСТВА №____________
 И@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И


.{
.[h OverWrite
 Ш┌─────╥─────────────┬──────────────────────────────────────┬───────┬────────────────╥────────────────────────────────────────┬────────┬────────────────────────────┬────────────────────────────┬──────────┬──────┐ Ш
 Ш│  №  ║Учетный номер│        Наименование имущества        │Единица│   Стоимость    ║             Вынос произвел             │ Табель-│           Корпус           │            Этаж            │   Дата   │Время │ Ш
 Ш│ п/п ║  имущества  │                                      │измер. │                ║         фамилия, имя, отчество         │  ный № │                            │                            │  выноса  │выноса│ Ш
 Ш├─────╫─────────────┼──────────────────────────────────────┼───────┼────────────────╫────────────────────────────────────────┼────────┼────────────────────────────┼────────────────────────────┼──────────┼──────┤ Ш
.]h
.begin
   NomPp :=NomPp + 1;
   Sum   :=Sum   + Цена;
end.
 Ш│&&&&&║&&&&&&&&&&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@│&'#&&&&&&&&&&.&&║@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@│@@@@@@│ Ш
.[f
 Ш└─────╨─────────────┴──────────────────────────────────────┴───────┴────────────────╨────────────────────────────────────────┴────────┴────────────────────────────┴────────────────────────────┴──────────┴──────┘ Ш
.]f
.}

.fields
  DoubletoString(0, FRoundRub5(Sum))
.endfields
 ИИмущество на сумму  З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ П

 ИОтчет с документами принял и проверил _____________________________  ___________________  ____________________________ И
 И                                                должность                  подпись             расшифровка подписи И

 ИМатериально ответственное лицо        _____________________________  ___________________  ____________________________ И
 И                                                должность                  подпись             расшифровка подписи И
.endform
