! ╔═════════════════════════════════════════════════════════════════════════╗
! ║  Разработал:  Голец Дмитрий Иванович                                    ║
! ║  Назначение:  наличие резерва для розничной торговли                    ║
! ╚═════════════════════════════════════════════════════════════════════════╝
!
#doc
Наличие резерва для розничной торговли
#end
.set name='RezervRZ'
.hide
.fields

!.{
!.if FirstRec
!.{
   дата_сегодня:date
   дата_начала:date
   дата_окончания:date
   подразделение_общ:string
   мол_общ:string
!.}
!.end

!.if NeedMC
!.{
   мц_название:string
   мц_код:string
!.}
!.end

!.if NeedPodrMol
!.{
   подразделение:string
   мол:string
!.}
!.end
!.if NeedDo
!.{
   КУТ_номер:string
   ДО_номер:string
   количество:double
   ед_измерения:string
   резерв_с:date
   резерв_по:date
   статус:boolean
   оплачено:double
!.}
!.end
!.}
.endfields

-------------------------------------------------------------------------------

   дата_сегодня   :date         ^
   дата_начала    :date         ^
   дата_окончания :date         ^
   подразделение  :string       ^
   мол            :string       ^

.{ //**************
.if NeedMC
!.{
   мц_название    :string       ^
   мц_код         :string       ^
!.}
.end

.if NeedPodrMol
!.{
   подразделение  :string       ^
   мол            :string       ^
!.}
.end

.{
.if NeedDo
   КУТ_номер      :string       ^
   ДО_номер       :string       ^
   количество     :double       ^
   ед_измерения   :string       ^
   резерв_с       :date         ^
   резерв_по      :date         ^
   статус         :boolean      ^
   оплачено       :double       ^
.end
.}

.} //********

.endform


//**************************************************************************
#doc
Протокол наличия резерва
#end
.linkform 'RezervRZ_1' prototype is 'RezervRZ'
.nameInList 'Протокол наличия резерва'
.PAPER PA4
.ORIENT PORTRAIT
.LL 60
.fields
  CommonFormHeader
!.{
!.if FirstRec
!.{
   if (дата_начала=date(0,0,0),'',' с ' + datetostr(дата_начала,'DD/MM/YYYY'))
   if (дата_окончания=date(0,0,0),'',' по ' + datetostr(дата_окончания,'DD/MM/YYYY'))
   подразделение_общ
   мол_общ
!.}
!.end

!.if NeedMC
!.{
   мц_название
   мц_код
!.}
!.end

!.if NeedPodrMol
!.{
   подразделение
   мол
!.}
!.end

!.if NeedDo
!.{
   КУТ_номер
   ДО_номер
   количество
   ед_измерения
   резерв_с
   резерв_по
   if(not статус,'','ДА')
   if(оплачено=0,'','ДА')
!.}
!.end
!.}
.endfields
^
!.if FirstRec
!.


 Б                 ПРОТОКОЛ НАЛИЧИЯ РЕЗЕРВА
 Й                 за период ^ ^ И

 Подразделение                 :  Б^ Б
 Материально ответственное лицо:  Б^ Б

.{ //******
.[H OverWrite
 И───────┬───────┬──────────────┬─────────┬─────────────────────┬────────────┬────────
       │       │              │         │  Зарезервировано    │            │
 КУТ № │ ДО №  │  Количество  │ Единица ├──────────┬──────────┤ Просрочено │ Оплата
       │       │              │измерения│   с      │  по      │            │
───────┴───────┴──────────────┴─────────┴──────────┴──────────┴────────────┴────────
!@@@@@@ @@@@@@  &&&&&&&&&&.&&& @@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@@ @@@@@@@@ И
.]H
!.}
!.end
.if NeedMC
!.{

 Ш МЦ:  Б^ Б  Номен. номер:  Б^ Б
 ............................................................................. Ш
!.}
.end
.if NeedPodrMol
!.{
 Ш подразделение:  Б^ Б  мол:  Б^ Щ
!.}
.end
.{
.if NeedDO
 И @@@@@@  @@@@@@ &&&&&&&&&&.&&& @@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@     @@@@@      @@@@ И
.end
.}
.} ///****
.endform
