//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.84 - Финансовый контур
// Классификатор КПП, справочники модуля Ведение налоговых расчетов
//------------------------------------------------------------------------------

#doc
 Каталог классификатор КПП базовая форма
#end

.Set name = 'KatKod'
.NameInList ' Каталог классификатора КПП базовая форма '
.Hide
.Fields
  KatKod_nRec    : comp
  Заголовок_Клас : string
  Заголовок_Кода : string

  НАИМЕНОВАНИЕ1  : string : 'T:-'
  КОД1           : string
  ПОЛУЧАТЕЛЬ1    : string
  ПЛАТЕЖ_ЗА1     : string

  НАИМЕНОВАНИЕ2  : string : 'T:-'
  КОД2           : string
  ПОЛУЧАТЕЛЬ2    : string
  ПЛАТЕЖ_ЗА2     : string
.EndFields
.{
^^^
.{ CheckEnter
.case
.when KatKodMaster
^^^^
.when KatKodSlave
^^^^
.END
.}
.}
.endform

!------------------------------------------------------------------------------------------------------------------------------------------------------
.LinkForm 'KatKod_01' Prototype Is 'KatKod'
.Group 'Классификатор КПП'
.NameInList 'Классификатор КПП'
.Fields
  CommonFormHeader
  Заголовок_Клас
  НАИМЕНОВАНИЕ1 : 'T:-'
  КОД1
  ПОЛУЧАТЕЛЬ1
  ПЛАТЕЖ_ЗА1
  НАИМЕНОВАНИЕ2 : 'T:-'
  КОД2
  ПОЛУЧАТЕЛЬ2
  ПЛАТЕЖ_ЗА2
.EndFields
.[H Skip
 Р                                                                                                                      лист @np@
──────────────────────────────────────────────────────────┬──────────────────┬─────────────────────────┬─────────────────────────
                      Наименование                        │        КПП       │        Получатель       │         Платеж за
──────────────────────────────────────────────────────────┼──────────────────┼─────────────────────────┼───────────────────────── Р
.]H
 Р ^ Р

 Б ^ Б
 Р                                                                                                                      лист @np@
──────────────────────────────────────────────────────────┬──────────────────┬─────────────────────────┬─────────────────────────
                      Наименование                        │        КПП       │        Получатель       │         Платеж за
──────────────────────────────────────────────────────────┼──────────────────┼─────────────────────────┼───────────────────────── Р
.{
.{ CheckEnter
.case
.when KatKodMaster
 Р Б @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б│ Б @@@@@@@@@@@@@@@@  Б│ Б @@@@@@@@@@@@@@@@@@@@@@@  Б│ Б @@@@@@@@@@@@@@@@@@@@@@@  Б Р
.when KatKodSlave
 Р @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│ @@@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@  Р
.end
.}
.}
 Р──────────────────────────────────────────────────────────┴──────────────────┴─────────────────────────┴───────────────────────── Р
.EndForm

!------------------------------------------------------------------------------------------------------------------------------------------------------
.LinkForm 'KatKod_02' Prototype Is 'KatKod'
.Group 'Классификатор ГНИ/УНН'
.NameInList 'Классификатора ГНИ/УНН'
.Fields
  Заголовок_Кода
  CommonFormHeader
  Заголовок_Клас
  Заголовок_Кода
  НАИМЕНОВАНИЕ1 : 'T:-'
  КОД1
  ПОЛУЧАТЕЛЬ1
  НАИМЕНОВАНИЕ2 : 'T:-'
  КОД2
  ПОЛУЧАТЕЛЬ2
.EndFields
.[H Skip
 Р                                                                                             лист @np@
──────────────────────────────────────────────────────────┬──────────────────┬──────────────────────────
                      Наименование                        │        @@@       │        Получатель
──────────────────────────────────────────────────────────┼──────────────────┼────────────────────────── Р
.]H
 Р ^ Р

 Б ^ Б
 Р                                                                                             лист @np@
──────────────────────────────────────────────────────────┬──────────────────┬──────────────────────────
                      Наименование                        │        @@@       │        Получатель
──────────────────────────────────────────────────────────┼──────────────────┼────────────────────────── Р
.{
.{ CheckEnter
.case
.when KatKodMaster
 Р Б @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б│ Б @@@@@@@@@@@@@@@@  Б│ Б @@@@@@@@@@@@@@@@@@@@@@@  Б Р
.when KatKodSlave
 Р @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│ @@@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@  Р
.end
.}
.}
 Р──────────────────────────────────────────────────────────┴──────────────────┴───────────────────────── Р
.EndForm

!------------------------------------------------------------------------------------------------------------------------------------------------------
.LinkForm 'KatKod_03' Prototype Is 'KatKod'
.Group 'Классификатор Кодов'
.NameInList 'Классификаторов Кодов'
.Fields
  CommonFormHeader
  Заголовок_Клас
  НАИМЕНОВАНИЕ1 : 'T:-'
  КОД1
  НАИМЕНОВАНИЕ2 : 'T:-'
  КОД2
.EndFields
.[H Skip
 Р                                                                   лист @np@
──────────────────────────────────────────────────────────┬───────────────────
                      Наименование                        │        Код
──────────────────────────────────────────────────────────┼─────────────────── Р
.]H
 Р ^ Р

 Б ^ Б
 Р                                                                   лист @np@
──────────────────────────────────────────────────────────┬───────────────────
                      Наименование                        │        Код
──────────────────────────────────────────────────────────┼─────────────────── Р
.{
.{ CheckEnter
.case
.when KatKodMaster
 Р Б @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б│ Б @@@@@@@@@@@@@@@@  Б Р
.when KatKodSlave
 Р @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│ @@@@@@@@@@@@@@@@  Р
.end
.}
.}
 Р──────────────────────────────────────────────────────────┴────────────────── Р
.EndForm
