/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,2004 корпорация ГАЛАКТИКА                    ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Оперативный контур                                        ║
 ║ Версия        : 5.85                                                      ║
 ║ Назначение    : Отчет намичия пакетов МЦ                                  ║
 ║ Ответственный : Швайковский Дмитрий Владимирович                          ║
 ║ Параметры     : нет                                                       ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
#doc
Отчет намичия пакетов МЦ
#end
.set name = 'rtNalPak'
.hide
.fields
 dDate :date
 MCPakNRec    :comp MCPakName    :string
 PakPodrNrec  :comp PakPodrName  :string
 PakMOLNrec   :comp PakMOLName   :string
 PakPartyNrec :comp PakPartyName :string
 PakKol :double PakEdIzm :string PakPrice :double PakSum :double

 MCNRec :comp MCName :string MCBarKod :string
 MCPartyNRec :comp MCPartyName :string
 MCKol :double MCAllKol :double MCEdIzm :string MCPrice :double MCSum :double

.endfields
^
.{
 ^ ^ ^ ^ ^ ^ ^ ^
  ^ ^ ^ ^
.{
 ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.}
.endform

#doc
Наличие пакетов МЦ (в НДЕ)
#end
.linkform 'rtNalPak_01' prototype is 'rtNalPak'
.NameInList ' Наличие пакетов МЦ (в НДЕ)'
.fields
 dDate
.endfields
 Б
 Р                    ВЕДОМОСТЬ НАЛИЧИЕ ПАКЕТОВ МЦ
                        на ^
 С
.fields
 MCPakName
 PakPodrName PakMOLName PakPartyName
 PakPrice PakKol PakEdIzm PakSum
.endfields
.{
 Р Пакет: @@@@@@@@@@@@@@@@@@@@@@@@@@
┌──────────────────┬─────────────────┬──────────────────┬───────────────┬───────────────┬──────────┬──────────────┐
│  Подразделение   │       МОЛ       │    Партия        │ Цена в руб.   │    Кол-во     │ Ед. изм. │ Сумма в руб. │
└──────────────────┴─────────────────┴──────────────────┴───────────────┴───────────────┴──────────┴──────────────┘
 @@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&.&& &'&&&&&&&&&&&&& @@@@@@@@@@ &'&&&&&&&&&&.&&
 Состав пакета:
┌─────────────────┬──────────────────┬───────────────┬───────────────┬───────────────┬──────────┬──────────────┐
│  Мат. ценность  │    Партия        │ Цена в руб.   │   Кол-во в 1  │ Общее кол-во  │ Ед. изм. │ Сумма в руб. │
└─────────────────┴──────────────────┴───────────────┴───────────────┴───────────────┴──────────┴──────────────┘ Р
.fields
 MCName MCPartyName
 MCPrice MCKol MCAllKol MCEdIzm MCSum
.endfields
.{
 Р @@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&.&& &'&&&&&&&&&&&&& &'&&&&&&&&&&&&& @@@@@@@@@@ &'&&&&&&&&&&.&& Р
.}

 Р------------------------------------------------------------------------------------------------------------------- Р

.}
.endform