! Возраст складских запасов
! Склад - Отчеты

#doc
Возраст складских запасов
#end
.Set Name = 'VozSklOs'
.hide
.fields
  data : string
  val  : string
!.{
  podr
!.{
  PodrName : string
  f1  : string
  f2  : string
  f3
  f4
  f5  : double
  f6  : double
  f7  : double
  f8
  f9
  f10 : double
  f11 : double
  f12 : double
  f13 : double
  f14 : double
  f15 : double
  f16 : double
  f17 : double
  f17a: double
  f18 : double
  f18a: double
  f19 : double
  f20 : double
  f21 : double
  f22 : double
  f23 : double
  f23a: double
  f23b: double
  f24
  f25 : double
  prnzayv : boolean
!.{
  zname
  zkol : double
!.}
!.}
!.{
  ipodr
  i1 : double
  i2 : double
  i3 : double
  i4 : double
  i5 : double
  i6 : double
  i7 : double
  i8 : double
  i9 : double
  i10: double
  i11: double
  i12: double
!.}
.endfields

  ^ ^
.{
.{
  ^
.}
.{
  ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.{
  ^ ^
.}
.}
.{
  ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.}
.endform

#doc
Возраст складских запасов
#end
.linkform 'VozSklOs_02' prototype is 'VozSklOs'
.nameInList 'Возраст складских запасов'
.group 'Возраст складских запасов'
.DEFO landscape
!.group 'gr1'
.fields
  data
  val
!.{
!.{
  podr
!.}
!.{
  f1
  f2
  f3
  f4
  f5
  f6
  f7
  f8
  f9
  f10
  f11
  f12
  f13
  f14
  f15
  f16
  f17
  f17a
  f18
  f18a
  f19
  f20
  f21
  f22
  f23
  f23a
  f23b
  f24
  f25
!.}
!.{
  zname
  zkol
!.}
!.{
  ipodr
  i1
  i2
  i3
  i4
  i5
  i6
  i7
  i8
  i9
  i10
  i11
  i12
!.}
!.}
.endfields


   Б Возраст запасов Б
    ^
    ^
 Ш
──────┬──────────┬──────────────┬─────────┬────────┬─────────┬─────────┬──────────┬──────────┬───────┬────────────────────────┬─────────────────┬──────────────┬──────────────┬───────────────────────┬──────────────────────┬───────────────────────────
      │          │              │         │        │         │         │          │          │Колво  │Возраст скл.остатков,дн.│    Расход за    │ Нормативный  │ Минимальный  │Сверхнормат. запасы,дн.│         Итого        │            Заявки
 Бух/ │ Номенклат│ Наименование │         │        │         │ Сальдо  │   Дата   │   Дата   │месяцев├─────┬─────┬────────────┤    год по ДР    │несниж-й запас│нормат-й запас├─────┬─────┬───────────┤ сверхнормат. запасов ├──────────────────┬────────
 счет │  номер   │     ТМЗ      │  ЕдИзм  │ Кол-во │   Цена  │  на ДР  │последней │ последн. │от даты│до 1 │свыше│в том числе ├────────┬────────┼──────┬───────┼──────┬───────┤ до 1│ свыш│ в том ч.  ├──────┬───────┬───────┤                  │
      │          │              │         │        │         │         │ поставки │ расхода  │последн│года │  1  ├─────┬──────┤        │        │      │       │      │       │ года│ 1   ├─────┬─────┤      │       │       │     подраз-      │ Кол-во
      │          │              │         │        │         │         │          │          │поставк│вкл. │ года│пред │более │ кол-во │ сумма  │в днях│в сумме│кол-во│в сумме│ вкл.│ года│ пред│бол. │в днях│кол-во │ сумма │     деление      │
      │          │              │         │        │         │         │          │          │до ДР  │     │     │года │ранние│        │        │      │       │      │       │     │     │ года│ран. │      │       │       │                  │
──────┼──────────┼──────────────┼─────────┼────────┼─────────┼─────────┼──────────┼──────────┼───────┼─────┼─────┼─────┼──────┼────────┼────────┼──────┼───────┼──────┼───────┼─────┼─────┼─────┼─────┼──────┼───────┼───────┼──────────────────┼────────
   1  │     2    │      3       │    4    │   5    │    6    │    7    │    8     │    9     │   10  │ 11  │ 12  │ 13  │  14  │   15   │   16   │  17  │  17а  │  18  │  18а  │ 19  │ 20  │ 21  │ 22  │  23  │  23a  │  23b  │        24        │   25
──────┼──────────┼──────────────┼─────────┼────────┼─────────┼─────────┼──────────┼──────────┼───────┼─────┼─────┼─────┼──────┼────────┼────────┼──────┼───────┼──────┼───────┼─────┼─────┼─────┼─────┼──────┼───────┼───────┼──────────────────┼──────── Ш
.{
.{
 Б^ Б
.}
.{
 Ш@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@@│@@@@@@@@@│&&&&&.&&│&&&&&&.&&│&&&&&&.&&│@@@@@@@@@@│@@@@@@@@@@│&&&&.&&│&&&&&│&&&&&│&&&&&│&&&&&&│&&&&.&&&│&&&&&.&&│&&&&&&│&&&&.&&│&&&&&&│&&&&.&&│&&&&&│&&&&&│&&&&&│&&&&&│&&&&&&│&&&&&&&│&&&&&&&│@@@@@@@@@@@@@@@@@@│&&&&&.&& Ш
.{
.{?internal; prnzayv
 Ш                                                                                                                                                                                                                             │@@@@@@@@@@@@@@@@@@│&&&&&.&& Ш
.}
.}
.}
.{
 Ш Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&│&&&&&│&&&&&│&&&&&&│    X   │&&&&&.&&│   X  │   X   │   X  │   X   │&&&&&│&&&&&│&&&&&│&&&&&│&&&&&&│&&&&&&&│&&&&&&&│         X        │   X Щ
.}
.}

.endform

#doc
Возраст складских запасов
#end
.linkform 'VozSklOs_04' prototype is 'VozSklOs'
.nameInList 'Возраст складских запасов'
.group 'Возраст складских запасов1'
.DEFO landscape
!.group 'gr1'
.fields
  data
  val
!.{
!.{
  podr
!.}
!.{
  PodrName
  f1
  f2
  f3
  f4
  f5
  f6
  f7
  f8
  f9
  f10
  f11
  f12
  f13
  f14
  f15
  f16
  f17
  f17a
  f18
  f18a
  f19
  f20
  f21
  f22
  f23
  f23a
  f23b
  f24
  f25
!.}
!.{
  zname
  zkol
!.}
!.{
  ipodr
  i1
  i2
  i3
  i4
  i5
  i6
  i7
  i8
  i9
  i10
  i11
  i12
!.}
!.}
.endfields


   Б Возраст запасов Б
    ^
    ^
 Ш
──────────┬──────┬──────────┬──────────────┬───────┬────────┬─────────┬─────────┬──────────┬──────────┬───────┬────────────────────────┬────────────────┬──────────────┬──────────────┬──────────────────────┬──────────────────────┬────────────────────
          │      │          │              │       │        │         │         │          │          │Кол-во │Возраст скл.остатков,дн.│    Расход за   │ Нормативный  │ Минимальный  │Сверхнормат.запасы,дн.│         Итого        │      Заявки
   Склад  │ Бух/ │ Номенклат│ Наименование │       │        │         │ Сальдо  │   Дата   │   Дата   │месяцев├─────┬─────┬────────────┤    год по ДР   │несниж-й запас│нормат-й запас├─────┬─────┬──────────┤ сверхнормат. запасов ├───────────┬────────
          │ счет │  номер   │     ТМЗ      │ ЕдИзм │ Кол-во │   Цена  │  на ДР  │последней │ последн. │от даты│до 1 │свыше│в том числе ├───────┬────────┼──────┬───────┼──────┬───────┤ до 1│ свыш│ в том ч. ├──────┬───────┬───────┤           │
          │      │          │              │       │        │         │         │ поставки │ расхода  │последн│года │  1  ├─────┬──────┤       │        │      │       │      │       │ года│ 1   ├─────┬────┤      │       │       │  подраз-  │ Кол-во
          │      │          │              │       │        │         │         │          │          │поставк│вкл. │ года│пред │более │ кол-во│ сумма  │в днях│в сумме│кол-во│в сумме│ вкл.│ года│ пред│бол.│в днях│кол-во │ сумма │  деление  │
          │      │          │              │       │        │         │         │          │          │до ДР  │     │     │года │ранние│       │        │      │       │      │       │     │     │ года│ран.│      │       │       │           │
──────────┼──────┼──────────┼──────────────┼───────┼────────┼─────────┼─────────┼──────────┼──────────┼───────┼─────┼─────┼─────┼──────┼───────┼────────┼──────┼───────┼──────┼───────┼─────┼─────┼─────┼────┼──────┼───────┼───────┼───────────┼────────
     1    │   2  │     3    │      4       │   5   │   6    │    7    │    8    │    9     │    10    │   11  │ 12  │ 13  │ 14  │  15  │   16  │   17   │  18  │  18а  │  19  │  19а  │ 20  │ 21  │ 22  │ 23 │  24  │  24a  │  24b  │     25    │   26
──────────┼──────┼──────────┼──────────────┼───────┼────────┼─────────┼─────────┼──────────┼──────────┼───────┼─────┼─────┼─────┼──────┼───────┼────────┼──────┼───────┼──────┼───────┼─────┼─────┼─────┼────┼──────┼───────┼───────┼───────────┼──────── Ш
.{
.{
 Б^ Б
.}
.{
 Ш@@@@@@@@@@│@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@@│@@@@@@@│&&&&&.&&│&&&&&&.&&│&&&&&&.&&│@@@@@@@@@@│@@@@@@@@@@│&&&&.&&│&&&&&│&&&&&│&&&&&│&&&&&&│&&&&.&&│&&&&&.&&│&&&&&&│&&&&.&&│&&&&&&│&&&&.&&│&&&&&│&&&&&│&&&&&│&&&&│&&&&&&│&&&&&&&│&&&&&&&│@@@@@@@@@@@│&&&&&.&& Ш
.{
.{?internal; prnzayv
 Ш                                                                                                                                                                                                                        │@@@@@@@@@@@@@@@@@@│&&&&&.&& Ш
.}
.}
.}
.{
 Ш Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&│&&&&&│&&&&&│&&&&&&│   X   │&&&&&.&&│   X  │   X   │   X  │   X   │&&&&&│&&&&&│&&&&&│&&&&│&&&&&&│&&&&&&&│&&&&&&&│     X     │   X Щ
.}
.}

.endform
