//******************************************************************************
//                                                      (c) корпорация Галактика
// Галактика 5.8 - Бухгалтерский контур
// Отчет о наличии данных для удаления ссылок ТХО
//******************************************************************************

#doc
Протокол контроля данных для удаления ссылок ТХО (скрытая базовая форма)
#end
.set name = 'deltxo'
.nameinlist 'Протокол контроля данных для удаления ссылок ТХО (Базовая форма)'
.hide
.fields
  Period
  TiDkGalName
  RegUch
  SoprHozNrec
  DocName
  TXO
.endfields
  Period      ^
  TiDkGalName ^
  RegUch      ^
.{
  SoprHozNrec ^
  DocName     ^
  TXO         ^
.}
.endform

#doc
Протокол контроля данных для удаления ссылок ТХО
#end
.linkform 'deltxo_01' prototype is 'deltxo'
.nameinlist 'Протокол контроля данных для удаления ссылок ТХО'
.fields
  CommonFormHeader
  Period
  TiDkGalName
  RegUch
  DocName
  TXO
.endfields

 Р^
 Б                                               Протокол контроля данных для удаления ссылок ТХО
                                               ^ С
 Р
Тип документа: ^
Регистр учета: ^
 Б ───────────────────────────────────────────┬────────────────────────────────────────────────────────────────────────────────────
          Дата и номер документа            │                                     ТХО для удаления
 ───────────────────────────────────────────┴──────────────────────────────────────────────────────────────────────────────────── С
 Р.{
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.} Р
.endform
