//********************************************************************************
//                                                        (c) корпорация Галактика
// Галактика 5.8 - Бухгалтерский контур
// Протокол расчетов по ТХО (линейный)
//********************************************************************************

#doc
Протокол расчета по ТХО (скрытая базовая форма)
#end
.set name = 'txolog'
.nameinlist 'Протокол расчета по ТХО (Базовая форма)'
.hide
.fields
  TxoTag
  TxoMesage
.endfields
.{
   TxoTag     ^
   TxoMesage  ^
.}
.endform

#doc
Протокол расчета по ТХО
#end
.linkform 'txolog_01' prototype is 'txolog'
.defo landscape
.nameinlist 'Протокол расчета по ТХО'
.fields
  CommonFormHeader
  TxoTag
  TxoMesage
.endfields

^
                                  БПротокол расчетов по ТХО Б

   Тег        │   Сообщение
 ─────────────┼─────────────────────────────────────────────────────────────────────────────────
.{
 @@@@@@@@@@@@ │ ^
.}
.endform
