//********************************************************************************
//                                                        (c) корпорация Галактика
// Галактика 5.8 - Бухгалтерский контур
// Протокол расчетов по ТХО (структурированный)
//********************************************************************************

#doc
Структурированный протокол расчета по ТХО (скрытая базовая форма)
#end
.set name = 'txologstruct'
.nameinlist 'Протокол расчета по ТХО (Базовая форма)'
.hide
.fields

cSoprHoz      : comp
NameDoc       : string

cHozOper      : comp
NameTXO       : string

KodRegPlSchCl : word
KodPlSchCl    : string
NamePlSchCl   : string
VidSaldo      : string
SchCl         : string
SubSchCl      : string
KauListCl     : string
PodrCl        : string
SumNdeCl      : double
SumValCl      : double
NameValCl     : string
SumKolCl      : double
EdKolCl       : string
DataSaldo     : date

cOborot       : comp
KodRegPlSch   : word
KodPlSch      : string
NamePlSch     : string
SchO          : string
SubSchO       : string
KauListO      : string
PodrO         : string
SchK          : string
SubSchK       : string
KauListK      : string
PodrK         : string
SumNDE        : double
SumVal        : double
NameVal       : string
SumKol        : double
EdKol         : string
DataProv      : date
SodPorv       : string

cFpOborot     : comp
KodRegPlSchF  : word
KodPlSchF     : string
NamePlSchF    : string
StBud         : string
CO            : string
NumKau        : word
Kau           : string
SumNdeF       : double
SumValF       : double
NameValF      : string
SumKolF       : double
EdKolF        : string
Period        : string
SodPorvF      : string

Nomer         : string
Key           : string
AlgNdeKey     : string
AlgValKey     : string
AlgKolKey     : string
SumNdeKey     : string
SumValKey     : string
SumKolKey     : string

DebugTeg      : string
DebugMsg      : string

.endfields

 Протокол расчетов по ТХО
.{
.case
.when HozDocum
 Nrec хозяйственного документа: ^
 Хозяйственный документ: ^
.when TXO
 Nrec шаблона ТХО: ^
 Шаблон ТХО: ^
.when TypeProvStorno
 Сторнирующие проводки:
.when TypeProvNew
 Новые проводки:
.when Saldo

   САЛЬДО:
   Общесистемный код регистра учета: ^
   Код плана счетов: ^
   Наименование плана счетов: ^
   Вид сальдо: @@@@@@ счет: ^ субсчет: ^
   КАУ: ^
   Подразделение: ^
   Сумма в НДЕ:   &'&&&&&&&&&&&&.&&
   Сумма в валюте:&'&&&&&&&&&&&&.&& валюта: ^
   Количество:    &'&&&&&&&&&&&&&&& единица измерения: ^
   Дата сальдо:   @@@@@@@@@@
.when BuhProvodka

   Nrec бухпроводки: ^
   Общесистемный код регистра учета: ^
   Код плана счетов: ^
   Наименование плана счетов: ^
   ДЕБЕТ:  счет: ^ субсчет: ^
   КАУ: ^
   Подразделение: ^
   КРЕДИТ: счет: ^ субсчет: ^
   КАУ: ^
   Подразделение: ^
   Сумма в НДЕ:   &'&&&&&&&&&&&&.&&
   Сумма в валюте:&'&&&&&&&&&&&&.&& валюта: ^
   Количество:    &'&&&&&&&&&&&&&&& единица измерения: ^
   Дата проводки: @@@@@@@@@@
   Содержание проводки: ^
.when FinProvodka

   Nrec финпроводки: ^
   Общесистемный код регистра учета: ^
   Код регистра учета: ^
   Наименование регистра учета: ^
   Статья: ^
   ЦО:     ^
   КАУ:
.{ CheckEnter CycleKauFP
     Номер: ^ Наименование : ^
.}
   Сумма в НДЕ:   &'&&&&&&&&&&&&.&&
   Сумма в валюте:&'&&&&&&&&&&&&.&& валюта: ^
   Количество:    &'&&&&&&&&&&&&&&& единица измерения: ^
   Период:        ^
   Содержание:    ^
.when BegFormula

   Результаты расчета формул:
.when Formula
   No: ^
   Ключ : ^
   Алгоритм в НДЕ:      ^
   Алгоритм в валюте:   ^
   Алгоритм количества: ^
   Сумма в НДЕ:         ^
   Сумма в валюте:      ^
   Количество:          ^
.when EndFormula
.when DebugMessage
 @@@@@@@@@@@@  ^
.end
.}

.endform

#doc
Структурированный протокол расчета по ТХО
#end
.linkform 'txologstruct_01' prototype is 'txologstruct'
.nameinlist 'Структурированный протокол расчета по ТХО'
.fields

CommonFormHeader

NameDoc

NameTXO

KodPlSchCl:'P:R'
NamePlSchCl
VidSaldo
SchCl
SubSchCl
KauListCl
PodrCl
SumNdeCl
SumValCl
NameValCl
SumKolCl
EdKolCl
DataSaldo

KodPlSch:'P:R'
NamePlSch
SchO
SubSchO
SchK
SubSchK
KauListO
KauListK
PodrO
PodrK
SumNDE
SumVal
NameVal
SumKol
EdKol
DataProv
SodPorv

namePlSchF
StBud
CO
NumKau Kau
SumNdeF
SumValF
NameValF
SumKolF
EdKolF
Period
SodPorvF

Nomer
Key
AlgNdeKey
SumNdeKey
AlgValKey
SumValKey
AlgKolKey
SumKolKey

DebugTeg DebugMsg

.endfields

 И^
 Б                                    Протокол расчетов по ТХО Й
 И
.{
.case
.when HozDocum

 Хозяйственный документ: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.when TXO                                                                                  
 Шаблон ТХО: ^
.when TypeProvStorno
 Сторнирующие проводки:
.when TypeProvNew
 Новые проводки:
.when Saldo
  ┌─────────────────────────────────────────────────────────────────────────────────────────┐
  │ САЛЬДО:                                                                                 │
  ├─────────────────────────────────────────────────────────────────────────────────────────┤
  │ План счетов: @@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
  ├─────────────────────────────────────────────────────────────────────────────────────────┤
  │ @@@@@@: @@@@@@@@@@ @@@@@@@@@@                                                           │
  │ КАУ: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
  │ Подразделение: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
  ├─────────────────────────────────────────────────────────────────────────────────────────┤
  │ Сумма в НДЕ:    &'&&&&&&&&&&&&.&&                                                       │
  │ Сумма в валюте: &'&&&&&&&&&&&&.&& &&&&&&&&&&&                                           │
  │ Количество:     &'&&&&&&&&&&&&&&& &&&&&&&&&&&                                           │
  │ Дата сальдо:    @@@@@@@@@@                                                              │
  └─────────────────────────────────────────────────────────────────────────────────────────┘
.when BuhProvodka
  ┌─────────────────────────────────────────────────────────────────────────────────────────┐
  │ План счетов: @@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
  ├────────────────────────────────────────────┬────────────────────────────────────────────┤
  │ ДЕБЕТ: @@@@@@@@@@ @@@@@@@@@@               │ КРЕДИТ: @@@@@@@@@@ @@@@@@@@@@              │
  │ КАУ: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│ КАУ: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
  │ Подразделение: @@@@@@@@@@@@@@@@@@@@@@@@@@@@│ Подразделение: @@@@@@@@@@@@@@@@@@@@@@@@@@@@│
  ├────────────────────────────────────────────┴────────────────────────────────────────────┤
  │ Сумма в НДЕ:    &'&&&&&&&&&&&&.&&                                                       │
  │ Сумма в валюте: &'&&&&&&&&&&&&.&& &&&&&&&&&&&                                           │
  │ Количество:     &'&&&&&&&&&&&&&&& &&&&&&&&&&&                                           │
  │ Дата проводки:       @@@@@@@@@@                                                         │
  │ Содержание проводки: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
  └─────────────────────────────────────────────────────────────────────────────────────────┘
.when FinProvodka
  ┌─────────────────────────────────────────────────────────────────────────────────────────┐
  │ Регистр учета: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
  ├─────────────────────────────────────────────────────────────────────────────────────────┤
  │ Статья: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
  │ ЦО:     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
  │ КАУ:                                                                                    │
.{ CheckEnter CycleKauFP
  │      @@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
.}
  ├─────────────────────────────────────────────────────────────────────────────────────────┤
  │ Сумма в НДЕ:    &'&&&&&&&&&&&&.&&                                                       │
  │ Сумма в валюте: &'&&&&&&&&&&&&.&& &&&&&&&&&&&                                           │
  │ Количество:     &'&&&&&&&&&&&&&&& &&&&&&&&&&&                                           │
  │ Период:         @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
  │ Содержание:     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
  └─────────────────────────────────────────────────────────────────────────────────────────┘
.when BegFormula
  ┌─────────────────────────────────────────────────────────────────────────────────────────┐
  │ Результаты расчета формул:                                                              │
  ├─────┬───────────────────────────────────────────────────────────────────────────────────┤
  │ No  │ Ключ                                                                              │
  │     ├─────────────────────────────────────────────────────────────────┬─────────────────┤
  │     │ Алгоритм в НДЕ                                                  │    Результат    │
  │     │ Алгоритм в валюте                                               │                 │
  │     │ Алгоритм количества                                             │                 │
.when Formula
  ├─────┼─────────────────────────────────────────────────────────────────┴─────────────────┤
  │@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
  │     ├─────────────────────────────────────────────────────────────────┬─────────────────┤
  │     │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@│
  │     │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@│
  │     │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@│
.when EndFormula
  └─────┴─────────────────────────────────────────────────────────────────┴─────────────────┘
.when DebugMessage
 @@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.end
.}
 И
.endform
