//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.70 - Отчеты контура логистики
// Реестр сопроводительных документов
//------------------------------------------------------------------------------

#doc
Реестр сопроводительных документов
#end
.Form 'SoprRep_Prn'
.hide
.Fields
Заголовок
НП_Дата
КП_Дата
СуммаНДЕ_Имя
СуммаВал_Имя

Ветка
Ветка_Сумма
Ветка_ВалСумма

Накл_NRec         : comp
Накл_Имя
Накл_Сумма
Накл_ВалСумма

Итого_Имя
Итого_Сумма
Итого_ВалСумма

.EndFields
^ ^ ^ ^ ^
.{ CheckEnter GroupSopr
^ ^ ^
.{ CheckEnter DocSopr
^ ^ ^ ^
.}
.{ CheckEnter TotalSopr
^ ^ ^
.}
.}
.EndForm

#doc
Реестр сопроводительных документов
#end
.LinkForm 'SoprRep_Prn_01' Prototype is 'SoprRep_Prn'
.NameInList 'Реестр сопроводительных документов'
.Group 'ValNDEDoc'
.DEFP PA4
.DEFO LANDSCAPE
.P 50
.Fields

CommonFormHeader
Заголовок
НП_Дата
КП_Дата
СуммаНДЕ_Имя
СуммаВал_Имя

Ветка
Ветка_Сумма
Ветка_ВалСумма


Накл_Имя
Накл_Сумма
Накл_ВалСумма

Итого_Имя
Итого_Сумма
Итого_ВалСумма

.EndFields
 Р^ Р
 Й                                             ^
                                          за период c @@@@@@@@@@ по @@@@@@@@@@ Й
 С──────────────────────────────────────────────────────────────────────────────────────┬─────────────────────────────────────
                                          Документы                                   │                Сумма
                                                                                      ├──────────────────┬──────────────────
                                                                                      │       @@@@@      │       @@@@@
──────────────────────────────────────────────────────────────────────────────────────┴──────────────────┴────────────────── С
.{ CheckEnter GroupSopr
 Т @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Т
.{ CheckEnter DocSopr
 Р @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Р
.}
.{ CheckEnter TotalSopr
 С @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& С
.}
.}
.EndForm

#doc
Реестр сопроводительных документов в валюте отчетов
#end
.LinkForm 'SoprRep_Prn_02' Prototype is 'SoprRep_Prn'
.NameInList 'Реестр сопроводительных документов в валюте отчетов'
.Group 'ValDoc'
.DEFP PA4
.DEFO PORTRAIT
.Fields

CommonFormHeader
Заголовок
НП_Дата
КП_Дата
СуммаВал_Имя

Ветка
Ветка_ВалСумма

Накл_Имя
Накл_ВалСумма

Итого_Имя
Итого_ВалСумма

.EndFields
 Р^ Р
 Й                             ^
                          за период c @@@@@@@@@@ по @@@@@@@@@@ Й
 С──────────────────────────────────────────────────────────────────────┬───────────────────
                                 Документы                            │     Сумма,@@@@@
                                                                      │
──────────────────────────────────────────────────────────────────────┴─────────────────── С
.{ CheckEnter GroupSopr
 Т @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& Т
.{ CheckEnter DocSopr
 Р @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& Р
.}
.{ CheckEnter TotalSopr
 С @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& С
.}
.}
.EndForm

#doc
Реестр сопроводительных документов в НДЕ
#end
.LinkForm 'SoprRep_Prn_03' Prototype is 'SoprRep_Prn'
.NameInList 'Реестр сопроводительных документов в НДЕ'
.Group 'NDEDoc'
.DEFP PA4
.DEFO PORTRAIT
.Fields

CommonFormHeader
Заголовок
НП_Дата
КП_Дата
СуммаНДЕ_Имя

Ветка
Ветка_Сумма

Накл_Имя
Накл_Сумма

Итого_Имя
Итого_Сумма

.EndFields
 Р^ Р
 Й                             ^
                          за период c @@@@@@@@@@ по @@@@@@@@@@ Й
 С──────────────────────────────────────────────────────────────────────┬───────────────────
                                 Документы                            │     Сумма,@@@@@
                                                                      │
──────────────────────────────────────────────────────────────────────┴─────────────────── С
.{ CheckEnter GroupSopr
 Т @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& Т
.{ CheckEnter DocSopr
 Р @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& Р
.}
.{ CheckEnter TotalSopr
 С @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& С
.}
.}
.EndForm
