!  ╔═════════════════════════════════════════════════════════════════════╗
!  ║      Н Т О  "T O P   S O F T",  А О   "Н О В Ы Й   А Т Л А Н Т"     ║
!  ║           Проект "КАДРЫ" (с) 1998, 1999                             ║
!  ║      Версия : 5.2                                                   ║
!  ║      Разработал:  Герасимович А.А.                                  ║
!  ║      Назначение:  Форма Т-2 (СССР) Лицевой карточки работника       ║
!  ║      Параметры:                                                     ║
!  ║      Изменения:                                                     ║
!  ╚═════════════════════════════════════════════════════════════════════╝

#doc
Форма Т-2 (СССР) Лицевой карточки работника
#end
.form formt2su
.Hide
.Fields

организация
номер пол таб_номер алфавит
 Фамилия Имя Отчество
 Дата_рождения
Место_рождения_1 Место_рождения_2 Место_рождения_3
Национальность

высшее_или_среднее_образование_1
высшее_или_среднее_образование_2
высшее_или_среднее_образование_3

специальность_по_диплому_1
специальность_по_диплому_2
код_ОКСО

квалификация_по_диплому
номер_диплома  день_д месяц_д год_д

средн_или_нач_проф_образование_1
средн_или_нач_проф_образование_2
средн_или_нач_проф_образование_3

!2-я страница
основная_профессия
//код_ОКПЛТР1
вторая_профессия
//код_ОКПЛТР2

!стаж
непрерывный_стаж_д непрерывный_стаж_м непрерывный_стаж_л
общий_стаж_д общий_стаж_м общий_стаж_л
стаж_по_специальности_д стаж_по_специальности_м стаж_по_специальности_л
стаж_на_предприятии_д стаж_на_предприятии_м стаж_на_предприятии_л

семейное_положение
член_семьи1
член_семьи2
член_семьи3
член_семьи4


!паспорт
серия_паспорта номер_паспорта
кем_выдан_1 кем_выдан_2

дата_выдачи
домашний_адрес_по_паспорту_1 домашний_адрес_по_паспорту_2
ученое_звание
номер_телефона

дата_заполнения_д дата_заполнения_м дата_заполнения_г

ВУ_группа_учета
ВУ_категория_учета
ВУ_состав
воинское_звание_1
воинское_звание_2
военно_учетная_специальность
годность_к_ВС
наименование_военкомата
номер_спец_учета
!назначения и перемещения
дата_назначения11 основание11 дата_приказа11 номер_приказа11 подразделение11
   категория_персонала11 должность11 оклад11 условия_труда11 соответствие_должности11
дата_назначения22 основание22 дата_приказа22 номер_приказа22 подразделение22
   категория_персонала22 должность22 оклад22 условия_труда22 соответствие_должности22
дата_назначения33 основание33 дата_приказа33 номер_приказа33 подразделение33
   категория_персонала33 должность33 оклад33 условия_труда33 соответствие_должности33
дата_назначения44 основание44 дата_приказа44 номер_приказа44 подразделение44
   категория_персонала44 должность44 оклад44 условия_труда44 соответствие_должности44
дата_назначения55 основание55 дата_приказа55 номер_приказа55 подразделение55
   категория_персонала55 должность55 оклад55 условия_труда55 соответствие_должности55
дата_назначения66 основание66 дата_приказа66 номер_приказа66 подразделение66
   категория_персонала66 должность66 оклад66 условия_труда66 соответствие_должности66
дата_назначения77 основание77 дата_приказа77 номер_приказа77 подразделение77
   категория_персонала77 должность77 оклад77 условия_труда77 соответствие_должности77
дата_назначения88 основание88 дата_приказа88 номер_приказа88 подразделение88
   категория_персонала88 должность88 оклад88 условия_труда88 соответствие_должности88
дата_назначения99 основание99 дата_приказа99 номер_приказа99 подразделение99
   категория_персонала99 должность99 оклад99 условия_труда99 соответствие_должности99
дата_назначения91 основание91 дата_приказа91 номер_приказа91 подразделение91
   категория_персонала91 должность91 оклад91 условия_труда91 соответствие_должности91
дата_назначения92 основание92 дата_приказа92 номер_приказа92 подразделение92
   категория_персонала92 должность92 оклад92 условия_труда92 соответствие_должности92
дата_назначения93 основание93 дата_приказа93 номер_приказа93 подразделение93
   категория_персонала93 должность93 оклад93 условия_труда93 соответствие_должности93
дата_назначения94 основание94 дата_приказа94 номер_приказа94 подразделение94
   категория_персонала94 должность94 оклад94 условия_труда94 соответствие_должности94

!повышение квалификации
дата_начала_ПК1 дата_окончания_ПК1 вид_повышения_квалификации1 наим_ОУ101
       номер_документа1 дата_документа1
дата_начала_ПК2 дата_окончания_ПК2 вид_повышения_квалификации2 наим_ОУ102
       номер_документа2 дата_документа2
дата_начала_ПК3 дата_окончания_ПК3 вид_повышения_квалификации3 наим_ОУ103
       номер_документа3 дата_документа3
дата_начала_ПК4 дата_окончания_ПК4 вид_повышения_квалификации4 наим_ОУ104
       номер_документа4 дата_документа4
дата_начала_ПК5 дата_окончания_ПК5 вид_повышения_квалификации5 наим_ОУ105
       номер_документа5 дата_документа5
дата_начала_ПК6 дата_окончания_ПК6 вид_повышения_квалификации6 наим_ОУ106
       номер_документа6 дата_документа6
дата_начала_ПК7 дата_окончания_ПК7 вид_повышения_квалификации7 наим_ОУ107
       номер_документа7 дата_документа7
дата_начала_ПК8 дата_окончания_ПК8 вид_повышения_квалификации8 наим_ОУ108
       номер_документа8 дата_документа8


дата_начала_ПП01 дата_окончания_ПП01 специальность_ПП01
        номер_диплома_ПП01  дата_диплома_ПП01
дата_начала_ПП02 дата_окончания_ПП02 специальность_ПП02
        номер_диплома_ПП02  дата_диплома_ПП02
дата_начала_ПП03 дата_окончания_ПП03 специальность_ПП03
        номер_диплома_ПП03  дата_диплома_ПП03
дата_начала_ПП04 дата_окончания_ПП04 специальность_ПП04
        номер_диплома_ПП04  дата_диплома_ПП04
дата_начала_ПП05 дата_окончания_ПП05 специальность_ПП05
        номер_диплома_ПП05  дата_диплома_ПП05
дата_начала_ПП06 дата_окончания_ПП06 специальность_ПП06
        номер_диплома_ПП06  дата_диплома_ПП06

результат_аттестации01 номер_документа_А01 дата_документа_А01
результат_аттестации02 номер_документа_А02 дата_документа_А02
результат_аттестации03 номер_документа_А03 дата_документа_А03
результат_аттестации04 номер_документа_А04 дата_документа_А04
результат_аттестации05 номер_документа_А05 дата_документа_А05
результат_аттестации06 номер_документа_А06 дата_документа_А06

доп_строка1
доп_строка2
доп_строка3

!отпуска
период_работы01 основание_отпуска01
    колво_дней101 колво_дней201 колво_дней301 колво_дней401 колво_дней_всего01
    итого_дней_отпуска01 дата_начала_О01 дата_окончания_О01
период_работы02 основание_отпуска02
    колво_дней102 колво_дней202 колво_дней302 колво_дней402 колво_дней_всего02
    итого_дней_отпуска02 дата_начала_О02 дата_окончания_О02
период_работы03 основание_отпуска03
    колво_дней103 колво_дней203 колво_дней303 колво_дней403 колво_дней_всего03
    итого_дней_отпуска03 дата_начала_О03 дата_окончания_О03
период_работы04 основание_отпуска04
    колво_дней104 колво_дней204 колво_дней304 колво_дней404 колво_дней_всего04
    итого_дней_отпуска04 дата_начала_О04 дата_окончания_О04
период_работы05 основание_отпуска05
    колво_дней105 колво_дней205 колво_дней305 колво_дней405 колво_дней_всего05
    итого_дней_отпуска05 дата_начала_О05 дата_окончания_О05
период_работы06 основание_отпуска06
    колво_дней106 колво_дней206 колво_дней306 колво_дней406 колво_дней_всего06
    итого_дней_отпуска06 дата_начала_О06 дата_окончания_О06

день_увольнения месяц_увольнения год_увольнения основание_увольнения
день_приказа_на_увольнение месяц_приказа_на_увольнение
  год_приказа_на_увольнение номер_приказа_на_увольнение

Место_рождения_4
домашний_адрес_по_паспорту_3 домашний_адрес_по_паспорту_4

.endfields

^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^

.endform

!----------------------------------------------------------------

!  Прототипы формы


.linkform 'formt2su_1' prototype is 'formt2su'
.nameinlist 'Лицевая сторона формы Т-2'
.p 100
.defo portrait
.fields
  организация
номер пол таб_номер алфавит

! ОБЩАЯ КАРТОЧКА

Фамилия:'d:r'             основная_профессия:'d:r'
Имя:'d:r'                 вторая_профессия:'d:r'
Отчество:'d:r'            основная_профессия:'d:r'
Дата_рождения:'d:r'
Место_рождения_1:'d:r'    стаж_по_специальности_д стаж_по_специальности_м стаж_по_специальности_л
Место_рождения_2:'d:r'    общий_стаж_д общий_стаж_м общий_стаж_л
Место_рождения_3:'d:r'    
Место_рождения_4:'d:r'    непрерывный_стаж_д непрерывный_стаж_м непрерывный_стаж_л
Национальность:'d:r'
                          стаж_на_предприятии_д стаж_на_предприятии_м стаж_на_предприятии_л
высшее_или_среднее_образование_1:'d:r'
                          семейное_положение:'d:r'
высшее_или_среднее_образование_2:'d:r'
                          член_семьи1:'d:r'
высшее_или_среднее_образование_3:'d:r'
                          член_семьи2:'d:r'
средн_или_нач_проф_образование_1:'d:r'
                          член_семьи3:'d:r'
средн_или_нач_проф_образование_2:'d:r' член_семьи4:'d:r'
средн_или_нач_проф_образование_3:'d:r'
специальность_по_диплому_1:'d:r'
специальность_по_диплому_2:'d:r'
                          серия_паспорта номер_паспорта
                          кем_выдан_1:'d:r'
код_ОКСО                  кем_выдан_2:'d:r'
квалификация_по_диплому:'d:r'
                          if(String(дата_выдачи)='ДД/ММ/ГГГГ', '', дата_выдачи)
номер_диплома день_д месяц_д год_д
                          домашний_адрес_по_паспорту_1:'d:r'
                          домашний_адрес_по_паспорту_2:'d:r'
ученое_звание
                          домашний_адрес_по_паспорту_3:'d:r'
                          домашний_адрес_по_паспорту_4:'d:r'
                          номер_телефона

! Дата заполнения

дата_заполнения_д дата_заполнения_м дата_заполнения_г

! Сведения о воинском учете

ВУ_группа_учета:'d:r'     военно_учетная_специальность:'d:r'
ВУ_категория_учета:'d:r'  годность_к_ВС:'d:r'
ВУ_состав:'d:r'
                          наименование_военкомата:'d:r'
воинское_звание_1:'d:r'
воинское_звание_2:'d:r'   номер_спец_учета

.endfields
 Р
  @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                 Форма N T-2
 ────────────────────────────────────────────────────                                                               ────────────
              предприятие, организация

                                                                                                                     ┌─────────┐
                                                                                                        Код по ОКУД  │ 0301002 │
                                                                                                                     └─────────┘
                                                                                ┌────────────┬──────────┬────────────┬─────────┐
                                                                                │   N док.   │ Пол: м/ж │   Таб. N   │ Алфавит │
                                   ЛИЧНАЯ КАРТОЧКА N                            ├────────────┼──────────┼────────────┼─────────┤
                                                     ───────────────            │ &&&&&&&&&& │ @~@@@@@@ │ &&&&&&&&&& │ @~@@@@@ │
                                                                                └────────────┴──────────┴────────────┴─────────┘
                                                       1. ОБЩИЕ СВЕДЕНИЯ
 Код │                                                                                                                   │ Код
     │                                                                                                                   ├─────
     │ 1. Фамилия  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │ 9. Профессия: основная  @@@@@@@@@@@@@@@@@@@@@@@@@@@@  │
     ├────────────────────────────────────────────────────────── │ ──────────────────────────────────────────────────────┼─────
     │ имя  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │ вторая  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │
     ├────────────────────────────────────────────────────────── │ ──────────────────────────────────────────────────────┼─────
     │ отчество  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │ 10. Должность  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │
─────┼────────────────────────────────────────────────────────── │ ──────────────────────────────────────────────────────┼─────
     │ 2. Дата рождения  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │                 Стаж работы:                          │
─────┼────────────────────────────────────────────────────────── │                                                       │
     │                          число, месяц, год                │ 11. По основн. профессии, должности                   │
     │ 3. Место рождения  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │   дней @@  месяцев @@  лет @@@                        │
     ├────────────────────────────────────────────────────────── │ ──────────────────────────────────────────────────────┼─────
     │  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │ 12. Общий   дней @@  месяцев @@  лет @@@              │
     ├────────────────────────────────────────────────────────── │ ──────────────────────────────────────────────────────┼─────
     │  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │                             дата, год                 │
     ├────────────────────────────────────────────────────────── │
     │  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │ 13. Непрерывный    дней @@  месяцев @@  лет @@@       │
     ├────────────────────────────────────────────────────────── │ ──────────────────────────────────────────────────────┼─────
     │ 4. Национальность  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │ 14. В том числе на данном предприятии                 │
─────┼────────────────────────────────────────────────────────── │    дней @@  месяцев @@  лет @@@                       │
     │ 5. Образование                                            │ ──────────────────────────────────────────────────────┼─────
     │ а)  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │ 15. Семейное положение  @@@@@@@@@@@@@@@@@@@@@@@@@@@@  │
     ├────────────────────────────────────────────────────────── │                        ───────────────────────────────┼─────
     │                 название и дата окончания                 │                                                       │
     │  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │ 16. Состав семьи с указанием года рождения            │
     ├────────────────────────────────────────────────────────── │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │
     │              высшего или среднего специального            │ ──────────────────────────────────────────────────────┼─────
     │  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │                каждого  члена  семьи                  │
     ├────────────────────────────────────────────────────────── │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │
     │                    учебного заведения                     │ ──────────────────────────────────────────────────────┤
     │ б)  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │
     ├────────────────────────────────────────────────────────── │ ──────────────────────────────────────────────────────┤
     │          название и дата окончания училища                │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │
     │  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │ ──────────────────────────────────────────────────────┤
     ├────────────────────────────────────────────────────────── │ 17.                                                   │
     │       школы по профессионально-техническому               │ ──────────────────────────────────────────────────────┼─────
     │  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │                                                       │
     ├────────────────────────────────────────────────────────── │ ──────────────────────────────────────────────────────┤
     │                                 образованию               │                                                       │
     │                                    ┌────────────────────┐ │ ──────────────────────────────────────────────────────┤
     │  Код профессии по ОКПДТР           │                    │ │                                                       │
     │                                    └────────────────────┘ │ 18.                                                   │
     │ в)                                                        │ ──────────────────────────────────────────────────────┼─────
─────┼────────────────────────────────────────────────────────── │                                                       │
     │ 6. Специальность по диплому (свидетельству)               │ ──────────────────────────────────────────────────────┤
     │  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │                                                       │
─────┼────────────────────────────────────────────────────────── │ ──────────────────────────────────────────────────────┤
     │             для окончивших высшее или среднее             │                                                       │
     │  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │ ──────────────────────────────────────────────────────┤
     ├────────────────────────────────────────────────────────── │ 19. Паспорт: серия @@@@@@@@@  N @@@@@@@@@@@@@@@@      │
     │               специальное учебное заведение               │ ──────────────────────────────────────────────────────┼─────
     │                                    ┌────────────────────┐ │ Кем выдан  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │
     │  Код специальности по ОКСО         │ &~&&&&&&&&&&&&&&&& │ │ ──────────────────────────────────────────────────────┼─────
     │                                    └────────────────────┘ │  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │
     │ 7. Квалификация по диплому (свидетельству)                │ ──────────────────────────────────────────────────────┤
     │  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │ Дата выдачи  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │
─────┼────────────────────────────────────────────────────────── │ ──────────────────────────────────────────────────────┤
     │ Диплом N @@@@@@@@@@@@@@@@@@@@@ от "@@" @@@@@@@@  @@@@ г.  │ 20. Домашний адрес   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │
     │────────────────────────────────────────────────────────── │ ──────────────────────────────────────────────────────┤
     │ свидетельство                                             │  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │
─────┼────────────────────────────────────────────────────────── │ ──────────────────────────────────────────────────────┤
     │ 8. Ученое звание @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │
     ├────────────────────────────────────────────────────────── │ ──────────────────────────────────────────────────────┤
     │                                                           │  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │
     ├────────────────────────────────────────────────────────── │ ──────────────────────────────────────────────────────┤
     │                                                           │  Телефон  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │
     ├────────────────────────────────────────────────────────── │ ──────────────────────────────────────────────────────┤

 Дата заполнения "@@" @@@@@@@@@@@@@@@@@@   @@@@ г.                          Личная подпись
 ────────────────────────────────────────  ───────                         ────────────────────────────────────────────────────

                                                 2. СВЕДЕНИЯ О ВОИНСКОМ УЧЕТЕ

     │ Группа учета  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │ Военно-учетная специальность N  @@@@@@@@@@@@@@@@@@@@  │
─────┼────────────────────────────────────────────────────────── │ ──────────────────────────────────────────────────────┼────
     │ Категория учета  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │ Годность к военной службе  @@@@@@@@@@@@@@@@@@@@@@@@@  │
─────┼────────────────────────────────────────────────────────── │ ──────────────────────────────────────────────────────┼────
     │ Состав  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │ Название райвоенкомата по месту жительства            │
─────┼────────────────────────────────────────────────────────── │  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │
     │ Воинское звание  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │ ──────────────────────────────────────────────────────┼────
─────┼────────────────────────────────────────────────────────── │ Состоит на специальном учете N                        │
     │  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │
─────┴────────────────────────────────────────────────────────── │ ──────────────────────────────────────────────────────┴──── Р

.endform

!----------------------------------------------------------------

.linkform 'formt2su_2' prototype is 'formt2su'
.nameinlist 'Оборотная сторона формы Т-2'
.defo landscape
.fields
!Назначения и перемещения, повышение квалификации, переподготовка
if(String(дата_назначения11)='ДД/ММ/ГГГГ', '', дата_назначения11)
    подразделение11 категория_персонала11 должность11
    соответствие_должности11 оклад11 условия_труда11 основание11
    if(String(дата_приказа11)='ДД/ММ/ГГГГ', '', дата_приказа11) номер_приказа11
    if(String(дата_начала_ПК1)='ДД/ММ/ГГГГ', '', дата_начала_ПК1) вид_повышения_квалификации1
    номер_документа1 if(String(дата_документа1)='ДД/ММ/ГГГГ', '', дата_документа1)
    if(String(дата_начала_ПП01)='ДД/ММ/ГГГГ', '', дата_начала_ПП01) специальность_ПП01
    if(String(дата_диплома_ПП01)='ДД/ММ/ГГГГ', '', дата_диплома_ПП01) номер_диплома_ПП01
if(String(дата_назначения22)='ДД/ММ/ГГГГ', '', дата_назначения22) подразделение22 категория_персонала22 должность22
    соответствие_должности22 оклад22 условия_труда22 основание22
    if(String(дата_приказа22)='ДД/ММ/ГГГГ', '', дата_приказа22) номер_приказа22
    if(String(дата_начала_ПК2)='ДД/ММ/ГГГГ', '', дата_начала_ПК2) вид_повышения_квалификации2
    номер_документа2 if(String(дата_документа2)='ДД/ММ/ГГГГ', '', дата_документа2)
    if(String(дата_начала_ПП02)='ДД/ММ/ГГГГ', '', дата_начала_ПП02) специальность_ПП02
    if(String(дата_диплома_ПП02)='ДД/ММ/ГГГГ', '', дата_диплома_ПП02) номер_диплома_ПП02
if(String(дата_назначения33)='ДД/ММ/ГГГГ', '', дата_назначения33) подразделение33 категория_персонала33 должность33
    соответствие_должности33 оклад33 условия_труда33 основание33
    if(String(дата_приказа33)='ДД/ММ/ГГГГ', '', дата_приказа33) номер_приказа33
    if(String(дата_начала_ПК3)='ДД/ММ/ГГГГ', '', дата_начала_ПК3) вид_повышения_квалификации3
    номер_документа3 if(String(дата_документа3)='ДД/ММ/ГГГГ', '', дата_документа3)
    if(String(дата_начала_ПП03)='ДД/ММ/ГГГГ', '', дата_начала_ПП03) специальность_ПП03
    if(String(дата_диплома_ПП03)='ДД/ММ/ГГГГ', '', дата_диплома_ПП03) номер_диплома_ПП03
if(String(дата_назначения44)='ДД/ММ/ГГГГ', '', дата_назначения44) подразделение44 категория_персонала44 должность44
    соответствие_должности44 оклад44 условия_труда44 основание44
    if(String(дата_приказа44)='ДД/ММ/ГГГГ', '', дата_приказа44) номер_приказа44
    if(String(дата_начала_ПК4)='ДД/ММ/ГГГГ', '', дата_начала_ПК4) вид_повышения_квалификации4
    номер_документа4 if(String(дата_документа4)='ДД/ММ/ГГГГ', '', дата_документа4)
    if(String(дата_начала_ПП04)='ДД/ММ/ГГГГ', '', дата_начала_ПП04) специальность_ПП04
    if(String(дата_диплома_ПП04)='ДД/ММ/ГГГГ', '', дата_диплома_ПП04) номер_диплома_ПП04
if(String(дата_назначения55)='ДД/ММ/ГГГГ', '', дата_назначения55) подразделение55 категория_персонала55 должность55
    соответствие_должности55 оклад55 условия_труда55 основание55
    if(String(дата_приказа55)='ДД/ММ/ГГГГ', '', дата_приказа55) номер_приказа55
    if(String(дата_начала_ПК5)='ДД/ММ/ГГГГ', '', дата_начала_ПК5) вид_повышения_квалификации5
    номер_документа5 if(String(дата_документа5)='ДД/ММ/ГГГГ', '', дата_документа5)
    if(String(дата_начала_ПП05)='ДД/ММ/ГГГГ', '', дата_начала_ПП05) специальность_ПП05
    if(String(дата_диплома_ПП05)='ДД/ММ/ГГГГ', '', дата_диплома_ПП05) номер_диплома_ПП05
if(String(дата_назначения66)='ДД/ММ/ГГГГ', '', дата_назначения66) подразделение66 категория_персонала66 должность66
    соответствие_должности66 оклад66 условия_труда66 основание66
    if(String(дата_приказа66)='ДД/ММ/ГГГГ', '', дата_приказа66) номер_приказа66
    if(String(дата_начала_ПК6)='ДД/ММ/ГГГГ', '', дата_начала_ПК6) вид_повышения_квалификации6
    номер_документа6 if(String(дата_документа6)='ДД/ММ/ГГГГ', '', дата_документа6)
    if(String(дата_начала_ПП06)='ДД/ММ/ГГГГ', '', дата_начала_ПП06) специальность_ПП06
    if(String(дата_диплома_ПП06)='ДД/ММ/ГГГГ', '', дата_диплома_ПП06) номер_диплома_ПП06
if(String(дата_назначения77)='ДД/ММ/ГГГГ', '', дата_назначения77) подразделение77 категория_персонала77 должность77
    соответствие_должности77 оклад77 условия_труда77 основание77
    if(String(дата_приказа77)='ДД/ММ/ГГГГ', '', дата_приказа77) номер_приказа77
    if(String(дата_начала_ПК7)='ДД/ММ/ГГГГ', '', дата_начала_ПК7) вид_повышения_квалификации7
    номер_документа7 if(String(дата_документа7)='ДД/ММ/ГГГГ', '', дата_документа7)
if(String(дата_назначения88)='ДД/ММ/ГГГГ', '', дата_назначения88) подразделение88 категория_персонала88 должность88
    соответствие_должности88 оклад88 условия_труда88 основание88
    if(String(дата_приказа88)='ДД/ММ/ГГГГ', '', дата_приказа88) номер_приказа88
    if(String(дата_начала_ПК8)='ДД/ММ/ГГГГ', '', дата_начала_ПК8) вид_повышения_квалификации8
    номер_документа8 if(String(дата_документа8)='ДД/ММ/ГГГГ', '', дата_документа8)

!Отпуска, аттестация
период_работы01 основание_отпуска01
    колво_дней101 колво_дней201 колво_дней301
    колво_дней401 колво_дней_всего01 итого_дней_отпуска01 if(String(дата_начала_О01)='ДД/ММ/ГГГГ', '', дата_начала_О01)
    if(String(дата_окончания_О01)='ДД/ММ/ГГГГ', '', дата_окончания_О01)
    if(String(дата_документа_А01)='ДД/ММ/ГГГГ', '', дата_документа_А01) результат_аттестации01
период_работы02 основание_отпуска02
    колво_дней102 колво_дней202 колво_дней302
    колво_дней402 колво_дней_всего02 итого_дней_отпуска02 if(String(дата_начала_О02)='ДД/ММ/ГГГГ', '', дата_начала_О02)
    if(String(дата_окончания_О02)='ДД/ММ/ГГГГ', '', дата_окончания_О02)
    if(String(дата_документа_А02)='ДД/ММ/ГГГГ', '', дата_документа_А02) результат_аттестации02
период_работы03 основание_отпуска03
    колво_дней103 колво_дней203 колво_дней303
    колво_дней403 колво_дней_всего03 итого_дней_отпуска03 if(String(дата_начала_О03)='ДД/ММ/ГГГГ', '', дата_начала_О03)
    if(String(дата_окончания_О03)='ДД/ММ/ГГГГ', '', дата_окончания_О03)
    if(String(дата_документа_А03)='ДД/ММ/ГГГГ', '', дата_документа_А03) результат_аттестации03
период_работы04 основание_отпуска04
    колво_дней104 колво_дней204 колво_дней304
    колво_дней404 колво_дней_всего04 итого_дней_отпуска04 if(String(дата_начала_О04)='ДД/ММ/ГГГГ', '', дата_начала_О04)
    if(String(дата_окончания_О04)='ДД/ММ/ГГГГ', '', дата_окончания_О04)
    if(String(дата_документа_А04)='ДД/ММ/ГГГГ', '', дата_документа_А04) результат_аттестации04
период_работы05 основание_отпуска05
    колво_дней105 колво_дней205 колво_дней305
    колво_дней405 колво_дней_всего05 итого_дней_отпуска05 if(String(дата_начала_О05)='ДД/ММ/ГГГГ', '', дата_начала_О05)
    if(String(дата_окончания_О05)='ДД/ММ/ГГГГ', '', дата_окончания_О05)
    if(String(дата_документа_А05)='ДД/ММ/ГГГГ', '', дата_документа_А05) результат_аттестации05
период_работы06 основание_отпуска06
    колво_дней106 колво_дней206 колво_дней306
    колво_дней406 колво_дней_всего06 итого_дней_отпуска06 if(String(дата_начала_О06)='ДД/ММ/ГГГГ', '', дата_начала_О06)
    if(String(дата_окончания_О06)='ДД/ММ/ГГГГ', '', дата_окончания_О06)
    if(String(дата_документа_А06)='ДД/ММ/ГГГГ', '', дата_документа_А06) результат_аттестации06

!Дополнительная информация
доп_строка1:'d:r'
доп_строка2:'d:r'
доп_строка3:'d:r'

!Дата и причина увольнения
день_увольнения месяц_увольнения год_увольнения основание_увольнения:'d:r'
номер_приказа_на_увольнение
день_приказа_на_увольнение месяц_приказа_на_увольнение год_приказа_на_увольнение

.endfields

 Ш┌──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────╥────────────────────────────────────────────╥─────────────────────────────────────────────┐
│                                               3. НАЗНАЧЕНИЯ И ПЕРЕМЕЩЕНИЯ                                                        ║          4. Повышение квалификации         ║                5. ПЕРЕПОДГОТОВКА            │
├──────────┬──────────────┬────┬───────────┬─────────────┬───────────┬───────────┬───────┬───────────────────────────────┬─────────╫──────────┬──────────────┬──────────────────╫──────────┬─────────────┬────────────────────┤
│   Дата   │  Цех, отдел  │Уча-│ Категория │  Профессия, │Соотв.спец.│ Тарифный  │ Услов.│          Основание            │ Подпись ║   Дата   │  Вид повыш.  │   Свидетельство  ║   Дата   │Специальность│       Диплом       │
│          │              │сток│           │  должность  │  по дипл. │  разряд   │ труда ├────────────┬──────────┬───────┤владельца║          │ квалификации │  (удостоверение) ║          │ (профессия) │   (свидетельство)  │
│          │              │    │           │             │  (свид.)  │ (класс),  │(норм.,│   наимен.  │   Дата   │ Номер │трудовой ║          │              ├──────────┬───────╢          │             ├──────────┬─────────┤
│          │              │    │           │             │ занимаем. │   оклад   │тяжел.,│   докум.   │          │       │ книжки  ║          │              │   дата   │ номер ║          │             │   дата   │  номер  │
│          │              │    │           │             │ должности │           │вредн. │            │          │       │         ║          │              │          │       ║          │             │          │         │
│          │              │    │           │             │(профессии)│           │и т.д.)│            │          │       │         ║          │              │          │       ║          │             │          │         │
│          │              │    │           │             │ (да, нет) │           │       │            │          │       │         ║          │              │          │       ║          │             │          │         │
├──────────┼──────────────┼────┼───────────┼─────────────┼───────────┼───────────┼───────┼────────────┼──────────┼───────┼─────────╫──────────┼──────────────┼──────────┼───────╫──────────┼─────────────┼──────────┼─────────┤
│     1    │      2       │ 3  │     4     │      5      │     6     │     7     │   8   │      9     │    10    │   11  │    12   ║    13    │      14      │    15    │   16  ║    17    │     18      │    19    │    20   │
├──────────┼──────────────┼────┼───────────┼─────────────┼───────────┼───────────┼───────┼────────────┼──────────┼───────┼─────────╫──────────┼──────────────┼──────────┼───────╫──────────┼─────────────┼──────────┼─────────┤
│@@@@@@@@@@│@@@@@@@@@@@@@@│    │@@@@@@@@@@@│@@@@@@@@@@@@@│@~@@@@@@@@@│&&&&&&&&&&&│@@@@@@@│@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&│         ║@@@@@@@@@@│@@@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&║@@@@@@@@@@│@@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&&&│
├──────────┼──────────────┼────┼───────────┼─────────────┼───────────┼───────────┼───────┼────────────┼──────────┼───────┼─────────╫──────────┼──────────────┼──────────┼───────╫──────────┼─────────────┼──────────┼─────────┤
│@@@@@@@@@@│@@@@@@@@@@@@@@│    │@@@@@@@@@@@│@@@@@@@@@@@@@│@~@@@@@@@@@│&&&&&&&&&&&│@@@@@@@│@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&│         ║@@@@@@@@@@│@@@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&║@@@@@@@@@@│@@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&&&│
├──────────┼──────────────┼────┼───────────┼─────────────┼───────────┼───────────┼───────┼────────────┼──────────┼───────┼─────────╫──────────┼──────────────┼──────────┼───────╫──────────┼─────────────┼──────────┼─────────┤
│@@@@@@@@@@│@@@@@@@@@@@@@@│    │@@@@@@@@@@@│@@@@@@@@@@@@@│@~@@@@@@@@@│&&&&&&&&&&&│@@@@@@@│@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&│         ║@@@@@@@@@@│@@@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&║@@@@@@@@@@│@@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&&&│
├──────────┼──────────────┼────┼───────────┼─────────────┼───────────┼───────────┼───────┼────────────┼──────────┼───────┼─────────╫──────────┼──────────────┼──────────┼───────╫──────────┼─────────────┼──────────┼─────────┤
│@@@@@@@@@@│@@@@@@@@@@@@@@│    │@@@@@@@@@@@│@@@@@@@@@@@@@│@~@@@@@@@@@│&&&&&&&&&&&│@@@@@@@│@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&│         ║@@@@@@@@@@│@@@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&║@@@@@@@@@@│@@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&&&│
├──────────┼──────────────┼────┼───────────┼─────────────┼───────────┼───────────┼───────┼────────────┼──────────┼───────┼─────────╫──────────┼──────────────┼──────────┼───────╫──────────┼─────────────┼──────────┼─────────┤
│@@@@@@@@@@│@@@@@@@@@@@@@@│    │@@@@@@@@@@@│@@@@@@@@@@@@@│@~@@@@@@@@@│&&&&&&&&&&&│@@@@@@@│@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&│         ║@@@@@@@@@@│@@@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&║@@@@@@@@@@│@@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&&&│
├──────────┼──────────────┼────┼───────────┼─────────────┼───────────┼───────────┼───────┼────────────┼──────────┼───────┼─────────╫──────────┼──────────────┼──────────┼───────╫──────────┼─────────────┼──────────┼─────────┤
│@@@@@@@@@@│@@@@@@@@@@@@@@│    │@@@@@@@@@@@│@@@@@@@@@@@@@│@~@@@@@@@@@│&&&&&&&&&&&│@@@@@@@│@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&│         ║@@@@@@@@@@│@@@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&║@@@@@@@@@@│@@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&&&│
├──────────┼──────────────┼────┼───────────┼─────────────┼───────────┼───────────┼───────┼────────────┼──────────┼───────┼─────────╫──────────┼──────────────┼──────────┼───────╫──────────┼─────────────┼──────────┼─────────┤
│@@@@@@@@@@│@@@@@@@@@@@@@@│    │@@@@@@@@@@@│@@@@@@@@@@@@@│@~@@@@@@@@@│&&&&&&&&&&&│@@@@@@@│@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&│         ║@@@@@@@@@@│@@@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&║          │             │          │         │
├──────────┼──────────────┼────┼───────────┼─────────────┼───────────┼───────────┼───────┼────────────┼──────────┼───────┼─────────╫──────────┼──────────────┼──────────┼───────╫──────────┼─────────────┼──────────┼─────────┤
│@@@@@@@@@@│@@@@@@@@@@@@@@│    │@@@@@@@@@@@│@@@@@@@@@@@@@│@~@@@@@@@@@│&&&&&&&&&&&│@@@@@@@│@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&│         ║@@@@@@@@@@│@@@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&║          │             │          │         │
└──────────┴──────────────┴────┴───────────┴─────────────┴───────────┴───────────┴───────┴────────────┴──────────┴───────┴─────────╨──────────┴──────────────┴──────────┴───────╨──────────┴─────────────┴──────────┴─────────┘

┌─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────╥───────────────────────────────────────────────────┐
│                                                                                            6. ОТПУСКА                                                                   ║                7. АТТЕСТАЦИЯ                      │
├─────────────────────────┬─────────────────────────────────────────┬────────────┬──────────────────────────────────┬─────────────┬───────────────────────────────────────╫───────────┬───────────────────────────────────────┤
│     За какой период     │                 Основание               │ Количество │       Дополнительный отпуск      │    Всего    │                  Дата                 ║    Дата   │            Решение комиссии           │
│                         │                                         │рабочих дней├───────────────────────┬──────────┤  к-во дней  ├───────────────────┬───────────────────╢           │                                       │
│                         │                                         │ основного  │    количество дней    │          │   отпуска   │    нач. осн. и    │    оконч. осн.    ║           │                                       │
│                         │                                         │  отпуска   ├───────┬───────┬───────┤   И-го   │             │  дополн. отпуска  │    и доп. отп.    ║           │                                       │
├─────────────────────────┼─────────────────────────────────────────┼────────────┼───────┼───────┼───────┼──────────┼─────────────┼───────────────────┼───────────────────╫───────────┼───────────────────────────────────────┤
│            1            │                     2                   │      3     │   4   │   5   │   6   │    7     │      8      │         9         │         10        ║     1     │                   2                   │
├─────────────────────────┼─────────────────────────────────────────┼────────────┼───────┼───────┼───────┼──────────┼─────────────┼───────────────────┼───────────────────╫───────────┼───────────────────────────────────────┤
│ @~@@@@@@@@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │ &&&&&&&&&& │ &&&&& │ &&&&& │ &&&&& │ &&&&&&&& │ &&&&&&&&&&& │ @~@@@@@@@@@@@@@@@ │ @~@@@@@@@@@@@@@@@ ║@~@@@@@@@@@│ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │
├─────────────────────────┼─────────────────────────────────────────┼────────────┼───────┼───────┼───────┼──────────┼─────────────┼───────────────────┼───────────────────╫───────────┼───────────────────────────────────────┤
│ @~@@@@@@@@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │ &&&&&&&&&& │ &&&&& │ &&&&& │ &&&&& │ &&&&&&&& │ &&&&&&&&&&& │ @~@@@@@@@@@@@@@@@ │ @~@@@@@@@@@@@@@@@ ║@~@@@@@@@@@│ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │
├─────────────────────────┼─────────────────────────────────────────┼────────────┼───────┼───────┼───────┼──────────┼─────────────┼───────────────────┼───────────────────╫───────────┼───────────────────────────────────────┤
│ @~@@@@@@@@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │ &&&&&&&&&& │ &&&&& │ &&&&& │ &&&&& │ &&&&&&&& │ &&&&&&&&&&& │ @~@@@@@@@@@@@@@@@ │ @~@@@@@@@@@@@@@@@ ║@~@@@@@@@@@│ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │
├─────────────────────────┼─────────────────────────────────────────┼────────────┼───────┼───────┼───────┼──────────┼─────────────┼───────────────────┼───────────────────╫───────────┼───────────────────────────────────────┤
│ @~@@@@@@@@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │ &&&&&&&&&& │ &&&&& │ &&&&& │ &&&&& │ &&&&&&&& │ &&&&&&&&&&& │ @~@@@@@@@@@@@@@@@ │ @~@@@@@@@@@@@@@@@ ║@~@@@@@@@@@│ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │
├─────────────────────────┼─────────────────────────────────────────┼────────────┼───────┼───────┼───────┼──────────┼─────────────┼───────────────────┼───────────────────╫───────────┼───────────────────────────────────────┤
│ @~@@@@@@@@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │ &&&&&&&&&& │ &&&&& │ &&&&& │ &&&&& │ &&&&&&&& │ &&&&&&&&&&& │ @~@@@@@@@@@@@@@@@ │ @~@@@@@@@@@@@@@@@ ║@~@@@@@@@@@│ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │
├─────────────────────────┼─────────────────────────────────────────┼────────────┼───────┼───────┼───────┼──────────┼─────────────┼───────────────────┼───────────────────╫───────────┼───────────────────────────────────────┤
│ @~@@@@@@@@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │ &&&&&&&&&& │ &&&&& │ &&&&& │ &&&&& │ &&&&&&&& │ &&&&&&&&&&& │ @~@@@@@@@@@@@@@@@ │ @~@@@@@@@@@@@@@@@ ║@~@@@@@@@@@│ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │
└─────────────────────────┴─────────────────────────────────────────┴────────────┴───────┴───────┴───────┴──────────┴─────────────┴───────────────────┴───────────────────╨───────────┴───────────────────────────────────────┘
                                                                                                                                                                                                     ┌────────────────────────┐
 8. ДОПОЛНИТЕЛЬНЫЕ СВЕДЕНИЯ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │          Код           │
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── ├────────────────────────┤
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │                        │
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── ├────────────────────────┤
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │                        │
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── ├────────────────────────┤
                                                                                                                                                                                                     │                        │
   Дата и причина увольнения  " @@ " @@@@@@@@@@@@ @@@@ г.  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@      Приказ N @@@@@@@@@@@@@ от " @@ " @@@@@@@@@@@@ @@@@ г.                                    └────────────────────────┘
  ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Ш

.endform
