/*
  ╔═════════════════════════════════════════════════════════════════════╗
  ║      Н Т О  "T O P   S O F T",  А О   "Н О В Ы Й   А Т Л А Н Т"     ║
  ║           Проект "КАДРЫ" (с) 2000                                   ║
  ║      Версия : 5.72                                                  ║
  ║      Разработал:  Магниченко А.В.                                   ║
  ║      Назначение:  Журнал регистрации переводов работающих           ║
  ╚═════════════════════════════════════════════════════════════════════╝
*/

!-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-!
! StaffReportChange
!-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-!
#doc
  Журнал регистрации переводов работающих
#end

.form StaffReportChange
.hide
.fields
 Название
 Дата_Начала
 Дата_Окончания
.endfields

 Наименование отчетной формы: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Дата_Начала                : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Дата_Окончания             : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

.fields
 PersNrec: comp
 ФИО
 табельный1
 должность1
 подразделение1
 Оклад1
 перевод
 табельный2
 должность2
 подразделение2
 Оклад2
 прик_дата
 прик_номер
 прик_дата2
 прик_номер2
 разряд1
 разряд2
.endfields

.{ ReportChangeCycle CheckEnter
PersNrec: ^
ФИО сотрудника: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
табельный1: @@@@@@@@
Должность1: @@@@@@@@@@@@@@@@@@@@@@@@@
Подразделение1: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Оклад1: ^
перевод : @@@@@@@@@@@
табельный2: @@@@@@@@
Должность2: @@@@@@@@@@@@@@@@@@@@@@@@@
Подразделение2: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Оклад2: ^
прик_дата: @@@@@@@@
прик_номер: @@@@@@@@@@@@@@@@@
прик_дата2: @@@@@@@@
прик_номер2: @@@@@@@@@@@@@@@@@
разряд1: @@@@@@@@
разряд2: @@@@@@@@
.}
.endform

/*.form StaffReportChange
.hide
.fields
 Название
.endfields

 Наименование отчетной формы: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

.{ ReportChangeCycle CheckEnter
.fields
 ФИО табельный1 должность1 подразделение1 назначен табельный2 должность2 подразделение2
.endfields

ФИО сотрудника: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
табельный1: @@@@@@@@
Должность1: @@@@@@@@@@@@@@@@@@@@@@@@@
Подразделение1: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Назначен : @@@@@@@@@@@
табельный2: @@@@@@@@
Должность2: @@@@@@@@@@@@@@@@@@@@@@@@@
Подразделение2: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.endform

.linkform "Журнал регистрации переводов сотрудников" prototype is StaffReportChange
.group 'Journals'
.defo landscape
.p 40
.var
 CurRec : Word ;
.endvar
.fields
 Название
.endfields
.[H skip
 Р                                                                                            Страница @NP@
┌─────┬────────────────────────────────┬────────────────────────────────────────────────────────┬───────────┬────────────────────────────────────────────────────────┐
│     │         Фамилия, имя,          │                     До перевода                        │   Дата    │                   После перевода                       │
│     │           отчество             ├──────────┬───────────────────┬─────────────────────────┤ перевода  ├──────────┬───────────────────┬─────────────────────────┤
│N п/п│                                │Табельный │     Должность     │      Структурное        │           │Табельный │     Должность     │      Структурное        │
│     │                                │  номер   │    (профессия)    │     подразделение       │           │  номер   │    (профессия)    │     подразделение       │
│     │                                │          │                   │                         │           │          │                   │                         │
├─────┼────────────────────────────────┼──────────┼───────────────────┤─────────────────────────┼───────────┼──────────┼───────────────────┤─────────────────────────┤
│  1  │               2                │     3    │         4         │            5            │     6     │     7    │         8         │            9            │
├─────┼────────────────────────────────┼──────────┼───────────────────┤─────────────────────────┼───────────┼──────────┼───────────────────┤─────────────────────────┘
.]H

                                                @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

┌─────┬────────────────────────────────┬────────────────────────────────────────────────────────┬───────────┬────────────────────────────────────────────────────────┐
│     │         Фамилия, имя,          │                     До перевода                        │   Дата    │                   После перевода                       │
│     │           отчество             ├──────────┬───────────────────┬─────────────────────────┤ перевода  ├──────────┬───────────────────┬─────────────────────────┤
│N п/п│                                │Табельный │     Должность     │      Структурное        │           │Табельный │     Должность     │      Структурное        │
│     │                                │  номер   │    (профессия)    │     подразделение       │           │  номер   │    (профессия)    │     подразделение       │
│     │                                │          │                   │                         │           │          │                   │                         │
├─────┼────────────────────────────────┼──────────┼───────────────────┤─────────────────────────┼───────────┼──────────┼───────────────────┤─────────────────────────┤
│  1  │               2                │     3    │         6         │            5            │     4     │     3    │         6         │            5            │
├─────┼────────────────────────────────┼──────────┼───────────────────┤─────────────────────────┼───────────┼──────────┼───────────────────┤─────────────────────────┤
.begin CurRec := 0 ; end.
.{ ReportChangeCycle CheckEnter
.fields
 CurRec ФИО табельный1 должность1 подразделение1 назначен табельный2 должность2 подразделение2
.endfields
.begin CurRec := CurRec + 1 ; end.
│&&&&.│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@│@~@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@ │@~@@@@@@@@│@~@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@│
.}
└─────┴────────────────────────────────┴──────────┴───────────────────┴─────────────────────────┴───────────┴──────────┴───────────────────┴─────────────────────────┘
.endform Ш*/
