//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.80 - модуль "Управление бюджетом"
// Форма печати: Каталог периодов планирования
//------------------------------------------------------------------------------
#doc
Форма печати: Каталог периодов планирования
#end
.set name='RepPeriod'
.hide
.fields
  coTab nTab
  NRec Nam Kod Abbr
  SDate EDate
  AllDay WorkDay
.endfields
  ^  ^
.{CycleOfPeriod CheckEnter
 ^ ^ ^ ^ ^ ^ ^ ^
.}

.endform
!
!
!
.linkform 'RepPeriod1' prototype is 'RepPeriod'
.Nameinlist 'Каталог периодов планирования'
.P 55
.fields
  CommonFormHeader
  Nam Kod Abbr
  SDate EDate
  AllDay WorkDay

.endfields
.[H Skip
 P                                                                                                     лист @np@ P
 P────────────────────────────────────────┬────────────┬──────┬─────────────┬─────────────┬───────────┬─────────
              Наименование              │    Код     │ Аббр │    Дата     │    Дата     │Календарных│ Рабочих
                                        │            │      │   начала    │  окончания  │   дней    │   дней
────────────────────────────────────────┼────────────┼──────┼─────────────┼─────────────┼───────────┼───────── Р
.]H
^

 Р                              Каталог периодов планирования                                          лист @np@
────────────────────────────────────────┬────────────┬──────┬─────────────┬─────────────┬───────────┬─────────
              Наименование              │    Код     │ Аббр │    Дата     │    Дата     │Календарных│ Рабочих
                                        │            │      │   начала    │  окончания  │   дней    │   дней
────────────────────────────────────────┼────────────┼──────┼─────────────┼─────────────┼───────────┼───────── Р
.{CycleOfPeriod CheckEnter
 Р@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&&&&&│&&&&&&│&&&&&&&&&&&&&│&&&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&
.[F
────────────────────────────────────────┴────────────┴──────┴─────────────┴─────────────┴───────────┴───────── Р
.]F
.}

.endform
!
!
!

