//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.80 - модуль "Управление бюджетом"
// Форма печати: Типы периодов планирования
//------------------------------------------------------------------------------
#doc
Форма печати: Типы периодов планирования
#end
.set name='RepTPer'
.hide
.fields
  coTab nTab
  NRec Nam Kod Attr
.endfields
  ^  ^
.{CycleOfTPer CheckEnter
 ^ ^ ^ ^
.}

.endform
!
!
!
.linkform 'RepTPer1' prototype is 'RepTPer'
.Nameinlist 'Типы периодов планирования'
.P 55
.fields
  CommonFormHeader
  Nam Kod Attr

.endfields
.[H Skip
 P                                                         лист @np@ P
 P─────────────────────────────────────────────┬────────────┬───────
                 Наименование                │    Код     │   X
                                             │            │
─────────────────────────────────────────────┼────────────┼─────── Р
.]H
^

 Р            Типы периодов планирования                   лист @np@
─────────────────────────────────────────────┬────────────┬───────
                 Наименование                │    Код     │   X
                                             │            │
─────────────────────────────────────────────┼────────────┼─────── Р
.{CycleOfTPer CheckEnter
 Р@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&&&&&│&&&&&&
.[F
─────────────────────────────────────────────┴────────────┴─────── Р
.]F
.}

 P"X" - существуют построенные периоды планирования P

.endform
!
!
!

