//------------------------------------------------------------------------------
//                                                      (c) корпорация ГАЛАКТИКА
// ГАЛАКТИКА 7.11 - Производственное планирование
// Альбом трудовых норм
//------------------------------------------------------------------------------

#doc
Базовая форма альбома трудовых норм</brief>
#end

.form ProfAlbum
.hide
.defo landscape
.fields
Izd_Type
Izd_Name
Izd_Obozn
Izd_Kod
TP_Type
TP_Name
TP_Obozn
dDate
Podrazd
PosType
PosName
PosNum
PosAddNum
Prof_Kod
Prof_Name
Razr
Isp_Kol
Ed_Norm
Ed_Norm2
Time_Norm
.EndFields
 ^ ^ ^ ^ ^ ^ ^ ^
.{PA01 CheckEnter
 ^ ^ ^ ^ ^
.{PA02 CheckEnter
 ^ ^ ^ ^ ^ ^ ^
.}
.}
.EndForm

.linkform 'ProfAlbum01' prototype is ProfAlbum
.nameinlist "Альбом трудовых норм"
.fields
Izd_Type
Izd_Name
Izd_Obozn
Izd_Kod
TP_Type
TP_Name
TP_Obozn
dDate
.endfields

 АЛЬБОМ ТРУДОВЫХ НОРМ

 Изделие (^):
   наименование  : ^
   обозначение   : ^
   номенкл. номер: ^
 Документ (^):
   наименование  : ^
   код           : ^
 Параметры расчета:
   на дату       : ^
───────────┬──────────────────────────────────┬────────┬──────────────┬──────────────────────┬─────────────────
 Код       │ Наименование профессии           │ Разряд │ Количество   │ Единица нормирования │ Норма времени,
           │                                  │        │ исполнителей │                      │ час
───────────┴──────────────────────────────────┴────────┴──────────────┴──────────────────────┴─────────────────
.{PA01 CheckEnter
.fields
Podrazd
PosType
PosName
PosNum
PosAddNum
.endfields
 ПОТРЕБИТЕЛЬ: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 @@@@@@@@@@@: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Номер: @@@@@@ Доп.номер: @@@@@@
───────────┬──────────────────────────────────┬────────┬──────────────┬──────────────────────┬─────────────────
.{PA02 CheckEnter
.fields
Prof_Kod
Prof_Name
Razr
Isp_Kol
Ed_Norm
Ed_Norm2
Time_Norm
.endfields
 @@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │ &&&&&& │ &&&&&&&&&&&& │ &&&&&&&.&&&& @@@@@@@ │ &&&&&&&.&&&&&&
.}
───────────┴──────────────────────────────────┴────────┴──────────────┴──────────────────────┴─────────────────
.}
.endform