//------------------------------------------------------------------------------
//                                                      (c) ╙╝Ю╞╝Ю═Ф╗О ┐─▀─┼▓┬┼─
// ┐─▀─┼▓┬┼─ 7.11 - ▐Ю╝╗╖╒╝╓АБ╒╔╜╜╝╔ ╞╚═╜╗Ю╝╒═╜╗╔
// ▒╒╝╓╜К╔ ╞╝БЮ╔║╜╝АБ╗
//------------------------------------------------------------------------------

#doc
│═╖╝╒═О Д╝Ю╛═ А╒╝╓╜КЕ ╞╝БЮ╔║╜╝АБ╔╘</brief>
#end

.form Rep1006
.hide
.defo landscape
.fields
RType
DAddInfo

DOType
DOName
DOCode
DONNom

DType
DName
DCode

DDate
DOQnt: double
DOEIzm
DLevel
DEIzm
DVariant

! 0 - ╒ Г═А═Е 1 - ╒ ╔╓╗╜╗Ф═Е ╓╝╙Ц╛╔╜Б═
wPREITime: word

GroupName

PRType
PRName
PRCode
PRNNom
PRQnt  : double
PRTime : double
PRSum  : double
PREIzm
PRPrice: double
.endfields
 ^ ^
 ^ ^ ^ ^
 ^ ^ ^
 ^ ^ ^ ^ ^ ^
 ^
.if NotGroup
.end // if
.{
 ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.if NotGroup1
.end // if
.endform
//******************************************************************************
.linkform 'PotrNorm' prototype is Rep1006
.nameinlist '▒┌▌└█⌡┘ ▐▌▓░┘│█▌▒▓┬ ┌ █▌░▄─∙'
.group 'Norm'
.var
  CurGroupName: string
.endvar
.fields
RType
DAddInfo

DOType
DOName
DOCode
DONNom

DType
DName
DCode

DDate
DOQnt
DOEIzm
DLevel
DEIzm

.endfields
.begin
CurGroupName:= '';
end.

 ▒┌▌└█⌡┘ ▐▌▓░┘│█▌▒▓┬ ┌ ^ ^

 ┬╖╓╔╚╗╔ (^):
   ╜═╗╛╔╜╝╒═╜╗╔  : ^
   ╝║╝╖╜═Г╔╜╗╔   : ^
   ╜╝╛╔╜╙╚. ╜╝╛╔Ю: ^
 └╝╙Ц╛╔╜Б (^):
   ╜═╗╛╔╜╝╒═╜╗╔  : ^
   ╙╝╓           : ^
 ▐═Ю═╛╔БЮК Ю═АГ╔Б═:
   ╜═ ╓═БЦ       : ^
   ╝║Й╔╛         : ^ ^
   ЦЮ╝╒╔╜Л       : ^
   ╒ ╔╓╗╜╗Ф═Е    : ^
дддддддддддддддддддддддддддддддддддбддддддддддддддддддддддбддддддддддддддддддддддбддддддддддддддддддддддддддд
   █═╗╛╔╜╝╒═╜╗╔                    Ё █╝╛╔╜╙╚. ╜╝╛╔Ю       Ё ▌║╝╖╜═Г╔╜╗╔          Ё ▐╝БЮ╔║╜╝АБЛ
.if NotGroup
дддддддддддддддддддддддддддддддддддеддддддддддддддддддддддеддддддддддддддддддддддеддддддддддддддддддддддддддд
.end // if
.{
.{ ?Internal;(GroupName <> CurGroupName)
.fields
GroupName
.endfields
дддддддддддддддддддддддддддддддддддаддддддддддддддддддддддаддддддддддддддддддддддаддддддддддддддддддддддддддд
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
дддддддддддддддддддддддддддддддддддбддддддддддддддддддддддбддддддддддддддддддддддбддддддддддддддддддддддддддд
.begin
CurGroupName:= GroupName;
end.
.} //end of ?Internal
.fields
PRName
PRNNom
PRCode
PRQnt
PREIzm
.endfields
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ё @@@@@@@@@@@@@@@@@@@@ Ё @@@@@@@@@@@@@@@@@@@@ Ё &&&&&&&&&&.&&&&&&& @@@@@@
.}
.if NotGroup1
.end // if
дддддддддддддддддддддддддддддддддддаддддддддддддддддддддддаддддддддддддддддддддддаддддддддддддддддддддддддддд
.endform
//******************************************************************************
.linkform 'InsNorm' prototype is Rep1006
.nameinlist '▒┌▌└█⌡┘ ▐▌▓░┘│█▌▒▓┬ ┌ ┬█▒▓░⌠▄┘█▓┘'
.group 'InsNorm'
.var
  CurGroupName: string
.endvar
.fields
RType
DAddInfo

DOType
DOName
DOCode
DONNom

DType
DName
DCode

DDate
DOQnt
DOEIzm
DLevel
DEIzm

.endfields
.begin
CurGroupName:= '';
end.

 ▒┌▌└█⌡┘ ▐▌▓░┘│█▌▒▓┬ ┌ ^ ^

 ┬╖╓╔╚╗╔ (^):
   ╜═╗╛╔╜╝╒═╜╗╔  : ^
   ╝║╝╖╜═Г╔╜╗╔   : ^
   ╜╝╛╔╜╙╚. ╜╝╛╔Ю: ^
 └╝╙Ц╛╔╜Б (^):
   ╜═╗╛╔╜╝╒═╜╗╔  : ^
   ╙╝╓           : ^
 ▐═Ю═╛╔БЮК Ю═АГ╔Б═:
   ╜═ ╓═БЦ       : ^
   ╝║Й╔╛         : ^ ^
   ЦЮ╝╒╔╜Л       : ^
   ╒ ╔╓╗╜╗Ф═Е    : ^
ддддддддддддддддддддддддддддддддбддддддддддддддддддддддбддддддддддддддддддддддбдддддддбдддддддддддбдддддддддд
   █═╗╛╔╜╝╒═╜╗╔                 Ё █╝╛╔╜╙╚. ╜╝╛╔Ю       Ё ▌║╝╖╜═Г╔╜╗╔          Ё ┘╓.   Ё ▓Ю╔║Ц╔БАО Ё А ЦГ╔Б╝╛
                                Ё                      Ё                      Ё ╗╖╛.  Ё           Ё ╗╖╜╝А═
.if NotGroup
ддддддддддддддддддддддддддддддддеддддддддддддддддддддддеддддддддддддддддддддддедддддддедддддддддддедддддддддд
.end // if
.{
.{ ?Internal;(GroupName <> CurGroupName)
.fields
GroupName
.endfields
ддддддддддддддддддддддддддддддддаддддддддддддддддддддддаддддддддддддддддддддддадддддддадддддддддддадддддддддд
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
ддддддддддддддддддддддддддддддддбддддддддддддддддддддддбддддддддддддддддддддддбдддддддбдддддддддддбдддддддддд
.begin
CurGroupName:= GroupName;
end.
.} //end of ?Internal
.fields
PRName
PRNNom
PRCode
PREIzm
PRQnt
PRSum
.endfields
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ё @@@@@@@@@@@@@@@@@@@@ Ё @@@@@@@@@@@@@@@@@@@@ Ё @@@@@ Ё &&&&&.&&& Ё &&&&&.&&&
.}
.if NotGroup1
.end // if
ддддддддддддддддддддддддддддддддаддддддддддддддддддддддаддддддддддддддддддддддадддддддадддддддддддадддддддддд
.endform

//******************************************************************************
.linkform 'EquipNorm01' prototype is Rep1006
.nameinlist '▒┌▌└█⌡┘ ▐▌▓░┘│█▌▒▓┬ ┌ ▌│▌░⌠└▌┌─█┬┬'
.group 'Equip'
.var
  CurGroupName: string
  dTotalTime  : double
.endvar
.fields
RType

DOType
DOName
DOCode
DONNom

DType
DName
DCode

DDate
DOQnt
DOEIzm
DLevel

.endfields
.begin
CurGroupName:= '';
end.
.{ ?Internal;(wPREITime = 0)
.begin
  dTotalTime := 0;
end.
.} //end of ?Internal

 ▒┌▌└█⌡┘ ▐▌▓░┘│█▌▒▓┬ ┌ ^

 ┬╖╓╔╚╗╔ (^):
   ╜═╗╛╔╜╝╒═╜╗╔  : ^
   ╝║╝╖╜═Г╔╜╗╔   : ^
   ╜╝╛╔╜╙╚. ╜╝╛╔Ю: ^
 └╝╙Ц╛╔╜Б (^):
   ╜═╗╛╔╜╝╒═╜╗╔  : ^
   ╙╝╓           : ^
 ▐═Ю═╛╔БЮК Ю═АГ╔Б═:
   ╜═ ╓═БЦ       : ^
   ╝║Й╔╛         : ^ ^
   ЦЮ╝╒╔╜Л       : ^
дддддддддддддддддддддддддддддддддддбдддддддддддддддддбдддддддддддддддддддддддддддддддбддддддддддддддддддддддддддд
   █═╗╛╔╜╝╒═╜╗╔                    Ё ▒╔Ю╗╘╜К╘ ╜╝╛╔Ю  Ё ┐ЮЦ╞╞═                        Ё ▐╝БЮ╔║╜╝АБЛ,
                                   Ё                 Ё                               Ё ╛═Х╗╜╝-...
.if NotGroup
дддддддддддддддддддддддддддддддддддедддддддддддддддддедддддддддддддддддддддддддддддддеддддддддддддддддддддддддддд
.end // if
.{
.{ ?Internal;(GroupName <> CurGroupName)
.fields
GroupName
.endfields
дддддддддддддддддддддддддддддддддддадддддддддддддддддадддддддддддддддддддддддддддддддаддддддддддддддддддддддддддд
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
дддддддддддддддддддддддддддддддддддбдддддддддддддддддбдддддддддддддддддддддддддддддддбддддддддддддддддддддддддддд
.begin
CurGroupName:= GroupName;
end.
.} //end of ?Internal
.fields
PRName
PRNNom
PRCode
PRTime
PREIzm
.endfields
.{ ?Internal;(wPREITime = 0)
.begin
  dTotalTime := dTotalTime + PRTime;
end.
.} //end of ?Internal
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ё @@@@@@@@@@@@@@@ Ё @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ё &&&&&&&&.&&&&&&&&& @@@@@@
.}
.if NotGroup1
.end // if
дддддддддддддддддддддддддддддддддддадддддддддддддддддадддддддддддддддддддддддддддддддаддддддддддддддддддддддддддд
.{ ?Internal;(wPREITime = 0)
.fields
  dTotalTime
  PREIzm
.endfields
                                                                     ┬▓▌┐▌ ▐▌ ┬┤└┘▀┬·: &&&&&&&&.&&&&&&&&& @@@@@@
ммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм
.} //end of ?Internal
.endform
//******************************************************************************
.linkform 'EquipNorm02' prototype is Rep1006
.nameinlist '▒┌▌└█⌡┘ ▐▌▓░┘│█▌▒▓┬ ┌ ▌│▌░⌠└▌┌─█┬┬ /╞╝ ёЮЦ╞╞═╛/'
.defo portrait
.group 'EquipGroup'
.var
  CurGroupName: string
  dTotalTime  : double
.endvar
.fields
RType

DOType
DOName
DOCode
DONNom

DType
DName
DCode

DDate
DOQnt
DOEIzm
DLevel

.endfields
.begin
CurGroupName:= '';
end.
.{ ?Internal;(wPREITime = 0)
.begin
  dTotalTime := 0;
end.
.} //end of ?Internal

 ▒┌▌└█⌡┘ ▐▌▓░┘│█▌▒▓┬ ┌ ^

 ┬╖╓╔╚╗╔ (^):
   ╜═╗╛╔╜╝╒═╜╗╔  : ^
   ╝║╝╖╜═Г╔╜╗╔   : ^
   ╜╝╛╔╜╙╚. ╜╝╛╔Ю: ^
 └╝╙Ц╛╔╜Б (^):
   ╜═╗╛╔╜╝╒═╜╗╔  : ^
   ╙╝╓           : ^
 ▐═Ю═╛╔БЮК Ю═АГ╔Б═:
   ╜═ ╓═БЦ       : ^
   ╝║Й╔╛         : ^ ^
   ЦЮ╝╒╔╜Л       : ^
дддддддддддддддддддддддддддддддддддбддддддддддддддддбддддддддддддддддддддддддддд
   █═╗╛╔╜╝╒═╜╗╔                    Ё ▒╔Ю╗╘╜К╘ ╜╝╛╔Ю Ё ▐╝БЮ╔║╜╝АБЛ,
                                   Ё                Ё ╛═Х╗╜╝-...
.if NotGroup
дддддддддддддддддддддддддддддддддддеддддддддддддддддеддддддддддддддддддддддддддд
.end // if
.{
.{ ?Internal;(GroupName <> CurGroupName)
.fields
GroupName
.endfields
дддддддддддддддддддддддддддддддддддаддддддддддддддддаддддддддддддддддддддддддддд
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
дддддддддддддддддддддддддддддддддддбддддддддддддддддбддддддддддддддддддддддддддд
.begin
CurGroupName:= GroupName;
end.
.} //end of ?Internal
.fields
PRName
PRNNom
PRTime
PREIzm
.endfields
.{ ?Internal;(wPREITime = 0)
.begin
  dTotalTime := dTotalTime + PRTime;
end.
.} //end of ?Internal
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ё @@@@@@@@@@@@@@ Ё &&&&&&&&.&&&&&&&&& @@@@@@
.}
.if NotGroup1
.end // if
дддддддддддддддддддддддддддддддддддаддддддддддддддддаддддддддддддддддддддддддддд
.{ ?Internal;(wPREITime = 0)
.fields
  dTotalTime
  PREIzm
.endfields
                                    ┬▓▌┐▌ ▐▌ ┬┤└┘▀┬·: &&&&&&&&.&&&&&&&&& @@@@@@
мммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм
.} //end of ?Internal
.endform
//******************************************************************************
.linkform 'JobNorm01' prototype is Rep1006
.nameinlist '▒┌▌└█⌡┘ ▐▌▓░┘│█▌▒▓┬ ┌ ▓░⌠└▌┤─▓░─▓─∙'
.group 'Job'
.var
  CurGroupName: string
  dGrTime: double
  dGrSum : double
  dTotalTime: double
  dTotalSum : double
.endvar
.fields
RType

DOType
DOName
DOCode
DONNom

DType
DName
DCode

DDate
DOQnt
DOEIzm
DLevel
//DAddInfo

.endfields
.begin
CurGroupName:= GroupName;
// dTotalTime:= 0;
dTotalSum := 0;
end.
.{ ?Internal;(wPREITime = 0)
.begin
  dTotalTime := 0;
end.
.} //end of ?Internal

 ▒┌▌└█⌡┘ ▐▌▓░┘│█▌▒▓┬ ┌ ^

 ┬╖╓╔╚╗╔ (^):
   ╜═╗╛╔╜╝╒═╜╗╔  : ^
   ╝║╝╖╜═Г╔╜╗╔   : ^
   ╜╝╛╔╜╙╚. ╜╝╛╔Ю: ^
 └╝╙Ц╛╔╜Б (^):
   ╜═╗╛╔╜╝╒═╜╗╔  : ^
   ╙╝╓           : ^
 ▐═Ю═╛╔БЮК Ю═АГ╔Б═:
   ╜═ ╓═БЦ       : ^
   ╝║Й╔╛         : ^ ^
   ЦЮ╝╒╔╜Л       : ^
.{ ?Internal;(DEIzm <> '1')
.fields
DAddInfo
.endfields
дддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддддддбддддддддддддддддддддддддддддддддддддддддд
   █═╗╛╔╜╝╒═╜╗╔ ╝╞╔Ю═Ф╗╗           Ё ┌╗╓ Ю═║╝Б                         Ё ▐╝БЮ╔║╜╝АБЛ,
                                   Ё                                   Ё Г╔╚╝╒╔╙╝-...          Ё ^
.} //end of ?Internal  (DEIzm <> '1')
.{ ?Internal;(DEIzm = '1')
.fields
DAddInfo
.endfields
ддддддддддддддддддддддддбддддддддддддддддддддддддддбддддддддддддддддддддддддддбддддддддддддддддддддддддддддддддддддддддд
 █═╗╛╔╜╝╒═╜╗╔ ╞Ю╝Д╔АА╗╗ Ё   █═╗╛╔╜╝╒═╜╗╔ ╝╞╔Ю═Ф╗╗  Ё         ┌╗╓ Ю═║╝Б        Ё ▐╝БЮ╔║╜╝АБЛ,
                        Ё                          Ё                          Ё Г╔╚╝╒╔╙╝-...          Ё ^
.} //end of ?Internal  (DEIzm = '1')
.if NotGroup
.{ ?Internal;(DEIzm <> '1')
дддддддддддддддддддддддддддддддддддедддддддддддддддддддддддддддддддддддедддддддддддддддддддддддеддддддддддддддддд
.} //end of ?Internal  (DEIzm <> '1')
.{ ?Internal;(DEIzm = '1')
ддддддддддддддддддддддддеддддддддддддддддддддддддддеддддддддддддддддддддддддддедддддддддддддддддддддддеддддддддддддддддд
.} //end of ?Internal  (DEIzm = '1')
.else
.{ ?Internal;(DEIzm <> '1')
дддддддддддддддддддддддддддддддддддадддддддддддддддддддддддддддддддддддадддддддддддддддддддддддаддддддддддддддддд
.fields
GroupName
.endfields
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
дддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддбддддддддддддддддд
.} //end of ?Internal  (DEIzm <> '1')
.{ ?Internal;(DEIzm = '1')
ддддддддддддддддддддддддаддддддддддддддддддддддддддаддддддддддддддддддддддддддадддддддддддддддддддддддаддддддддддддддддд
.fields
GroupName
.endfields
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
ддддддддддддддддддддддддбддддддддддддддддддддддддддбддддддддддддддддддддддддддбдддддддддддддддддддддддбддддддддддддддддд
.} //end of ?Internal  (DEIzm = '1')
.begin
// dGrTime:= 0;
dGrSum := 0;
end.
.{ ?Internal;(wPREITime = 0)
.begin
  dGrTime := 0;
end.
.} //end of ?Internal
.end // if
.{
.{ ?Internal;(GroupName <> CurGroupName) and (wPREITime = 0)
.fields
dGrTime
PREIzm
dGrSum
GroupName
.endfields
дддддддддддддддддддддддддддддддддддадддддддддддддддддддддддддддддддддддедддддддддддддддддддддддеддддддддддддддддд
                                                      ┬▓▌┐▌ ▐▌ ┐░⌠▐▐┘: Ё &&&&&&.&&&&&&& @@@@@@ Ё &&&&&&&&&&&&.&&
дддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддддддаддддддддддддддддд
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
дддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддбддддддддддддддддд
.begin
  CurGroupName := GroupName;
  dGrTime      := 0;
  dGrSum       := 0;
end.
.} //end of ?Internal
.{ ?Internal;(GroupName <> CurGroupName) and (wPREITime <> 0)
.fields
// dGrTime
dGrSum
GroupName
.endfields
дддддддддддддддддддддддддддддддддддадддддддддддддддддддддддддддддддддддедддддддддддддддддддддддеддддддддддддддддд
                                                      ┬▓▌┐▌ ▐▌ ┐░⌠▐▐┘: Ё                       Ё &&&&&&&&&&&&.&&
дддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддддддаддддддддддддддддд
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
дддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддбддддддддддддддддд
.begin
CurGroupName:= GroupName;
// dGrTime:= 0;
dGrSum := 0;
end.
.} //end of ?Internal
.{ ?Internal;(DEIzm = '1')
.fields
PRCode
PRName
PRNNom
PRTime
PREIzm
PRSum
.endfields
 @@@@@@@@@@@@@@@@@@@@@@ Ё @@@@@@@@@@@@@@@@@@@@@@@@ Ё @@@@@@@@@@@@@@@@@@@@@@@@ Ё &&&&&&.&&&&&&& @@@@@@ Ё &&&&&&&&&&&&.&&
.} //end of ?Internal  (DEIzm = '1')
.{ ?Internal;(DEIzm <> '1')
.fields
PRName
PRNNom
PRTime
PREIzm
PRSum
.endfields
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ё @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ё &&&&&&.&&&&&&& @@@@@@ Ё &&&&&&&&&&&&.&&
.} //end of ?Internal  (DEIzm <> '1')
.begin
// dGrTime:= dGrTime + PRTime;
dGrSum := dGrSum + PRSum;
// dTotalTime:= dTotalTime + PRTime;
dTotalSum := dTotalSum + PRSum;
end.
.{ ?Internal;(wPREITime = 0)
.begin
  dGrTime    := dGrTime + PRTime;
  dTotalTime := dTotalTime + PRTime;
end.
.} //end of ?Internal
.}
.if NotGroup1
.{ ?Internal;(DEIzm = '1')
ммммммммммммммммммммммммоммммммммммммммммммммммммммоммммммммммммммммммммммммммьмммммммммммммммммммммммьммммммммммммммммм
.} //end of ?Internal  (DEIzm = '1')
.{ ?Internal;(DEIzm <> '1')
мммммммммммммммммммммммммммммммммммомммммммммммммммммммммммммммммммммммьмммммммммммммммммммммммьммммммммммммммммм
.} //end of ?Internal  (DEIzm <> '1')
.else
.{ ?Internal;(wPREITime = 0)
.fields
dGrTime
PREIzm
dGrSum
.endfields
дддддддддддддддддддддддддддддддддддадддддддддддддддддддддддддддддддддддедддддддддддддддддддддддеддддддддддддддддд
                                                      ┬▓▌┐▌ ▐▌ ┐░⌠▐▐┘: Ё &&&&&&.&&&&&&& @@@@@@ Ё &&&&&&&&&&&&.&&
мммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммьмммммммммммммммммммммммьммммммммммммммммм
.} //end of ?Internal
.{ ?Internal;(wPREITime <> 0)
.fields
// dGrTime
dGrSum
.endfields
дддддддддддддддддддддддддддддддддддадддддддддддддддддддддддддддддддддддедддддддддддддддддддддддеддддддддддддддддд
                                                      ┬▓▌┐▌ ▐▌ ┐░⌠▐▐┘: Ё                       Ё &&&&&&&&&&&&.&&
мммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммьмммммммммммммммммммммммьммммммммммммммммм
.} //end of ?Internal
.end // if
.{ ?Internal;(wPREITime = 0) and (DEIzm = '1')
.fields
dTotalTime
PREIzm
dTotalSum
.endfields
                                                            ┬▓▌┐▌ ▐▌ ┬┤└┘▀┬·: Ё &&&&&&.&&&&&&& @@@@@@ Ё &&&&&&&&&&&&.&&
ммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммомммммммммммммммммммммммоммммммммммммммммм
.} //end of ?Internal  (DEIzm = '1')
.{ ?Internal;(wPREITime = 0) and (DEIzm <> '1')
.fields
dTotalTime
PREIzm
dTotalSum
.endfields
                                                     ┬▓▌┐▌ ▐▌ ┬┤└┘▀┬·: Ё &&&&&&.&&&&&&& @@@@@@ Ё &&&&&&&&&&&&.&&
мммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммомммммммммммммммммммммммоммммммммммммммммм
.} //end of ?Internal  (DEIzm <> '1')
.{ ?Internal;(wPREITime <> 0) and (DEIzm = '1')
.fields
// dTotalTime
dTotalSum
.endfields
                                                            ┬▓▌┐▌ ▐▌ ┬┤└┘▀┬·: Ё                       Ё &&&&&&&&&&&&.&&
ммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммомммммммммммммммммммммммоммммммммммммммммм
.} //end of ?Internal  (DEIzm = '1')
.{ ?Internal;(wPREITime <> 0) and (DEIzm <> '1')
.fields
// dTotalTime
dTotalSum
.endfields
                                                     ┬▓▌┐▌ ▐▌ ┬┤└┘▀┬·: Ё                       Ё &&&&&&&&&&&&.&&
мммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммомммммммммммммммммммммммоммммммммммммммммм
.} //end of ?Internal  (DEIzm <> '1')
.endform
//******************************************************************************
.linkform 'JobNorm02' prototype is Rep1006
.nameinlist '▒┌▌└█⌡┘ ▐▌▓░┘│█▌▒▓┬ ┌ ▓░⌠└▌┤─▓░─▓─∙ /╞╝ ╒╗╓═╛ Ю═║╝Б/'
.group 'JobGroup'
.var
  CurGroupName: string
  dGrTime: double
  dGrSum : double
  dTotalTime: double
  dTotalSum : double
.endvar
.fields
RType

DOType
DOName
DOCode
DONNom

DType
DName
DCode

DDate
DOQnt
DOEIzm
DLevel
DEIzm
DAddInfo

.endfields
.begin
CurGroupName:= GroupName;
// dTotalTime:= 0;
dTotalSum := 0;
end.
.{ ?Internal;(wPREITime = 0)
.begin
  dTotalTime := 0;
end.
.} //end of ?Internal

 ▒┌▌└█⌡┘ ▐▌▓░┘│█▌▒▓┬ ┌ ^

 ┬╖╓╔╚╗╔ (^):
   ╜═╗╛╔╜╝╒═╜╗╔  : ^
   ╝║╝╖╜═Г╔╜╗╔   : ^
   ╜╝╛╔╜╙╚. ╜╝╛╔Ю: ^
 └╝╙Ц╛╔╜Б (^):
   ╜═╗╛╔╜╝╒═╜╗╔  : ^
   ╙╝╓           : ^
 ▐═Ю═╛╔БЮК Ю═АГ╔Б═:
   ╜═ ╓═БЦ       : ^
   ╝║Й╔╛         : ^ ^
   ЦЮ╝╒╔╜Л       : ^
ддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддддддддддддддддддддд
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ё ▐╝БЮ╔║╜╝АБЛ,
                                            Ё Г╔╚╝╒╔╙╝-...          Ё ^
.if NotGroup
ддддддддддддддддддддддддддддддддддддддддддддедддддддддддддддддддддддеддддддддддддддддд
.else
ддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддддддаддддддддддддддддд
.fields
GroupName
.endfields
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
ддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддбддддддддддддддддд
.begin
// dGrTime:= 0;
dGrSum := 0;
end.
.{ ?Internal;(wPREITime = 0)
.begin
  dGrTime := 0;
end.
.} //end of ?Internal
.end // if
.{
.{ ?Internal;(GroupName <> CurGroupName) and (wPREITime = 0)
.fields
dGrTime
PREIzm
dGrSum
GroupName
.endfields
ддддддддддддддддддддддддддддддддддддддддддддедддддддддддддддддддддддеддддддддддддддддд
                           ┬▓▌┐▌ ▐▌ ┐░⌠▐▐┘: Ё &&&&&&.&&&&&&& @@@@@@ Ё &&&&&&&&&&&&.&&
ддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддддддаддддддддддддддддд
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
ддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддбддддддддддддддддд
.begin
  CurGroupName := GroupName;
  dGrTime      := 0;
  dGrSum       := 0;
end.
.} //end of ?Internal
.{ ?Internal;(GroupName <> CurGroupName) and (wPREITime <> 0)
.fields
// dGrTime
dGrSum
GroupName
.endfields
ддддддддддддддддддддддддддддддддддддддддддддедддддддддддддддддддддддеддддддддддддддддд
                           ┬▓▌┐▌ ▐▌ ┐░⌠▐▐┘: Ё                       Ё &&&&&&&&&&&&.&&
ддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддддддаддддддддддддддддд
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
ддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддддбддддддддддддддддд
.begin
CurGroupName:= GroupName;
// dGrTime:= 0;
dGrSum := 0;
end.
.} //end of ?Internal
.fields
PRName
PRTime
PREIzm
PRSum
.endfields
.begin
// dGrTime:= dGrTime + PRTime;
dGrSum := dGrSum + PRSum;
// dTotalTime:= dTotalTime + PRTime;
dTotalSum := dTotalSum + PRSum;
end.
.{ ?Internal;(wPREITime = 0)
.begin
  dGrTime    := dGrTime + PRTime;
  dTotalTime := dTotalTime + PRTime;
end.
.} //end of ?Internal
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ё &&&&&&.&&&&&&& @@@@@@ Ё &&&&&&&&&&&&.&&
.}
.if NotGroup1
ммммммммммммммммммммммммммммммммммммммммммммьмммммммммммммммммммммммьммммммммммммммммм
.else
.{ ?Internal;(wPREITime = 0)
.fields
dGrTime
PREIzm
dGrSum
.endfields
ддддддддддддддддддддддддддддддддддддддддддддедддддддддддддддддддддддеддддддддддддддддд
                           ┬▓▌┐▌ ▐▌ ┐░⌠▐▐┘: Ё &&&&&&.&&&&&&& @@@@@@ Ё &&&&&&&&&&&&.&&
ммммммммммммммммммммммммммммммммммммммммммммьмммммммммммммммммммммммьммммммммммммммммм
.} //end of ?Internal
.{ ?Internal;(wPREITime <> 0)
.fields
// dGrTime
dGrSum
.endfields
ддддддддддддддддддддддддддддддддддддддддддддедддддддддддддддддддддддеддддддддддддддддд
                           ┬▓▌┐▌ ▐▌ ┐░⌠▐▐┘: Ё                       Ё &&&&&&&&&&&&.&&
ммммммммммммммммммммммммммммммммммммммммммммьмммммммммммммммммммммммьммммммммммммммммм
.} //end of ?Internal
.end // if
.{ ?Internal;(wPREITime = 0)
.fields
dTotalTime
PREIzm
dTotalSum
.endfields
                          ┬▓▌┐▌ ▐▌ ┬┤└┘▀┬·: Ё &&&&&&.&&&&&&& @@@@@@ Ё &&&&&&&&&&&&.&&
ммммммммммммммммммммммммммммммммммммммммммммомммммммммммммммммммммммоммммммммммммммммм
.} //end of ?Internal
.{ ?Internal;(wPREITime <> 0)
.fields
// dTotalTime
dTotalSum
.endfields
                          ┬▓▌┐▌ ▐▌ ┬┤└┘▀┬·: Ё                       Ё &&&&&&&&&&&&.&&
ммммммммммммммммммммммммммммммммммммммммммммомммммммммммммммммммммммоммммммммммммммммм
.} //end of ?Internal
.endform
//******************************************************************************
.linkform 'PrfNorm' prototype is Rep1006
.nameinlist '▒┌▌└█⌡┘ ▐▌▓░┘│█▌▒▓┬ ┌ ▒▐┘√┬─▀┬▒▓─∙'
.group 'Prof'
.var
  CurGroupName: string
  dGrTime: double
  dGrSum : double
  dTotalTime: double
  dTotalSum : double
.endvar
.fields
RType

DOType
DOName
DOCode
DONNom

DType
DName
DCode

DDate
DOQnt
DOEIzm
DLevel
DAddInfo

.endfields
.begin
CurGroupName:= GroupName;
// dTotalTime:= 0;
dTotalSum := 0;
end.
.{ ?Internal;(wPREITime = 0)
.begin
  dTotalTime := 0;
end.
.} //end of ?Internal

 ▒┌▌└█⌡┘ ▐▌▓░┘│█▌▒▓┬ ┌ ^

 ┬╖╓╔╚╗╔ (^):
   ╜═╗╛╔╜╝╒═╜╗╔  : ^
   ╝║╝╖╜═Г╔╜╗╔   : ^
   ╜╝╛╔╜╙╚. ╜╝╛╔Ю: ^
 └╝╙Ц╛╔╜Б (^):
   ╜═╗╛╔╜╝╒═╜╗╔  : ^
   ╙╝╓           : ^
 ▐═Ю═╛╔БЮК Ю═АГ╔Б═:
   ╜═ ╓═БЦ       : ^
   ╝║Й╔╛         : ^ ^
   ЦЮ╝╒╔╜Л       : ^
ддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддбдддддддддбддддддддддддддддддддддддддддддддддддддддд
   █═╗╛╔╜╝╒═╜╗╔                         Ё ┼╝╓                Ё ░═╖ЮО╓  Ё ▐╝БЮ╔║╜╝АБЛ,
                                        Ё                    Ё         Ё Г╔╚╝╒╔╙╝-...          Ё ^
.if NotGroup
ддддддддддддддддддддддддддддддддддддддддеддддддддддддддддддддедддддддддедддддддддддддддддддддддеддддддддддддддддд
.else
ддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддадддддддддадддддддддддддддддддддддаддддддддддддддддд
.fields
GroupName
.endfields
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
ддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддбдддддддддбдддддддддддддддддддддддбддддддддддддддддд
.begin
// dGrTime:= 0;
dGrSum := 0;
end.
.{ ?Internal;(wPREITime = 0)
.begin
  dGrTime := 0;
end.
.} //end of ?Internal
.end // if
.{
.{ ?Internal;(GroupName <> CurGroupName) and (wPREITime = 0)
.fields
dGrTime
PREIzm
dGrSum
GroupName
.endfields
ддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддадддддддддедддддддддддддддддддддддеддддддддддддддддд
                                                      ┬▓▌┐▌ ▐▌ ┐░⌠▐▐┘: Ё &&&&&&.&&&&&&& @@@@@@ Ё &&&&&&&&&&&&.&&
дддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддддддаддддддддддддддддд
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
ддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддбдддддддддбдддддддддддддддддддддддбддддддддддддддддд
.begin
  CurGroupName := GroupName;
  dGrTime      := 0;
  dGrSum       := 0;
end.

.} //end of ?Internal
.{ ?Internal;(GroupName <> CurGroupName) and (wPREITime <> 0)
.fields
// dGrTime
dGrSum
GroupName
.endfields
ддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддадддддддддедддддддддддддддддддддддеддддддддддддддддд
                                                      ┬▓▌┐▌ ▐▌ ┐░⌠▐▐┘: Ё                       Ё &&&&&&&&&&&&.&&
дддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддддддаддддддддддддддддд
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
ддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддбдддддддддбдддддддддддддддддддддддбддддддддддддддддд
.begin
CurGroupName:= GroupName;
// dGrTime:= 0;
dGrSum := 0;
end.
.} //end of ?Internal
.fields
PRName
PRNNom
PRCode
PRTime
PREIzm
PRSum
.endfields
.begin
// dGrTime:= dGrTime + PRTime;
dGrSum := dGrSum + PRSum;
// dTotalTime:= dTotalTime + PRTime;
dTotalSum := dTotalSum + PRSum;
end.
.{ ?Internal;(wPREITime = 0)
.begin
  dGrTime    := dGrTime + PRTime;
  dTotalTime := dTotalTime + PRTime;
end.
.} //end of ?Internal
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ё @@@@@@@@@@@@@@@@@@ Ё @@@@@@@ Ё &&&&&&.&&&&&&& @@@@@@ Ё &&&&&&&&&&&&.&&
.}
.if NotGroup1
ммммммммммммммммммммммммммммммммммммммммоммммммммммммммммммммомммммммммьмммммммммммммммммммммммьммммммммммммммммм
.else
.{ ?Internal;(wPREITime = 0)
.fields
dGrTime
PREIzm
dGrSum
.endfields
ддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддадддддддддедддддддддддддддддддддддеддддддддддддддддд
                                                      ┬▓▌┐▌ ▐▌ ┐░⌠▐▐┘: Ё &&&&&&.&&&&&&& @@@@@@ Ё &&&&&&&&&&&&.&&
мммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммьмммммммммммммммммммммммьммммммммммммммммм
.} //end of ?Internal
.{ ?Internal;(wPREITime <> 0)
.fields
// dGrTime
dGrSum
.endfields
ддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддадддддддддедддддддддддддддддддддддеддддддддддддддддд
                                                      ┬▓▌┐▌ ▐▌ ┐░⌠▐▐┘: Ё                       Ё &&&&&&&&&&&&.&&
мммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммьмммммммммммммммммммммммьммммммммммммммммм
.} //end of ?Internal
.end // if
.{ ?Internal;(wPREITime = 0)
.fields
dTotalTime
PREIzm
dTotalSum
.endfields
                                                     ┬▓▌┐▌ ▐▌ ┬┤└┘▀┬·: Ё &&&&&&.&&&&&&& @@@@@@ Ё &&&&&&&&&&&&.&&
мммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммомммммммммммммммммммммммоммммммммммммммммм
.} //end of ?Internal
.{ ?Internal;(wPREITime <> 0)
.fields
// dTotalTime
dTotalSum
.endfields
                                                     ┬▓▌┐▌ ▐▌ ┬┤└┘▀┬·: Ё                       Ё &&&&&&&&&&&&.&&
мммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммомммммммммммммммммммммммоммммммммммммммммм
.} //end of ?Internal
.endform

//******************************************************************************
.linkform 'PriceNorm' prototype is Rep1006
.nameinlist '▒┌▌└█⌡┘ ▐▌▓░┘│█▌▒▓┬ ┌ █▌░▄─∙ (√┘█⌡ ┌ █└┘)'
.group 'PriceNorm'
.var
  CurGroupName: string
  GroupSumm   : double
  TotalSumm   : double
.endvar
.fields
RType

DOType
DOName
DOCode
DONNom

DType
DName
DCode

DDate
DOQnt
DOEIzm
DLevel
DEIzm
DVariant
DAddInfo
DAddInfo
.endfields
.begin
CurGroupName:= GroupName;
GroupSumm:= 0;
TotalSumm:= 0;
end.

 ▒┌▌└█⌡┘ ▐▌▓░┘│█▌▒▓┬ ┌ ^

 ┬╖╓╔╚╗╔ (^):
   ╜═╗╛╔╜╝╒═╜╗╔  : ^
   ╝║╝╖╜═Г╔╜╗╔   : ^
   ╜╝╛╔╜╙╚. ╜╝╛╔Ю: ^
 └╝╙Ц╛╔╜Б (^):
   ╜═╗╛╔╜╝╒═╜╗╔  : ^
   ╙╝╓           : ^
 ▐═Ю═╛╔БЮК Ю═АГ╔Б═:
   ╜═ ╓═БЦ       : ^
   ╝║Й╔╛         : ^ ^
   ЦЮ╝╒╔╜Л       : ^
   ╒ ╔╓╗╜╗Ф═Е    : ^
   ╒═Ю╗═╜Б Ф╔╜   : ^
ддддддддддддддддддддддддддддддбдддддддддддддддддддддбдддддддддддддддддддддбддддддддддддддддддбдддддддддбдддддддддд
   █═╗╛╔╜╝╒═╜╗╔               Ё █╝╛╔╜╙╚. ╜╝╛╔Ю      Ё ▌║╝╖╜═Г╔╜╗╔         Ё ▐╝БЮ╔║╜╝АБЛ      Ё √╔╜═    Ё ▒Ц╛╛═
                              Ё                     Ё                     Ё                  Ё @@@@@@@ Ё ^
.if NotGroup
ддддддддддддддддддддддддддддддедддддддддддддддддддддедддддддддддддддддддддеддддддддддддддддддедддддддддедддддддддд
.else
ддддддддддддддддддддддддддддддадддддддддддддддддддддадддддддддддддддддддддаддддддддддддддддддадддддддддадддддддддд
.fields
GroupName
.endfields
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
ддддддддддддддддддддддддддддддбдддддддддддддддддддддбдддддддддддддддддддддбддддддддддддддддддбдддддддддбдддддддддд
.end // if
.{
.{ ?Internal;(GroupName <> CurGroupName)
.fields
GroupSumm
GroupName
.endfields
ддддддддддддддддддддддддддддддадддддддддддддддддддддадддддддддддддддддддддаддддддддддддддддддедддддддддадддддддддд
                                                                            ┬▓▌┐▌ ▐▌ ┐░⌠▐▐┘: Ё &&&&&&&&&&&&&&&.&&
дддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддд
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
ддддддддддддддддддддддддддддддбдддддддддддддддддддддбдддддддддддддддддддддбддддддддддддддддддбдддддддддбдддддддддд
.begin
CurGroupName:= GroupName;
TotalSumm   := TotalSumm + GroupSumm;
GroupSumm   := 0;
end.
.} //end of ?Internal
.begin
GroupSumm:= GroupSumm + PRSum;
end.
.fields
PRName
PRNNom
PRCode
PRQnt
PREIzm
PRPrice
PRSum
.endfields
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ё @@@@@@@@@@@@@@@@@@@ Ё @@@@@@@@@@@@@@@@@@@ Ё &&&&&&.&&&& @@@@@Ё&&&&&.&& Ё&&&&&&.&&
.}
.if NotGroup1
ммммммммммммммммммммммммммммммомммммммммммммммммммммомммммммммммммммммммммоммммммммммммммммммьмммммммммомммммммммм
.else
.fields
GroupSumm
.endfields
ддддддддддддддддддддддддддддддадддддддддддддддддддддадддддддддддддддддддддаддддддддддддддддддедддддддддадддддддддд
                                                                            ┬▓▌┐▌ ▐▌ ┐░⌠▐▐┘: Ё &&&&&&&&&&&&&&&.&&
мммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммьмммммммммммммммммммм
.end // if
.begin
TotalSumm:= TotalSumm + GroupSumm;
end.
.fields
TotalSumm
.endfields
                                                                           ┬▓▌┐▌ ▐▌ ┬┤└┘▀┬·: Ё &&&&&&&&&&&&&&&.&&
мммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммомммммммммммммммммммм
.endform
//******************************************************************************
