//------------------------------------------------------------------------------
//                                                      (c) корпорация ГАЛАКТИКА
// ГАЛАКТИКА 7.11 - Производственное планирование
// Каталог техоперций
//------------------------------------------------------------------------------

#doc
Базовая форма 'Каталог техоперций'</brief>
#end

.form KatOper
.hide
.defo landscape
.fields
 sFilter
 dtRep
 sTOType
 sTOKind
 sTOCode
 sTOCodeEx
 sTOName
 sTOWork
 sTOPodr
.endfields
 ^ ^
.{
 ^ ^ ^ ^ ^ ^ ^
.}
.endform

//******************************************************************************
.linkform 'KatOper_1' prototype is KatOper
.nameinlist 'КАТАЛОГ ОПЕРАЦИЙ'
.fields
 sFilter
 dtRep
 sTOType
 sTOCode
 sTOCodeEx
 sTOName
 sTOWork
 sTOPodr
.endfields

 КАТАЛОГ ОПЕРАЦИЙ ^
 сформирован: ^
─────┬─────────────────────┬──────────────────────────────┬──────────────────────────────┬─────────────
 Тип │ Коды                │ Наименование                 │ Вид работ                    │ Исполнитель
─────┼──────────┬──────────┼──────────────────────────────┼──────────────────────────────┼─────────────
.{
  @  │&&&&&&&&&&│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@
.}
.[F
─────┴──────────┴──────────┴──────────────────────────────┴──────────────────────────────┴─────────────
.]F
.endform
