//------------------------------------------------------------------------------
//                                                      (c) корпорация ГАЛАКТИКА
// ГАЛАКТИКА 7.11 - Производственное планирование
// Отчеты по спецификации
//------------------------------------------------------------------------------

#doc
Базовая форма 'Спецификация отчет'</brief>
#end

.Form SpecifRep
.nameinlist 'Спецификация отчет'
.hide
.Fields
Resours
Res_Oboz
IzdOboz
IzdName
TypeSpecif
Specif
EdNorm
IzdAbbr
IzdKol
.endfields


^
^
.{
^ ^ ^ ^ ^ ^ ^
.}


.EndForm

.LinkForm 'SpecifRep1' prototype is SpecifRep
.nameinlist 'Отчет о вхождении ресурса в спецификации'
.var
nnn:word;
.endvar
.Fields
Resours
Res_Oboz
nnn
IzdOboz
IzdName
TypeSpecif
Specif
EdNorm
IzdAbbr
IzdKol
.endfields
.begin
nnn:=0;
end.



                                            Отчет
                                о вхождении ресурса  в спецификации

    Наименование ресурса        :  ^
    Конструкторское обозначение :  ^

─────┬───────────────┬────────────────┬─────────────────┬────────────────────────┬────────────┬──────────┬──────
     │               │                │                 │                        │            │          │             
Номер│ Обозначение   │  Наименование  │      Тип        │     Наименование       │  Единица   │Количество│ Ед. 
 п/п │               │     изделия    │   спецификации  │     спецификации       │нормирования│          │ изм. 
─────┼───────────────┼────────────────┼─────────────────┼────────────────────────┼────────────┼──────────┼──────                    
.{
.begin
nnn:=nnn+1;
end.
&&&&&│@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@│&&&&&&.&&&│@@@@@
.}
.[F
─────┴───────────────┴────────────────┴─────────────────┴────────────────────────┴────────────┴──────────┴──────
.]F
.EndForm









