//********************************************************************************
//                                                        (c) корпорация Галактика
// Галактика 5.85 - модуль Клиент
// Форма иерархического отчета по предполагаемым продажам
//********************************************************************************

// Основная форма
#doc
Форма иерархического отчета по предполагаемым продажам
#end
.form EstRep
.hide
.fields
  // Фильтры
  ДатаС
  ДатаПо
  // Группировки
  Группировка_Наименование
  Группировка_Количество
  Группировка_Сумма_в_НДЕ
  Группировка_Сумма_в_валюте
  Группировка_валюта
  // Продажа
  Est_NRec
  Номер
  Дата
  Количество
  Цена_в_НДЕ
  Сумма_в_НДЕ
  Цена_в_валюте
  Сумма_в_валюте
  Валюта

  Client_NRec
  Клиент

  Good_NRec
  Товар

  Man_NRec
  Менеджер

  Chanel_NRec
  Diler_NRec
  Канал_сбыта
.endfields
.if Est_IF
 ^ ^
.end
.{
.{ Est_Header CheckEnter
 ^ ^ ^ ^ ^
.}
.{ Est_Oborot CheckEnter
 ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.}
.endform

#doc
Отчет по продажам (в валюте и НДЕ)
#end
.linkform 'EstRep_Val_NDE' prototype is 'EstRep'
.nameinlist 'Отчет по продажам (в валюте и НДЕ)'
.defo Landscape
.fields
  // Фильтры
  ДатаС
  ДатаПо
  // Группировки
  Группировка_Наименование
  Группировка_Количество
  Группировка_Сумма_в_НДЕ
  Группировка_Сумма_в_валюте
  Группировка_валюта
  // Продажа
  Номер
  Дата
  Клиент
  Товар
  Менеджер
  Количество
  Цена_в_НДЕ
  Сумма_в_НДЕ
  Цена_в_валюте
  Сумма_в_валюте
  Валюта
.endfields
 Ш                                                                                                БОтчет по предполагаемым продажам Б
.if Est_IF
                                                                                                  с @@@@@@@@@@ по @@@@@@@@@@
.end

─────────────┬──────────┬────────────────────────┬──────────────────────────────┬──────────────────────────┬──────────────────┬─────────────────┬─────────────────────────┬─────────────────┬─────────────────────────┬────────
    Номер    │   Дата   │         Клиент         │         Товар/услуга         │         Менеджер         │    Количество    │    Цена в НДЕ   │       Сумма в НДЕ       │  Цена в валюте  │      Сумма в валюте     │ Валюта
─────────────┴──────────┴────────────────────────┴──────────────────────────────┴──────────────────────────┴──────────────────┴─────────────────┴─────────────────────────┴─────────────────┴─────────────────────────┴────────
.{
.{ Est_Header CheckEnter
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&&                   &'&&&&&&&&&&&&&&&&&&&&.&&                   &'&&&&&&&&&&&&&&&&&&&&.&& @~@@@@@@ Б
.}
.{ Est_Oborot CheckEnter
@@@@@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&& &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&&&&&&&.&& @~@@@@@@
.}
.} Ш
.endform
