//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.71 - Бухгалтерский контур
// Отчет соответствия финансовых документов и авизо
//------------------------------------------------------------------------------

#doc
Отчет соответствия финансовых документов и авизо
#end
.set name = 'CheckAvizo'
.NameInList 'Базовая форма'
.hide
.fields
  Титл
  Фильтр
  Номер_Документа
  Дата_Документа
  Сумма_Документа      : double
  Сумма_АВИЗО_         : double
  Контрагент_Документа
  Номер_АВИЗО          : string : 'T:-'
  Дата_АВИЗО
  Сумма_АВИЗО          : double
  Контрагент_АВИЗО
.endfields
^
.if ChAVIZOFilter
^
.end
.{CycleOfFinDoc CheckEnter
^^^^^
.{CycleOfAVIZO CheckEnter
^^^^
.}
.}
.endform

!------------------------------------------------------------------------------------------------------------------------------------------------------
.linkform 'CheckAvizo_01' prototype is 'CheckAvizo'
.NameInList 'Краткая форма'
.P 50
.set thousand separator = "`"
.var
  Не_Извещено           : double
  ИТОГО_Сумма_Документа : double
  ИТОГО_Сумма_АВИЗО     : double
  ИТОГО_Не_Извещено     : double
.endvar
.fields
  CommonFormHeader
  Титл
  Фильтр
  Номер_Документа
  Дата_Документа
  Сумма_Документа
  Сумма_АВИЗО_
  Не_Извещено
  Контрагент_Документа
  ИТОГО_Сумма_Документа
  ИТОГО_Сумма_АВИЗО
  ИТОГО_Не_Извещено
.endfields
.[H Skip
 Р                                                                                                      лист @np@
──────────────────────┬──────────┬───────────────┬───────────────┬───────────────┬─────────────────────────────
    Номер документа   │   Дата   │   Сумма по    │   Сумма по    │   Подлежит    │          Контрагент
                      │          │   документу   │     АВИЗО     │   извещению   │
──────────────────────┴──────────┴───────────────┴───────────────┴───────────────┴───────────────────────────── Р
.]H
.begin
  ИТОГО_Сумма_Документа := 0;
  ИТОГО_Сумма_АВИЗО     := 0;
  ИТОГО_Не_Извещено     := 0;
end.
^
 Б@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
.if ChAVIZOFilter
 С@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ С
.end
 Р                                                                                                      лист @np@
──────────────────────┬──────────┬───────────────┬───────────────┬───────────────┬─────────────────────────────
    Номер документа   │   Дата   │   Сумма по    │   Сумма по    │   Подлежит    │          Контрагент
                      │          │   документу   │     АВИЗО     │   извещению   │
──────────────────────┴──────────┴───────────────┴───────────────┴───────────────┴───────────────────────────── Р
.{CycleOfFinDoc CheckEnter
.begin
  Не_Извещено := Сумма_Документа - Сумма_АВИЗО_;
end.
 Р@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@│&&&&&&&&&&&&.&&│&&&&&&&&&&&&.&&│&&&&&&&&&&&&.&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Р
.begin
  ИТОГО_Сумма_Документа := ИТОГО_Сумма_Документа + Сумма_Документа;
  ИТОГО_Сумма_АВИЗО     := ИТОГО_Сумма_АВИЗО     + Сумма_АВИЗО_;
  ИТОГО_Не_Извещено     := ИТОГО_Не_Извещено     + Не_Извещено;
end.
.{CycleOfAVIZO CheckEnter
.}
.}
 Р─────────────────────────────────────────────────────────────────────────────────────────────────────────────── Р
 С               И Т О Г О          &&&&&&&&&&&&.&& &&&&&&&&&&&&.&& &&&&&&&&&&&&.&& С
.endform

!------------------------------------------------------------------------------------------------------------------------------------------------------
.linkform 'CheckAvizo_02' prototype is 'CheckAvizo'
.NameInList 'Полная форма'
.P 50
.set thousand separator = "`"
.var
  Не_Извещено           : double
  ИТОГО_Сумма_Документа : double
  ИТОГО_Сумма_АВИЗО     : double
  ИТОГО_Не_Извещено     : double
.endvar
.fields
  CommonFormHeader
  Титл
  Фильтр
  Номер_Документа
  Дата_Документа
  Сумма_Документа
  Сумма_АВИЗО_
  Не_Извещено
  Контрагент_Документа
  Номер_АВИЗО    : 'T:-'
  Дата_АВИЗО
  Сумма_АВИЗО
  Контрагент_АВИЗО
  ИТОГО_Сумма_Документа
  ИТОГО_Сумма_АВИЗО
  ИТОГО_Не_Извещено
.endfields
.[H Skip
 Р                                                                                                        лист @np@
────────────────────────┬──────────┬───────────────┬───────────────┬───────────────┬─────────────────────────────
     Номер документа    │   Дата   │   Сумма по    │   Сумма по    │   Подлежит    │          Контрагент
                        │          │   документу   │     АВИЗО     │   извещению   │
────────────────────────┴──────────┴───────────────┴───────────────┴───────────────┴───────────────────────────── Р
.]H
.begin
  ИТОГО_Сумма_Документа := 0;
  ИТОГО_Сумма_АВИЗО     := 0;
  ИТОГО_Не_Извещено     := 0;
end.
^
 Б@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
.if ChAVIZOFilter
 С@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ С
.end
 Р                                                                                                        лист @np@
────────────────────────┬──────────┬───────────────┬───────────────┬───────────────┬─────────────────────────────
     Номер документа    │   Дата   │   Сумма по    │   Сумма по    │   Подлежит    │          Контрагент
                        │          │   документу   │     АВИЗО     │   извещению   │
────────────────────────┴──────────┴───────────────┴───────────────┴───────────────┴───────────────────────────── Р
.{CycleOfFinDoc CheckEnter
.begin
  Не_Извещено := Сумма_Документа - Сумма_АВИЗО_;
end.
 С@@@@@@@@@@@@@@@@@@@@@@   @@@@@@@@@@ &&&&&&&&&&&&.&& &&&&&&&&&&&&.&& &&&&&&&&&&&&.&& @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ С
.{CycleOfAVIZO CheckEnter
.[H
 Б   Сопутствующие АВИЗО : Б
.]H
 Р    @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@                 &&&&&&&&&&&&.&&                 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Р
.}
.begin
  ИТОГО_Сумма_Документа := ИТОГО_Сумма_Документа + Сумма_Документа;
  ИТОГО_Сумма_АВИЗО     := ИТОГО_Сумма_АВИЗО     + Сумма_АВИЗО_;
  ИТОГО_Не_Извещено     := ИТОГО_Не_Извещено     + Не_Извещено;
end.
.}
 Р─────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                 И Т О Г О          &&&&&&&&&&&&.&& &&&&&&&&&&&&.&& &&&&&&&&&&&&.&& Р
.endform

