#doc
Акт сверки
#end
.set name = 'AktSver'
.hide
.fields
 nRecАкта
 НомерАкта
 ДатаАкта
 Между
 Договор
 Дата_Договора
 Сумма_Договора
 Валюта_Договора
 Валюта
 Период1
 Период2
 Сальдо_На_Начало
 Кто1
 Контрагент1
 Номер11
 Дата11
 Сумма11
 ОбщаяСумма11
 Номер12
 Дата12
 Сумма12
 ОбщаяСумма12
 Номер13
 Дата13
 Сумма13
 ОбщаяСумма13
 Кто2
 Контрагент2
 Номер21
 Дата21
 Сумма21
 ОбщаяСумма21
 Номер22
 Дата22
 Сумма22
 ОбщаяСумма22
 Номер23
 Дата23
 Сумма23
 ОбщаяСумма23
 Сальдо_На_Конец
.endfields
.{
^^^^^^^^^^^^
^^
.{
^^^
.}
^
.{
^^^
.}
^
.{
^^^
.}
^
^^
.{
^^^
.}
^
.{
^^^
.}
^
.{
^^^
.}
^
^
.}
.endform

#doc
Акт сверки
#end
.linkform  'AS' prototype is AktSver
.nameinlist 'Акт сверки'
.fields
 CommonFormHeader
 НомерАкта
 ДатаАкта
 Между
 Договор
 Дата_Договора
 Сумма_Договора
 Валюта_Договора
 Валюта
 Период1
 Период2
 Сальдо_На_Начало
 Кто1
 Контрагент1
 Номер11
 Дата11
 Сумма11
 ОбщаяСумма11
 Номер12
 Дата12
 Сумма12
 ОбщаяСумма12
 Номер13
 Дата13
 Сумма13
 ОбщаяСумма13
 Кто2
 Контрагент2
 Номер21
 Дата21
 Сумма21
 ОбщаяСумма21
 Номер22
 Дата22
 Сумма22
 ОбщаяСумма22
 Номер23
 Дата23
 Сумма23
 ОбщаяСумма23
 Сальдо_На_Конец
 Контрагент1
 Контрагент2
.endfields
.{
^
                  Б  Приложение к Акту сверки взаиморасчетов
                   № @@@@@@@@@@@@@@ на @@@@@@@@@@ г. между
                      ^
                   по договору № @@@@@@@@@@ от @@@@@@@@@@ г.
                      на сумму ^ ^ Б

               Валюта взаиморасчетов: ^
               За период с ^ по ^

               Сальдо на начало периода: ^

                БКонтрагент 1    ^       ^ Б

                Всчета/документы-основания В
               ┌──────────────┬────────────┬───────────────────┐
               │    Номер     │    Дата    │       Сумма       │
               ├──────────────┼────────────┼───────────────────┤
.{
               │ @@@@@@@@@@@@ │ @@@@@@@@@@ │ &'&&&&&&&&&&&&.&& │
.}
               └──────────────┴────────────┼───────────────────┤
                Б                            │ &'&&&&&&&&&&&&.&& │ Б
                                           └───────────────────┘
                Всопроводительные документы В
               ┌──────────────┬────────────┬───────────────────┐
               │    Номер     │    Дата    │       Сумма       │
               ├──────────────┼────────────┼───────────────────┤
.{
               │ @@@@@@@@@@@@ │ @@@@@@@@@@ │ &'&&&&&&&&&&&&.&& │
.}
               └──────────────┴────────────┼───────────────────┤
                Б                            │ &'&&&&&&&&&&&&.&& │ Б
                                           └───────────────────┘

                Вплатежные документы В
               ┌──────────────┬────────────┬───────────────────┐
               │    Номер     │    Дата    │       Сумма       │
               ├──────────────┼────────────┼───────────────────┤
.{
               │ @@@@@@@@@@@@ │ @@@@@@@@@@ │ &'&&&&&&&&&&&&.&& │
.}
               └──────────────┴────────────┼───────────────────┤
                Б                            │ &'&&&&&&&&&&&&.&& │ Б
                                           └───────────────────┘

                БКонтрагент 2    ^       ^ Б

                Всчета/документы-основания В
               ┌──────────────┬────────────┬───────────────────┐
               │    Номер     │    Дата    │       Сумма       │
               ├──────────────┼────────────┼───────────────────┤
.{
               │ @@@@@@@@@@@@ │ @@@@@@@@@@ │ &'&&&&&&&&&&&&.&& │
.}
               └──────────────┴────────────┼───────────────────┤
                Б                            │ &'&&&&&&&&&&&&.&& │ Б
                                           └───────────────────┘

                Всопроводительные документы В
               ┌──────────────┬────────────┬───────────────────┐
               │    Номер     │    Дата    │       Сумма       │
               ├──────────────┼────────────┼───────────────────┤
.{
               │ @@@@@@@@@@@@ │ @@@@@@@@@@ │ &'&&&&&&&&&&&&.&& │
.}
               └──────────────┴────────────┼───────────────────┤
                Б                            │ &'&&&&&&&&&&&&.&& │ Б
                                           └───────────────────┘

                Вплатежные документы В
               ┌──────────────┬────────────┬───────────────────┐
               │    Номер     │    Дата    │       Сумма       │
               ├──────────────┼────────────┼───────────────────┤
.{
               │ @@@@@@@@@@@@ │ @@@@@@@@@@ │ &'&&&&&&&&&&&&.&& │
.}
               └──────────────┴────────────┼───────────────────┤
                Б                            │ &'&&&&&&&&&&&&.&& │ Б
                                           └───────────────────┘

               Сальдо на конец периода: ^



                Б@@@@@@@@@@@@@@@@@@@@@       @@@@@@@@@@@@@@@@@@@@@ Б

.}
.endform