/*
 ╔════════════════════════════════════════════════════════════════════════════╗
 ║                     (c) Корпорация ГАЛАКТИКА, 1997,98                      ║
 ║ Проект        : ГАЛАКТИКА                                                  ║
 ║ Система       : Оперативный контур                                         ║
 ║ Версия        : 5.70                                                       ║
 ║ Назначение    : Распоряжение на отгрузку                                   ║
 ║ Ответственный : Славко Александр Анатольевич(SLAVKO)                       ║
 ╚════════════════════════════════════════════════════════════════════════════╝
*/
#doc
Распоряжение на отгрузку
#end
.Form 'ROtg_R'
.NameInList 'Базовая форма'
.Hide
.Fields
 РнаО_НРек
 Номер
 Дата
 Орг_Сформ
 Орг_Отпр
  Контр_РнаО
  Тел_Контр_РнаО
  Адр_Контр_РнаО
  Договор
  Контр_Дог
   НЗ_НРек
   Наряд_Заказ
   Тип_Н_З
   Грузоополучатель
   Пункт_Назн
   Адр_Грузоополучателя
    МЦ_Усл
    Количество
    Ед_Изм
    Ресурс_Отгр
    Транспорт
.EndFields
 ^ ^ ^ ^ ^
.{
 ^ ^ ^ ^ ^
.{
 ^ ^ ^ ^ ^ ^
.{
 ^ ^ ^ ^ ^
.}
.}
.}
.EndForm
!
!
!

#doc
Распоряжение на отгрузку
#end
.LinkForm 'ROtg_R1' Prototype Is 'ROtg_R'
.NameInList 'Распоряжение на отгрузку'
.Group 'Телеграмма на отгрузку'
.Fields
 CommonFormHeader
 Номер
 Дата
 Орг_Сформ
 Орг_Отпр
  Контр_РнаО
  Тел_Контр_РнаО
  Адр_Контр_РнаО
  Орг_Отпр
  Договор
  Контр_Дог
   Наряд_Заказ
   Тип_Н_З
   Грузоополучатель
   Пункт_Назн
   Адр_Грузоополучателя
    МЦ_Усл
    Количество
    Ед_Изм
    Ресурс_Отгр
    Транспорт
.EndFields
  ^
! Номер и дата распоряжения на отгрузку
Исх.№ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ от ^

Телеграмма
════════════════════════════════════════════════════════════════════════════════
! Наименование орг.сформировавшей распоряжение на отгрузку
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
! Наименование орг.отправителя в распоряжении на отгрузку
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
! Наименование орг.контролирующей (поля нет)
! @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

.{
════════════════════════════════════════════════════════════════════════════════
! Контрагент в Н/З
Для сведения @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
(Тел.: @@@@@@@@@@@@@@@@@@@ Адрес: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@)
! Наименование орг.отправителя в распоряжении на отгрузку
Прошу выполнить отгрузки с предприятия @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
! Договор
в счет договора @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
! Наименование контрагента в Договоре
по обязательствам @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
по следующим позициям:
! все Н/З этого договора данного распоряжения на отгрузку
.{
────────────────────────────────────────────────────────────────────────────────
! Наряд-заказ №
Наряд-заказ № @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
! Тип Н/З
Тип наряда-заказа: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

! Грузоополучатель Н/З , если нет то Контрагент
Получатель: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
! Пункт назначения Грузоополучателя Н/З, если нет то - По заявке
Пункт назначения: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
! Адрес Грузоополучателя Н/З , если нет то Контрагента
Адрес: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
! Примечание - (поля нет)
Примечание:

.{
! МЦ , Кол-во , Ед_Изм
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ - &#'&&&&&&&&&&& @@@@@@@@@
! Ресурс отгрузки из спец.Н/З
Из ресурсов: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
! Транспорт из спец.Н/З
Способ транспортировки: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

.}
.}
.}
.EndForm

#doc
Телеграмма на аннулирование
#end
.LinkForm 'ROtg_R2' Prototype Is 'ROtg_R'
.NameInList 'Телеграмма на аннулирование'
.Group 'Телеграмма на аннулирование'
.Fields
 CommonFormHeader
 Номер
 Дата
 Орг_Сформ
 Орг_Отпр
  Контр_РнаО
  Тел_Контр_РнаО
  Адр_Контр_РнаО
  Орг_Отпр
  Договор
  Контр_Дог
   Наряд_Заказ
   Тип_Н_З
   Грузоополучатель
   Пункт_Назн
   Адр_Грузоополучателя
    МЦ_Усл
    Количество
    Ед_Изм
    Ресурс_Отгр
    Транспорт
.EndFields
  ^
! Номер и дата распоряжения на отгрузку
Исх.№ ^  от ^

Телеграмма
════════════════════════════════════════════════════════════════════════════════
! Наименование орг.сформировавшей распоряжение на отгрузку
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
! Наименование орг.отправителя в распоряжении на отгрузку
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
! Наименование орг.контролирующей (поля нет)
! @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

.{
════════════════════════════════════════════════════════════════════════════════
! Контрагент в Н/З
Для сведения @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
(Тел.: @@@@@@@@@@@@@@@@@@@ Адрес: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@)
! Наименование орг.отправителя в распоряжении на отгрузку
Прошу исключить из плана отгрузки с предприятия @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
! Договор
в счет договора @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
! Наименование контрагента в Договоре
по обязательствам @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
по следующим позициям (перечисленные наряд-заказы аннулировать):
! все Н/З этого договора данного распоряжения на отгрузку
.{
────────────────────────────────────────────────────────────────────────────────
! Наряд-заказ №
Наряд-заказ № @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
! Тип Н/З
Тип наряда-заказа: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

! Грузоополучатель Н/З , если нет то Контрагент
Получатель: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
! Пункт назначения Грузоополучателя Н/З, если нет то - По заявке
Пункт назначения: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
! Адрес Грузоополучателя Н/З , если нет то Контрагента
Адрес: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
! Примечание - (поля нет)
Примечание:

.{
! МЦ , Кол-во , Ед_Изм
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ - &#'&&&&&&&&&&& @@@@@@@@@
! Ресурс отгрузки из спец.Н/З
Из ресурсов: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
! Транспорт из спец.Н/З
Способ транспортировки: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

.}
.}
.}
.EndForm
