//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.0 - Бухгалтерский контур
// Отчеты \ Реестры \ Просмотр банковской выписки
//------------------------------------------------------------------------------

#doc
Отчеты \ Реестры \ Просмотр банковской выписки
#end
.set name = 'SeeBank'
.nameinlist 'Базовая форма'
.hide
.fields

c0p1      // нач. дата
c0p2      // конеч. дата 
c0p3      // наименование банка
c0p4      // код МФО
c0p5      // счет
c0p6      // "Входящее сальдо"
c0p7      // сумма сальдо
      
PlPorNRec // NRec плат. поручения
c1p1      // Дата выписки док. или Дата оборота факт-я
c1p2      // Номер документа                   
c1p3      // вид операции                     
c1p4      // учетный номер налогоплательщика     
c1p5      // наим.организации или ФИО физ.лица   
c1p6      // наименование банка
c1p7      // код МФО                          {2-й }||  СЧЕТ по дебету
c1p8      // счет                             {цикл}||  СЧЕТ по кредиту
c1p9      // Сумма платежа по док-ту                ||  Дебет 
c1p10     // Сумма платежа по док-ту                ||  Кредит
c1p11     // Сумма в валюте                            
c1p12     // Символ валюты или  Валюта документа
c1p20     // Назначение платежа
          
c2p1      // СУММА по дебету  
c2p2      // СУММА по кредиту
c2p3      // 'Исходящее сальдо'
c2p4      // СУММА по сальдо
          
.endfields
 ^ ^ ^ ^ ^ ^ ^
.if  ИbNoOborotPrint И
.else
.end
.{
 ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
 ^ ^ ^ ^
.endform
!==============================================================================
.linkform 'seebank_01' prototype is 'SeeBank'
.nameinlist '1. Банковская выписка (по оборотам)'
.p 80
.defo portrait
.fields
CommonFormHeader
c0p1 c0p2 c0p3 c0p4 c0p5 c0p6 c0p7
c1p3 c1p2 c1p7 c1p8 c1p9 c1p10
c2p1 c2p2 c2p3 c2p4
.endfields
 И^
         Выписка с  Б^ Б по  Б^ Б
          Б^ Б
         БИК  Б^ Б  Р.Счет  Б^ Б
         @@@@@@@@@@@@@@@@ &'#&&&&&&&&&&&&&&&&&&
.if bNoOborotPrint
────┬──────┬────────────────────────────────┬──────────────────────────────────────
 Вид│Номер │          Корреспондент         │                Обороты
 оп.│док-та├───────────┬────────────────────┼───────────────────┬──────────────────
    │      │     Код   │      Счет          │       Дебет       │        Кредит
────┼──────┼───────────┼────────────────────┼───────────────────┼──────────────────
.else
────┬──────┬────────────────────────────────┬──────────────────────────────────────
 Вид│Номер │          Корреспондент         │                Обороты
 оп.│док-та├───────────┬────────────────────┼───────────────────┬──────────────────
    │      │     Код   │      Счет          │       Дебет       │        Кредит
    │      │Счет по Деб│Счет по кредиту     │                   │
────┼──────┼───────────┼────────────────────┼───────────────────┼──────────────────
.end С
 С.{
@@@@│@@@@@@│@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@│&'#&&&&&&&&&&&&&&& │&'#&&&&&&&&&&&&&&&
.}
────┴──────┴───────────┴────────────────────┴───────────────────┴──────────────────
                        БИтоговые обороты      &'#&&&&&&&&&&&&&&&  &'#&&&&&&&&&&&&&&& Б
───────────────────────────────────────────────────────────────────────────────────
         @@@@@@@@@@@@@@@@ &'#&&&&&&&&&&&&&&&&&& И
.endform
!==============================================================================
.linkform 'seebank_02' prototype is 'SeeBank'
.nameinlist '2. Банковская выписка (по содержанию)'
.p 60
.defo landscape
.fields
CommonFormHeader
c0p1 c0p2 c0p3 c0p4 c0p5 c0p6 c0p7
c1p3 c1p2 c1p7 c1p8 c1p4 + ' '+ c1p5 c1p9 c1p10 c1p20
c2p1 c2p2 c2p3 c2p4
.endfields
 Р^
         Выписка за с  Б^ Б по  Б^ Б
          Б^ Б
         БИК  Б^ Б  Р.Счет  Б^ Б
         @@@@@@@@@@@@@@@@ &'#&&&&&&&&&&&&&&&&&&
 Ш.if bNoOborotPrint
 Ш────┬──────┬─────────────────────────────────────────────────────────────────────────┬───────────────────────────────────────┬──────────────────────────────────────────────────
 Вид│Номер │                       Корреспондент                                     │                Обороты                │               Назначение платежа
 оп.│док-та├───────────┬────────────────────┬────────────────────────────────────────┼───────────────────┬───────────────────┤
    │      │     Код   │       Счет         │               Наименование             │       Дебет       │        Кредит     │
────┼──────┼───────────┼────────────────────┼────────────────────────────────────────┼───────────────────┼───────────────────┼──────────────────────────────────────────────────
.else
────┬──────┬─────────────────────────────────────────────────────────────────────────┬───────────────────────────────────────┬──────────────────────────────────────────────────
 Вид│Номер │                       Корреспондент                                     │                Обороты                │               Назначение платежа
 оп.│док-та├───────────┬────────────────────┬────────────────────────────────────────┼───────────────────┬───────────────────┤
    │      │     Код   │       Счет         │               Наименование             │       Дебет       │        Кредит     │
    │      │Счет по Деб│ Счет по кредиту    │                                        │                   │                   │
────┼──────┼───────────┼────────────────────┼────────────────────────────────────────┼───────────────────┼───────────────────┼──────────────────────────────────────────────────
.end
.{
@@@@│@@@@@@│@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&'#&&&&&&&&&&&&&&& │&'#&&&&&&&&&&&&&&& │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
────┴──────┴───────────┴────────────────────┴────────────────────────────────────────┴───────────────────┴───────────────────┴──────────────────────────────────────────────────
                                                                     БИтоговые обороты  &'#&&&&&&&&&&&&&&&  &'#&&&&&&&&&&&&&&& Б
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
         @@@@@@@@@@@@@@@@ &'#&&&&&&&&&&&&&&&&&& Р
.endform
!==============================================================================
 С