//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.8 - Бухгалтерский контур
// Реестр финансовых операций по ДО
//------------------------------------------------------------------------------

#doc
Реестр финансовых операций по ДО
#end
.set name='TXOPrnFP'
.nameinlist 'Базовая форма'
.hide
.fields
       RegUch
// Поля таблицы документов BaseDoc :
       dDoc  NomDes  BaseDok_Name  KatOrg_Name  SummaDoc
// Поля таблицы спецификаций SpStep:
       NameMCUSL  KatPartyName  KatOtpEd_Name  Price  KolSkl
// Поля таблицы хозопераций SoprHoz :
       SoprHoz_DatOb   NoDoc  SummaSopr   NameOper
// Поля таблицы финпроводок
       StBud CO Period KAU SummaFinProv
.endfields
^
.{ TxoLoopDocum2 CheckEnter    // Цикл по документам
  ^  ^  ^  ^  ^
.if ExistSpec2
.{ TxoLoopSpec2 CheckEnter     // Цикл по спецификациям
  ^  ^  ^  ^  ^
.}
.else
  --- Спецификация отсутствует ---
.end
.if ExistHozOper2
.{ TxoLoopHozOper2  CheckEnter // Цикл по хозоперациям
   ^  ^  ^  ^
.if ExistProvod2
.{ TxoLoopProvod2 CheckEnter // Цикл по финпроводкам
  ^  ^  ^  ^  ^
.}
.else
  --- Финпроводки отсутствуют ---
.end
.}
.else
  --- Хозяйственные операции отсутствуют ---
.end
.}
.endform


.linkform 'TXOPRNFP_1' prototype is 'TXOPRNFP'
.nameinlist 'Документ-Спецификация-ХозОперации-Проводки'
.fields
 CommonFormHeader
 RegUch
// Поля таблицы документов BaseDoc :
    dDoc NomDes BaseDok_Name KatOrg_Name SummaDoc
// Поля таблицы спецификаций SpStep:
    NameMCUSL  KatPartyName  KatOtpEd_Name  Price  KolSkl
// Поля таблицы хозопераций SoprHoz :
    SoprHoz_DatOb   NoDoc  NameOper  SummaSopr
// Поля таблицы финпроводок
    StBud CO Period KAU SummaFinProv
.endfields

 Р^
 Б                                              Операции по документам-основаниям в разрезе
                                           Документ - Спецификация - Хозоперации - Проводки С
 Р
Регистр учета: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Б──────────┬───────────┬────────────────────────────────────────┬───────────────────────────────────────────────┬─────────────────
   Дата   │ Номер ДО  │            Примечание                  │                   Контрагент                  │            Сумма
──────────┴───────────┼────────────────────────────────────────┼─────────────────┬───────────┬─────────────────┼─────────────────
                      │            МЦ/Услуга                   │      Партия     │   Ед.Изм. │      Цена       │            Сумма
                      ├──────────┬───────────┬─────────────────┴─────────────────┴───────────┴─────────────────┼─────────────────
                      │   Дата   │   Номер   │                        Хозяйственная операция                   │Сумма хозоперации
                      ├──────────┴───────────┼─────────────────┬─────────────────┬─────────────────────────────┼─────────────────
                      │    Статья бюджета    │ Центр ответств. │      Период     │              КАУ            │    Сумма оборота
──────────────────────┴──────────────────────┴─────────────────┴─────────────────┴─────────────────────────────┴───────────────── С
 Р.{  TxoLoopDocum2 CheckEnter         // Цикл по документам
@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&
                      ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────
.if ExistSpec2
.{ TxoLoopSpec2 CheckEnter           // Цикл по спецификациям
                      │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@ @@@@@@@@@@@ &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&&
.}
.else
                      │ --- Спецификация отсутствует ---
.end
                      └──────────────────────────────────────────────────────────────────────────────────────────────────────────
.if ExistHozOper2
.{ TxoLoopHozOper2  CheckEnter       // Цикл по хозоперациям
                      ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────
                      │@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&
                      ├──────────────────────────────────────────────────────────────────────────────────────────────────────────
.if ExistProvod2
.{ TxoLoopProvod2 CheckEnter      // Цикл по финпроводкам
                      │@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&
.}
.else
                      │ --- Финпроводки отсутствуют ---
.end
                      └──────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
.else
                      ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────
                      │ --- Хозяйственные операции отсутствуют ---
                      └──────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.} Р
.endform

.linkform 'TXOPRNFP_2' prototype is 'TXOPRNFP'
.nameinlist 'Документ-Спецификация'
.fields
 CommonFormHeader
 RegUch
// Поля таблицы документов BaseDoc :
    dDoc NomDes BaseDok_Name KatOrg_Name SummaDoc
// Поля таблицы спецификаций SpStep:
    NameMCUSL  KatPartyName  KatOtpEd_Name  Price  KolSkl
.endfields

 Р^
 Б                                              Операции по документам-основаниям в разрезе
                                                         Документ - Спецификация С
 Р
Регистр учета: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Б──────────┬───────────┬────────────────────────────────────────┬───────────────────────────────────────────────┬─────────────────
   Дата   │ Номер ДО  │            Примечание                  │                  Контрагент                   │            Сумма
──────────┴───────────┼────────────────────────────────────────┼─────────────────┬───────────┬─────────────────┼─────────────────
                      │            МЦ/Услуга                   │      Партия     │   Ед.Изм. │      Цена       │            Сумма
──────────────────────┴────────────────────────────────────────┴─────────────────┴───────────┴─────────────────┴───────────────── С
 Р.{  TxoLoopDocum2 CheckEnter         // Цикл по документам
@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&
                      ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────
.if ExistSpec2
.{ TxoLoopSpec2 CheckEnter           // Цикл по спецификациям
                      │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@ @@@@@@@@@@@ &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&&
.}
.else
                      │ -- Спецификация отсутствует ---
.end
                      └──────────────────────────────────────────────────────────────────────────────────────────────────────────
.if ExistHozOper2
.{ TxoLoopHozOper2  CheckEnter       // Цикл по хозоперациям
.if ExistProvod2
.{ TxoLoopProvod2 CheckEnter      // Цикл по финпроводкам
.}
.else
.end
.}
.else
.end
.} Р
.endform

.linkform 'TXOPRNFP_3' prototype is 'TXOPRNFP'
.nameinlist 'Документ-ХозОперации-Проводки'
.fields
 CommonFormHeader
 RegUch
// Поля таблицы документов BaseDoc :
   dDoc NomDes BaseDok_Name KatOrg_Name SummaDoc
// Поля таблицы хозопераций SoprHoz :
   SoprHoz_DatOb   NoDoc  NameOper SummaSopr
// Поля таблицы финпроводок
   StBud CO Period KAU SummaFinProv
.endfields

 Р^
 Б                                              Операции по документам-основаниям в разрезе
                                                   Документ - Хозоперации - Проводки С
 Р
Регистр учета: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Б──────────┬───────────┬────────────────────────────────────────┬───────────────────────────────────────────────┬─────────────────
   Дата   │ Номер ДО  │            Примечание                  │              Контрагент                       │            Сумма
──────────┴───────────┼──────────┬───────────┬─────────────────┴───────────────────────────────────────────────┼─────────────────
                      │   Дата   │   Номер   │                        Хозяйственная операция                   │Сумма хозоперации
                      ├──────────┴───────────┼─────────────────┬─────────────┬─────────────────────────────────┼─────────────────
                      │    Статья бюджета    │ Центр ответств. │    Период   │              КАУ                │    Сумма оборота
──────────────────────┴──────────────────────┴─────────────────┴─────────────┴─────────────────────────────────┴───────────────── С
 Р.{  TxoLoopDocum2 CheckEnter         // Цикл по документам
@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&
.if ExistSpec2
.{ TxoLoopSpec2 CheckEnter           // Цикл по спецификациям
.}
.else
.end
.if ExistHozOper2
.{ TxoLoopHozOper2  CheckEnter       // Цикл по хозоперациям
                      ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────
                      │@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&
                      ├──────────────────────────────────────────────────────────────────────────────────────────────────────────
.if ExistProvod2
.{ TxoLoopProvod2 CheckEnter      // Цикл по финпроводкам
                      │@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&
.}
.else
                      │ --- Финпроводки отсутствуют ---
.end
                      └──────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
.else
                      ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────
                      │ --- Хозяйственные операции отсутствуют ---
                      └──────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.} Р
.endform

.linkform 'TXOPRNFP_4' prototype is 'TXOPRNFP'
.nameinlist 'Документ-ХозОперации'
.fields
 CommonFormHeader
 RegUch
// Поля таблицы документов BaseDoc :
    dDoc NomDes BaseDok_Name KatOrg_Name SummaDoc
// Поля таблицы хозопераций SoprHoz :
   SoprHoz_DatOb NoDoc NameOper SummaSopr
.endfields

 Р^
 Б                                              Операции по документам-основаниям в разрезе
                                                         Документ - Хозоперации С
 Р
Регистр учета: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Б──────────┬───────────┬────────────────────────────────────────┬───────────────────────────────────────────────┬─────────────────
   Дата   │ Номер ДО  │            Примечание                  │              Контрагент                       │            Сумма
──────────┴───────────┼──────────┬───────────┬─────────────────┴───────────────────────────────────────────────┼─────────────────
                      │   Дата   │    Номер  │                        Хозяйственная операция                   │Сумма хозоперации
──────────────────────┴──────────┴───────────┴─────────────────────────────────────────────────────────────────┴───────────────── С
 Р.{  TxoLoopDocum2 CheckEnter         // Цикл по документам
@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&
.if ExistSpec2
.{ TxoLoopSpec2 CheckEnter           // Цикл по спецификациям
.}
.else
.end
                      ┌──────────────────────────────────────────────────────────────────────────────────────────────────────────
.if ExistHozOper2
.{ TxoLoopHozOper2  CheckEnter       // Цикл по хозоперациям
                      │@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&&
.if ExistProvod2
.{ TxoLoopProvod2 CheckEnter      // Цикл по финпроводкам
.}
.else
.end
.}
.else
                      │ --- Хозяйственные операции отсутствуют ---
.end
                      └──────────────────────────────────────────────────────────────────────────────────────────────────────────
.} Р
.endform

