/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,2001 корпорация ГАЛАКТИКА                    ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Заработная плата                                          ║
 ║ Версия        : 5.73 и выше                                               ║
 ║ Назначение    : Формирование Анкетных данных по  работникам               ║
 ║                 для  страхового  фонда                                    ║
 ║ Ответственный : Мелех Василий Евгеньевич                                  ║
 ║ Параметры     : нет                                                       ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
#doc
Формирование Анкетных данных по  работникам для  страхового  фонда
#end
.set name = 'ANKETFND'
.hide
.{ AllPachLoop CheckEnter
.fields
CodeOKPO
РегНомер Наименование
НомерПачки ДатаСостав
ЧислоДок
.endfields
^
"ЗГЛВ","02.50"
"РБТД","РБТД","^","^"
"ПАПЧК",^,"^",1
"ТИПД","АНКТ",^
.{ NexpPersLoop CheckEnter
.fields
НомерДок
ДатаЗаполнения: date СтрахНомер ДатаПоступления: date ТабНом Фамилия Имя Отчество Пол
ДатаРожд : date
НасПункт Район Обл Страна ТипДок ТипДок4 НаимДок Серия СерияРим СерияРус НомерПасс Датавыдачи:date КемВыдан
Адр1Индекс Адр1Адр Адр2Индекс Адр2Адр Телефоны
.endfields
^ ^ ^
"АНКТ",^,"^","^","^","^","^","^","^","СТАНДАРТ","^",0,0,0,"СТАНДАРТ","^","^","^","^","^","^","^","^",^,"^","^",^,"^",^,"^","^"
.fields
ДатаОтчета : date
РуководФИО
РуководДОЛЖ
.endfields
^^^
.}
.if EndPach
.{ Anket_ADV6 CheckEnter
.fields
EndPriz:word
.endfields
^
.}
.fields
НомТекПачки
.endfields
___КОНЕЦ ^ ПАЧКИ
.end
.}
.endform
!
.linkform 'ANKETFND_l011' prototype is 'ANKETFND'
.nameinlist'Файл анкетных данных для застрахованных лиц(2.40)'
.var
 PachCnt : word;
 DocCnt  : word;
 my_pred    : string[40];
.endvar
.group 'Анкеты на магнитных носителях'
.begin
  PachCnt :=0
  DocCnt  :=0
  my_pred := Upcase( Trim( Replace( Наименование, '"', '''' ) ) )
end.
.{ AllPachLoop CheckEnter
.fields
РегНомер my_pred
(Word(НомерПачки) + PachCnt) ДатаСостав
ЧислоДок
.endfields
"ЗГЛВ","02.40"
"РБТД","РБТД","^","^"
"ПАЧК",^,"^",1
"ТИПД","АНКТ",^
.begin
  PachCnt := PachCnt + 1
  DocCnt  :=0
end.
.{ NexpPersLoop CheckEnter
.fields
(Word(НомерДок) + DocCnt)
if(Day(ДатаЗаполнения) = 0,'', String(ДатаЗаполнения))
Trim(UpCase(Фамилия)) Trim(UpCase(Имя)) Trim(UpCase(Отчество))
if(Пол = chr(0),Trim(''), UpCase(Пол))
if(Day(ДатаРожд) = 0,'', String(ДатаРожд))
Trim(UpCase(НасПункт)) Trim(UpCase(Район)) Trim(UpCase(Обл)) Trim(UpCase(Страна)) Trim(UpCase(ТипДок4)) Trim(UpCase(НаимДок)) UpCase(СерияРим) UpCase(СерияРус) НомерПасс
if(Day(Датавыдачи) = 0,'', String(Датавыдачи))
Trim(UpCase(КемВыдан))
Адр1Индекс Trim(UpCase(Адр1Адр)) Адр2Индекс Trim(UpCase(Адр2Адр)) Trim(Телефоны)
.endfields
"АНКТ",^,"^","^","^","^","^","СТАНДАРТ","^",0,0,0,"СТАНДАРТ","^","^","^","^","^","^","^","^",^,"^","^",^,"^",^,"^","^"
.begin
  DocCnt := DocCnt + 1
end.
.}
.if EndPach
.{ Anket_ADV6 CheckEnter
.}
.{?internal;EndPriz=0
.fields
НомТекПачки
.endfields
___КОНЕЦ ^ ПАЧКИ
.}
.end
.}
.endform
!
.linkform 'ANKETFND_l01' prototype is 'ANKETFND'
.nameinlist'Файл анкетных данных для застрахованных лиц(2.50)'
.var
 PachCnt : word;
 DocCnt  : word;
 my_pred : string[40];
.endvar
.group 'Анкеты на магнитных носителях'
.begin
  PachCnt :=0
  DocCnt  :=0
  my_pred := Upcase( Trim( Replace( Наименование, '"', '''' ) ) )
end.
.{ AllPachLoop CheckEnter
.fields
РегНомер my_pred
(Word(НомерПачки) + PachCnt) ДатаСостав
ЧислоДок
.endfields
"ЗГЛВ","02.50"
"РБТД","РБТД","^","^"
"ПАЧК",^,"^",1
"ТИПД","АНКТ",^
.begin
  PachCnt := PachCnt + 1
  DocCnt  :=0
end.
.{ NexpPersLoop CheckEnter
.fields
(Word(НомерДок) + DocCnt)
if(Day(ДатаЗаполнения) = 0,'', String(ДатаЗаполнения))
СтрахНомер ТабНом
Trim(UpCase(Фамилия)) Trim(UpCase(Имя)) Trim(UpCase(Отчество))
if(Пол = chr(0),Trim(''), UpCase(Пол))
if(Day(ДатаРожд) = 0,'', String(ДатаРожд))
Trim(UpCase(НасПункт)) Trim(UpCase(Район)) Trim(UpCase(Обл)) Trim(UpCase(Страна)) Trim(UpCase(ТипДок)) Trim(UpCase(НаимДок)) UpCase(СерияРим) UpCase(СерияРус) НомерПасс
if(Day(Датавыдачи) = 0,'', String(Датавыдачи))
Trim(UpCase(КемВыдан))
Адр1Индекс Trim(UpCase(Адр1Адр)) Адр2Индекс Trim(UpCase(Адр2Адр)) Trim(Телефоны)
.endfields
"АНКТ",^,"^","^","^","^","^","^","^","СТАНДАРТ","^",0,0,0,"СТАНДАРТ","^","^","^","^","^","^","^","^",^,"^","^",^,"^",^,"^","^"
.begin
  DocCnt := DocCnt + 1
end.
.}
.if EndPach
.{ Anket_ADV6 CheckEnter
.}
.{?internal;EndPriz=0
.fields
НомТекПачки
.endfields
___КОНЕЦ ^ ПАЧКИ
.}
.end
.}
.endform
!
.linkform 'ANKETFND_l013' prototype is 'ANKETFND'
.nameinlist'Файл данных об обмене Страхового свидетельства ( ИАДВ-2 И)'
.var
 PachCnt : word;
 DocCnt  : word;
 my_pred : string[40];
.endvar
.group 'Заявление об обмене на бумажных бланках'
.begin
  PachCnt :=0
  DocCnt  :=0
  my_pred := Upcase( Trim( Replace( Наименование, '"', '''' ) ) )
end.
.{ AllPachLoop CheckEnter
.fields
РегНомер my_pred
(Word(НомерПачки) + PachCnt) ДатаСостав
ЧислоДок
.endfields
"ЗГЛВ","02.50"
"РБТД","РБТД","^","^"
"ПАЧК",^,"^",1
"ТИПД","ОБМН",^
.begin
  PachCnt := PachCnt + 1
  DocCnt  :=0
end.
.{ NexpPersLoop CheckEnter
.fields
(Word(НомерДок) + DocCnt)
if(Day(ДатаЗаполнения) = 0,'', String(ДатаЗаполнения))
СтрахНомер
Trim(UpCase(Фамилия)) Trim(UpCase(Имя)) Trim(UpCase(Отчество))
if(Пол = chr(0),Trim(''), UpCase(Пол))
if(Day(ДатаРожд) = 0,'', String(ДатаРожд))
Trim(UpCase(НасПункт)) Trim(UpCase(Район)) Trim(UpCase(Обл)) Trim(UpCase(Страна))
Trim(UpCase(ТипДок)) Trim(UpCase(НаимДок)) UpCase(СерияРим) UpCase(СерияРус) НомерПасс
if(Day(Датавыдачи) = 0,'', String(Датавыдачи))
Trim(UpCase(КемВыдан))
Адр1Индекс Trim(UpCase(Адр1Адр)) Адр2Индекс Trim(UpCase(Адр2Адр)) Trim(Телефоны)
.endfields
"ОБМН",^,"^","^","^","^","^","","","","^","СТАНДАРТ","^",0,0,0,"СТАНДАРТ","^","^","^","^","","","^","^","^","^",^,"^","^",^,"^",^,"^","^"
.begin
  DocCnt := DocCnt + 1
end.
.}
.if EndPach
.{ Anket_ADV6 CheckEnter
.}
.{?internal;EndPriz=0
.fields
НомТекПачки
.endfields
___КОНЕЦ ^ ПАЧКИ
.}
.end
.}
.endform
!
.linkform 'ANKETFND_l02' prototype is 'ANKETFND'
.nameinlist'Файл анкетных данных для застрахованных лиц'
.group 'Анкеты на бумажных бланках'
.var
 PachCnt : word;
.endvar
.begin
  PachCnt :=0
end.
.p 48
.{ AllPachLoop CheckEnter
.{ NexpPersLoop CheckEnter
 ИКонфеденциальность информации гарантируется получателем И
 И                                 ┌────────────────────────┐ И
 ИФорма АДВ-1          Код по ОКУД │                        │ И
 И                                 └────────────────────────┘ И

 Й                          АНКЕТА Й
 Й                      ЗАСТРАXОВАННОГО Й
 Й                            ЛИЦА Й
.fields
UpCase(Фамилия) UpCase(Имя) UpCase(Отчество)
if(Пол = chr(0),Trim(''), UpCase(Пол))
Day(ДатаРожд) UpCase(datetostr(ДатаРожд,'mon')) Year(ДатаРожд)
UpCase(НасПункт) UpCase(Район) UpCase(Обл) UpCase(Страна)
Адр1Индекс UpCase(Адр1Адр)
if (trim(Адр1Адр) <> trim(Адр2Адр),Адр2Индекс, '')
if (trim(Адр1Адр) <> trim(Адр2Адр),UpCase(Адр2Адр),'')
Телефоны
if(Trim(НаимДок) <> '',НаимДок, ТипДок)
UpCase(Серия) НомерПасс
Day(Датавыдачи) UpCase(datetostr(Датавыдачи,'mon')) Year(Датавыдачи) UpCase(КемВыдан)
.endfields
 И┌────────────────────────────────────────────────────────────────┐ И
 И│Фамилия                      Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Имя                          Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Отчество                     Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Пол                          Д@@@ (м/ж)                            Д│ И
 И│Дата рождения                Д"@#" @@@@@@@@@@ @#@@ Д года           │ И
 И│Место рождения:                                                 │ И
 И│  город(село,дер.,...)       Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│  район                      Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│  область(край,респ.,...)    Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│  страна                     Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│                                                                │ И
 И│Адрес       индекс  Д@#@@@@@@@@ адрес                              Д│ И
 И│регистрации         Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│                                                                │ И
 И│Адрес места индекс  Д@#@@@@@@@@ адрес                              Д│ И
 И│жительства          Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│фактический        (заполнять при отличии от адреса регистрации)│ И
 И│                                                                │ И
 И│Телефоны                     Д@#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│                                   (домашний или рабочий)       │ И
 И│Документ, удостоверяющий личность:                              │ И
 И│Вид документа                Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│(указать название документа: паспорт, удостоверение личности...)│ И
 И│                                                                │ И
 И│                   Дсерия @@@@@@@@@@@@@@ номер @@@@@@@@@@@@@@@@@@@ Д│ И
 И│Дата выдачи        Д"@#" @@@@@@@@@@ @#@@ Д года                     │ И
 И│Кем выдан          Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│                                                                │ И
 И└────────────────────────────────────────────────────────────────┘ И
.fields
Day(ДатаОтчета) UpCase(datetostr(ДатаОтчета,'mon')) Year(ДатаОтчета)
.endfields
 И Дата заполнения                  Личная подпись И
 И  Д"@#" @@@@@@@@@@ @#@@ Д года        застрахованного лица __________ И


.}
.if EndPach
.{ Anket_ADV6 CheckEnter
.fields
CodeOKPO
РегНомер Наименование
ЧислоДок
ЧислоДок
(Word(НомерПачки) + PachCnt)
РуководДОЛЖ
РуководФИО
.endfields
                                                         Форма АДВ-6
                                ┌─────────────┐               ┌──────────────┐
                    Код по ОКУД │             │   Код по ОКПО │@@@@@@@@@@@@@@│
                                └─────────────┘               └──────────────┘

                 ОПИСЬ ДОКУМЕНТОВ, ПЕРЕДАВАЕМЫХ РАБОТОДАТЕЛЕМ

┌────────────────────────────────────────────────────────────────────────────┐
│Реквизиты работодателя, передающего документы:                              │
│                                                                            │
│Регистрационный номер @@@@@@@@@@@@@@@@@@@@@@@@@@                            │
│                                                                            │
│Наименование @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
└────────────────────────────────────────────────────────────────────────────┘

 Примечания:
            ────────────────────────────────────────────────────────

 ───────────────────────────────────────────────────────────────────

┌─────────────────────────────────────────────────────┬──────────────────────┐
│    Наименование входящего документа                 │Количество документов │
│                                                     │данного наименования  │
│                                                     │в пачке               │
├─────────────────────────────────────────────────────┼──────────────────────┤
│Анкета застрахованного лица                          │  @@@@@@@@@@@@@@@@@@@@│
├─────────────────────────────────────────────────────┼──────────────────────┤
│Заявление об обмене Страхового свидетельства         │                      │
├─────────────────────────────────────────────────────┼──────────────────────┤
│Заявление о выдаче дубликата Страхового свидетельства│                      │
├─────────────────────────────────────────────────────┼──────────────────────┤
│Индивидуальные сведения о трудовом стаже, заработке  │                      │
│(вознаграждении), доходе и начисленных страховых     │                      │
│взносах                                              │                      │
├─────────────────────────────────────────────────────┼──────────────────────┤
│                                                     │                      │
├─────────────────────────────────────────────────────┼──────────────────────┤
│      Итого документов всех наименований:            │  @@@@@@@@@@@@@@@@@@@@│
└─────────────────────────────────────────────────────┴──────────────────────┘

     Заполняется для пачки документов, сопровождаемой машинным носителем
 (дискетой):

     Номер пачки документов,присвоенный работодателем     @@@@@@@@@@@@@@@@

     Заполняется для пачки документов, содержащей "Индивидуальные сведения о
 трудовом стаже, заработке (вознаграждении), доходе и начисленных страховых
 взносах":

     Сведения о заработке (вознаграждении), доходе за отчетный период (итого
 по пачке документов:
┌──────────────┬─────────────────────────────────────────────────────────────┐
│              │  Общие начисления, учитываемые при назначении пенсии        │
│              │  (итого по пачке)                                           │
│              ├───────────────────────┬─────────────────────────────────────┤
│              │всего                  │в том числе по больничным листкам    │
│              │                       │(листкам нетрудоспособности)         │
│              │                       │и стипендии                          │
├──────────────┼───────────────────────┼─────────────────────────────────────┤
│ Итого:       │                       │                                     │
└──────────────┴───────────────────────┴─────────────────────────────────────┘
 Р   Наименование должности руководителя            Подпись                 Расшифровка подписи

   @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                             @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Р

 Дата                    года                    М.П.

 Отметка "ПРИНЯТО"                                1. Сумма начислений за от-
 Специалист КП                                    четный период (за минусом
                                                  б/л), руб.
 ──────────────────────────
   (Ф.И.О)
                                                  2. Сумма страховых взносов
 ──────────────────────────                       за отчетный период, руб.
 Дата

 ──────────────────────────
 Подпись
.begin
  PachCnt := PachCnt + 1
end.
.}
.{?internal;EndPriz=0
 И------------------------------------------------------------------ И
.}
.end
.fields
'true':'s'
.endfields
^
.}
.endform
!
.linkform 'ANKETFND_l03' prototype is 'ANKETFND'
.nameinlist'Заявление об обмене Страхового свидетельства ( ИАДВ-2 И)'
.group 'Заявление об обмене на бумажных бланках'
.p 48
.var   Поступил:date
 PachCnt : word;
  .endvar
.begin
  PachCnt :=0
end.
.{ AllPachLoop CheckEnter
.{ NexpPersLoop CheckEnter
 ИКонфиденциальность информации гарантируется получателем И
 И                                 ┌────────────────────────┐ И
 ИФорма АДВ-2          Код по ОКУД │                        │ И
 И                                 └────────────────────────┘ И

              ЗАЯВЛЕНИЕ ОБ ОБМЕНЕ СТРАХОВОГО
                      СВИДЕТЕЛЬСТВА
.fields
СтрахНомер
UpCase(Фамилия) UpCase(Имя) UpCase(Отчество)
if(Пол = chr(0),'', UpCase(Пол))
Day(ДатаРожд) UpCase(datetostr(ДатаРожд,'mon')) Year(ДатаРожд)
UpCase(НасПункт) UpCase(Район) UpCase(Обл) UpCase(Страна)
Адр1Индекс UpCase(Адр1Адр)
if (trim(Адр1Адр) <> trim(Адр2Адр),Адр2Индекс, '')
if (trim(Адр1Адр) <> trim(Адр2Адр),UpCase(Адр2Адр),'')
Телефоны
if(Trim(НаимДок) <> '',НаимДок, ТипДок)
UpCase(Серия) НомерПасс
Day(Датавыдачи) UpCase(datetostr(Датавыдачи,'mon')) Year(Датавыдачи) UpCase(КемВыдан)
.endfields
 И┌────────────────────────────────────────────────────────────────┐ И
 И│Страховой номер              Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│ ВФ.И.О., указанные в Страховом свидетельстве В                     │ И
 И│Фамилия                      Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Имя                          Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Отчество                     Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│ ВНовые анкетные данные (указать только изменившиеся данные) В      │ И
 И│Фамилия                      Д                                     Д│ И
 И│Имя                          Д                                     Д│ И
 И│Отчество                     Д                                     Д│ И
 И│Пол                          Д@@@ Д (м/ж)                           │ И
 И│Дата рождения                Д"@#" @@@@@@@@@@ @#@@ Д года           │ И
 И│Место рождения:                                                 │ И
 И│  город(село,дер.,...)       Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│  район                      Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│  область(край,респ.,... В) В    Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│  страна                     Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│                                                                │ И
 И│Адрес       индекс  Д@#@@@@@@@@ Д адрес  Д                             Д│ И
 И│регистрации         Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│                                                                │ И
 И│Адрес места индекс  Д@#@@@@@@@@ Д адрес  Д                             Д│ И
 И│жительства          Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│фактический        (заполнять при отличии от адреса регистрации)│ И
 И│                                                                │ И
 И│Телефоны                     Д@#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│                                   (домашний или рабочий)       │ И
 И│Документ, удостоверяющий личность:                              │ И
 И│Вид документа                Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│(указать название документа: паспорт, удостоверение личности...)│ И
 И│                                                                │ И
 И│                  серия  Д@@@@@@@@@@@@@@ Д номер  Д@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Дата выдачи        Д"@#" @@@@@@@@@@ @#@@ Д года                     │ И
 И│Кем выдан          Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│                                                                │ И
 И└────────────────────────────────────────────────────────────────┘ И
.fields
Day(ДатаОтчета) UpCase(datetostr(ДатаОтчета,'mon')) Year(ДатаОтчета)
.endfields
 И Дата заполнения                  Личная подпись И
 И  Д"@#" @@@@@@@@@@ @#@@ Д года        застрахованного лица __________ И
.fields
'true':'s'
.endfields
^
.}
.if EndPach
.{ Anket_ADV6 CheckEnter
.fields
CodeOKPO
РегНомер Наименование
ЧислоДок
ЧислоДок
(Word(НомерПачки) + PachCnt)
РуководДОЛЖ
РуководФИО
.endfields
                                                         Форма АДВ-6
                                ┌─────────────┐               ┌──────────────┐
                    Код по ОКУД │             │   Код по ОКПО │@@@@@@@@@@@@@@│
                                └─────────────┘               └──────────────┘

                 ОПИСЬ ДОКУМЕНТОВ, ПЕРЕДАВАЕМЫХ РАБОТОДАТЕЛЕМ

┌────────────────────────────────────────────────────────────────────────────┐
│Реквизиты работодателя, передающего документы:                              │
│                                                                            │
│Регистрационный номер @@@@@@@@@@@@@@@@@@@@@@@@@@                            │
│                                                                            │
│Наименование @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
└────────────────────────────────────────────────────────────────────────────┘

 Примечания:
            ────────────────────────────────────────────────────────

 ───────────────────────────────────────────────────────────────────

┌─────────────────────────────────────────────────────┬──────────────────────┐
│    Наименование входящего документа                 │Количество документов │
│                                                     │данного наименования  │
│                                                     │в пачке               │
├─────────────────────────────────────────────────────┼──────────────────────┤
│Анкета застрахованного лица                          │                      │
├─────────────────────────────────────────────────────┼──────────────────────┤
│Заявление об обмене Страхового свидетельства         │  @@@@@@@@@@@@@@@@@@@@│
├─────────────────────────────────────────────────────┼──────────────────────┤
│Заявление о выдаче дубликата Страхового свидетельства│                      │
├─────────────────────────────────────────────────────┼──────────────────────┤
│Индивидуальные сведения о трудовом стаже, заработке  │                      │
│(вознаграждении), доходе и начисленных страховых     │                      │
│взносах                                              │                      │
├─────────────────────────────────────────────────────┼──────────────────────┤
│                                                     │                      │
├─────────────────────────────────────────────────────┼──────────────────────┤
│      Итого документов всех наименований:            │  @@@@@@@@@@@@@@@@@@@@│
└─────────────────────────────────────────────────────┴──────────────────────┘

     Заполняется для пачки документов, сопровождаемой машинным носителем
 (дискетой):

     Номер пачки документов,присвоенный работодателем     @@@@@@@@@@@@@@@@

     Заполняется для пачки документов, содержащей "Индивидуальные сведения о
 трудовом стаже, заработке (вознаграждении), доходе и начисленных страховых
 взносах":

     Сведения о заработке (вознаграждении), доходе за отчетный период (итого
 по пачке документов:
┌──────────────┬─────────────────────────────────────────────────────────────┐
│              │  Общие начисления, учитываемые при назначении пенсии        │
│              │  (итого по пачке)                                           │
│              ├───────────────────────┬─────────────────────────────────────┤
│              │всего                  │в том числе по больничным листкам    │
│              │                       │(листкам нетрудоспособности)         │
│              │                       │и стипендии                          │
├──────────────┼───────────────────────┼─────────────────────────────────────┤
│ Итого:       │                       │                                     │
└──────────────┴───────────────────────┴─────────────────────────────────────┘
 Р   Наименование должности руководителя            Подпись                 Расшифровка подписи

   @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                             @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Р

 Дата                    года                    М.П.

 Отметка "ПРИНЯТО"                                1. Сумма начислений за от-
 Специалист КП                                    четный период (за минусом
                                                  б/л), руб.
 ──────────────────────────
   (Ф.И.О)
                                                  2. Сумма страховых взносов
 ──────────────────────────                       за отчетный период, руб.
 Дата

 ──────────────────────────
 Подпись
.begin
  PachCnt := PachCnt + 1
end.
.}
.{?internal;EndPriz=0
 И------------------------------------------------------------------ И
.}
.end
.}
.endform

.linkform 'ANKETFND_l04' prototype is 'ANKETFND'
.nameinlist'Заявление о выдаче дубликата Страхового свидетельства(АДВ-3)'
.group 'Заявление о выдаче на бумажных бланках'
.p 48
.var    Поступил:date
        PachCnt : word;
.endvar
.begin
  PachCnt :=0
end.
.{ AllPachLoop CheckEnter
.{ NexpPersLoop CheckEnter
 И                                 ┌────────────────────────┐ И
 ИФорма АДВ-3          Код по ОКУД │                        │ И
 И                                 └────────────────────────┘ И
              ЗАЯВЛЕНИЕ О ВЫДАЧЕ ДУБЛИКАТА
                СТРАХОВОГО СВИДЕТЕЛЬСТВА
.fields
UpCase(Фамилия) UpCase(Имя) UpCase(Отчество)
if(Пол = chr(0),'', UpCase(Пол))
Day(ДатаРожд) UpCase(datetostr(ДатаРожд,'mon')) Year(ДатаРожд)
UpCase(НасПункт) UpCase(Район) UpCase(Обл) UpCase(Страна)
Адр1Индекс UpCase(Адр1Адр)
if (trim(Адр1Адр) <> trim(Адр2Адр),Адр2Индекс, '')
if (trim(Адр1Адр) <> trim(Адр2Адр),UpCase(Адр2Адр),'')
Телефоны
if(Trim(НаимДок) <> '',НаимДок, ТипДок)
UpCase(Серия) НомерПасс
Day(Датавыдачи) UpCase(datetostr(Датавыдачи,'mon')) Year(Датавыдачи) UpCase(КемВыдан)
.endfields
 И┌────────────────────────────────────────────────────────────────┐ И
 И│ ВДанные, указанные в Страховом свидетельстве В                     │ И
 И│Фамилия                      Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Имя                          Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Отчество                     Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Пол                          Д@@@ Д (м/ж)                           │ И
 И│Дата рождения                Д"@#" @@@@@@@@@@ @#@@ Д года           │ И
 И│Место рождения:                                                 │ И
 И│  город(село,дер.,...)       Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│  район                      Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│  область(край,респ.,... В) В    Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│  страна                     Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│ ВДанные, действительные в настоящее время (указать только  В       │ И
 И│ В                                          изменившиеся данные) В  │ И
 И│Фамилия                      Д                                     Д│ И
 И│Имя                          Д                                     Д│ И
 И│Отчество                     Д                                     Д│ И
 И│Пол                          Д    Д (м/ж)                           │ И
 И│Дата рождения                Д"  "                 Д года           │ И
 И│Место рождения:                                                 │ И
 И│  город(село,дер.,...)       Д                                     Д│ И
 И│  район                      Д                                     Д│ И
 И│  область(край,респ.,... В) В    Д                                     Д│ И
 И│  страна                     Д                                     Д│ И
 И│Адрес       индекс  Д@#@@@@@@@@ Д адрес  Д                             Д│ И
 И│регистрации         Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Адрес места индекс  Д@#@@@@@@@@ Д адрес  Д                             Д│ И
 И│жительства          Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│фактический        (заполнять при отличии от адреса регистрации)│ И
 И│Телефоны                     Д@#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│                                   (домашний или рабочий)       │ И
 И│Документ, удостоверяющий личность:                              │ И
 И│Вид документа                Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│(указать название документа: паспорт, удостоверение личности...)│ И
 И│                  серия  Д@@@@@@@@@@@@@@ Д номер  Д@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Дата выдачи        Д"@#" @@@@@@@@@@ @#@@ Д года                     │ И
 И│Кем выдан          Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И└────────────────────────────────────────────────────────────────┘ И
.fields
Day(ДатаОтчета) UpCase(datetostr(ДатаОтчета,'mon')) Year(ДатаОтчета)
.endfields
 И Дата заполнения                  Личная подпись И
 И  Д"@#" @@@@@@@@@@ @#@@ Д года        застрахованного лица __________ И
.fields
'true':'s'
.endfields
^
.fields
СтрахНомер
РуководДОЛЖ РуководФИО
Day(ДатаОтчета) UpCase(datetostr(ДатаОтчета,'mon')) Year(ДатаОтчета)
.endfields
  ВЗаполняется работодателем. В
 И┌────────────────────────────────────────────────────────────────┐ И
 И│ Для заявления, заверенного работодателем:                      │ И
 И│Заверяю, что застрахованное лицо имело Страховое свидетельство  │ И
 И│со страховым номером  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д, на   │ И
 И│основании которого сведения о его стаже и заработке             │ И
 И│ Дпредставлялись/будут представлены Д в ПФР.                        │ И
 И│     В(ненужное зачеркнуть) В                                       │ И
 И│ Д@@@@@@@@@@@@@@@@@@@@@@ Д   Д            Д  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│ ВНаименование должности В     ВПодпись В        ВРасшифровка  подписи В    │ И
 И│      Вруководителя В                                               │ И
 И│Дата  Д"@#" @@@@@@@@@@ @#@@ Д года                                  │ И
 И└────────────────────────────────────────────────────────────────┘ И
.fields
'true':'s'
.endfields
^
.}
.if EndPach
.{ Anket_ADV6 CheckEnter
.fields
CodeOKPO
РегНомер Наименование
ЧислоДок
ЧислоДок
(Word(НомерПачки) + PachCnt)
РуководДОЛЖ
РуководФИО
.endfields
                                                         Форма АДВ-6
                                ┌─────────────┐               ┌──────────────┐
                    Код по ОКУД │             │   Код по ОКПО │@@@@@@@@@@@@@@│
                                └─────────────┘               └──────────────┘

                 ОПИСЬ ДОКУМЕНТОВ, ПЕРЕДАВАЕМЫХ РАБОТОДАТЕЛЕМ

┌────────────────────────────────────────────────────────────────────────────┐
│Реквизиты работодателя, передающего документы:                              │
│                                                                            │
│Регистрационный номер @@@@@@@@@@@@@@@@@@@@@@@@@@                            │
│                                                                            │
│Наименование @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
└────────────────────────────────────────────────────────────────────────────┘

 Примечания:
            ────────────────────────────────────────────────────────

 ───────────────────────────────────────────────────────────────────

┌─────────────────────────────────────────────────────┬──────────────────────┐
│    Наименование входящего документа                 │Количество документов │
│                                                     │данного наименования  │
│                                                     │в пачке               │
├─────────────────────────────────────────────────────┼──────────────────────┤
│Анкета застрахованного лица                          │                      │
├─────────────────────────────────────────────────────┼──────────────────────┤
│Заявление об обмене Страхового свидетельства         │                      │
├─────────────────────────────────────────────────────┼──────────────────────┤
│Заявление о выдаче дубликата Страхового свидетельства│  @@@@@@@@@@@@@@@@@@@@│
├─────────────────────────────────────────────────────┼──────────────────────┤
│Индивидуальные сведения о трудовом стаже, заработке  │                      │
│(вознаграждении), доходе и начисленных страховых     │                      │
│взносах                                              │                      │
├─────────────────────────────────────────────────────┼──────────────────────┤
│                                                     │                      │
├─────────────────────────────────────────────────────┼──────────────────────┤
│      Итого документов всех наименований:            │  @@@@@@@@@@@@@@@@@@@@│
└─────────────────────────────────────────────────────┴──────────────────────┘

     Заполняется для пачки документов, сопровождаемой машинным носителем
 (дискетой):

     Номер пачки документов,присвоенный работодателем     @@@@@@@@@@@@@@@@

     Заполняется для пачки документов, содержащей "Индивидуальные сведения о
 трудовом стаже, заработке (вознаграждении), доходе и начисленных страховых
 взносах":

     Сведения о заработке (вознаграждении), доходе за отчетный период (итого
 по пачке документов:
┌──────────────┬─────────────────────────────────────────────────────────────┐
│              │  Общие начисления, учитываемые при назначении пенсии        │
│              │  (итого по пачке)                                           │
│              ├───────────────────────┬─────────────────────────────────────┤
│              │всего                  │в том числе по больничным листкам    │
│              │                       │(листкам нетрудоспособности)         │
│              │                       │и стипендии                          │
├──────────────┼───────────────────────┼─────────────────────────────────────┤
│ Итого:       │                       │                                     │
└──────────────┴───────────────────────┴─────────────────────────────────────┘
 Р   Наименование должности руководителя            Подпись                 Расшифровка подписи

   @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                             @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Р

 Дата                    года                    М.П.

 Отметка "ПРИНЯТО"                                1. Сумма начислений за от-
 Специалист КП                                    четный период (за минусом
                                                  б/л), руб.
 ──────────────────────────
   (Ф.И.О)
                                                  2. Сумма страховых взносов
 ──────────────────────────                       за отчетный период, руб.
 Дата

 ──────────────────────────
 Подпись
.begin
  PachCnt := PachCnt + 1
end.
.}
.{?internal;EndPriz=0
 И------------------------------------------------------------------ И
.}
.end
.}
.endform

.linkform 'ANKETFND_l05' prototype is 'ANKETFND'
.nameinlist'Листок исправлений ( ИАДВ- И9)'
.group 'Листок исправлений'
.p 50
.var  Поступил:date
  .endvar
.{ AllPachLoop CheckEnter
.{ NexpPersLoop CheckEnter
 И                                 ┌────────────────────────┐ И
 ИФорма АДВ-9          Код по ОКУД │                        │ И
 И                                 └────────────────────────┘ И
              ЛИСТОК ИСПРАВЛЕНИЙ
.fields
UpCase(Фамилия) UpCase(Имя) UpCase(Отчество)
if(Пол = chr(0),'', UpCase(Пол))
Day(ДатаРожд) UpCase(datetostr(ДатаРожд,'mon')) Year(ДатаРожд)
UpCase(НасПункт) UpCase(Район) UpCase(Обл) UpCase(Страна)
if(Trim(НаимДок) <> '',НаимДок, ТипДок)
UpCase(Серия) НомерПасс
Day(Датавыдачи) UpCase(datetostr(Датавыдачи,'mon')) Year(Датавыдачи)
.endfields
 И Наименование ошибочного документа:
┌──────┬─────────────────────────────────┐
│ ┌──┐ │                                 │
│ │  │ │Страховое свидетельство          │
│ └──┘ │                                 │
│ ┌──┐ │                                 │
│ │  │ │Запрос об уточнении сведений     │
│ └──┘ │                                 │
│  И И┌──┐ │                                 │
│ │  │ │Отказ в выдаче документов        │
│ └──┘ │                                 │
└──────┴─────────────────────────────────┘
 В Ф.И.О. В страхованного лица,   Д                                     Д.
                                           фамилия
 содержащиеся в ошибочном     Д                                     Д.
                                             Имя
 документе                    Д                                     Д.
                                           отчество
 Страховой номер, содержащий-
 ся в ошибочном документе     Д                                     Д.
┌────────────────────────────────────────────────────────────────┐
│Листок исправлений заполнил  Дработодатель/застрахованное лицо Д    │ И
 И│                                  (нужное зачеркнуть)           │ И
 И│Причина возврата документа Д                                       Д│ И
 И│Правильные данные:                                              │ И
 И│Фамилия                      Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Имя                          Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Отчество                     Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Пол                          Д@@@ Д (м/ж)                           │ И
 И│Дата рождения                Д"@#" @@@@@@@@@@ @#@@ Д года           │ И
 И│Место рождения:                                                 │ И
 И│  город(село,дер.,...)       Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│  район                      Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│  область(край,респ.,... В) В    Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│  страна                     Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Документ, удостоверяющий личность:                              │ И
 И│Вид документа                Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│(указать название документа: паспорт, удостоверение личности...)│ И
 И│                  серия  Д@@@@@@@@@@@@@@ Д номер  Д@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Дата выдачи        Д"@#" @@@@@@@@@@ @#@@ Д года                     │ И
 И└────────────────────────────────────────────────────────────────┘ И
.fields
Day(ДатаОтчета) UpCase(datetostr(ДатаОтчета,'mon')) Year(ДатаОтчета)
.endfields
 И Дата заполнения                  Личная подпись И
 И  Д"@#" @@@@@@@@@@ @#@@ Д года        застрахованного лица __________ И
.fields
'true':'s'
.endfields
^
.}
.if EndPach
.{ Anket_ADV6 CheckEnter
.}
.end
.}
.endform

.linkform 'ANKETFND_l06' prototype is 'ANKETFND'
.nameinlist'Запрос об уточнении сведений ( ИАДИ- И2)'
.group 'Запрос об уточнении сведений'
.p 50
.var    Поступил:date
  .endvar
.{ AllPachLoop CheckEnter
.{ NexpPersLoop CheckEnter
 ИПодлежит возврату в территориальный орган ПФР И
 И                                 ┌────────────────────────┐ И
 ИФорма АДИ-2          Код по ОКУД │                        │ И
 И                                 └────────────────────────┘ И

          ЗАПРОС ОБ УТОЧНЕНИИ СВЕДЕНИЙ
.fields
UpCase(Фамилия) UpCase(Имя) UpCase(Отчество)
UpCase(Фамилия) UpCase(Имя) UpCase(Отчество)
if(Пол = chr(0),'', UpCase(Пол))
Day(ДатаРожд) UpCase(datetostr(ДатаРожд,'mon')) Year(ДатаРожд)
UpCase(НасПункт) UpCase(Район) UpCase(Обл) UpCase(Страна)
if(Trim(НаимДок) <> '',НаимДок, ТипДок)
UpCase(Серия) НомерПасс
Day(Датавыдачи) UpCase(datetostr(Датавыдачи,'mon')) Year(Датавыдачи)
.endfields
 ИУважаемый(ая)  Д@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ Д
 Д"  "                 Д года Вы представили в ПФР форму
 Д Д__________________________________________________________________
                   (код и наименование формы)
В числе зарегистрированных в системе государственного пенсионного
страхования застрахованных лиц есть человек с теми же, что и у Вас,
анкетными данными:
Фамилия                         Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д И
 ИИмя                             Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д И
 ИОтчество                        Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д И
 ИПол                             Д@@@ Д (м/ж) И
 ИДата рождения                   Д"@#" @@@@@@@@@@ @#@@ Д года И
 ИМесто рождения: И
 И  город(село,дер.,...)          Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д И
 И  район                         Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д И
 И  область(край,респ.,... В) В       Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д И
 И  страна                        Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д И
 ИДокумент, удостоверяющий личность: И
 ИВид документа                   Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д И
 И И И(указать название документа: паспорт, удостоверение личности...) И
 И                  серия  Д@@@@@@@@@@@@@@ Д номер  Д@@@@@@@@@@@@@@@@@@@ М
 ИДата выдачи        Д"@#" @@@@@@@@@@ @#@@ Д года И
 ИДля принятия решения просим Вас проверить правильность указанных
выше данных и сообщить, представлялась ли на Вас ранее Анкета
застрахованного лица следующими организациями:
┌───┬───────────────┬─────────────────────────────┬────────────────────┐
 И И│N/N│Дата заполнения│ Реквизиты работодателя или  │     Заполняется    │ И
 И│п/п│    формы      │органа ПФР, принявшего форму │застрахованным лицом│ И
 И│   │               │                             │  Форму представлял │ И
 И│   │               │                             │  варианты ответов  │ И
 И│   │               │                             │       да/нет       │ И
 И├───┼───────────────┼─────────────────────────────┼────────────────────┤ И
 И│   │               │                             │                    │ И
 И├───┼───────────────┼─────────────────────────────┼────────────────────┤ И
 И│   │               │                             │                    │ И
 И└───┴───────────────┴─────────────────────────────┴────────────────────┘ И
.fields
Day(ДатаОтчета) UpCase(datetostr(ДатаОтчета,'mon')) Year(ДатаОтчета)
.endfields
 И Дата заполнения                  Личная подпись И
 И  Д"@#" @@@@@@@@@@ @#@@ Д года        застрахованного лица __________ И

 И Исходящий номер СПУ:
.fields
'true':'s'
.endfields
^
 И.}
.if EndPach
.{ Anket_ADV6 CheckEnter
.}
.end
.}
.endform

.linkform 'ANKETFND_l07' prototype is 'ANKETFND'
.nameinlist'Справка о смерти ( ИАДВ- И8)'
.group 'Справка о смерти'
.p 32
.var    Поступил:date
        my_pred : string[40];
.endvar
.begin
  my_pred := Upcase( Trim( Replace( Наименование, '"', '''' ) ) )
end.
.{ AllPachLoop CheckEnter
.{ NexpPersLoop CheckEnter
 И                                 ┌────────────────────────┐ И
 ИФорма АДВ-8          Код по ОКУД │                        │ И
 И                                 └────────────────────────┘ И

               СПРАВКА О СМЕРТИ
.fields
 Иmy_pred И
UpCase(Фамилия) UpCase(Имя) UpCase(Отчество)
if(Пол = chr(0),'', UpCase(Пол))
Day(ДатаРожд) UpCase(datetostr(ДатаРожд,'mon')) Year(ДатаРожд)
UpCase(НасПункт) UpCase(Район) UpCase(Обл) UpCase(Страна)
Day(ДатаОтчета) UpCase(datetostr(ДатаОтчета,'mon')) Year(ДатаОтчета)
РуководДОЛЖ РуководФИО
.endfields
 И┌────────────────────────────────────────────────────────────────┐ И
 И│Наименование организации, представившей справку              Д Д    │ И
 И│ Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И└────────────────────────────────────────────────────────────────┘ И
 И┌────────────────────────────────────────────────────────────────┐ И
 И│Фамилия                      Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Имя                          Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Отчество                     Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Пол                          Д@@@ Д (м/ж)                           │ И
 И│Дата рождения                Д"@#" @@@@@@@@@@ @#@@ Д года           │ И
 И│Место рождения:                                                 │ И
 И│  город(село,дер.,...)       Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│  район                      Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│  область(край,респ.,... В) В    Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│  страна                     Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│                                                                │ И
 И│Дата смерти        Д"  "                 Д года                     │ И
 И│Запись акта №      Д                     Д                          │ И
 И│Дата заполнения    Д"@#" @@@@@@@@@@ @#@@ Д года                     │ И
 И└────────────────────────────────────────────────────────────────┘ И
 М Д
  Д@@@@@@@@@@@@@@@@@@@@@@ Д               Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
 Наименование должности    Подпись       Расшифровка  подписи
      руководителя
 И.fields
Day(ДатаОтчета) UpCase(datetostr(ДатаОтчета,'mon')) Year(ДатаОтчета)
.endfields
 И Дата "@#" @@@@@@@@@@ @#@@ года                  М.П.
.fields
'true':'s'
.endfields
^
 И.}
.if EndPach
.{ Anket_ADV6 CheckEnter
.}
.end
.}
.endform

.linkform 'ANKETFND_l08' prototype is 'ANKETFND'
.nameinlist'Справка о соответствии ( ИАДВ- И7)'
.group 'Справка о соответствии'
.p 30
.var    Поступил:date
        my_pred : string[40];
.endvar
.begin
  my_pred := Upcase( Trim( Replace( Наименование, '"', '''' ) ) )
end.
.{ AllPachLoop CheckEnter
.{ NexpPersLoop CheckEnter
.fields
CodeOKPO
.endfields
 И                           ┌───────────────────┐            ┌───────────────────┐ И
 ИФорма АДВ-7    Код по ОКУД │                   │Код по ОКПО │@@@@@@@@@@@@@@@@@@@│ И
 И                           └───────────────────┘            └───────────────────┘ И

               СПРАВКА О СООТВЕТСТВИИ
.fields
 ИРегНомер И
 Иmy_pred И
UpCase(Фамилия) UpCase(Имя) UpCase(Отчество)
ДатаПоступления
СтрахНомер
РуководДОЛЖ РуководФИО
Day(ДатаОтчета) UpCase(datetostr(ДатаОтчета,'MON')) Year(ДатаОтчета)
.endfields
 И┌────────────────────────────────────────────────────────────────┐ И
 И│Реквизиты организации, представившей справку:                Д Д    │ И
 И│Регистрационный номер        Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Наименование  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И└────────────────────────────────────────────────────────────────┘ И
 И┌────────────────────────────────────────────────────────────────┐ И
 И│Застрахованное лицо                                             │ И
 И│Фамилия                      Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Имя                          Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Отчество                     Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д│ И
 И│Поступил(а) на работу        Д @~@@@@@@@@@@@@      Д                │ И
 И│На основании Страхового свидетельства со страховым номером      │ И
 И│ Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д сведения о его (ее) стаже  │ И
 И│и заработке  Дпредсталялись/будут представлены Д в ПФР.             │ И
 И│                   В(ненужное зачеркнуть) В                         │ И
 И└────────────────────────────────────────────────────────────────┘ И
 М Д
  Д@@@@@@@@@@@@@@@@@@@@@@ Д               Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
 Наименование должности    Подпись       Расшифровка  подписи
      руководителя
 Дата "@#" @@@@@@@@@@ @#@@ года                  М.П.
.fields
'true':'s'
.endfields
^
 И.}
.if EndPach
.{ Anket_ADV6 CheckEnter
.}
.end
.}
.endform