//********************************************************************************
//                                                        (c) корпорация Галактика
// Галактика 8.50 - Сервисные функции
// протокол проверки использования пользавательской аналитики 				 	
//********************************************************************************

#doc
  Протокол проверки использования пользавательской аналитики.
#end

.Form CheckinAnalit 
.fields
  NameTable : String
  NameCheckAnalit : String
  NameZnachAnalit : String
  Count : String 
  
      
.endfields


                            Проверка использования аналитики

┌─────────────────────────────┬─────────────┬───────────────┬─────────────┐
│                             │   Название  │   Значение    │             │
│         Название Таблицы    │  аналитики  │  аналитики    │  Количество │
│                             │             │               │             │
├─────────────────────────────┼─────────────┼───────────────┼─────────────┤
.{ cycleofcheck
│ @@@@@@@@@@@@@@@@@@@@@@@@@@@ │  @@@@@@@@@@@│ @@@@@@@@@@@@@ │ @@@@@@@@@@@ │
.}
└─────────────────────────────┴─────────────┴───────────────┴─────────────┘

.endform