//********************************************************************************
//                                                        (c) ชฎเฏฎเ ๆจ๏  ซ ชโจช 
//  ซ ชโจช  5.84 - ‘ฅเขจแญ๋ฅ ไใญชๆจจ
// เฎโฎชฎซ ฏ ชฅโญฎฉ ฏฅ็ โจ ฎ่จกฎช ขแฅๅ โจฏฎข ฎก๊ฅคจญฅญจ๏
//********************************************************************************

#doc
  เฎโฎชฎซ ฏ ชฅโญฎฉ ฏฅ็ โจ ฎ่จกฎช ขแฅๅ โจฏฎข ฎก๊ฅคจญฅญจ๏.	
#end


.Form ErrObAll 
.fields
  ResultAll : string
  RecResultAll : comp
    ObAll : string
    RecObAll : comp
      No : longint
      ErrTable : string
      ErrRec : comp
      Text : string
      ErrSumSp : longint
    ErrSumJoi  : longint
  ErrSumAll    : longint
.endfields

                            เฎโฎชฎซ ฎ่จกฎช

ฺฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ
ณ    ณ               ณ                 ณ                                       ณ
ณฏ/ฏ ณ    ’ กซจๆ     ณ   ฎฌฅเ ง ฏจแจ  ณ             ฏจแ ญจฅ ฎ่จกชจ           ณ
ณ    ณ               ณ                 ณ                                       ณ
รฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤด
.{CycleOfResAll
ฦออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออต
ณ                           ………                                       ณ
ณ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  NREC @@@@@@@@@@@@@@@@@ณ
ฦออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออต
.{CycleOfObAll
ณ ก๊ฅคจญ๏ฅโแ๏  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ NREC @@@@@@@@@@@@@@@@@ณ
รฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤด
.{CycleOfErrorAll
ณ&&&&ณ@@@@@@@@@@@@@@@ณ@@@@@@@@@@@@@@@@@ณ@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ณ
ณ    ณ               ณ                 ณ                                       ณ
.}
รฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤด
ณ                                      ณ ่จกฎช: @@@@@@@@@@@@@@@@              ณ
ฦออออออออออออออออออออออออออออออออออออออฯอออออออออออออออออออออออออออออออออออออออต
.}
ณ แฅฃฎ ฎ่จกฎช คซ๏ เฅงใซ์โ โ  ฎก๊ฅคจญฅญจ๏: @@@@@@@@@@@@@@@@                    ณ
.}
ิออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออพ

แฅฃฎ ฎ่จกฎช ฎก๊ฅคจญฅญจ๏: @@@@@@@@@@@@@@@@
.endform