//********************************************************************************
//                                                        (c) ชฎเฏฎเ ๆจ๏  ซ ชโจช 
//  ซ ชโจช  5.84 - ‘ฅเขจแญ๋ฅ ไใญชๆจจ
// เฎโฎชฎซ ฏ ชฅโญฎฉ ฏฅ็ โจ ฎ่จกฎช ฎก๊ฅคจญฅญจ๏ –
//********************************************************************************

#doc
  เฎโฎชฎซ ฏ ชฅโญฎฉ ฏฅ็ โจ ฎ่จกฎช ฎก๊ฅคจญฅญจ๏ –.
#end

.Form ErrObMc
.fields
  ResultMc : string
  RecResultMc : comp
    ObMc : string
    RecObMc : comp
      No : longint
      ErrTable : string
      ErrRec : comp
      Text : string
      ErrSumSp : longint
    ErrSumJoi  : longint
  ErrSumAll    : longint
.endfields

                            เฎโฎชฎซ ฎ่จกฎช

ฺฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ
ณ    ณ               ณ                 ณ                                       ณ
ณฏ/ฏ ณ    ’ กซจๆ     ณ   ฎฌฅเ ง ฏจแจ  ณ             ฏจแ ญจฅ ฎ่จกชจ           ณ
ณ    ณ               ณ                 ณ                                       ณ
รฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤด
.{CycleOfResMc
ฦออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออต
ณ                           ………                                       ณ
ณ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  NREC @@@@@@@@@@@@@@@@@ณ
ฦออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออต
.{CycleOfObMc
ณ ก๊ฅคจญ๏ฅโแ๏  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ NREC @@@@@@@@@@@@@@@@@ณ
รฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤด
.{CycleOfError
ณ&&&&ณ@@@@@@@@@@@@@@@ณ@@@@@@@@@@@@@@@@@ณ@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ณ
ณ    ณ               ณ                 ณ                                       ณ
.}
รฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤด
ณ                                      ณ ่จกฎช: @@@@@@@@@@@@@@@@              ณ
ฦออออออออออออออออออออออออออออออออออออออฯอออออออออออออออออออออออออออออออออออออออต
.}
ณ แฅฃฎ ฎ่จกฎช คซ๏ เฅงใซ์โ โ  ฎก๊ฅคจญฅญจ๏: @@@@@@@@@@@@@@@@                    ณ
.}
ิออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออพ

แฅฃฎ ฎ่จกฎช ฎก๊ฅคจญฅญจ๏: @@@@@@@@@@@@@@@@
.endform