//**************************************************************************************************
//                                                                        (c) корпорация Галактика
// Галактика 8.10 - Сервисные функции
// протокол по времени объединения учетных единиц
//**************************************************************************************************

#doc
  Протокол по времени объединения учетных единиц.
#end
.form ExchngTime 
.hide
.fields
  interfacename
  fromname
  toname
  tabname
  starttime
  endtime
  exetime
  sumfromname
  sumtoname
  tof2form
  fromexetime
  sumsumtoname
  toexetime
  sumexetime
.endfields
 ^
.{CyrcleOfObedUchEd
.{CyrcleOfToUchEd
.{CyrcleOfFromUchEd
 ^ ^ ^ ^ ^ ^
.}
 ^ ^ ^ ^
.}
^ ^
.}
^
.endform
!
.linkform 'ExchngTime1' prototype is 'ExchngTime'
.nameinlist "Протокол по времени объединения"
.fields
  interfacename
  fromname
  toname
  tabname
  starttime
  endtime
  exetime
  sumfromname
  sumtoname
  fromexetime
  sumsumtoname
  toexetime
  sumexetime
.endfields
                              Протокол по времени объединения ^
┌─────────────────────┬─────────────────────┬─────────────────────────────┬─────────────┬─────────────┬─────────────┐
│    объединяемый     │    объединяющий     │          таблица            │   начало    │   конец     │   время     │
│                     │                     │                             │ объединения │ объединения │ объединения │
├─────────────────────┼─────────────────────┼─────────────────────────────┼─────────────┼─────────────┼─────────────┤
.{CyrcleOfObedUchEd
.{CyrcleOfToUchEd
.{CyrcleOfFromUchEd
│ @@@@@@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@@@@@ │ @@@@@@@@@@@ │ @@@@@@@@@@@ │ @@@@@@@@@@@ │
.}
├─────────────────────┼─────────────────────┼─────────────────────────────┴─────────────┴─────────────┴─────────────┤
│ @@@@@@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@ │                                                           @@@@@@@@@@@ │
├─────────────────────┴─────────────────────┴───────────────────────────────────────────────────────────────────────┤
.}
│   Общее время объединения для   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                 @@@@@@@@@@@ │
├───────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
.}
│   Общее время объединения                                                                             @@@@@@@@@@@ │
└───────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
.endform
!
.linkform 'ExchngTime2' prototype is 'ExchngTime'
.nameinlist "Общий протокол по времени объединения"
.fields
  interfacename
  sumfromname
  tof2form
 // sumtoname
  fromexetime
  sumsumtoname
  toexetime
  sumexetime
.endfields
          Протокол по времени объединения ^
┌─────────────────────┬─────────────────────┬───────────────┐
│    Объединяемый     │    Объединяющий     │     Время     │
│                     │                     │   объединения │
├─────────────────────┼─────────────────────┼───────────────┤
.{CyrcleOfObedUchEd
.{CyrcleOfToUchEd
.{CyrcleOfFromUchEd
.}
│ @@@@@@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@ │   @@@@@@@@@@@ │
.}
├─────────────────────┴─────────────────────┴───────────────┤
│ Общее время объединения для                               │
│ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@ │
├───────────────────────────────────────────────────────────┤
.}
│ Общее время объединения                       @@@@@@@@@@@ │
└───────────────────────────────────────────────────────────┘
.endform
 П