.Form 'frActFormProtocol'
.NameInList 'Базовая форма'
.Fields
  DataTimeUserStr
  
  PONumber
  POPodr
  
  PODateBeg 
  PODateEnd
  
  ActNumber
  Naznachenie
  Prim
.endfields
^

                         ПРОТОКОЛ ФОРМИРОВАНИЯ АКТОВ СПИСАНИЯ

.{
  Производственный отчет: ^
  Подразделение:          ^
  Период действия:        с ^ по ^
 ┌────────────────────────────────┬────────────────────────────┬─────────────────────┐
 │      Номер акта списания       │        Назначение          │    Примечание       │
 ├────────────────────────────────┼────────────────────────────┼─────────────────────┤
.{
 │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@│
.}
 └────────────────────────────────┴────────────────────────────┴─────────────────────┘
.}
.endform