/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 2001 корпорация ГАЛАКТИКА                         ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Контроллинг                                               ║
 ║ Версия        : 8.1                                                       ║
 ║ Назначение    : Печать итоговых данных по всем ресурсам                   ║
 ║ Ответственный : Магазинников Алексей Валентинович                         ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
.set Name = 'ItgDataAllRes'
.Hide
.Fields
 HeadLine
 strFiltr
 strtmp1
 strtmp2
 strtmp3
 strtmp4
 strtmp5
 strtmp6
 Valut
 strDei1
 Valut1
 strDei2
 BegSaldo
 BegSum
 BegSaldo2
 SentCom
 SentSum
 SentCom2
 InCom
 InSum
 InCom2
 ProdCom
 ProdSum
 ProdCom2
 PotrCom
 PotrSum
 PotrCom2
 ProdComN
 ProdSumN
 ProdComN2
 SpisCom
 SpisSum
 SpisCom2
 ProdNZP
 EndSaldo
 EndSum
 EndSaldo2
.EndFields
 ^
																																																^
                       &&&&&&&&&&           &&&&&            &&&&&&&&&&                             &&&&&&&&&&           &&&&&            &&&&&&&&&&
                                        &&&&&&&&&&             &&&&&                                                 &&&&&&&&&&             &&&&&
 Входящий остаток  &&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&   Передано          &&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&
 Поступило         &&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&   Выпуск            &&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&
 Переработано      &&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&   По норме          &&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&
 Cписано           &&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&   Выпуск в НЗП      &&&&&&&&&&&&&&&&&&
                                                                              Исходящий остаток &&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&&

.endform
!
.LinkForm 'ItgDataAllRes_01' Prototype is 'ItgDataAllRes'
.NameInList 'Отчет в формате ТЕКСТ'
.Fields
 HeadLine
 strFiltr
 strtmp1
 strtmp2
 strtmp3
 strtmp4
 strtmp5
 strtmp6
 Valut
 strDei1
 Valut1
 strDei2
 BegSaldo
 BegSum
 BegSaldo2
 SentCom
 SentSum
 SentCom2
 InCom
 InSum
 InCom2
 ProdCom
 ProdSum
 ProdCom2
 PotrCom
 PotrSum
 PotrCom2
 ProdComN
 ProdSumN
 ProdComN2
 SpisCom
 SpisSum
 SpisCom2
 ProdNZP
 EndSaldo
 EndSum
 EndSaldo2
.EndFields
^

                                                               Итоговые данные по всем ресурсам ^
──────────────────┬──────────────────┬──────────────────┬──────────────────┬───────────────────┬──────────────────┬──────────────────┬──────────────────┬
                  │    &&&&&&&&&&    │      &&&&&       │    &&&&&&&&&&    │                   │    &&&&&&&&&&    │      &&&&&       │    &&&&&&&&&&    │
                  │                  │  &&&&&&&&&&      │       &&&&&      │                   │                  │  &&&&&&&&&&      │       &&&&&      │
──────────────────│──────────────────│──────────────────│──────────────────│───────────────────│──────────────────│──────────────────│──────────────────│
 Входящий остаток │&&&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&&&│  Передано         │&&&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&&&│
 Поступило        │&&&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&&&│  Выпуск           │&&&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&&&│
 Переработано     │&&&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&&&│  По норме         │&&&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&&&│
 Cписано          │&&&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&&&│  Выпуск в НЗП     │&&&&&&&&&&&&&&&&&&│                  │                  │
                  │                  │                  │                  │  Исходящий остаток│&&&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&&&│
──────────────────┴──────────────────┴──────────────────┴──────────────────┴───────────────────┴──────────────────┴──────────────────┴──────────────────┴
.endform
