/*
╔═════════════════════════════════════════════════════════════╗
║             (c) 2001  Корпорация ГАЛАКТИКА                  ║
║ Проект:     Галактика                                       ║
║ Система:    Контроллинг                                     ║
║ Версия:     7.1                                             ║
║ Назначение: Формы отчета о ценах                            ║
║ Автор:      Бычковский О. Ф.                                ║
║ Параметры:  Нет                                             ║
╚═════════════════════════════════════════════════════════════╝
*/
.Form 'fPriceOutp'
.Hide
.Fields
   Название_отчета
   Цены_даны_по_состоянию_на_дату
   Фильтр
   Тип_Изготовитель
   Окончание_первой_строки_головки_таблицы
   Вторая_строка_головки_таблицы
   Третья_строка_головки_таблицы
   Ресурс
   Ресурс_номенклатурный_номер
   Партия
   Подразделение

   Цена
.EndFields

^
^
^

 .{.?Ot_price_stL1OP; .}
 .{.?Ot_price_stL2OP; ^.}
^ .{.?Ot_price_stL3OP; ^.}
 .{.?Ot_price_stL4OP; ^.}
 .{.?Ot_price_stL5OP; .}

.{
  ^ ^ ^ ^ .{.?Ot_price_stZnOP; ^.}
.}
 .{.?Ot_price_stL6OP;.}

.EndForm

.LinkForm 'lfPriceOutp_02' ProtoType Is 'fPriceOutp'
.NameInList 'Список цен'
.Fields
Название_отчета

Цены_даны_по_состоянию_на_дату
Фильтр
Тип_Изготовитель
Окончание_первой_строки_головки_таблицы
Вторая_строка_головки_таблицы
Третья_строка_головки_таблицы
Ресурс
Ресурс_номенклатурный_номер
Партия
Подразделение

Цена
.EndFields

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

──────────────────────────────────┬────────────────────┬────────────────────┬────────────────────────────.{.?Ot_price_stL1OP;┬─────────────────────.}
                                  │                    │                    │                            .{.?Ot_price_stL2OP;│@@@@@@@@@@@@@@@@@@@@@.}
           Ресурс                 │Номенклатурный номер│      Партия        │@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?Ot_price_stL3OP;│@@@@@@@@@@@@@@@@@@@@@.}
                                  │                    │                    │                            .{.?Ot_price_stL4OP;│@@@@@@@@@@@@@@@@@@@@@.}
──────────────────────────────────┼────────────────────┼────────────────────┼────────────────────────────.{.?Ot_price_stL5OP;┼─────────────────────.}
.{
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?Ot_price_stZnOP;│@@@@@@@@@@@@@@@@@@@@@.}
.}
──────────────────────────────────┴────────────────────┴────────────────────┴────────────────────────────.{.?Ot_price_stL6OP;┴─────────────────────.}
.EndForm