/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 2001 корпорация ГАЛАКТИКА                         ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Контроллинг                                               ║
 ║ Версия        : 7.1                                                       ║
 ║ Назначение    : Отчет по производству и поставка продукции                ║
 ║ Ответственный : Бычковский О. Ф.(OlegB)                                   ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
.set name = 'OProizPost'
.nameinlist 'Базовая форма'
.hide
.fields
NameTitle
Predpr
Period
Potrebit
Produkt
Cherteg
EdIzm
Field1
Field2
Field3
Field4
Field5
Field6
.endfields
^^^
.{
^^^^^^^^^^
.}
.endform

.linkform 'OProizPost_01' prototype is 'OProizPost'
.GROUP 'Производство и поставки продукции предприятиям за период.'
.nameinlist 'Производство и поставки продукции предприятиям за период.'
.fields
NameTitle
Predpr
Period
Potrebit
Produkt
Cherteg
EdIzm
Field2
Field3
Field4
.endfields
                   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

Предприятие:@@@@@@@@@@@@@@@@@@@@@@@@@
Период:     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
┌───────────────────────┬────────────────────┬─────────┬─────┬───────────┬───────────────────────┐
│      Потребитель      │    Наименование    │ №       │ Ед. │Произведено│    Поставлено ОАО     │
│                       │    продукта        │ чертежа │ изм.│   факт    │        "ТВЭЛ"         │
│                       │                    │         │     │           ├───────────┬───────────┤
│                       │                    │         │     │           │   План    │   Факт    │
├───────────────────────┼────────────────────┼─────────┼─────┼───────────┼───────────┼───────────┤
.{
│@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│@@@@@│&'&&&&&.&&&│&'&&&&&.&&&│&'&&&&&.&&&│
.}
└───────────────────────┴────────────────────┴─────────┴─────┴───────────┴───────────┴───────────┘
.endform

.linkform 'OProizPost_02' prototype is 'OProizPost'
.GROUP 'Поставки продукции предприятиям ОАО "ТВЭЛ" за период (форма 1).'
.nameinlist 'Поставки продукции предприятиям ОАО "ТВЭЛ" за период (форма 1).'
.fields
NameTitle
Predpr
Period
Potrebit
Produkt
Cherteg
EdIzm
Field1
Field2
Field3
Field4
.endfields
                   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

Предприятие:@@@@@@@@@@@@@@@@@@@@@@@@@
Период:     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
┌───────────────────────┬────────────────────┬─────────┬─────┬───────────────────────┬───────────────────────┐
│      Потребитель      │    Наименование    │ №       │ Ед. │      Поставки за      │     С начала года     │
│                       │    продукта        │ чертежа │ изм.│        период         │                       │
│                       │                    │         │     ├───────────┬───────────┼───────────┬───────────┤
│                       │                    │         │     │   План    │   Факт    │   План    │   Факт    │
├───────────────────────┼────────────────────┼─────────┼─────┼───────────┼───────────┼───────────┼───────────┤
.{
│@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│@@@@@│&'&&&&&.&&&│&'&&&&&.&&&│&'&&&&&.&&&│&'&&&&&.&&&│
.}
└───────────────────────┴────────────────────┴─────────┴─────┴───────────┴───────────┴───────────┴───────────┘
.endform


.linkform 'OProizPost_03' prototype is 'OProizPost'
.GROUP 'Поставки продукции предприятиям ОАО "ТВЭЛ" за период (форма 2).'
.nameinlist 'Поставки продукции предприятиям ОАО "ТВЭЛ" за период (форма 2).'
.fields
NameTitle
Predpr
Period
Potrebit
Produkt
Cherteg
EdIzm
Field1
Field2
Field3
Field4
Field5
.endfields
                   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

Предприятие:@@@@@@@@@@@@@@@@@@@@@@@@@
Период:     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
┌───────────────────────┬────────────────────┬─────────┬─────┬───────────────────────────────────────────────────────────┐
│      Потребитель      │    Наименование    │ №       │ Ед. │                Поставки за период                         │
│                       │    продукта        │ чертежа │ изм.├───────────┬───────────┬───────────┬───────────┬───────────┤
│                       │                    │         │     │   План    │   Факт    │   Дата    │   Кол-во  │ № на-     │
│                       │                    │         │     │           │   всего   │           │           │ кладной   │
├───────────────────────┼────────────────────┼─────────┼─────┼───────────┼───────────┼───────────┼───────────┼───────────┤
.{
│@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│@@@@@│&'&&&&&.&&&│&'&&&&&.&&&│@@@@@@@@@@@│&'&&&&&.&&&│@@@@@@@@@@@│
.}
└───────────────────────┴────────────────────┴─────────┴─────┴───────────┴───────────┴───────────┴───────────┴───────────┘
.endform

.linkform 'OProizPost_04' prototype is 'OProizPost'
.GROUP 'Движение давальческого сырья и материалов на предприятии за период.'
.nameinlist 'Движение давальческого сырья и материалов на предприятии за период.'
.fields
NameTitle
Predpr
Period
Produkt
Cherteg
EdIzm
Field1
Field2
Field3
Field4
Field5
Field6
.endfields
                   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

Предприятие:@@@@@@@@@@@@@@@@@@@@@@@@@
Период:     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
┌────────────────────┬─────────┬─────┬───────────┬───────────────────────┬────────────┬───────────┬───────────┐
│    Наименование    │ №       │ Ед. │Остаток на │ Поставки за период    │Переработано│Возвращено │Остаток на │
│    материала       │ чертежа │ изм.│ складе к  │   из ОАО "ТВЭЛ"       │ за период  │ОАО "ТВЭЛ" │ складе к  │
│                    │         │     │  началу   ├───────────┬───────────┤   факт     │           │  концу    │
│                    │         │     │  периода  │   План    │   Факт    │            │           │ периода   │
├────────────────────┼─────────┼─────┼───────────┼───────────┼───────────┼────────────┼───────────┼───────────┤
.{
│@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│@@@@@│&'&&&&&.&&&│&'&&&&&.&&&│&'&&&&&.&&&│&'&&&&&&.&&&│&'&&&&&.&&&│&'&&&&&.&&&│
.}
└────────────────────┴─────────┴─────┴───────────┴───────────┴───────────┴────────────┴───────────┴───────────┘
.endform