//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
//Галактика 7.1 - Контроллинг
//Отчет "Заявка производственных подразделений по статьм"
//------------------------------------------------------------------------------
.set name = 'RepClaimSt'
.nameiNlist 'Базовая форма'
.hide
.fields
NamePeriod
NamePodr
TitleSt
TitleSumKol
NameSt
SumKol
.endfields
^
.{
^^
   .{.?stTitleSumKol; ^.}
.{
 ^ .{.?stSumKol; ^.}
.}
.}
.endform