/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 2001 корпорация ГАЛАКТИКА                         ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Контроллинг                                               ║
 ║ Версия        : 7.1                                                       ║
 ║ Назначение    : Смета расходов по подразделению                           ║
 ║ Ответственный : Украинко В. (UkrV)                                        ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
.set name = 'ContrZatrSmets_Stlb'
.nameinlist 'Базовая форма'
.hide
.fields
DataTimeUserStr

  NamePodr1
  Period
  Variant

  TitleStr
  NameStr

  ListPodr               // подчиненные подразделения, если есть
  Str_Dop_St
  Formula
  NameZatr
  NameAnal
  Kod_Nom
  NameStZatr
  Sum_It_Str
  Sum_Out
  Sum_It_All
  Sum_It_Stolb
.endfields

^
  ^
.{
  ^^
.{
  ^^
 .{.?ZatrSmets_st_Podr_List; ^.}
.}
  ^^^                   
  .{.?ZatrSmets_St_LR1; .}
  .{.?ZatrSmets_St_LA1; ^.}
  .{.?ZatrSmets_St_LR2; .}
.{
  ^^
  ^ .{.?ZatrSmets_St_LS1; ^.}
.}
 .{.?ZatrSmets_St_LEN; .}
  ^
 .{.?ZatrSmets_St_LI1; ^.}
.}
.endform

.linkform 'ContrZatrSmets_Stolb_01' prototype is 'ContrZatrSmets_Stlb'
.GROUP 'Смета расходов по подразделению.'
.nameinlist 'Смета расходов по подразделению.'
.fields
  DataTimeUserStr
  NamePodr1
  Period
  Variant

  TitleStr
  NameStr

  ListPodr               // подчиненные подразделения, если есть
  Str_Dop_St
  Formula
  NameZatr
  NameAnal
  Kod_Nom
  NameStZatr
  Sum_It_Str
  Sum_Out
  Sum_It_All
  Sum_It_Stolb
.endfields
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

             Сводная смета затрат @@@@@@@@@@@@@@@@@@@@@@@@@@@@@

.{
Период:                                                          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Затраты:                                                         @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                                                                .{.?ZatrSmets_St_Podr_List; @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.}

.}
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ 
Сумма (комбинация сумм): @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
──────────┬─────────────────────────────────┬──────────────────────.{.?ZatrSmets_St_LR1;┬────────────────────────────.}
 Код      │ Наименование статей @@@@@@@@@@@@│ ВСЕГО                .{.?ZatrSmets_St_LA1;│@@@@@@@@@@@@@@@@@@@@@@@@@@@@.}
──────────┼─────────────────────────────────┼──────────────────────.{.?ZatrSmets_St_LR2;┼────────────────────────────.}
.{
 @@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │&'&&&&&&&&&&&&&&&&&.&&.{.?ZatrSmets_St_LS1;│ &'&&&&&&&&&&&&&&&&&.&&     .}
.}
──────────┴─────────────────────────────────┴──────────────────────.{.?ZatrSmets_St_LEN;┴────────────────────────────.}
                                     ВСЕГО   &'&&&&&&&&&&&&&&&&&.&&.{.?ZatrSmets_St_LI1;  &'&&&&&&&&&&&&&&&&&.&&     .}


.}
.endform