/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 2001 корпорация ГАЛАКТИКА                         ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Контроллинг                                               ║
 ║ Версия        : 7.1                                                       ║
 ║ Назначение    : Отчет по экономическим элементам затрат                   ║
 ║ Ответственный : Бычковский О. Ф.(OlegB)                                   ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
.set name = 'OElemZatr'
.nameinlist 'Базовая форма'
.hide
.fields
Period1
Period2
VidZatr1
VidZatr2
NameBalans1
NameBalans2
Podr
Valut
ElemZatr
ZatrB
ZatrSr
Otcl1
Otcl2
.endfields
^^^^^^^^
.{
^^^^^
.}
.endform

.linkform 'OElemZatr_01' prototype is 'OElemZatr'
.nameinlist 'Отчет по экономическим элементам затрат'
.fields
Period1
Period2
VidZatr1
VidZatr2
NameBalans1
NameBalans2
Podr
Valut
ElemZatr
ZatrB
ZatrSr
Otcl1
Otcl2
.endfields
                   Сравнение затрат по экономическим элементам

                        Базовый вариант                      Сравниваемый вариант
Период:               @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Вид затрат:           @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Наименование баланса: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

Подразделение:@@@@@@@@@@@@@@@@@@@@@@@@@
Валюта:       @@@@@@@@@@@@@@@@@@@@@@@@@
─────────────────────────────┬────────────────┬────────────────┬─────────────────────────────────
       Зкономические         │    Затраты     │    Затраты     │          Отклонение
      элементы затрат        │    базового    │ сравниваемого  ├────────────────┬────────────────
                             │    варианта    │    варианта    │     Абс.       │       %
─────────────────────────────┼────────────────┼────────────────┼────────────────┼────────────────
.{
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&'&&&&&&&&&&&.&&│&'&&&&&&&&&&&.&&│&'&&&&&&&&&&&.&&│&'&&&&&&&&&&&.&&
.}
─────────────────────────────┴────────────────┴────────────────┴────────────────┴────────────────
.endform