/*
 иммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм╩
 ╨                     (c) 2001 ╙╝Ю╞╝Ю═Ф╗О ┐─▀─┼▓┬┼─                         ╨
 ╨ ▐Ю╝╔╙Б        : ┐─▀─┼▓┬┼─                                                 ╨
 ╨ ▒╗АБ╔╛═       : ┼╝╜БЮ╝╚╚╗╜ё                                               ╨
 ╨ ┌╔ЮА╗О        : 7.1                                                       ╨
 ╨ █═╖╜═Г╔╜╗╔    : ▐╝АБ═╒╙╗ ╞Ю╝╓Ц╙Ф╗╗ ╞Ю╔╓╞Ю╗ОБ╗╔╛ ╜═ ▌─▌ "▓┌²▀" ╖═ ё╝╓      ╨
 ╨ ▌Б╒╔БАБ╒╔╜╜К╘ : │КГ╙╝╒А╙╗╘ ▌. ■.(OlegB)                                   ╨
 хммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм╪
*/
.set name = 'OPostYear'
.nameinlist '│═╖╝╒═О Д╝Ю╛═'
.hide
.fields
NameTitle
Predpr
Period
Potrebit
Prod
Cherteg
EdIzm
SentComKv1
SentPlanKv1
SentComKv2
SentPlanKv2
SentComKv3
SentPlanKv3
SentComKv4
SentPlanKv4
SentComKv
SentPlanKv
.endfields
^^^
.{
^^^^^^^^^^^^^^
.}
.endform

.linkform 'OPostYear_01' prototype is 'OPostYear'
.nameinlist '▐╝АБ═╒╙╗ ╞Ю╝╓Ц╙Ф╗╗ ╞Ю╔╓╞Ю╗ОБ╗╔╛ ╜═ ▌─▌ "▓┌²▀" ╖═ ё╝╓.'
.fields
NameTitle
Predpr
Period
Potrebit
Prod
Cherteg
EdIzm
SentComKv1
SentPlanKv1
SentComKv2
SentPlanKv2
SentComKv3
SentPlanKv3
SentComKv4
SentPlanKv4
SentComKv
SentPlanKv
.endfields
                           @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

▐Ю╔╓╞Ю╗ОБ╗╔:@@@@@@@@@@@@@@@@@@@@@@@@@
▐╔Ю╗╝╓:     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
здддддддддддддддддддддддбддддддддддддддддддддбдддддддддбдддддбдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд©
Ё      ▐╝БЮ╔║╗Б╔╚Л      Ё    █═╗╛╔╜╝╒═╜╗╔    Ё Э       Ё ┘╓. Ё                                     ▐╝АБ═╒╙╗ ╞╝ ╙╒═ЮБ═╚═╛                                     Ё                       Ё
Ё                       Ё    ╞Ю╝╓Ц╙Б═        Ё Г╔ЮБ╔╕═ Ё ╗╖╛.цдддддддддддддддддддддддбдддддддддддддддддддддддбдддддддддддддддддддддддбддддддддддддддддддддддд╢                       Ё
Ё                       Ё                    Ё         Ё     Ё         1 ╙╒.         Ё         2 ╙╒.         Ё         3 ╙╒.         Ё         4 ╙╒.         Ё                       Ё
Ё                       Ё                    Ё         Ё     цдддддддддддбдддддддддддедддддддддддбдддддддддддедддддддддддбдддддддддддедддддддддддбдддддддддддедддддддддддбддддддддддд╢
Ё                       Ё                    Ё         Ё     Ё   ▐╚═╜    Ё    ■═╙Б   Ё   ▐╚═╜    Ё    ■═╙Б   Ё   ▐╚═╜    Ё    ■═╙Б   Ё   ▐╚═╜    Ё    ■═╙Б   Ё   ▐╚═╜    Ё   ■═╙Б    Ё
цдддддддддддддддддддддддеддддддддддддддддддддедддддддддедддддедддддддддддедддддддддддедддддддддддедддддддддддедддддддддддедддддддддддедддддддддддедддддддддддедддддддддддеддддддддддд╢
.{
Ё@@@@@@@@@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@@@@@@Ё@@@@@@@@@Ё@@@@@Ё&'&&&&&.&&&Ё&'&&&&&.&&&Ё&'&&&&&.&&&Ё&'&&&&&.&&&Ё&'&&&&&.&&&Ё&'&&&&&.&&&Ё&'&&&&&.&&&Ё&'&&&&&.&&&Ё&'&&&&&.&&&Ё&'&&&&&.&&&Ё
.}
юдддддддддддддддддддддддаддддддддддддддддддддадддддддддадддддадддддддддддадддддддддддадддддддддддадддддддддддадддддддддддадддддддддддадддддддддддадддддддддддадддддддддддаддддддддддды
.endform
