/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 2001 корпорация ГАЛАКТИКА                         ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Контроллинг                                               ║
 ║ Версия        : 7.1                                                       ║
 ║ Назначение    : Отчет по суммам смет                                      ║
 ║ Ответственный : Бычковский О. Ф.(OlegB)                                   ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
.set name = 'SmSmet'
.nameinlist 'Базовая форма'
.hide
.fields
nRec_Budjet
NameBudjet
Period
Pot_nRecPeriod
Variant
Podr
Pot_wIzg
Pot_cIzg
Balans
Npp
NameStBudjet 
NameStZatr
Pot_nRecStZatr
Anal
Pot_wKau1
Pot_cKau1
Pot_wKau2
Pot_cKau2
Pot_wKau3
Pot_cKau3
Pot_wKau4
Pot_cKau4
Pot_wKau5
Pot_cKau5
Pot_wKau6
Pot_cKau6
Pot_wKau7
Pot_cKau7
Pot_wKau8
Pot_cKau8
Pot_wKau9
Pot_cKau9
Pot_wKau10
Pot_cKau10
BegSum
PotrSum
SpisSum
SpisPB
EndSum
Valut
ElemZatr
PrzZatr
ItgSummaBeg
ItgSummaPotr
ItgSummaSpis
ItgSummaEnd
ValItgSumma

PerProhl
NppDop
NameStBudjetDop 
NameStZatrDop
AnalDop
PotrSumDop
ValutDop
ElemZatrDop
PrzZatrDop
ItgSummaDop
ValItgSummaDop
KursDat
fSimvolV
Kurs
NDE
.endfields

.{
^
^^^^^^^^
.{
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
.}
^^^^^

.if Zatr_Dop1
.{
^
.{
^^^^^^^^
.}
^^
.}
.end

.if Kurs_Val1
^
.{
^^^
.}
.end
.}

.endform

.linkform 'SmSmet_01' prototype is 'SmSmet'
.GROUP 'Отчет по суммам смет.'
.nameinlist 'Отчет  по суммам смет'
.fields
NameBudjet
Period
Variant
Podr
Balans
Npp
NameStBudjet :'t:r'
NameStZatr
Anal
BegSum
PotrSum
SpisSum
SpisPB
EndSum
Valut
ElemZatr
PrzZatr
ItgSummaBeg
ItgSummaPotr
ItgSummaSpis
ItgSummaEnd
ValItgSumma

PerProhl
NppDop
NameStBudjetDop :'t:r'
NameStZatrDop
AnalDop
PotrSumDop
ValutDop
ElemZatrDop
PrzZatrDop
ItgSummaDop
ValItgSummaDop
KursDat
fSimvolV
Kurs
NDE
.endfields
.{
            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

Период:  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Затраты: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Подразделение:  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Вариант кальк.\баланс: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
───────┬───────────────────────────┬──────────────────────────┬──────────────────────────────────┬───────────────────┬───────────────────┬───────────────────┬────────────────────┬───────────────────┬──────────┬──────────────────────────┬───────────
 Номер │Наименование статьи сметы  │   Наименование статьи    │       Значение аналитики         │  Входящее сальдо  │ Затраты за период │     Списание      │    Затраты к       │ Исходящее  сальдо │  Валюта  │      Элемент затрат      │  Признак
       │                           │    расходов/доходов      │                                  │                   │                   │                   │    распределению   │                   │          │                          │  затрат
───────┼───────────────────────────┼──────────────────────────┼──────────────────────────────────┼───────────────────┼───────────────────┼───────────────────┼────────────────────┼───────────────────┼──────────┼──────────────────────────┼───────────
.{
@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&'&&&&&&&&&&&&&&.&&│&'&&&&&&&&&&&&&&.&&│&'&&&&&&&&&&&&&&.&&│&'&&&&&&&&&&&&&&&.&&│&'&&&&&&&&&&&&&&.&&│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@
.}
───────┴───────────────────────────┴──────────────────────────┴──────────────────────────────────┴───────────────────┴───────────────────┴───────────────────┴────────────────────┴───────────────────┴──────────┴──────────────────────────┴───────────
Итого по смете:                                                                                   &'&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&.&&                      &'&&&&&&&&&&&&&&.&&    @@@@@@@

.if Zatr_Dop1
                       Затраты прошлых периодов
.{

Период учета затрат: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
───────┬───────────────────────────┬──────────────────────────┬──────────────────────────────────┬───────────────────┬──────────┬──────────────────────────┬───────────
 Номер │Наименование статьи сметы  │   Наименование статьи    │       Значение аналитики         │     Затраты       │  Валюта  │      Элемент затрат      │  Признак
       │                           │    расходов/доходов      │                                  │                   │          │                          │  затрат
───────┼───────────────────────────┼──────────────────────────┼──────────────────────────────────┼───────────────────┼──────────┼──────────────────────────┼───────────
.{
@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&'&&&&&&&&&&&&&&.&&│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@
.}
───────┴───────────────────────────┴──────────────────────────┴──────────────────────────────────┴───────────────────┴──────────┴──────────────────────────┴───────────
Итого по смете: &'&&&&&&&&&&&&&&&.&& @@@@@@@
.}
.end
.if Kurs_Val1

Курсы валют на дату: @@@@@@@@@@@@@@@@@@@
.{
@@@@@@@@@@@ &'&&&&&&&.&& @@@@@@@@
.}
.end
.}
.endform

.linkform 'SmSmet_02' prototype is 'SmSmet'
.GROUP 'Отчет по суммам смет'
.nameinlist 'Отчет по суммам смет'
.fields
NameBudjet
Period
Variant
Podr
Balans
Npp
NameStBudjet :'t:r'
NameStZatr
Anal
BegSum
PotrSum
SpisSum
EndSum
Valut
ElemZatr
PrzZatr
ItgSummaBeg
ItgSummaPotr
ItgSummaSpis
ItgSummaEnd
ValItgSumma

PerProhl
NppDop
NameStBudjetDop :'t:r'
NameStZatrDop
AnalDop
PotrSumDop
ValutDop
ElemZatrDop
PrzZatrDop
ItgSummaDop
ValItgSummaDop
KursDat
fSimvolV
Kurs
NDE
.endfields
.{
            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

Период:  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Затраты: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Подразделение:  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Вариант кальк.\баланс: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
───────┬───────────────────────────┬──────────────────────────┬──────────────────────────────────┬───────────────────┬───────────────────┬───────────────────┬───────────────────┬──────────┬──────────────────────────┬───────────
 Номер │Наименование статьи сметы  │   Наименование статьи    │       Значение аналитики         │  Входящее сальдо  │ Затраты за период │     Списание      │ Исходящее  сальдо │  Валюта  │      Элемент затрат      │  Признак
       │                           │    расходов/доходов      │                                  │                   │                   │                   │                   │          │                          │  затрат
───────┼───────────────────────────┼──────────────────────────┼──────────────────────────────────┼───────────────────┼───────────────────┼───────────────────┼───────────────────┼──────────┼──────────────────────────┼───────────
.{
@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&'&&&&&&&&&&&&&&.&&│&'&&&&&&&&&&&&&&.&&│&'&&&&&&&&&&&&&&.&&│&'&&&&&&&&&&&&&&.&&│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@
.}
───────┴───────────────────────────┴──────────────────────────┴──────────────────────────────────┴───────────────────┴───────────────────┴───────────────────┴───────────────────┴──────────┴──────────────────────────┴───────────
Итого по смете:                                                                                   &'&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&.&&    @@@@@@@

.if Zatr_Dop1
                       Затраты прошлых периодов
.{

Период учета затрат: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
───────┬───────────────────────────┬──────────────────────────┬──────────────────────────────────┬───────────────────┬──────────┬──────────────────────────┬───────────
 Номер │Наименование статьи сметы  │   Наименование статьи    │       Значение аналитики         │     Затраты       │  Валюта  │      Элемент затрат      │  Признак
       │                           │    расходов/доходов      │                                  │                   │          │                          │  затрат
───────┼───────────────────────────┼──────────────────────────┼──────────────────────────────────┼───────────────────┼──────────┼──────────────────────────┼───────────
.{
@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&'&&&&&&&&&&&&&&.&&│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@
.}
───────┴───────────────────────────┴──────────────────────────┴──────────────────────────────────┴───────────────────┴──────────┴──────────────────────────┴───────────
Итого по смете: &'&&&&&&&&&&&&&&&.&& @@@@@@@
.}
.end
.if Kurs_Val1

Курсы валют на дату: @@@@@@@@@@@@@@@@@@@
.{
@@@@@@@@@@@ &'&&&&&&&.&& @@@@@@@@
.}
.end
.}
.endform

.linkform 'SmSmetSm_01' prototype is 'SmSmet'
.GROUP 'Отчет по суммам сметSm.'
.nameinlist 'Отчет по  суммам смет'
.fields
NameBudjet
Period
Variant
Podr
Balans
Npp
NameStBudjet :'t:r'
NameStZatr
Anal
BegSum
PotrSum
SpisSum
SpisPB
EndSum
Valut
PrzZatr
ItgSummaBeg
ItgSummaPotr
ItgSummaSpis
ItgSummaEnd
ValItgSumma

PerProhl
NppDop
NameStBudjetDop :'t:r'
NameStZatrDop
AnalDop
PotrSumDop
ValutDop
PrzZatrDop
ItgSummaDop
ValItgSummaDop
KursDat
fSimvolV
Kurs
NDE
.endfields
.{
            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

Период:  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Затраты: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Подразделение:  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Вариант кальк.\баланс: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
───────┬───────────────────────────┬──────────────────────────┬──────────────────────────────────┬───────────────────┬───────────────────┬───────────────────┬────────────────────┬───────────────────┬──────────┬───────────
 Номер │Наименование статьи сметы  │   Наименование статьи    │       Значение аналитики         │  Входящее сальдо  │ Затраты за период │     Списание      │    Затраты к       │ Исходящее  сальдо │  Валюта  │ Признак
       │                           │    расходов/доходов      │                                  │                   │                   │                   │    распределению   │                   │          │ затрат
───────┼───────────────────────────┼──────────────────────────┼──────────────────────────────────┼───────────────────┼───────────────────┼───────────────────┼────────────────────┼───────────────────┼──────────┼───────────
.{
@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&'&&&&&&&&&&&&&&.&&│&'&&&&&&&&&&&&&&.&&│&'&&&&&&&&&&&&&&.&&│&'&&&&&&&&&&&&&&&.&&│&'&&&&&&&&&&&&&&.&&│@@@@@@@@@@│@@@@@@@@@@@
.}
───────┴───────────────────────────┴──────────────────────────┴──────────────────────────────────┴───────────────────┴───────────────────┴───────────────────┴────────────────────┴───────────────────┴──────────┴───────────
Итого по смете:                                                                                   &'&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&.&&                      &'&&&&&&&&&&&&&&.&&    @@@@@@@

.if Zatr_Dop1
                       Затраты прошлых периодов
.{

Период учета затрат: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
───────┬───────────────────────────┬──────────────────────────┬──────────────────────────────────┬───────────────────┬──────────┬───────────
 Номер │Наименование статьи сметы  │   Наименование статьи    │       Значение аналитики         │     Затраты       │  Валюта  │  Признак
       │                           │    расходов/доходов      │                                  │                   │          │  затрат
───────┼───────────────────────────┼──────────────────────────┼──────────────────────────────────┼───────────────────┼──────────┼───────────
.{
@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&'&&&&&&&&&&&&&&.&&│@@@@@@@@@@│@@@@@@@@@@@
.}
───────┴───────────────────────────┴──────────────────────────┴──────────────────────────────────┴───────────────────┴──────────┴───────────
Итого по смете: &'&&&&&&&&&&&&&&&.&& @@@@@@@
.}
.end
.if Kurs_Val1

Курсы валют на дату: @@@@@@@@@@@@@@@@@@@
.{
@@@@@@@@@@@ &'&&&&&&&.&& @@@@@@@@
.}
.end
.}
.endform

.linkform 'SmSmetSm_02' prototype is 'SmSmet'
.GROUP 'Отчет по суммам сметSm'
.nameinlist 'Отчет по суммам  смет'
.fields
NameBudjet
Period
Variant
Podr
Balans
Npp
NameStBudjet :'t:r'
NameStZatr
Anal
BegSum
PotrSum
SpisSum
EndSum
Valut
PrzZatr
ItgSummaBeg
ItgSummaPotr
ItgSummaSpis
ItgSummaEnd
ValItgSumma

PerProhl
NppDop
NameStBudjetDop :'t:r'
NameStZatrDop
AnalDop
PotrSumDop
ValutDop
PrzZatrDop
ItgSummaDop
ValItgSummaDop
KursDat
fSimvolV
Kurs
NDE
.endfields
.{
            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

Период:  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Затраты: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Подразделение:  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Вариант кальк.\баланс: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
───────┬───────────────────────────┬──────────────────────────┬──────────────────────────────────┬───────────────────┬───────────────────┬───────────────────┬───────────────────┬──────────┬───────────
 Номер │Наименование статьи сметы  │   Наименование статьи    │       Значение аналитики         │  Входящее сальдо  │ Затраты за период │     Списание      │ Исходящее  сальдо │  Валюта  │  Признак
       │                           │    расходов/доходов      │                                  │                   │                   │                   │                   │          │  затрат
───────┼───────────────────────────┼──────────────────────────┼──────────────────────────────────┼───────────────────┼───────────────────┼───────────────────┼───────────────────┼──────────┼───────────
.{
@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&'&&&&&&&&&&&&&&.&&│&'&&&&&&&&&&&&&&.&&│&'&&&&&&&&&&&&&&.&&│&'&&&&&&&&&&&&&&.&&│@@@@@@@@@@│@@@@@@@@@@@
.}
───────┴───────────────────────────┴──────────────────────────┴──────────────────────────────────┴───────────────────┴───────────────────┴───────────────────┴───────────────────┴──────────┴───────────
Итого по смете:                                                                                   &'&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&.&& &'&&&&&&&&&&&&&&.&&    @@@@@@@

.if Zatr_Dop1
                       Затраты прошлых периодов
.{

Период учета затрат: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
───────┬───────────────────────────┬──────────────────────────┬──────────────────────────────────┬───────────────────┬──────────┬───────────
 Номер │Наименование статьи сметы  │   Наименование статьи    │       Значение аналитики         │     Затраты       │  Валюта  │  Признак
       │                           │    расходов/доходов      │                                  │                   │          │  затрат
───────┼───────────────────────────┼──────────────────────────┼──────────────────────────────────┼───────────────────┼──────────┼───────────
.{
@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&'&&&&&&&&&&&&&&.&&│@@@@@@@@@@│@@@@@@@@@@@
.}
───────┴───────────────────────────┴──────────────────────────┴──────────────────────────────────┴───────────────────┴──────────┴───────────
Итого по смете: &'&&&&&&&&&&&&&&&.&& @@@@@@@
.}
.end
.if Kurs_Val1

Курсы валют на дату: @@@@@@@@@@@@@@@@@@@
.{
@@@@@@@@@@@ &'&&&&&&&.&& @@@@@@@@
.}
.end
.}
.endform
