/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 2001 корпорация ГАЛАКТИКА                         ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Контроллинг                                               ║
 ║ Версия        : 7.1                                                       ║
 ║ Назначение    : Отчет о состоянии незавершенного производства за период   ║
 ║ Ответственный : Бычковский О. Ф.(OlegB)                                   ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
.set name = 'OSostNzp'
.nameinlist 'Базовая форма'
.hide
.fields
NameTitle
Predpr
Period
Potrebit
Cherteg
EdIzm
BegNzp
IntoNzp
ProdNzp
EndNzp
Potrebit1
Produkt1
Cherteg1
EdIzm1
BegNzp1
IntoNzp1
ProdNzp1
EndNzp1
.endfields
^^^
.{
.if TitleProd
^^^^^^^
.else
^^^^^^^^
.end
.}
.endform

.linkform 'OSostNzp_01' prototype is 'OSostNzp'
.nameinlist 'Состояние незавершенного производства за период.'
.fields
NameTitle
Predpr
Period
Potrebit
Cherteg
EdIzm
BegNzp
IntoNzp
ProdNzp
EndNzp
Potrebit1
Produkt1
Cherteg1
EdIzm1
BegNzp1
IntoNzp1
ProdNzp1
EndNzp1
.endfields
                   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

Предприятие:@@@@@@@@@@@@@@@@@@@@@@@@@
Период:     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
┌───────────────────────┬────────────────────┬─────────┬─────┬───────────────────────────────────────────────┐
│      Потребитель      │    Наименование    │ №       │ Ед. │             Движение НЗП за период            │
│                       │    продукта        │ чертежа │ изм.├───────────┬───────────┬───────────┬───────────┤
│                       │                    │         │     │ Задел НЗП │  Запуск   │Произведено│ Задел НЗП │
│                       │                    │         │     │ к началу  │    за     │ за период │НЗП к концу│
│                       │                    │         │     │  периода  │  период   │           │  периода  │
├───────────────────────┼────────────────────┼─────────┼─────┼───────────┼───────────┼───────────┼───────────┤
.{
.if TitleProd
│   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│@@@@@│&'&&&&&.&&&│&'&&&&&.&&&│&'&&&&&.&&&│&'&&&&&.&&&│
.else
│@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│@@@@@│&'&&&&&.&&&│&'&&&&&.&&&│&'&&&&&.&&&│&'&&&&&.&&&│
.end
.}
└───────────────────────┴────────────────────┴─────────┴─────┴───────────┴───────────┴───────────┴───────────┘
.endform