/*
 ╔════════════════════════════════════════════════════════════════════════════╗
 ║                     (c) Корпорация ГАЛАКТИКА, 1996,98                      ║
 ║ Проект        : ГАЛАКТИКА                                                  ║
 ║ Система       : Оперативный контур                                         ║
 ║ Версия        : 5.50                                                       ║
 ║ Назначение    : Временная форма для отладки и обработки ошибок             ║
 ║ Ответственный : Володько Вадим Геннадьевич (VVG)                           ║
 ╚════════════════════════════════════════════════════════════════════════════╝
*/
#doc
Временная форма для отладки и обработки ошибок
#end
.set name='STEKS'

   БИнформация по МЦ Б  Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
   БНоменклатурный номер @@@@@@@@@@@@@@@@@@ Б   БУчетная единица @@@@@@@@@@@@@@@@@@ Б
 И─────────────────────┬───────────────────────────┬─────────────┬─────────┬──────────────
 Материально-отв.лицо│ Партия       Срок годности│   Наличие   │ Резерв  │   Свободно
─────────────────────┴───────────────────────────┴─────────────┴─────────┴──────────────
.{ CHECKENTER STEKS01

 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &&&&&&&&&&&&& &&&&&&&&& &&&&&&&&&&&&& Б
.{ CHECKENTER STEKS02
  @@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@ &&&&&&&&&&&&& &&&&&&&&& &&&&&&&&&&&&&
.}
.}

 БВСЕГО на предприятии                             &&&&&&&&&&&&& &&&&&&&&& &&&&&&&&&&&&& Б
.endform И
