//********************************************************************************
//                                                        (c) корпорация Галактика
// Галактика 5.80 - Сервисные функции
// Отчет об объединениях счетов
//********************************************************************************

#doc
  Протокол, отображающий переводы сумм после объединение счетов.
#end

.Form obedschp

.hide
.fields
  CommonFormHeader1
  CommonFormHeader2
  NameTable
  DescrOldSch
  DescrNewSch
  Summa
.endfields
 ^ ^ ^
.{ ObedschP_cyrcle CheckEnter
 ^ ^ ^ 
.}
.endform
!
!
!
.linkform 'obedschp1' prototype is 'obedschp'
.fields
  CommonFormHeader1
  CommonFormHeader2
  Nametable
  DescrOldSch
  DescrNewSch
  Summa
.endfields
                            Б   Объединение счетов О
 НПлан счетов (приемник)   ^
План счетов (источник)   ^ Т
Название таблицы ^
! Р------------------------------------------------------------------------------
┌──────────────────────────────────────┬──────────────────────────────────────┬──────────┐
│ Код счета(субсчета) источника,       │ Код счета(субсчета) (приемника),     │  Сумма   │
│ значение КАУ                         │ значение КАУ                         │          │
.{ ObedschP_cyrcle CheckEnter
├──────────────────────────────────────┼──────────────────────────────────────┼──────────┤
│ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@│
.}
└──────────────────────────────────────┴──────────────────────────────────────┴──────────┘
.endform