//********************************************************************************
//                                                        (c) корпорация Галактика
// Галактика 5.80 - Сервисные функции
// Отчет об объединениях
//********************************************************************************

#doc
  Отчет о настройке объединений.
#end

.Form obedall
.hide
.fields
  NameTitleOtchet
  FromName
  ToName
.endfields
^
.{ Obedall_cyrcle CheckEnter
 ^ ^ 
.{ Obedall_cyrcleLine CheckEnter
.}
.}
.endform
!
!
!
.linkform 'obedall1' prototype is 'obedall'
.fields
  NameTitleOtchet
  FromName
  ToName
.endfields
                                 Б   Объединение ^ О

 П┌───────────────────────────────────────────┬──────────────────────────────────────────┐
│ Б           Результат объединения  Б          │ Б            Список объединяемых Б           │
├───────────────────────────────────────────┼──────────────────────────────────────────┤
.{ Obedall_cyrcle CheckEnter О
 О│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│ П
 П.{ Obedall_cyrcleLine CheckEnter
├───────────────────────────────────────────┼──────────────────────────────────────────┤
.} П
 П.}
└───────────────────────────────────────────┴──────────────────────────────────────────┘
.endform П
