//********************************************************************************
//                                                        (c) корпорация Галактика
// Галактика 8.50 - Сервисные функции
// протокол по времени при объединении пользавательской аналитики 			 	
//********************************************************************************

#doc
  Протокол по времени при объединении пользавательской аналитики.
#end

.Form TimeObAll 
.fields
  NameTable : String
  NameObedTable : String
  NameTable1 : String
  StartTime : String
  FinishTime : String
  ResTime : String
  AllStartTime : String
  AllFinishTime : String
  AllResTime : String
      
.endfields


                            Протокол по времени объединения

┌─────────────────────────────┬─────────────┬───────────────┬─────────────┐
│                             │   Начало    │   Окончание   │   Время     │
│         Название Таблицы    │объединения  │  объединения  │ объединения │
│                             │ (время)     │   (время)     │             │
.{cycleoftimeresall
├─────────────────────────────┴─────────────┴───────────────┴─────────────┤
│                        ЗАМЕЩЕНИЕ @@@@@@@@@@ на @@@@@@@@@@@@@            │
├─────────────────────────────┬─────────────┬───────────────┬─────────────┤
.{ cycleoftime
│ @@@@@@@@@@@@@@@@@@@@@@@@@@@ │  @@@@@@@@@@@│ @@@@@@@@@@@@@ │ @@@@@@@@@@@ │
.}
.}
├─────────────────────────────┼─────────────┼───────────────┼─────────────┤
│ ИТОГО                       │  @@@@@@@@@@@│ @@@@@@@@@@@@@ │ @@@@@@@@@@@ │
└─────────────────────────────┴─────────────┴───────────────┴─────────────┘

.endform