/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,97 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Заработная плата                                          ║
 ║ Версия        : 5.70                                                      ║
 ║ Ответственный : Корзюк Виталий Францевич                                  ║
 ║ Назначение    : Отчет по совместителям                                    ║
 ╚═══════════════════════════════════════════════════════════════════════════╝

*/
#doc
Отчет по совместителям
#end
.FORM 'ByWorkerListForm'
.HIDE
.FIELDS
  CurrentDate
  CurrentTime
.ENDFIELDS
^ ^
.if ByWorkerListPortrait
.{
.FIELDS
  Работник1
  Табельный_номер1
  Подразделение1
  Должность1
.ENDFIELDS
^
.{
^ ^ ^
.}
.}
.ELSE
.{
.FIELDS
  Работник2
  Табельный_номер2
  Подразделение2
  Должность2
.ENDFIELDS
^
┬──────────────.{.?ClockNumbers1;┬─────────────────────.}┐
││Таб.номер     .{.?ClockNumbers2;│@@@@@@@@@@           .}│
├──────────────.{.?ClockNumbers3;┼─────────────────────.}┤
│Подразделение .{.?Departments1;│@@@@@@@@@@@@@@@@@@@@ .}│
├──────────────.{.?Departments2;┼─────────────────────.}┤
│Должность     .{.?Posts1;│@@@@@@@@@@@@@@@@@@@@ .}│
┴──────────────.{.?Posts2;┴─────────────────────.}┘
.}
.END
.ENDFORM

!-------------------------------------------------------------------------------
.LINKFORM 'ByWorkerListLinkForm' PROTOTYPE IS 'ByWorkerListForm'
.NAMEINLIST 'Отчет по совместителям'
.[H OVERWRITE
.FIELDS
  CurrentDate
  CurrentTime
.ENDFIELDS
^ ^
.]H

                             БОТЧЕТ ПО СОВМЕСТИТЕЛЯМ Б

.if ByWorkerListPortrait
.{
.FIELDS
  Работник1
  Табельный_номер1
  Подразделение1
  Должность1
.ENDFIELDS
 Б^ Б
┌──────────┬────────────────────┬────────────────────┐
│ БТаб. ном. Б │ БПодразделение        Б│ БДолжность            Б│
├──────────┼────────────────────┼────────────────────┤
.{
│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@│
.}
└──────────┴────────────────────┴────────────────────┘


.}
.ELSE
.{
.FIELDS
  Работник2
  Табельный_номер2
  Подразделение2
  Должность2
.ENDFIELDS
 Б^ Б
┌──────────────.{.?ClockNumbers1;┬──────────────────────────.}┐
│ БТаб.номер Б     .{.?ClockNumbers2;│@@@@@@@@@@                .}│
├──────────────.{.?ClockNumbers3;┼──────────────────────────.}┤
│ БПодразделение Б .{.?Departments1;│@@@@@@@@@@@@@@@@@@@@@@@@@@.}│
├──────────────.{.?Departments2;┼──────────────────────────.}┤
│ БДолжность Б     .{.?Posts1;│@@@@@@@@@@@@@@@@@@@@@@@@@@.}│
└──────────────.{.?Posts2;┴──────────────────────────.}┘


.}
.END
.ENDFORM