/*
 ╔════════════════════════════════════════════════════════════════════════════╗
 ║                     (c) Корпорация ГАЛАКТИКА, 1997, 2003                   ║
 ║ Проект        : ГАЛАКТИКА                                                  ║
 ║ Система       : Оперативный контур                                         ║
 ║ Версия        : 5.8                                                        ║
 ║ Назначение    : План/Справка поступления/расходования ДС (Оренбург)        ║
 ║ Ответственный : Жданович Юрий Геннадьевич                                  ║
 ╚════════════════════════════════════════════════════════════════════════════╝
*/

#doc
План поступления/расходования ДС (Оренбург)
#end
.Form 'OGP_Plan'
.Hide
.Fields
// Заголовок
Наша_Организация
Заголовок1
Заголовок2
Период_Отчета
Валюта_Отчетов
// Настройки
// Таблица
НомерПП
Продукт_Договор_Организация
Количество_По_Плану
Единица_Измерения
Ожидаемая_Оплата
Условия_оплаты
.EndFields

     ^
  ^
  ^
  ^
^
.{ CheckEnter OGPPlan_MainRec
^ ^ ^ ^ ^ ^
.}
.EndForm

#doc
План
#end
.LinkForm 'OGP_Plan1' Prototype is 'OGP_Plan'
.NameInList 'План'
.Fields
// Заголовок
Наша_Организация
Заголовок1
Заголовок2
Период_Отчета
Валюта_Отчетов
// Настройки
// Таблица
НомерПП
Продукт_Договор_Организация
Количество_По_Плану
Единица_Измерения
Ожидаемая_Оплата
Условия_оплаты
.EndFields

 Ш
                                                                                                                  "Утверждаю"
                                                                                                                  Руководитель
                                                                                                                  ^
                                                                                                                  "___"_____________ 20__г.


 Б@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
 В@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ В

─────────┬─────────────────────────────────────────────────────────┬──────────────┬─────────────┬────────────────┬───────────────────────────
  Номер  │              Продукт, договор, потребитель              │  Количество  │   Единица   │Ожидаемая оплата│      Условия оплаты
   п/п   │                                                         │   по плану   │  измерения  │@~@@@@@@@@@@@@@@│        по договору
─────────┼─────────────────────────────────────────────────────────┼──────────────┼─────────────┼────────────────┼───────────────────────────
    1    │                            2                            │       3      │      4      │        5       │             6
─────────┴─────────────────────────────────────────────────────────┴──────────────┴─────────────┴────────────────┴───────────────────────────
.{ CheckEnter OGPPlan_MainRec
@~@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&.&&& @~@@@@@@@@@@@ &'&&&&&&&&&&&.&& @@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
 Ш
.EndForm

#doc
Справка о поступлении/расходовании ДС (Оренбург)
#end
.Form 'OGP_Spravka'
.Hide
.Fields
// Заголовок
Заголовок_Общий
// Заголовок таблицы
Заголовок_Наименование
Заголовок_ДС
Заголовок_С
Заголовок_По
// Таблица
НомерПП
Продукт_Договор_Организация
План_Отчетный_Период
Всего_Оплачено
Оплачено_В_Счет_Плана
Выполнение_Плана_В_Процентах
Просроченная_Задолженность
Просроченная_задолженность_До
Просроченная_задолженность_С_По
Просроченная_задолженность_После
Задолженность_По_Неисполненным_Авансовым_Платежам
.EndFields

^
^ ^ ^ ^
.{ CheckEnter OGPSpravka_MainRec
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.EndForm

#doc
Справка
#end
.LinkForm 'OGP_Spravka1' Prototype is 'OGP_Spravka'
.Defo Landscape
.NameInList 'Справка'
.Fields
// Заголовок
Заголовок_Общий
// Заголовок таблицы
Заголовок_Наименование
Заголовок_ДС
Заголовок_С
Заголовок_С
Заголовок_По
Заголовок_По
// Таблица
НомерПП
Продукт_Договор_Организация
План_Отчетный_Период
Всего_Оплачено
Оплачено_В_Счет_Плана
Выполнение_Плана_В_Процентах
Просроченная_Задолженность
Просроченная_задолженность_До
Просроченная_задолженность_С_По
Просроченная_задолженность_После
Задолженность_По_Неисполненным_Авансовым_Платежам
.EndFields
 Ш
 Б@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б

─────────┬─────────────────────────────────────────────────────────┬──────────────────────────────────────────────────────────┬─────────────────┬──────────────────────────────────────────────────┬──────────────────
  Номер  │ @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │ @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │   Просроченная  │                 В т.ч. возникшая                 │       В т.ч.
   п/п   │                                                         ├────────────────┬────────────────┬────────────────┬───────┤ задолженность по├────────────────┬────────────────┬────────────────┤   задолженность
         │                                                         │      план      │   факт всего   │  в т.ч. в счет │ % вып.│     условиям    │ до @@@@@@@@@@  │ с  @@@@@@@@@@  │     после      │ по неисполненным
         │                                                         │                │                │    вып.плана   │ плана │     договора    │                │ по @@@@@@@@@@  │   @@@@@@@@@@   │авансовым платежам
─────────┼─────────────────────────────────────────────────────────┼────────────────┼────────────────┼────────────────┼───────┼─────────────────┼────────────────┼────────────────┼────────────────┼──────────────────
    1    │                            2                            │         3      │        4       │        5       │   6   │         7       │        8       │        9       │        10      │        11
─────────┴─────────────────────────────────────────────────────────┴────────────────┴────────────────┴────────────────┴───────┴─────────────────┴────────────────┴────────────────┴────────────────┴──────────────────
.{ CheckEnter OGPSpravka_MainRec
@~@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&.&& &'&&&&&&&&&&&.&& &'&&&&&&&&&&&.&& &'&&.&& &'&&&&&&&&&&&&&.& &'&&&&&&&&&&&.&& &'&&&&&&&&&&&.&& &'&&&&&&&&&&&.&& &'&&&&&&&&&&&&&.&&
.}
 Ш
.EndForm