/*
 ╔════════════════════════════════════════════════════════════════════════════╗
 ║                     (c) Корпорация ГАЛАКТИКА, 2002                         ║
 ║ Проект        : ГАЛАКТИКА                                                  ║
 ║ Система       : Оперативный контур                                         ║
 ║ Версия        : 5.84                                                       ║
 ║ Назначение    : Показатели наличия ТМЗ                                     ║
 ║ Ответственный : Ясев А.А (ANDR)                                            ║
 ╚════════════════════════════════════════════════════════════════════════════╝
*/
#doc
Показатели наличия ТМЗ
#end
.set name = 'sprdebit'
.hide
.fields
 feDate:date
 fDogovor:string
 fdolg:Double
 fdolgpros:Double
 fdolgsomn:Double
 fdolg_dolgsoroch:Double
 fdolg_restrukt:Double
 fReshND:string
 fReshNDS:double
 fAktND:string
 fAktNDS:double
 fAktSD:string
 fAktSDS:double
 fDDolg:string
 fDoc:string
 fProduct:string
.endfields
 ^
.{
   ^^^^^^^^^^^^^^^
.}
.endform


#doc
Справка о дебиторской задолженности
#end
.linkform 'sprdebit1' prototype is 'sprdebit'
.group 'sprdebit'
.NameInList 'Справка о дебиторской задолженности'
.fields
 feDate
 fDogovor
 fdolg
 fdolgpros
 fdolgsomn
 fdolg_dolgsoroch
 fdolg_restrukt
 fReshND
 fReshNDS
 fAktND
 fAktNDS
 fAktSD
 fAktSDS
 fDDolg
 fDoc
 fProduct
.endfields

                              БСправка о состоянии дебиторской задолженности
                                         на @@@@@@@@@@@@ Б
──────────────────────────────┬─────────────┬──────────────┬─────────────┬────────────┬───────────────────┬───────────────────────┬───────────────────────┬───────────────────────┬────────────┬───────────────────────┬─────────────────────────────────────
       Наименование           │Задолженность│   в т.ч.     │    в т.ч.   │  в т.ч.    │реструктурированная│    Решение суда       │Акт о невоз.взыск.долга│      Акт сверки       │Дата возник.│      Документ         │             Продукция
                              │             │ просроченная │ сомнительная│долгосрочная│                   │номер и дата│   сумма  │номер и дата│   сумма  │номер и дата│   сумма  │задолжен.   │подтвержд. задолжен    │
──────────────────────────────┴─────────────┴──────────────┴─────────────┴────────────┴───────────────────┴───────────────────────┴───────────────────────┴───────────────────────┴────────────┴───────────────────────┴─────────────────────────────────────
.{
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#&&&&&&&&.&& &#&&&&&&&&&.&& &#&&&&&&.&&   &#&&&&&&.&&  &#&&&&&&&&&&&&.&&  @@@@@@@@@@@@ &#&&&&&&.&& @@@@@@@@@@ &#&&&&&&.&&  @@@@@@@@@@ &#&&&&&&.&& @@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.EndForm
