/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,97 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Автотранспорт                                             ║
 ║ Версия        : 7.12                                                      ║
 ║ Назначение    : Автотранспорт                                             ║
 ║ Ответственный : Павлович Дмитрий Анатольевич                              ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
.Set Name = 'FreeTC'
.hide
.fields
  BegDate EndDate
  Npp MarkaAvt GosNmbr GarNmbr InvNm SostTc Remark
.endfields
.{
^ ^
.{
^ ^ ^ ^  ^ ^
.{
^
.}
.}
.}
.endform

.linkform 'FreeTC01' prototype is 'FreeTC'
.NameInList 'Сведения по ТС не распределенным по заказам'
.Group 'Avto'
.fields
  BegDate EndDate
  Npp MarkaAvt GosNmbr GarNmbr Remark
.endfields
.{

        Сведения по ТС не распределенным по заказам
     за период с @@@@@@@@@@@@@@@@@ по @@@@@@@@@@@@@@@@@

─────┬──────────────────────┬────────────────┬─────────────────
  №  │       Марка ТС       │  Госуд. номер  │ Гаражный номер
─────┴──────────────────────┴────────────────┴─────────────────
.{
 @@@@ @@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@
.{
      ^
.}
───────────────────────────────────────────────────────────────
.}
.}
.endform

.linkform 'FreeTC02' prototype is 'FreeTC'
.NameInList 'Сведения по ТС не распределенным по заказам '
.Group 'Rail'
.fields
  BegDate EndDate
  Npp MarkaAvt GosNmbr GarNmbr Remark
.endfields
.{

        Сведения по ТС не распределенным по заказам
     за период с @@@@@@@@@@@@@@@@@ по @@@@@@@@@@@@@@@@@

─────┬──────────────────────┬────────────────┬─────────────────
  №  │       Марка ТС       │ Бортовой номер │ Заводской номер
─────┴──────────────────────┴────────────────┴─────────────────
.{
 @@@@ @@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@
.{
      ^
.}
───────────────────────────────────────────────────────────────
.}
.}
.endform

.linkform 'FreeTC02_Free' prototype is 'FreeTC'
.NameInList 'Свободные ТС'
.Group 'Rail_Free'
.fields
  BegDate EndDate
  Npp MarkaAvt GosNmbr GarNmbr
.endfields
.{

        Сведения по ТС не распределенным по заказам
     за период с @@@@@@@@@@@@@@@@@ по @@@@@@@@@@@@@@@@@

─────┬──────────────────────┬────────────────┬─────────────────
  №  │       Марка ТС       │ Бортовой номер │ Заводской номер
─────┴──────────────────────┴────────────────┴─────────────────
.{
 @@@@ @@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@
.{
.}
.}
.}
.endform