/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,97 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Автотранспорт                                             ║
 ║ Версия        : 5.00                                                      ║
 ║ Назначение    : Пункты движения                                           ║
 ║ Ответственный : Лисица Наталья Михайловна                                 ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
.set name='Way_Item'
.hide
.p 60
.fields
 State City TipStop
 NamePunkt WayItem
 Distantion DistCity DistWay1 DistWay2 DistWay3 DistMoun
 MaxGsm npNotmat
.endfields
.{
.[h OverWrite
.]h
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.[f
.]f
.}
.endform
.linkform 'Way_Item_01' prototype is 'Way_Item'
.NameInList 'Пункты движения'
!.p 60
.fields
 CommonFormHeader
 State City TipStop
 NamePunkt WayItem
 Distantion DistCity DistWay1 DistWay2 DistWay3 DistMoun
 MaxGsm npNotmat

.endfields
 Ш^
                                           Пункты движения ТС
.{
.[h OverWrite
┌───────────────┬────────────────┬────────────────┬──────────────────┬─────────┬──────────┬─────────┬─────────┬─────────┬─────────┬─────────┬────────┬────────┐
│     Страна    │     Город      │  Тип пункта    │   Наименование   │ Время в │  Общее   │  По     │ Дороги  │ Дороги  │ Дороги  │ Горные  │Кол-во  │ Время  │
│               │                │                │    пункта        │  пути   │расстояние│ городу  │1 группы │2 группы │3 группы │ дороги  │ ГСМ    │в пункте│
└───────────────┴────────────────┴────────────────┴──────────────────┴─────────┴──────────┴─────────┴─────────┴─────────┴─────────┴─────────┴────────┴────────┘
.]h
│@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│&&&#&&.&&│&&&&#&&.&&│&&&#&&.&&│&&&#&&.&&│&&&#&&.&&│&&&#&&.&&│&&&#&&.&&│&&#&&.&&│&&#&&.&&│
.[f
└───────────────┴────────────────┴────────────────┴──────────────────┴─────────┴──────────┴─────────┴─────────┴─────────┴─────────┴─────────┴────────┴────────┘
.]f
.}
 Ш.endform
