//******************************************************************************
//                                                      (c) корпорация Галактика
// Галактика 5.85 - Бухгалтерский контур
// Типовые операции
//******************************************************************************

#doc
Типовые операции (скрытая базовая форма)
#end
.set name='hozoper'
.nameinlist 'Базовая форма'
.hide
.fields
NameDoc

HozOperNRec:comp
Probel
NameTXO

PlSch
  HozOborNRec:comp
  Npp:word
  SchO
  SubSchO
  DebName
  Proc
  Vh
  KauLevelO:word
  KauO
  PodrO
  SchK SubSchK
  KredName
  KauLevelK:word
  KauK
  PodrK
  DatPr
  SodPr
  Alg
  Val
  AlgVal
  AlgKol
  SkFormula
  FiltCO
  CyclObr
  Rez
  ConvSumVal
  ExClHozOb

PlSchF
  FpOborNRec:comp
  NppF:word
  StBudF
  ProcF
  CO
  DatPrF
  PeriodF
  KauLevelF:word
  KauF
  SodPrF
  AlgF
  ValF
  AlgValF
  AlgKolF
  SkFormulaF
  FiltCOF
  CyclObrF

HozFormNRec:comp
NppK:word
NameK
AlgK
PrimK
.endfields
.{
.if HozDoc
NameDoc    Документ               ^
.end
HozOperNRec                       ^
Probel                            ^
NameTxo    Наименование ТХО       ^
.{ CheckEnter SeeBuh
.case
.when Buh_LastOborot
.when Buh_LastElse
.end
PlSch      План счетов            ^
.{
  HozOborNRec                     ^
  Npp        Nп/п                 ^
  SchO       счет осн.            ^
  SubSchO    субсчет              ^
  DebName    имя дебета           ^
  Proc       доля/процент         ^
  Vh         Признак входимости   ^
.{ CheckEnter KauO
  KauLevelO  Уровень КАУ          ^
  KauO       КАУ                  ^
.}
  PodrO      подразделение        ^
  SchK       счет кор.            ^
  SubSchK    субсчет              ^
  KredName   имя кредита          ^
.{ CheckEnter KauK
  KauLevelК  Уровень КАУ          ^
  KauK       КАУ                  ^
.}
  PodrK      подразделение        ^
  DatPr      дата проводки        ^
  SodPr      содержание проводки  ^
  Alg        алгоритм в НДЕ       ^
  Val        алгоритм в           ^
  AlgVal     алгоритм в валюте    ^
  AlgKol     алгоритм количества  ^
  SkFormula  вычисление формул    ^
  FiltCO     фильтр для цикл.обр. ^
  CyclObr    цикл. обработка      ^
  Rez        результат            ^
  ConvSumVal сумму в проводке     ^
  ExClHozOb  Внешн. классификация ^
.}
.}
.{CheckEnter SeeFP
.case
.when FP_LastOborot
.when FP_LastFPOborot
.when FP_LastElse
.end
PlSchF       Регистр учета        ^
.{
  FpOborNRec                      ^
  NppF       Nп/п                 ^
  StBudF     статья бюджета       ^
  ProcF      доля/процент         ^
  CO         ЦО                   ^
  DatPrF     дата проводки        ^
  PeriodF    период               ^
.{ CheckEnter KauFP
  KauLevelF  Уровень КАУ          ^
  KauF       КАУ                  ^
.}
  SodPrF     содержание проводки  ^
  AlgF       алгоритм в НДЕ       ^
  ValF       алгоритм в           ^
  AlgValF    алгоритм в валюте    ^
  AlgKol     алгоритм количество  ^
  SkFormulaF вычисление формул    ^
  FiltCOF    фильтр для цикл.обр. ^
  CyclObrF   цикл. обработка      ^
.}
.}
.if SeeFormula
.case
.when Form_LastOborot
.when Form_LastFPOborot
.when Form_LastElse
.end
.{
     HozFormNRec           ^
     NppK    Nп/п          ^
     NameK   ключ          ^
     AlgK    формула       ^
     PrimK   примечание    ^
.}
.end
.CASE
.when LastOborot
.when LastFPOborot
.when LastFormula
.when LastElse
.END
.}
.endform

#doc
1. Реестр типовых хозяйственных операций
#end
.linkform 'hozoper_01' prototype is 'hozoper'
.nameinlist '1. Реестр типовых хозяйственных операций'
.fields
CommonFormHeader
NameDoc Probel NameTxo
.endfields

 Р^
 Б                                           Реестр типовых хозяйственных операций С
 Р.{
.if HozDoc

Хозяйственный документ : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.end
  ^@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{ CheckEnter SeeBuh
.case
.when Buh_LastOborot
.when Buh_LastElse
.end
.{
.{ CheckEnter KauO
.}
.{ CheckEnter KauK
.}
.}
.}
.{ CheckEnter SeeFP
.case
.when FP_LastOborot
.when FP_LastFPOborot
.when FP_LastElse
.end
.{
.{ CheckEnter KauFP
.}
.}
.}
.if SeeFormula
.case
.when Form_LastOborot
.when Form_LastFPOborot
.when Form_LastElse
.end
.{
.}
.end
.CASE
.when LastOborot
.when LastFPOborot
.when LastFormula
.when LastElse
.END
.}
 Р
.endform

#doc
2. Типовые хозяйственные операции и проводки к ним
#end
.linkform 'hozoper_02' prototype is 'hozoper'
.nameinlist '2. Типовые хозяйственные операции и проводки к ним'
.fields
CommonFormHeader
NameDoc
NameTXO:'P:C'

PlSch
  Npp:'P:R'
    SchO+'.'+SubSchO
    Vh Proc
    KauLevelO
    KauO
    PodrO
    SchK+'.'+SubSchK
    KauLevelK
    KauK
    PodrK
  DatPr
  SodPr
  Alg
  '<'+Val+'>: '+AlgVal
  AlgKol
  SkFormula
  FiltCO
  CyclObr
  Rez
  ConvSumVal
  ExClHozOb
PlSchF
  NppF:'P:R'
  StBudF  ProcF
    CO
    DatPrF
    PeriodF
    KauLevelF
    KauF
  SodPrF
  AlgF
  '<'+ValF+'>: '+AlgValF
  AlgKolF
  SkFormulaF
  FiltCOF
  CyclObrF

NppK:'P:R' NameK AlgK PrimK

.endfields

 Р^
 Б                                            Реестр типовых хозяйственных операций и
                                      формируемых проводок по счетам бухгалтерского учета С
 Р.{
.if HozDoc

  Хозяйственный документ : ^
.end
┌────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
.{ CheckEnter SeeBuh
.case
.when Buh_LastOborot
├────┴──────────────────────────────────────────────────────────────────────────────────────────────────────────────┴───┴────────┤
.when Buh_LastElse
├────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
.end
│Регистр учета: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
├────┬──────────────────────────────────────────────────────────────────────────────────────────────────────────────┬───┬────────┤
│ No │ Корреспонденция                                                                                              │Вх.│ Процент│
.{
├────┼──────────────────────────────────────────────────────────────────────────────────────────────────────────────┼───┼────────┤
│@@@@│ ДЕБЕТ : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│ @ │&&&&&&&&│
.{ CheckEnter KauO
│    │ КАУ @@: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│   │        │
.}
│    │ Подразделение: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│   │        │
│    ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────┤   │        │
│    │ КРЕДИТ: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│   │        │
.{ CheckEnter KauK
│    │ КАУ @@: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│   │        │
.}
│    │ Подразделение: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│   │        │
│    ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────┤   │        │
│    │ Дата проводки: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│   │        │
│    │ Содержание проводки: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│   │        │
│    │ Алгоритм в НДЕ     : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│   │        │
│    │ Алгоритм в валюте @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│   │        │
│    │ Алгоритм количество: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│   │        │
│    │ Вычисление формул  : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│   │        │
│    │ Фильтр для циклической обработки: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│   │        │
│    │ Циклическая обработка: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│   │        │
│    │ Результат: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│   │        │
│    │ Сумму в проводке: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│   │        │
│    │ Внешняя классификация: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│   │        │
.}
.}
.{ CheckEnter SeeFP
.case
.when FP_LastOborot
├────┴──────────────────────────────────────────────────────────────────────────────────────────────────────────────┴───┴────────┤
.when FP_LastFpOborot
├────┴──────────────────────────────────────────────────────────────────────────────────────────────────────────────────┴────────┤
.when FP_LastElse
├────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
.end
│Регистр учета: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
├────┬──────────────────────────────────────────────────────────────────────────────────────────────────────────────────┬────────┤
│ No │ Корреспонденция                                                                                                  │ Процент│
.{
├────┼──────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────┤
│@@@@│ Статья: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&│
│    │ ЦО:     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│        │
│    │ Дата проводки: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│        │
│    │ Период: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│        │
.{ CheckEnter KauFP
│    │ КАУ @@: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│        │
.}
│    ├──────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤        │
│    │ Содержание проводки: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│        │
│    │ Алгоритм в НДЕ     : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│        │
│    │ Алгоритм в валюте @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│        │
│    │ Алгоритм количество: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│        │
│    │ Вычисление формул  : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│        │
│    │ Фильтр для циклической обработки: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│        │
│    │ Циклическая обработка: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│        │
.}
.}
.if SeeFormula
.case
.when Form_LastOborot
├────┴──────────────────────────────────────────────────────────────────────────────────────────────────────────────┴───┴────────┤
.when Form_LastFPOborot
├────┴──────────────────────────────────────────────────────────────────────────────────────────────────────────────────┴────────┤
.when Form_LastElse
├────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
.end
│ Алгоритмы для расчета сумм                                                                                                     │
├────┬───────────────────┬──────────────────────────────────────────────────────┬────────────────────────────────────────────────┤
│ No │       Ключ        │    Описание алгоритма для расчета сумм проводки      │             Примечание к алгоритму             │
├────┼───────────────────┼──────────────────────────────────────────────────────┼────────────────────────────────────────────────┤
.{
│@@@@│@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
.}
.end
.CASE
.when LastOborot
└────┴──────────────────────────────────────────────────────────────────────────────────────────────────────────────┴───┴────────┘
.when LastFPOborot
└────┴──────────────────────────────────────────────────────────────────────────────────────────────────────────────────┴────────┘
.when LastFormula
└────┴───────────────────┴──────────────────────────────────────────────────────┴────────────────────────────────────────────────┘
.when LastElse
└────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
.END
.}
 Р
.endform

#doc
3. Типовые хозяйственные операции и проводки к ним (линейная форма)
#end
.linkform 'hozoper_03' prototype is 'hozoper'
.nameinlist '3. Типовые хозяйственные операции и проводки к ним (линейная форма)'
.fields
CommonFormHeader
NameDoc
NameTXO

PlSch
  Npp
    Proc Vh
    SchO SubSchO
    KauLevelO KauO
    PodrO
    SchK SubSchK
    KauLevelK KauK
    PodrK
DatPr
SodPr
Alg
Val
AlgVal
AlgKol
SkFormula
FiltCO
CyclObr
Rez
ConvSumVal
ExClHozOb

PlSchF
  NppF
     ProcF
     StBudF
     CO
     DatPrF
     PeriodF
     KauLevelF
     KauF
SodPrF
AlgF
ValF
AlgValF
AlgKolF
SkFormulaF
FiltCOF
CyclObrF

NppK NameK AlgK PrimK

.endfields

 Р^
 Б                                              Реестр типовых хозяйственных операций и
                                       формируемых проводок по счетам бухгалтерского учета С
 Р.{
.if HozDoc

Хозяйственный документ : ^
.end

ТХО: ^
.{ CheckEnter SeeBuh
.case
.when Buh_LastOborot
.when Buh_LastElse
.end
  Регистр учета: ^
.{
    Номер по порядку: @@@@  Процент: &&&&&&&&  Входимость: @
      ДЕБЕТ : ^.^
.{ CheckEnter KauO
      КАУ @@: ^
.}
      Подразделение: ^
      КРЕДИТ: ^.^
.{ CheckEnter KauK
      КАУ @@: ^
.}
      Подразделение: ^
      Дата проводки: ^
      Содержание проводки: ^
      Алгоритм в НДЕ: ^
      Алгоритм в валюте <^>: ^
      Алгоритм количество: ^
      Вычисление формул: ^
      Фильтр для циклической обработки: ^
      Циклическая обработка: ^
      Результат: ^
      Сумму в проводке: ^
      Внешняя классификация: ^
.}
.}
.{ CheckEnter SeeFP
.case
.when FP_LastOborot
.when FP_LastFpOborot
.when FP_LastElse
.end
  Регистр учета: ^
.{
    Номер по порядку: @@@@  Процент: &&&&&&&&
      Статья: ^
      ЦО:     ^
      Дата проводки: ^
      Период: ^
.{ CheckEnter KauFP
      КАУ @@: ^
.}
      Содержание проводки: ^
      Алгоритм в НДЕ: ^
      Алгоритм в валюте <^>: ^
      Алгоритм количество: ^
      Вычисление формул: ^
      Фильтр для циклической обработки: ^
      Циклическая обработка: ^
.}
.}
.if SeeFormula
.case
.when Form_LastOborot
.when Form_LastFPOborot
.when Form_LastElse
.end
  Алгоритмы для расчета сумм проводки:
.{
    ^: ^ := ^   //^
.}
.end
.CASE
.when LastOborot
.when LastFPOborot
.when LastFormula
.when LastElse
.END
.}
 Р
.endform

 #doc
5. Реестр типовых хозяйственных операций и формируемых проводок по счетам бухгалтерского учета (Краткий)
#end
.linkform 'hozoper_05' prototype is 'hozoper'
.nameinlist '5. Реестр типовых хозяйственных операций и формируемых проводок по счетам бухгалтерского учета (Краткий)'
.fields
CommonFormHeader
NameDoc
NameTXO

SchO SubSchO
SchK SubSchK
SodPr
DebName
KredName

.endfields

 Р^
 Б                                              Реестр типовых хозяйственных операций и
                                       формируемых проводок по счетам бухгалтерского учета (Краткий)
 Р.{
.if HozDoc
┌─────────────────────────────────────────┬──────────────────────────────────────────────────────────────────────────────────────┐
│ Хозяйственный документ                  │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@            │
└─────────────────────────────────────────┴──────────────────────────────────────────────────────────────────────────────────────┘
.end
┌─────────────────────────────────────────┬──────────────────────────────────────────────────────────────────────────────────────┐
│ ТХО                                     │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@            │
.{ CheckEnter SeeBuh
.case
.when Buh_LastOborot
├─────────────────────────────────────────┼────────────────────────────────────────┼─────────────────────────────────────────────┤
.when Buh_LastElse
├─────────────────────────────────────────┼────────────────────────────────────────┬─────────────────────────────────────────────┤
│                ДЕБЕТ                    │                  КРЕДИТ                │            Содержание проводки              │
├─────────────────────────────────────────┼────────────────────────────────────────┼─────────────────────────────────────────────┤
.end
.{
.{ CheckEnter KauO
.}
.{ CheckEnter KauK
.}
│ @@@@@@.@@@@@@@                          │ @@@@@@.@@@@@@@                         │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@       │
│ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │                                             │
.}
.}
.{ CheckEnter SeeFP
.case
.when FP_LastOborot
.when FP_LastFpOborot
.when FP_LastElse
.end
.{
.{ CheckEnter KauFP
.}
.}
.}
.if SeeFormula
.case
.when Form_LastOborot
.when Form_LastFPOborot
.when Form_LastElse
.end
.{
.}
.end
.CASE
.when LastOborot
└─────────────────────────────────────────┴────────────────────────────────────────┴─────────────────────────────────────────────┘
.when LastFPOborot
.when LastFormula
└─────────────────────────────────────────┴────────────────────────────────────────┴─────────────────────────────────────────────┘
.when LastElse
└─────────────────────────────────────────┴──────────────────────────────────────────────────────────────────────────────────────┘
.END
.}
.endform
