//******************************************************************************
//                                                      (c) корпорация Галактика
// Галактика 7.12 - Бухгалтерский контур
// Реестр хозяйственных операций
//******************************************************************************

#doc
Реестр хозяйственных операций для финпроводок (скрытая базовая форма)
#end
.set name = 'REEHOZFP'
.hide
.fields
Interval    : string
SimvNDE     : string
NameNDE     : string
SimvBV      : string
NameBV      : string

IsFiltrHead : boolean

IsHozDoc    : boolean
NameTiDk    : string

IsHozOpHead : boolean
NameHozOp   : string
NameTiDkHoz : string

IsGrDescrHead: boolean
NameGrDescr : string

IsCurDescr  : boolean
CurDescr    : string

IsDataHozOp : boolean
DataHozOpBeg: date
DataHozOpEnd: date

IsDataProv  : boolean
DataProvBeg : date
DataProvEnd : date

RegUch      : string

NameTxo     : string
NrecTxo     : comp
TiDkTxo     : word
SysOperTxo  : word
DocNameTxo  : string
TiDk_NameTxo: string

Nrec_SH     : comp
Date_SH     : date
DateProv_SH : date
Nom_SH      : string
Soder_SH    : string
SumNDE_SH   : string
SumBV_SH    : string
SumVal_SH   : string
SimvVal_SH  : string
OrgUNN_SH   : string
Org_SH      : string
DO_SH       : string

StBud       : string
FpCO        : string
FpPeriod    : string
Kau         : string
SumNDE      : string
SumBV       : string
SumVal      : string
SimvVal     : string
SodrPr      : string

ItogoTXO_SumNDE : double
ItogoTXO_SumBV  : double

Itogo_SumNDE    : double
Itogo_SumBV     : double
.endfields

#include ExcelFormat.var
.var
   sFormat : string;
.endvar
.Begin
   sFormat := '\2p[|-]3666`666`666`666`666`667.88';
end.

Interval   интервал                 ^
SimvNDE    символ Н.Д.Е.            ^
NameNDE    наименование нац. валюты ^
SimvBV     символ Б.В.              ^
NameBV     наименование Б. валюты   ^
^ ^
NameTiDk   тип документа             ^
^
.{ CheckEnter IsHozOpFP
   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ ^
.}
^
.{ CheckEnter IsGrDescrFP
    ^
.}
^
CurDescr   дескриптор пользователя  ^
^
DataHozOpBeg   Дата хозоперации с   ^
DataHozOpEnd   Дата хозоперации по  ^
^
DataProvBeg    Дата проводок с      ^
DataProvEnd    Дата проводок по     ^

RegUch     регистр учета            ^
.{

NameTXO    Наименование ТХО              ^
NrecTxo    HozOper.Nrec                  ^
TiDkTxo    Тип документа                 ^
SysOperTxo Тип операции                  ^
DocNameTxo Название документа и операции ^
TiDk_NameTxo Наименование ТХО (Название документа и операции в скобках) ^
.{
  Nrec_SH     SoprHoz.Nrec             ^
  Date_SH     дата SoprHoz             ^
  DateProv_SH дата проводок SoprHoz    ^
  Nom_SH      номер SoprHoz            ^
  Soder_SH    содержание операции      ^
  SumNDE_SH   сумма в Н.Д.Е.           ^
  SumBV_SH    сумма в Баз валюте       ^
  SumVal_SH   сумма в валюте           ^
  SimvVal_SH  валюта                   ^
  OrgUNN_SH   контрагент UNN           ^
  Org_SH      контрагент               ^
  DO_SH       документ основание       ^
.{ CheckEnter HeadProvFP
.{ CheckEnter ProvFP
    StBud      статья бюджета           ^
    FpCO       ЦО                       ^
    FpPeriod   Период                   ^
    Kau        КАУ                      ^
    SumNDE     сумма в Н.Д.Е.           ^
    SumBV      сумма в Б.В.             ^
    SumVal     сумма в валюте           ^
    SimvVal    валюта                   ^
    SodrPr     содержание проводки      ^
.}
.}
.}
Итого по операции:
ItogoTXO_SumNDE сумма НДЕ ^
ItogoTXO_SumBV  сумма БВ  ^
.}

Итого по реестру:
Itogo_SumNDE сумма НДЕ ^
Itogo_SumBV  сумма БВ  ^
.endform

#doc
1. Реестр хозяйственных операций для финпроводок (по контрагентам)
#end
.linkform 'reehozfp_01' prototype is 'reehozfp'
.NameInList '1. Реестр хозяйственных операций (по контрагентам)'
.Defo Portrait
.fields
CommonFormHeader
Interval
NameTiDk
NameHozOp
NameTiDkHoz
NameGrDescr
CurDescr
DataHozOpBeg
DataHozOpEnd
DataProvBeg
DataProvEnd
RegUch
SimvNDE
SimvBV
TiDk_NameTxo
Date_SH Nom_SH Org_SH DO_SH SumNDE_SH SumBV_SH SumVal_SH SimvVal_SH
ItogoTXO_SumNDE
ItogoTXO_SumBV
Itogo_SumNDE
Itogo_SumBV
.endfields
 Ш^
                                                   БРеестр хозяйственных операций Б
                                                  ^

.{?internal; (IsFiltrHead);
Применялись фильтры:
.}
.{?internal; (IsHozDoc);
  Хозяйственный документ:
    ^
.}
.{?internal; (IsHozOpHead);
  Типовая хозоперация:
.}
.{ CheckEnter IsHozOpFP
    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ ^
.}
.{?internal; (IsGrDescrHead);
  Рабочая группа:
.}
.{ CheckEnter IsGrDescrFP
    ^
.}
.{?internal; (IsCurDescr);
  Дескриптор пользователя:
    ^
.}
.{?internal; (IsDataHozOp);
  Дата хозоперации:
    с @@@@@@@@@@ по @@@@@@@@@@
.}
.{?internal; (IsDataProv);
  Дата проводок из хозоперации:
    с @@@@@@@@@@ по @@@@@@@@@@
.}
Регистр учета: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Б──────────┬─────────┬──────────────────────────────────┬────────────────────────────────┬─────────────────────────────────────────────────────┬──────
          │         │                                  │                                │                       Сумма в                       │ Симв.
   Дата   │ N док-та│      Организация-Контрагент      │       Документ-Основание       ├─────────────────┬─────────────────┬─────────────────┤      
          │         │                                  │                                │ @@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@ │      валюте     │ вал.
──────────┴─────────┴──────────────────────────────────┴────────────────────────────────┴─────────────────┴─────────────────┴─────────────────┴────── Б
.{                                                                                  
 БTXO: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
.{                                                                                  
@@@@@@@@@@ @@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&& @@@@@@
.{ CheckEnter HeadProvFP
.{ CheckEnter ProvFP
.}                                                                                  
.}                                                                                  
.}                                                                                  
 БИтого по операции                                                                        &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&& Б
                                                                                   
.}                                                                                  
 Б───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Б
 БИтого по ведомости                                                                       &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&& Щ
.endform                                                                         

#doc
2. Реестр хозяйственных операций для финпроводок (по операциям)
#end
.linkform 'reehozfp_02' prototype is 'reehozfp'
.NameInList '2. Реестр хозяйственных операций (по операциям)'
.Defo Portrait
.fields
CommonFormHeader
Interval
NameTiDk
NameHozOp
NameTiDkHoz
NameGrDescr
CurDescr
DataHozOpBeg
DataHozOpEnd
DataProvBeg
DataProvEnd
RegUch
SimvNDE:'P:C'
SimvBV:'P:C'
TiDk_NameTxo
Date_SH Nom_SH Soder_SH SumNDE_SH SumBV_SH SumVal_SH SimvVal_SH
ItogoTXO_SumNDE
ItogoTXO_SumBV
Itogo_SumNDE
Itogo_SumBV
.endfields
 Р^
 Б                                                   Реестр хозяйственных операций
                                                   ^ С
 Р
.{?internal; (IsFiltrHead);
Применялись фильтры:
.}
.{?internal; (IsHozDoc);
  Хозяйственный документ:
    ^
.}
.{?internal; (IsHozOpHead);
  Типовая хозоперация:
.}
.{ CheckEnter IsHozOpFP
    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ ^
.}
.{?internal; (IsGrDescrHead);
  Рабочая группа:
.}
.{ CheckEnter IsGrDescrFP
    ^
.}
.{?internal; (IsCurDescr);
  Дескриптор пользователя:
    ^
.}
.{?internal; (IsDataHozOp);
  Дата хозоперации:
    с @@@@@@@@@@ по @@@@@@@@@@
.}
.{?internal; (IsDataProv);
  Дата проводок из хозоперации:
    с @@@@@@@@@@ по @@@@@@@@@@
.}
Регистр учета: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Б──────────┬─────────┬───────────────────────────────────────────────┬─────────────────────────────────────────────────────┬──────
          │         │                                               │                       Сумма в                       │
   Дата   │ N док-та│             Содержание операции               ├─────────────────┬─────────────────┬─────────────────┤Валюта
          │         │                                               │ @@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@ │     валюте      │
──────────┴─────────┴───────────────────────────────────────────────┴─────────────────┴─────────────────┴─────────────────┴────── С
 Р.{
 БTXO: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ С
 Р.{
@@@@@@@@@@ @@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&& @@@@@@
.{ CheckEnter HeadProvFP
.{ CheckEnter ProvFP
.}
.}
.}
 БИтого по операции                                                    &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&& С
 Р
.}
 Б─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
Итого по ведомости                                                   &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&& С
.endform

#doc
3. Реестр хозяйственных операций и проводок к ним для финпроводок
#end
.linkform 'reehozfp_03' prototype is 'reehozfp'
.NameInList '3. Реестр хозяйственных операций и проводок к ним'
.Defo Landscape
.fields
CommonFormHeader
Interval
NameTiDk
NameHozOp
NameTiDkHoz
NameGrDescr
CurDescr
DataHozOpBeg
DataHozOpEnd
DataProvBeg
DataProvEnd
RegUch
SimvNDE:'P:C'
SimvBV:'P:C'
TiDk_NameTxo
Date_SH Nom_SH Soder_SH SumNDE_SH SumBV_SH SumVal_SH SimvVal_SH
               SodrPr   SumNDE    SumBV    SumVal    SimvVal     StBud FpCO FpPeriod Kau
ItogoTXO_SumNDE
ItogoTXO_SumBV
Itogo_SumNDE
Itogo_SumBV
.endfields
 Ш^
 Б                                                        Реестр хозяйственных операций
                                                        ^ Щ
 Ш
.{?internal; (IsFiltrHead);
Применялись фильтры:
.}
.{?internal; (IsHozDoc);
  Хозяйственный документ:
    ^
.}
.{?internal; (IsHozOpHead);
  Типовая хозоперация:
.}
.{ CheckEnter IsHozOpFP
    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ ^
.}
.{?internal; (IsGrDescrHead);
  Рабочая группа:
.}
.{ CheckEnter IsGrDescrFP
    ^
.}
.{?internal; (IsCurDescr);
  Дескриптор пользователя:
    ^
.}
.{?internal; (IsDataHozOp);
  Дата хозоперации:
    с @@@@@@@@@@ по @@@@@@@@@@
.}
.{?internal; (IsDataProv);
  Дата проводок из хозоперации:
    с @@@@@@@@@@ по @@@@@@@@@@
.}
Регистр учета: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Б──────────┬─────────┬───────────────────────────────────────────┬─────────────────────────────────────────────────────┬────┬────────────────────────────────────────────────────────────────────────────────────────────────────
          │         │                                           │                    Сумма в                          │Симв│                               К о р р е с п о н д е н ц и я
  Дата    │N док-та │     Содержание операции, проводки         ├─────────────────┬─────────────────┬─────────────────┤    ├─────────────────────┬─────────────────────┬────────────────────┬───────────────────────────────────
          │         │                                           │ @@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@ │    валюте       │вал.│   Статья бюджета    │          ЦО         │       Период       │                КАУ
──────────┴─────────┴───────────────────────────────────────────┴─────────────────┴─────────────────┴─────────────────┴────┴─────────────────────┴─────────────────────┴────────────────────┴─────────────────────────────────── Щ
 Ш.{
 БTXO: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Щ
 Ш.{
@@@@@@@@@@ @@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&& @@@@
.{ CheckEnter HeadProvFP
                    ┌───────────────────────────────────────────┬─────────────────┬─────────────────┬─────────────────┬────┬─────────────────────┬─────────────────────┬────────────────────┬───────────────────────────────────
.{ CheckEnter ProvFP
                    │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&'&&&&&&&&&&&&.&&│&'&&&&&&&&&&&&.&&│&'&&&&&&&&&&&&.&&│@@@@│@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
                    └───────────────────────────────────────────┴─────────────────┴─────────────────┴─────────────────┴────┴─────────────────────┴─────────────────────┴────────────────────┴───────────────────────────────────
.}
.}
 Б────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
Итого по операции                                                &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&& Щ
 Ш
.}
 Б────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
Итого по ведомости                                               &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&& Щ
.endform

#doc
4. Реестр хозяйственных операций для финпроводок (по датам проводок)
#end
.linkform 'reehozfp_04' prototype is 'reehozfp'
.NameInList '4. Реестр хозяйственных операций (по датам проводок)'
.Defo Portrait
.fields
CommonFormHeader
Interval
NameTiDk
NameHozOp
NameTiDkHoz
NameGrDescr
CurDescr
DataHozOpBeg
DataHozOpEnd
DataProvBeg
DataProvEnd
RegUch
SimvNDE:'P:C'
SimvBV:'P:C'
TiDk_NameTxo
if(DateProv_SH<>date(0,0,0), DateProv_SH, Date_SH)
Nom_SH Soder_SH SumNDE_SH SumBV_SH SumVal_SH SimvVal_SH
ItogoTXO_SumNDE
ItogoTXO_SumBV
Itogo_SumNDE
Itogo_SumBV
.endfields
 Р^
 Б                                                   Реестр хозяйственных операций
                                                   ^ С
 Р
.{?internal; (IsFiltrHead);
Применялись фильтры:
.}
.{?internal; (IsHozDoc);
  Хозяйственный документ:
    ^
.}
.{?internal; (IsHozOpHead);
  Типовая хозоперация:
.}
.{ CheckEnter IsHozOpFP
    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ ^
.}
.{?internal; (IsGrDescrHead);
  Рабочая группа:
.}
.{ CheckEnter IsGrDescrFP
    ^
.}
.{?internal; (IsCurDescr);
  Дескриптор пользователя:
    ^
.}
.{?internal; (IsDataHozOp);
  Дата хозоперации:
    с @@@@@@@@@@ по @@@@@@@@@@
.}
.{?internal; (IsDataProv);
  Дата проводок из хозоперации:
    с @@@@@@@@@@ по @@@@@@@@@@
.}
Регистр учета: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Б──────────┬─────────┬───────────────────────────────────────────────┬─────────────────────────────────────────────────────┬──────
          │         │                                               │                       Сумма в                       │
   Дата   │ N док-та│             Содержание операции               ├─────────────────┬─────────────────┬─────────────────┤Валюта
 проводок │         │                                               │ @@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@ │      валюте     │
──────────┴─────────┴───────────────────────────────────────────────┴─────────────────┴─────────────────┴─────────────────┴────── С
 Р.{
 БTXO: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ С
 Р.{
@@@@@@@@@@ @@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&& @@@@@@
.{ CheckEnter HeadProvFP
.{ CheckEnter ProvFP
.}
.}
.}
 БИтого по операции                                                    &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&& С
 Р
.}
 Б─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
Итого по ведомости                                                   &'&&&&&&&&&&&&.&& &'&&&&&&&&&&&&.&& С
.endform
