//-----------------------------------------------------------------------------
//                                                     (c) Є®аЇ®а жЁп ѓЂ‹ЂЉ’€ЉЂ
// ѓ « ЄвЁЄ  9.10 - § а Ў®в­ п Ї« в 
// ”®а¬  Їа®в®вЁЇ ¤«п д®а¬Ёа®ў ­Ёп бЇа ўЄЁ 2-Ќ„”‹
//-----------------------------------------------------------------------------
#doc
Ќ„”‹-2
#end
.Linkform 'NDFL2_2017XML' prototype 'NDFL2_prototype'
.nameinlist '” ©« ®Ў¬Ґ­  ў д®а¬ вҐ XML c 2017 Ј®¤ '
.F 'NdflX2017.XML'
.group 'Ndfl_2015'
.var 
 „®«Ј1             : LongInt;
 „®«Ј2             : LongInt; 
 ‘г¬Ќ «“¤          : LongInt; 
 boPrint, 
 VichPrint         : boolean;
.endvar
.fields
ANSI2OEM(€¬п_д ©« )
.endFields
.{ Main_Cycle_2NDFL CheckEnter
<?xml version="1.0" encoding="windows-1251"?>
<” ©« €¤” ©«="^" ‚ҐабЏа®Ј="ѓ « ЄвЁЄ  9.10" ‚Ґаб”®а¬="5.05">
.fields
 ЂЎЎаЋЉ’ЊЋЁ«ЁЋЉЂ’Ћ
 ЋЉЂ’Ћ
 ѓ®¤
 ЏаЁ§­ Є
.endfields
  <‘ўђҐЄў ^="^" ЋвзҐвѓ®¤="^" ЏаЁ§­ Є” = "^">
.{?INTERNAL; (’ЁЇЋаЈ = 0)
.fields
 €ЌЌ
 ЉЏЏ 
.endfields
    <‘ўћ‹ €ЌЌћ‹="^" ЉЏЏ="^"></‘ўћ‹>
.}
.{?INTERNAL; (’ЁЇЋаЈ <> 0)
.fields
 €ЌЌ
.endfields
    <‘ў”‹ €ЌЌ”‹="^"></‘ў”‹>
.}
.fields
  Ќ «ЂЈҐ­в
  ” ¬‘®бв
  €¬п‘®бв
  Ћвз‘®бв
  „®ўҐаҐ­­®бвм‘®бв ўЁвҐ«п   
  Replace(ЋаЈ“ЇЏаҐ¤бв, '"', '&quot;')
  „®ўҐаҐ­­®бвм‘®бв ўЁвҐ«п
.endfields
    <Џ®¤ЇЁб ­в ЏаЏ®¤Ї="^">
.{?INTERNAL; (Ќ «ЂЈҐ­в = 2 or €ЌЌ <> '')
      <”€Ћ ” ¬Ё«Ёп="^" €¬п="^"
.{?INTERNAL; (Trim(Ћвз‘®бв) <> '')
      ЋвзҐбвў®="^"
.}
      ></”€Ћ>
.}
.{?INTERNAL; (Ќ «ЂЈҐ­в = 2 and ЋаЈ“ЇЏаҐ¤бв <> '')
      <‘ўЏаҐ¤ Ќ Ё¬„®Є="^" Ќ Ё¬ЋаЈ="^"></‘ўЏаҐ¤>
.}
.{?INTERNAL; (Ќ «ЂЈҐ­в = 2 and ЋаЈ“ЇЏаҐ¤бв = '')
      <‘ўЏаҐ¤ Ќ Ё¬„®Є="^"></‘ўЏаҐ¤>
.}    
    </Џ®¤ЇЁб ­в>
  </‘ўђҐЄў>
.{ Person_Cycle_2NDFL CheckEnter
.fields  
  „ в 
  Ќ®¬Ґа
  ѓ®¤    
  ЏаЁ§­ Є
  Ќ®¬ҐаЉ®ааҐЄв
  €”Ќ‘
  ЋЉЂ’Ћ  
  ’Ґ«Ґд®­  
.endfields
  <„®Єг¬Ґ­в ЉЌ„="1151078" „ в „®Є="^" Ќ®¬‘Їа="^" ЋвзҐвѓ®¤="^" ЏаЁ§­ Є="^" Ќ®¬Љ®аа="^" Љ®¤ЌЋ="^">
    <‘ўЌЂ ЋЉ’ЊЋ="^"
.{?INTERNAL; (Trim(’Ґ«Ґд®­) <> '')
    ’«д="^"
.}
    >
.{?INTERNAL; (’ЁЇЋаЈ = 0)
.fields
  Replace(ЋаЈ ­Ё§ жЁп, '"', '&quot;')
  €ЌЌ
  ЉЏЏ
.endfields
      <‘ўЌЂћ‹ Ќ Ё¬ЋаЈ="^" €ЌЌћ‹="^" ЉЏЏ="^">
.{?INTERNAL; (Љ®¤ђ…Ћђѓ = '0' or Љ®¤ђ…Ћђѓ = '1'  or Љ®¤ђ…Ћђѓ = '2' or Љ®¤ђ…Ћђѓ = '3' or Љ®¤ђ…Ћђѓ = '5' or Љ®¤ђ…Ћђѓ = '6')
.fields
  Љ®¤ђ…Ћђѓ
.endfields
        <‘ўђҐ®аЈћ‹ ”®а¬ђҐ®аЈ="^"
.{?INTERNAL; (Љ®¤ђ…Ћђѓ = '1'  or Љ®¤ђ…Ћђѓ = '2' or Љ®¤ђ…Ћђѓ = '3' or Љ®¤ђ…Ћђѓ = '5' or Љ®¤ђ…Ћђѓ = '6')
.fields
  €ЌЌђ…Ћђѓ
  ЉЏЏђ…Ћђѓ
.endfields
         €ЌЌћ‹="^" ЉЏЏ="^"
.}
        />
.}
      </‘ўЌЂћ‹>
.}
.{?INTERNAL; (’ЁЇЋаЈ <> 0)
.fields
  €ЌЌ
  ” ¬ђгЄ
  €¬пђгЄ
  ЋвзђгЄ
.endfields 
      <‘ўЌЂ”‹ €ЌЌ”‹="^">
        <”€Ћ ” ¬Ё«Ёп="^" €¬п="^"
.{?INTERNAL; (Trim(ЋвзђгЄ) <> '')
      ЋвзҐбвў®="^"
.}
      ></”€Ћ>
      </‘ўЌЂ”‹>
.}
    </‘ўЌЂ>
.fields  
  €ЌЌ_­ «®Ј®Ї« вҐ«мйЁЄ 
  €ЌЌ2_­ «®Ј®Ї« вҐ«мйЁЄ 
  ‘в вгб
  „ в _а®¦¤Ґ­Ёп
  ѓа ¦¤ ­бвў®
.endfields
    <Џ®«гз„®е
.{?internal; (Trim(€ЌЌ_­ «®Ј®Ї« вҐ«мйЁЄ ) <> '')
      €ЌЌ”‹="^"
.}
.{?internal; (Trim(€ЌЌ2_­ «®Ј®Ї« вҐ«мйЁЄ ) <> '')
      €ЌЌ€­®="^"
.}
      ‘в вгб="^" „ в ђ®¦¤="^" ѓа ¦¤="^">
.fields
  ” ¬Ё«Ёп
  €¬п
  ЋвзҐбвў®
  Љ®¤_¤®Єг¬Ґ­в 
  ‘ҐаЁп_­®¬Ґа_¤®Єг¬Ґ­в 
.endFields
      <”€Ћ ” ¬Ё«Ёп="^" €¬п="^"
.{?INTERNAL; (Trim(ЋвзҐбвў®) <> '')
      ЋвзҐбвў®="^"
.}
      ></”€Ћ>
      <“¤‹Ёз­”‹ Љ®¤“¤‹Ёз­="^" ‘ҐаЌ®¬„®Є="^"></“¤‹Ёз­”‹>
    </Џ®«гз„®е>
.fields
 ‘в ўЄ _Ќ «®Ј 
 ЊҐбпж_‘в1 Љ®¤_¤®е®¤ _‘в1 ‘г¬¬ _¤®е®¤ _‘в1 Љ®¤_‚лзҐв _‘в1 ‘г¬¬ _ўлзҐв _‘в1
 ЊҐбпж_‘в2 Љ®¤_¤®е®¤ _‘в2 ‘г¬¬ _¤®е®¤ _‘в2 Љ®¤_‚лзҐв _‘в2 ‘г¬¬ _ўлзҐв _‘в2
.endfields
.{ Percent_Cycle_2NDFL CheckEnter
   <‘ўҐ¤„®е  ‘в ўЄ ="^">
      <„®е‚лз>
.{ Incom_Cycle_2NDFL CheckEnter
.{?INTERNAL; (Double(‘г¬¬ _¤®е®¤ _‘в1) <> 0)
        <‘ў‘г¬„®е ЊҐбпж="^" Љ®¤„®е®¤="^" ‘г¬„®е®¤="^">
.{?INTERNAL; (Double(‘г¬¬ _ўлзҐв _‘в1) <> 0)
          <‘ў‘г¬‚лз Љ®¤‚лзҐв="^" ‘г¬‚лзҐв="^"/>
.}
        </‘ў‘г¬„®е>
.}
.{?INTERNAL; (Double(‘г¬¬ _¤®е®¤ _‘в2) <> 0)
        <‘ў‘г¬„®е ЊҐбпж="^" Љ®¤„®е®¤="^" ‘г¬„®е®¤="^">
.{?INTERNAL; (Double(‘г¬¬ _ўлзҐв _‘в2) <> 0)
          <‘ў‘г¬‚лз Љ®¤‚лзҐв="^" ‘г¬‚лзҐв="^"/>
.}
        </‘ў‘г¬„®е>
.}
.}//Incom_Cycle_2NDFL CheckEnter
      </„®е‚лз>
.fields
 Љ®¤_‚лзҐв _1     ‘г¬¬ _ўлзҐв _1
 Љ®¤_‚лзҐв _2     ‘г¬¬ _ўлзҐв _2
 Љ®¤_‚лзҐв _3     ‘г¬¬ _ўлзҐв _3
 Љ®¤_‚лзҐв _4     ‘г¬¬ _ўлзҐв _4
.endfields
.begin
 boPrint := false;
 VichPrint := false;
end.
.{ Discount_Cycle_2NDFL CheckEnter
.begin
 boPrint  := false;  
 if (Double(‘г¬¬ _ўлзҐв _1) <> 0)
   boPrint := true
 else
   if (Double(‘г¬¬ _ўлзҐв _2) <> 0) 
     boPrint := true
     else
       if (Double(‘г¬¬ _ўлзҐв _3) <> 0)
         boPrint := true
           else
             if (Double(‘г¬¬ _ўлзҐв _4) <> 0) 
               boPrint := true;
end.
.{?INTERNAL; (boPrint = true) and (VichPrint = false);
       <Ќ «‚лз‘‘€>
.begin 
 VichPrint:= true;
end.
.}
.{?INTERNAL; (Double(‘г¬¬ _ўлзҐв _1) <> 0);
        <ЏаҐ¤‚лз‘‘€ Љ®¤‚лзҐв="^" ‘г¬‚лзҐв="^"></ЏаҐ¤‚лз‘‘€>
.}
.{?INTERNAL; (Double(‘г¬¬ _ўлзҐв _2) <> 0);
        <ЏаҐ¤‚лз‘‘€ Љ®¤‚лзҐв="^" ‘г¬‚лзҐв="^"></ЏаҐ¤‚лз‘‘€>
.}
.{?INTERNAL; (Double(‘г¬¬ _ўлзҐв _3) <> 0);
        <ЏаҐ¤‚лз‘‘€ Љ®¤‚лзҐв="^" ‘г¬‚лзҐв="^"></ЏаҐ¤‚лз‘‘€>
.}
.{?INTERNAL; (Double(‘г¬¬ _ўлзҐв _4) <> 0);
        <ЏаҐ¤‚лз‘‘€ Љ®¤‚лзҐв="^" ‘г¬‚лзҐв="^"></ЏаҐ¤‚лз‘‘€>
.}
.}//Discount_Cycle_2NDFL CheckEnter
.fields
  Ќ®¬Ґа“ўҐ¤‘®ж‚лз
  „ в ‚л¤ зЁ‘®ж“ўҐ¤
  ЉҐ¬‚л¤ ­®‘®ж“ўҐ¤
.endfields
.{ Info_DiscountSoc_Cycle_2NDFL CheckEnter
.{?INTERNAL; (trim(Ќ®¬Ґа“ўҐ¤‘®ж‚лз) <> '') or (trim(„ в ‚л¤ зЁ‘®ж“ўҐ¤) <> '') or (trim(ЉҐ¬‚л¤ ­®‘®ж“ўҐ¤) <> '')
        <“ўҐ¤‘®ж‚лз Ќ®¬Ґа“ўҐ¤="^" „ в “ўҐ¤="^"  €”Ќ‘“ўҐ¤="^"></“ўҐ¤‘®ж‚лз>
.}
.}
.fields
  Ќ®¬Ґа“ўҐ¤€¬‚лз
  „ в ‚л¤ зЁ“ўҐ¤
  ЉҐ¬‚л¤ ­®“ўҐ¤
.endfields
.{ Info_Discount_Cycle_2NDFL CheckEnter
.{?INTERNAL; (trim(Ќ®¬Ґа“ўҐ¤€¬‚лз) <> '') or (trim(„ в ‚л¤ зЁ“ўҐ¤) <> '') or (trim(ЉҐ¬‚л¤ ­®“ўҐ¤) <> '')
        <“ўҐ¤€¬гй‚лз Ќ®¬Ґа“ўҐ¤="^" „ в “ўҐ¤="^"  €”Ќ‘“ўҐ¤="^"></“ўҐ¤€¬гй‚лз>
.}       
.}//Info_Discount_Cycle_2NDFL CheckEnter
.{?INTERNAL; (VichPrint = true);
       </Ќ «‚лз‘‘€>
.}
.begin
 „®«Ј1 := 0;
 „®«Ј2 := 0;
 if ( ‘в ўЄ _Ќ «®Ј  = 13 )
   ‘г¬Ќ «“¤ := if (“зҐв„ вл‚лЇ« вл = 1, ‘г¬¬ Ќ «®Ј “¤‚лЇ«, ‘г¬¬ Ќ «®Ј “¤) - ‘г¬¬ ЂўЏ« в;
 else
   ‘г¬Ќ «“¤ := if (“зҐв„ вл‚лЇ« вл = 1, ‘г¬¬ Ќ «®Ј “¤‚лЇ«, ‘г¬¬ Ќ «®Ј “¤);
 if ( ‘г¬¬ Ќ «®Ј €бз > ‘г¬¬ Ќ «®Ј “¤ )
   „®«Ј2 := ‘г¬¬ Ќ «®Ј €бз - ‘г¬¬ Ќ «®Ј “¤
 else
   if ( ‘г¬¬ Ќ «®Ј €бз < ‘г¬¬ Ќ «®Ј “¤ and “зҐв„ вл‚лЇ« вл = 0)
     „®«Ј1 := ‘г¬¬ Ќ «®Ј “¤  - ‘г¬¬ Ќ «®Ј €бз
end.
.fields
 ‘г¬¬ „®е®¤      
 Ќ «Ѓ §          
 ‘г¬¬ Ќ «®Ј €бз  
 ‘г¬¬ ЂўЏ« в
 ‘г¬Ќ «“¤   
 ‘г¬¬ Ќ «®Ј ЏҐаҐз
 „®«Ј1
 „®«Ј2
.endfields
      <‘г¬€вЌ «ЏҐа
        ‘г¬„®еЋЎй="^" Ќ «Ѓ § ="^" Ќ «€бзЁб«="^" Ђў ­бЏ« в”ЁЄб="^" Ќ «“¤Ґа¦="^"
        Ќ «ЏҐаҐзЁб«="^"
        Ќ «“¤Ґа¦‹Ёи="^" Ќ «ЌҐ“¤Ґа¦="^">
.fields
  Ќ®¬Ґа“ўҐ¤ЂўЏ« в‚лз   
  „ в ‚л¤ зЁ“ўҐ¤ЂўЏ« в   
  ЉҐ¬‚л¤ ­®“ўҐ¤ЂўЏ« в     
.endfields
.{ Info_DiscountAvPlat_Cycle_2NDFL CheckEnter
.{?INTERNAL; (trim(Ќ®¬Ґа“ўҐ¤ЂўЏ« в‚лз) <> '') or (trim(„ в ‚л¤ зЁ“ўҐ¤ЂўЏ« в) <> '') or (trim(ЉҐ¬‚л¤ ­®“ўҐ¤ЂўЏ« в) <> '')
        <“ўҐ¤”ЁЄбЏ« в Ќ®¬Ґа“ўҐ¤="^" „ в “ўҐ¤="^"  €”Ќ‘“ўҐ¤="^"></“ўҐ¤”ЁЄбЏ« в>
.}       
.}
      </‘г¬€вЌ «ЏҐа>
    </‘ўҐ¤„®е>
.}
  </„®Єг¬Ґ­в>
.}
</” ©«>
.}
.endform
