//-----------------------------------------------------------------------------
//                                                     (c) Є®аЇ®а жЁп ѓЂ‹ЂЉ’€ЉЂ
// ѓ « ЄвЁЄ  8.10 - § а Ў®в­ п Ї« в 
// ”®а¬  Їа®в®вЁЇ ¤«п д®а¬Ёа®ў ­Ёп бЇа ўЄЁ 2-Ќ„”‹
//-----------------------------------------------------------------------------
#doc
Ќ„”‹-2
#end
.Linkform 'NDFL2_XML' prototype 'NDFL2_prototype'
.nameinlist '” ©« ®Ў¬Ґ­  ў д®а¬ вҐ XML c 2012 Ј®¤ '
.F 'NdflX2012.XML'
.group 'Ndfl_2012'
.var 
 „®«Ј1             : double;
 „®«Ј2             : double; 
 boPrint, 
 VichPrint         : boolean;
.endvar
.fields
ANSI2OEM(€¬п_д ©« )
.endFields
.{ Main_Cycle_2NDFL CheckEnter
<?xml version="1.0" encoding="windows-1251"?>
#ifdef Gal9_1
<” ©« €¤” ©«="^" ‚ҐабЏа®Ј="ѓ « ЄвЁЄ  9.10" ‚Ґаб”®а¬="5.03">
#else
<” ©« €¤” ©«="^" ‚ҐабЏа®Ј="ѓ « ЄвЁЄ  8.10" ‚Ґаб”®а¬="5.03">
#endif
.fields
 ЂЎЎаЋЉ’ЊЋЁ«ЁЋЉЂ’Ћ
 ЋЉЂ’Ћ
 ѓ®¤
 ЏаЁ§­ Є
.endfields
  <‘ўђҐЄў ^="^" ЋвзҐвѓ®¤="^" ЏаЁ§­ Є” = "^">
.{?INTERNAL; (’ЁЇЋаЈ = 0)
.fields
 €ЌЌ
 ЉЏЏ 
.endfields
    <‘ўћ‹ €ЌЌћ‹="^" ЉЏЏ="^"></‘ўћ‹>
.}
.{?INTERNAL; (’ЁЇЋаЈ <> 0)
.fields
 €ЌЌ
.endfields
    <‘ў”‹ €ЌЌ”‹="^"></‘ў”‹>
.}
  </‘ўђҐЄў>
.{ Person_Cycle_2NDFL CheckEnter
.fields
  „ в 
  ѓ®¤  
  Ќ®¬Ґа
  ЏаЁ§­ Є
  €”Ќ‘
  ЂЎЎаЋЉ’ЊЋЁ«ЁЋЉЂ’Ћ
  ЋЉЂ’Ћ  
  ’Ґ«Ґд®­  
.endfields
  <„®Єг¬Ґ­в ЉЌ„="1151078" „ в „®Є="^" ЋвзҐвѓ®¤="^" Ќ®¬‘Їа="^" ЏаЁ§­ Є="^" Љ®¤ЌЋ="^">
    <‘ўЌЂ ^="^"
.{?INTERNAL; (Trim(’Ґ«Ґд®­) <> '')
    ’«д="^"
.}
    >
.{?INTERNAL; (’ЁЇЋаЈ = 0)
.fields
  Replace(ЋаЈ ­Ё§ жЁп, '"', '&quot;')
  €ЌЌ
  ЉЏЏ
.endfields
      <‘ўЌЂћ‹ Ќ Ё¬ЋаЈ="^" €ЌЌћ‹="^" ЉЏЏ="^"></‘ўЌЂћ‹>
.}
.{?INTERNAL; (’ЁЇЋаЈ <> 0)
.fields
  €ЌЌ
  ” ¬ђгЄ
  €¬пђгЄ
  ЋвзђгЄ
.endfields 
      <‘ўЌЂ”‹ €ЌЌ”‹="^">
        <”€Ћ ” ¬Ё«Ёп="^" €¬п="^"
.{?INTERNAL; (Trim(ЋвзђгЄ) <> '')
        ЋвзҐбвў®="^"
.}
      ></”€Ћ>
      </‘ўЌЂ”‹>
.}
    </‘ўЌЂ>
.fields  
  €ЌЌ_­ «®Ј®Ї« вҐ«мйЁЄ 
  ‘в вгб
  „ в _а®¦¤Ґ­Ёп
  ѓа ¦¤ ­бвў®
.endfields
    <Џ®«гз„®е
.{?internal; (Trim(€ЌЌ_­ «®Ј®Ї« вҐ«мйЁЄ ) <> '')
      €ЌЌ”‹="^"
.}
      ‘в вгб="^" „ в ђ®¦¤="^" ѓа ¦¤="^">
.fields
  ” ¬Ё«Ёп
  €¬п
  ЋвзҐбвў®
  Љ®¤_¤®Єг¬Ґ­в 
  ‘ҐаЁп_­®¬Ґа_¤®Єг¬Ґ­в 
  €­¤ҐЄбђ”
  Љ®¤ђҐЈЁ®­ ђ”
  ђ ©®­ђ”
  ѓ®а®¤ђ”
  Ќ бЏг­Євђ”
  replace(“«Ёж ђ”,'"','')
  replace(„®¬ђ”,'"','')
  replace(Љ®аЇгбђ”,'"','')
  replace(Љў авЁа ђ”,'"','')
  replace(Љ®¤‘ва ­лЏа®¦Ёў ­Ёп,'"','')
  replace(Џ®«­л©Ђ¤аҐб,'"','')
.endFields
      <”€Ћ ” ¬Ё«Ёп="^" €¬п="^"
.{?INTERNAL; (Trim(ЋвзҐбвў®) <> '')
      ЋвзҐбвў®="^"
.}
      ></”€Ћ>
      <“¤‹Ёз­”‹ Љ®¤“¤‹Ёз­="^" ‘ҐаЌ®¬„®Є="^"></“¤‹Ёз­”‹>
.{?INTERNAL; (trim(€­¤ҐЄбђ”) <> '') or (trim(Љ®¤ђҐЈЁ®­ ђ”) <> '')
      <Ђ¤аЊ†ђ”
.{?INTERNAL; (trim(€­¤ҐЄбђ”)<>'')
        €­¤ҐЄб="^"
.}
        Љ®¤ђҐЈЁ®­="^"
.{?INTERNAL; (trim(ђ ©®­ђ”)<>'')
        ђ ©®­="^"
.}
.{?INTERNAL; (trim(ѓ®а®¤ђ”)<>'')
        ѓ®а®¤="^"
.}
.{?INTERNAL; (trim(Ќ бЏг­Євђ”)<>'')
        Ќ бҐ«Џг­Єв="^"
.}
.{?INTERNAL; (trim(“«Ёж ђ”)<>'')
        “«Ёж ="^"
.}
.{?INTERNAL; (trim(„®¬ђ”)<>'')
        „®¬="^"
.}
.{?INTERNAL; (trim(Љ®аЇгбђ”)<>'')
        Љ®аЇгб="^"
.}
.{?INTERNAL; (trim(Љў авЁа ђ”)<>'')
        Љў ав="^"
.}
        ></Ђ¤аЊ†ђ”>
.}
.{?INTERNAL; (trim(Џ®«­л©Ђ¤аҐб) <> '')
      <Ђ¤а€ЌЋ Љ®¤‘ва="^" Ђ¤а’ҐЄбв="^"></Ђ¤а€ЌЋ>
.}
    </Џ®«гз„®е>
.fields
 ‘в ўЄ _Ќ «®Ј 
 ЊҐбпж_‘в1 Љ®¤_¤®е®¤ _‘в1 ‘г¬¬ _¤®е®¤ _‘в1 Љ®¤_‚лзҐв _‘в1 ‘г¬¬ _ўлзҐв _‘в1
 ЊҐбпж_‘в2 Љ®¤_¤®е®¤ _‘в2 ‘г¬¬ _¤®е®¤ _‘в2 Љ®¤_‚лзҐв _‘в2 ‘г¬¬ _ўлзҐв _‘в2
.endfields
.{ Percent_Cycle_2NDFL CheckEnter
   <‘ўҐ¤„®е  ‘в ўЄ ="^">
      <„®е‚лз>
.{ Incom_Cycle_2NDFL CheckEnter
.{?INTERNAL; (Double(‘г¬¬ _¤®е®¤ _‘в1) <> 0)
        <‘ў‘г¬„®е ЊҐбпж="^" Љ®¤„®е®¤="^" ‘г¬„®е®¤="^">
.{?INTERNAL; (Double(‘г¬¬ _ўлзҐв _‘в1) <> 0)
          <‘ў‘г¬‚лз Љ®¤‚лзҐв="^" ‘г¬‚лзҐв="^"/>
.}
        </‘ў‘г¬„®е>
.}
.{?INTERNAL; (Double(‘г¬¬ _¤®е®¤ _‘в2) <> 0)
        <‘ў‘г¬„®е ЊҐбпж="^" Љ®¤„®е®¤="^" ‘г¬„®е®¤="^">
.{?INTERNAL; (Double(‘г¬¬ _ўлзҐв _‘в2) <> 0)
          <‘ў‘г¬‚лз Љ®¤‚лзҐв="^" ‘г¬‚лзҐв="^"/>
.}
        </‘ў‘г¬„®е>
.}
.}//Incom_Cycle_2NDFL CheckEnter
      </„®е‚лз>
.fields
 Љ®¤_‚лзҐв _1     ‘г¬¬ _ўлзҐв _1
 Љ®¤_‚лзҐв _2     ‘г¬¬ _ўлзҐв _2
 Љ®¤_‚лзҐв _3     ‘г¬¬ _ўлзҐв _3
 Љ®¤_‚лзҐв _4     ‘г¬¬ _ўлзҐв _4
.endfields
.begin
 boPrint := false;
 VichPrint := false;
end.
.{ Discount_Cycle_2NDFL CheckEnter
.begin
 boPrint  := false;  
 if (Double(‘г¬¬ _ўлзҐв _1) <> 0)
   boPrint := true
 else
   if (Double(‘г¬¬ _ўлзҐв _2) <> 0) 
     boPrint := true
     else
       if (Double(‘г¬¬ _ўлзҐв _3) <> 0)
         boPrint := true
           else
             if (Double(‘г¬¬ _ўлзҐв _4) <> 0) 
               boPrint := true;
end.
.{?INTERNAL; (boPrint = true) and (VichPrint = false);
       <Ќ «‚лз‘‘€>
.begin 
 VichPrint:= true;
end.
.}
.{?INTERNAL; (Double(‘г¬¬ _ўлзҐв _1) <> 0);
        <ЏаҐ¤‚лз‘‘€ Љ®¤‚лзҐв="^" ‘г¬‚лзҐв="^"></ЏаҐ¤‚лз‘‘€>
.}
.{?INTERNAL; (Double(‘г¬¬ _ўлзҐв _2) <> 0);
        <ЏаҐ¤‚лз‘‘€ Љ®¤‚лзҐв="^" ‘г¬‚лзҐв="^"></ЏаҐ¤‚лз‘‘€>
.}
.{?INTERNAL; (Double(‘г¬¬ _ўлзҐв _3) <> 0);
        <ЏаҐ¤‚лз‘‘€ Љ®¤‚лзҐв="^" ‘г¬‚лзҐв="^"></ЏаҐ¤‚лз‘‘€>
.}
.{?INTERNAL; (Double(‘г¬¬ _ўлзҐв _4) <> 0);
        <ЏаҐ¤‚лз‘‘€ Љ®¤‚лзҐв="^" ‘г¬‚лзҐв="^"></ЏаҐ¤‚лз‘‘€>
.}
.}//Discount_Cycle_2NDFL CheckEnter
.fields
  Ќ®¬Ґа“ўҐ¤€¬‚лз
  „ в ‚л¤ зЁ“ўҐ¤
  ЉҐ¬‚л¤ ­®“ўҐ¤
.endfields
.{ Info_DiscountSoc_Cycle_2NDFL CheckEnter
.}
.{ Info_Discount_Cycle_2NDFL CheckEnter
.{?INTERNAL; (trim(Ќ®¬Ґа“ўҐ¤€¬‚лз) <> '') or (trim(„ в ‚л¤ зЁ“ўҐ¤) <> '') or (trim(ЉҐ¬‚л¤ ­®“ўҐ¤) <> '')
        <“ўҐ¤€¬гй‚лз Ќ®¬Ґа“ўҐ¤="^" „ в “ўҐ¤="^"  €”Ќ‘“ўҐ¤="^"></“ўҐ¤€¬гй‚лз>
.}       
.}//Info_Discount_Cycle_2NDFL CheckEnter
.{?INTERNAL; (VichPrint = true);
       </Ќ «‚лз‘‘€>
.}
.begin
 „®«Ј1 := 0;
 „®«Ј2 := 0;
 if ( ‘г¬¬ Ќ «®Ј €бз > ‘г¬¬ Ќ «®Ј “¤ )
   „®«Ј2 := ‘г¬¬ Ќ «®Ј €бз - ‘г¬¬ Ќ «®Ј “¤
 else
   if ( ‘г¬¬ Ќ «®Ј €бз < ‘г¬¬ Ќ «®Ј “¤ )
     „®«Ј1 := ‘г¬¬ Ќ «®Ј “¤  - ‘г¬¬ Ќ «®Ј €бз
end.
.fields
 ‘г¬¬ „®е®¤      
 Ќ «Ѓ §          
 ‘г¬¬ Ќ «®Ј €бз  
 ‘г¬¬ Ќ «®Ј “¤   
 ‘г¬¬ Ќ «®Ј ЏҐаҐз
 „®«Ј1
 „®«Ј2
.endfields
      <‘ѓ„Ќ «ЏҐа
        ‘г¬„®еЋЎй="^" Ќ «Ѓ § ="^" Ќ «€бзЁб«="^" Ќ «“¤Ґа¦="^"
        Ќ «ЏҐаҐзЁб«="^"
        Ќ «“¤Ґа¦‹Ёи="^" Ќ «ЌҐ“¤Ґа¦="^"/>
    </‘ўҐ¤„®е>
.{ Info_DiscountAvPlat_Cycle_2NDFL CheckEnter
.}
.}
  </„®Єг¬Ґ­в>
.}
</” ©«>
.}
.endform
