//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
//------------------------------------------------------------------------------
// Галактика 5.0 - ФРО
// Ведомости аналитического учета по счету
//------------------------------------------------------------------------------
#include FeeSigners.frn
//------------------------------------------------------------------------------
// Внимание! Существуют Slk-отчеты (копии всех присоединенных форм)
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Информация о замене полей (в порядке убывания дат)
//
//  ----------------------------------------------------------------------------
//  DD-MM-YYYY
//  ----------------------------------------------------------------------------
//  24-06-2005
//    Изменилось содержание полей, выводимых в форме cons_anuch_sh_11 (*_SLK)
//      c7p10ov      - если проводка валютная, то сумма оборота по дебету в
//                     валюте документа, а если проводка в НДЕ, то сумма в НДЕ
//      c7p11ov      - аналогично, но сумма оборота по кредиту
//      c7p10ov_name - [New] cимвол валюты для суммы c7p10ov (если она в валюте)
//      c7p11ov_name - аналогично для c7p11ov
//
//    Ранее в поля c7p10ov и c7p11ov выводились только суммы в валюте
//
//  ----------------------------------------------------------------------------
//  27-05-2005
//
//    Из прототипа _удалены_ поля:
//      c3p2, c4p2, c5p2, c8p2, c9p2, c10p2
//        В них выводился ключ для группировки в отчете, который содержал
//        непечатные символы. Фактически использовать поля было невозможно.
//
//    В прототип _добавлены_ поля:
//      cOborot   содержит ссылку Oborot.NRec
//      cSoprHoz  содержит ссылку Oborot.cSoprHoz
//      SodrMode  содержит режим формирования содержания операции из интерфейса
//                настройки параметров отчета
//
//  ----------------------------------------------------------------------------
//  01-02-2007
//
//    Добавлены поля для количества:
//      c7p8kol,   c7p9kol,   c7p10kol,  c7p11kol                          - по оборотам
//      c7_p1kol,  c7_p2kol,  c7_p3kol,  c7_p4kol,  c7_p5kol,  c7_p6kol    - по филиалу
//      c6_p1kol,  c6_p2kol,  c6_p3kol,  c6_p4kol,  c6_p5kol,  c6_p6kol    - по кау6
//      c10_p1kol, c10_p2kol, c10_p3kol, c10_p4kol, c10_p5kol, c10_p6kol   - по кау5
//      c9_p1kol,  c9_p2kol,  c9_p3kol,  c9_p4kol,  c9_p5kol,  c9_p6kol    - по кау4
//      c8_p1kol,  c8_p2kol,  c8_p3kol,  c8_p4kol,  c8_p5kol,  c8_p6kol    - по кау3
//      c5_p1kol,  c5_p2kol,  c5_p3kol,  c5_p4kol,  c5_p5kol,  c5_p6kol    - по кау2
//      c4_p1kol,  c4_p2kol,  c4_p3kol,  c4_p4kol,  c4_p5kol,  c4_p6kol    - по кау1
//      c3_p1kol,  c3_p2kol,  c3_p3kol,  c3_p4kol,  c3_p5kol,  c3_p6kol    - по подразделению
//      c2_p1kol,  c2_p2kol,  c2_p3kol,  c2_p4kol,  c2_p5kol,  c2_p6kol    - по субсчету
//      c1_p1kol,  c1_p2kol,  c1_p3kol,  c1_p4kol,  c1_p5kol,  c1_p6kol    - по счету
//
//------------------------------------------------------------------------------

#doc
Базовая форма отчета "Ведомости аналитического учета по счету"
#end
.set name = 'anuch_sh'
.group 'Аналитика по операциям'
.nameinlist 'Базовая форма AnUch_Sh'
.hide
.fields
c0p1 c0p1n c0p2 c0p3 c0p4 c0p5 c0p6 c0p7
cCurPS sCurPS
c1f1
c2f1 c2f2
c1p1 c1p1n
c2p1
c3p1 Kau1KodTable:word Kau1Nrec:comp
c4p1 Kau2KodTable:word Kau2Nrec:comp
c5p1 Kau3KodTable:word Kau3Nrec:comp
c8p1 Kau4KodTable:word Kau4Nrec:comp
c9p1 Kau5KodTable:word Kau5Nrec:comp
c10p1 Kau6KodTable:word Kau6Nrec:comp
c6p1
c7p1 c7p2 c7p3 c7p4 c7p5 c7p6 c7p7 cOborot cSoprHoz SodrMode:word c7p7pl c7p7op c7p8 c7p8v c7p8kol c7p9 c7p9v c7p9kol
c7p10:double c7p10v:double c7p10kol
c7p11:double c7p11v:double c7p11kol
c7p10ov:double c7p10ov_name c7p11ov:double c7p11ov_name c7p11v_date // Все 5 полей - только для cons_anuch_sh_11
BaseDocDate c7p11edIzm
c7_p1 c7_p1v c7_p1kol c7_p2 c7_p2v c7_p2kol c7_p3 c7_p3v c7_p3kol c7_p4 c7_p4v c7_p4kol c7_p5 c7_p5v c7_p5kol c7_p6 c7_p6v c7_p6kol
c7_pfod c7_pfok  c7_pdvd  c7_pdvk
c6_p1 c6_p1v c6_p1kol c6_p2 c6_p2v c6_p2kol c6_p3 c6_p3v c6_p3kol c6_p4 c6_p4v c6_p4kol   c6_p5 c6_p5v c6_p5kol c6_p6 c6_p6v c6_p6kol
c6_pfod c6_pfok  c6_pdvd  c6_pdvk c6_edizm
c10_p1 c10_p1v c10_p1kol c10_p2 c10_p2v c10_p2kol c10_p3 c10_p3v c10_p3kol c10_p4 c10_p4v c10_p4kol c10_p5 c10_p5v c10_p5kol c10_p6 c10_p6v c10_p6kol
c10_pfod c10_pfok  c10_pdvd  c10_pdvk c10_edizm
c9_p1 c9_p1v c9_p1kol c9_p2 c9_p2v c9_p2kol c9_p3 c9_p3v c9_p3kol c9_p4 c9_p4v c9_p4kol c9_p5 c9_p5v c9_p5kol c9_p6 c9_p6v c9_p6kol
c9_pfod c9_pfok  c9_pdvd  c9_pdvk  c9_edizm
c8_p1 c8_p1v c8_p1kol c8_p2 c8_p2v c8_p2kol c8_p3 c8_p3v c8_p3kol c8_p4 c8_p4v c8_p4kol c8_p5 c8_p5v c8_p5kol c8_p6 c8_p6v c8_p6kol
c8_pfod c8_pfok  c8_pdvd  c8_pdvk  c8_edizm
c5_p1 c5_p1v c5_p1kol c5_p2 c5_p2v c5_p2kol c5_p3 c5_p3v c5_p3kol c5_p4 c5_p4v c5_p4kol c5_p5 c5_p5v c5_p5kol c5_p6 c5_p6v c5_p6kol
c5_pfod c5_pfok  c5_pdvd  c5_pdvk c5_edizm
c4_p1 c4_p1v c4_p1kol c4_p2 c4_p2v c4_p2kol c4_p3 c4_p3v c4_p3kol c4_p4 c4_p4v c4_p4kol c4_p5 c4_p5v c4_p5kol c4_p6 c4_p6v c4_p6kol
c4_pfod c4_pfok  c4_pdvd  c4_pdvk c4_edizm
c3_p1 c3_p1v c3_p1kol c3_p2 c3_p2v c3_p2kol c3_p3 c3_p3v c3_p3kol c3_p4 c3_p4v c3_p4kol c3_p5 c3_p5v c3_p5kol c3_p6 c3_p6v c3_p6kol
c3_pfod c3_pfok  c3_pdvd  c3_pdvk c3_edizm
c2_p1 c2_p1v c2_p1kol c2_p2 c2_p2v c2_p2kol c2_p3 c2_p3v c2_p3kol c2_p4 c2_p4v c2_p4kol c2_p5 c2_p5v c2_p5kol c2_p6 c2_p6v c2_p6kol
c2_pfod c2_pfok  c2_pdvd  c2_pdvk c2_edizm
RolledSubDeb RolledSubDebV RollSubDebKol RolledSubKred RolledSubKredV RollSubKredKol
c1_p1 c1_p1v c1_p1kol c1_p2 c1_p2v c1_p2kol c1_p3 c1_p3v c1_p3kol c1_p4 c1_p4v c1_p4kol c1_p5 c1_p5v c1_p5kol c1_p6 c1_p6v c1_p6kol
c1_pfod c1_pfok  c1_pdvd  c1_pdvk c1_edizm
RolledSchDeb RolledSchDebV RollSchDebKol RolledSchKred RolledSchKredV RollSchKredKol
#FeeSignersCycleFields
.endfields
c0p1    Счет N         ^
c0p1n   Счет имя       ^
c0p2    Интервал начало  ^
c0p3             конец   ^
c0p4    Нац ДЕ (имя)   ^
c0p5    Нац ДЕ (симв)  ^
c0p6    Валюта отчетов (имя)   ^
c0p7    Валюта отчетов (симв)  ^
cCurPS  Текущий план счетов (nrec) ^
sCurPS  Текущий план счетов (имя)  ^
.if OkFilAnS
.{
c1f1 ^
.{
c2f1 ^
c2f2 ^
.}
.}
.end
.{
.if OkAnRSub
c1p1    Субсчет осн счета   ^
c1p1n        имя субсчета   ^
.end
.{
.if OkAnRPodr
c2p1    Подразделение       ^
.end
.{
.if OkAnRKau1
c3p1    КАУ1 осн счета      ^
Kau1KodTable  Код таблицы КАУ 1 основного счета ^
Kau1Nrec      NRec КАУ 1 основного счета ^
.end
.{
.if OkAnRKau2
c4p1    КАУ2 осн счета      ^
Kau2KodTable  Код таблицы КАУ 2 основного счета ^
Kau2Nrec      NRec КАУ 2 основного счета ^
.end
.{
.if OkAnRKau3
c5p1    КАУ3 осн счета      ^
Kau3KodTable  Код таблицы КАУ 3 основного счета ^
Kau3Nrec      NRec КАУ 3 основного счета ^
.end
.{
.if OkAnRKau4
c8p1    КАУ4 осн счета      ^
Kau4KodTable  Код таблицы КАУ 4 основного счета ^
Kau4Nrec      NRec КАУ 4 основного счета ^
.end
.{
.if OkAnRKau5
c9p1    КАУ5 осн счета      ^
Kau5KodTable  Код таблицы КАУ 5 основного счета ^
Kau5Nrec      NRec КАУ 5 основного счета ^
.end
.{
.if OkAnRKau6
c10p1    КАУ6 осн счета      ^
Kau6KodTable  Код таблицы КАУ 6 основного счета ^
Kau6Nrec      NRec КАУ 6 основного счета ^
.end
.{
c6p1    Филиал корпорации   ^
.{
c7p1     дата         ^
c7p2     N док        ^
c7p3     субсчет осн  ^
c7p4     кор счет     ^
c7p5     субсчет кор  ^
c7p6     КАУ кор      ^
c7p7     подразд кор  ^
cOborot  - NRec проводки                 ^
cSoprHoz - ссылка на журнал хозопераций  ^
SodrMode - режим формирования содержания ^
c7p7pl   - плательщик/получатель ^
c7p7op   - наименование операции ^
c7p8     сальдо вход по дебету  ^
c7p8v                           ^
c7p8kol                         ^
c7p9     сальдо вход по кредиту ^
c7p9v                           ^
c7p9kol                         ^
c7p10    обороты по дебету      ^
c7p10v                          ^
c7p10kol                        ^
c7p11    обороты по кредиту     ^
c7p11v                          ^
c7p11kol                        ^
c7p10ov                         ^ Оборот по дебету в валюте операции
c7p10ov_name                    ^ Название валюты операции (для дебета)
c7p11ov                         ^ Оборот по кредиту в валюте операции
c7p11ov_name                    ^ Название валюты операции (для кредита)
c7p11v_date                     ^ Дата курса для валюты отчетов
BaseDocDate   Дата платежного документа ^
c7p11edIzm                      ^ Единица измерения количества
.}
Сумма по Филиалу корпорации
c7_p1     сальдо вход по дебету  ^
c7_p1v                           ^
c7_p1kol                         ^
c7_p2     сальдо вход по кредиту ^
c7_p2v                           ^
c7_p2kol                         ^
c7_p3     обороты по дебету      ^
c7_p3v                           ^
c7_p3kol                         ^
c7_p4     обороты по кредиту     ^
c7_p4v                           ^
c7_p4kol                         ^
c7_p5     сальдо исх по дебету   ^
c7_p5v                           ^
c7_p5kol                         ^
c7_p6     сальдо исх по кредиту  ^
c7_p6v                           ^
c7_p6kol                         ^
c7_pfod   сальдо исх по дебету фактическое в БВ   ^
c7_pfok   сальдо исх по кредиту фактическое в БВ  ^
c7_pdvd   дельта между расчетным и фактическим по дебету   ^
c7_pdvk   дельта между расчетным и фактическим по кредиту  ^
.}
.if OkAnRSumKau6
Сумма по КАУ 6
c6_p1     сальдо вход по дебету  ^
c6_p1v                           ^
c6_p1kol                         ^
c6_p2     сальдо вход по кредиту ^
c6_p2v                           ^
c6_p2kol                         ^
c6_p3     обороты по дебету      ^
c6_p3v                           ^
c6_p3kol                         ^
c6_p4     обороты по кредиту     ^
c6_p4v                           ^
c6_p4kol                         ^
c6_p5     сальдо исх по дебету   ^
c6_p5v                           ^
c6_p5kol                         ^
c6_p6     сальдо исх по кредиту  ^
c6_p6v                           ^
c6_p6kol                         ^
c6_pfod   сальдо исх по дебету фактическое в БВ   ^
c6_pfok   сальдо исх по кредиту фактическое в БВ  ^
c6_pdvd   дельта между расчетным и фактическим по дебету   ^
c6_pdvk   дельта между расчетным и фактическим по кредиту  ^
c6_edizm                         ^ Единица измерения количества
.end
.}
.if OkAnRSumKau5
Сумма по КАУ 5
c10_p1     сальдо вход по дебету  ^
c10_p1v                           ^
c10_p1kol                         ^
c10_p2     сальдо вход по кредиту ^
c10_p2v                           ^
c10_p2kol                         ^
c10_p3     обороты по дебету      ^
c10_p3v                           ^
c10_p3kol                         ^
c10_p4     обороты по кредиту     ^
c10_p4v                           ^
c10_p4kol                         ^
c10_p5     сальдо исх по дебету   ^
c10_p5v                           ^
c10_p5kol                         ^
c10_p6     сальдо исх по кредиту  ^
c10_p6v                           ^
c10_p6kol                         ^
c10_pfod   сальдо исх по дебету фактическое в БВ   ^
c10_pfok   сальдо исх по кредиту фактическое в БВ  ^
c10_pdvd   дельта между расчетным и фактическим по дебету   ^
c10_pdvk   дельта между расчетным и фактическим по кредиту  ^
c10_edizm                         ^ Единица измерения количества
.end
.}
.if OkAnRSumKau4
Сумма по КАУ 4
c9_p1     сальдо вход по дебету  ^
c9_p1v                           ^
c9_p1kol                         ^
c9_p2     сальдо вход по кредиту ^
c9_p2v                           ^
c9_p2kol                         ^
c9_p3     обороты по дебету      ^
c9_p3v                           ^
c9_p3kol                         ^
c9_p4     обороты по кредиту     ^
c9_p4v                           ^
c9_p4kol                         ^
c9_p5     сальдо исх по дебету   ^
c9_p5v                           ^
c9_p5kol                         ^
c9_p6     сальдо исх по кредиту  ^
c9_p6v                           ^
c9_p6kol                         ^
c9_pfod   сальдо исх по дебету фактическое в БВ   ^
c9_pfok   сальдо исх по кредиту фактическое в БВ  ^
c9_pdvd   дельта между расчетным и фактическим по дебету   ^
c9_pdvk   дельта между расчетным и фактическим по кредиту  ^
c9_edizm                         ^  Единица измерения количества
.end
.}
.if OkAnRSumKau3
Сумма по КАУ 3
c8_p1     сальдо вход по дебету  ^
c8_p1v                           ^
c8_p1kol                         ^
c8_p2     сальдо вход по кредиту ^
c8_p2v                           ^
c8_p2kol                         ^
c8_p3     обороты по дебету      ^
c8_p3v                           ^
c8_p3kol                         ^
c8_p4     обороты по кредиту     ^
c8_p4v                           ^
c8_p4kol                         ^
c8_p5     сальдо исх по дебету   ^
c8_p5v                           ^
c8_p5kol                         ^
c8_p6     сальдо исх по кредиту  ^
c8_p6v                           ^
c8_p6kol                         ^
c8_pfod   сальдо исх по дебету фактическое в БВ   ^
c8_pfok   сальдо исх по кредиту фактическое в БВ  ^
c8_pdvd   дельта между расчетным и фактическим по дебету   ^
c8_pdvk   дельта между расчетным и фактическим по кредиту  ^
c8_edizm                         ^ Единица измерения количества
.end
.}
.if OkAnRSumKau2
Сумма по КАУ 2
c5_p1     сальдо вход по дебету  ^
c5_p1v                           ^
c5_p1kol                         ^
c5_p2     сальдо вход по кредиту ^
c5_p2v                           ^
c5_p2kol                         ^
c5_p3     обороты по дебету      ^
c5_p3v                           ^
c5_p3kol                         ^
c5_p4     обороты по кредиту     ^
c5_p4v                           ^
c5_p4kol                         ^
c5_p5     сальдо исх по дебету   ^
c5_p5v                           ^
c5_p5kol                         ^
c5_p6     сальдо исх по кредиту  ^
c5_p6v                           ^
c5_p6kol                         ^
c5_pfod   сальдо исх по дебету фактическое в БВ   ^
c5_pfok   сальдо исх по кредиту фактическое в БВ  ^
c5_pdvd   дельта между расчетным и фактическим по дебету   ^
c5_pdvk   дельта между расчетным и фактическим по кредиту  ^
c5_edizm                         ^  Единица измерения количества
.end
.}
.if OkAnRSumKau1
Сумма по КАУ 1
c4_p1     сальдо вход по дебету  ^
c4_p1v                           ^
c4_p1kol                         ^
c4_p2     сальдо вход по кредиту ^
c4_p2v                           ^
c4_p2kol                         ^
c4_p3     обороты по дебету      ^
c4_p3v                           ^
c4_p3kol                         ^
c4_p4     обороты по кредиту     ^
c4_p4v                           ^
c4_p4kol  ^
c4_p5     сальдо исх по дебету   ^
c4_p5v                           ^
c4_p5kol                         ^
c4_p6     сальдо исх по кредиту  ^
c4_p6v                           ^
c4_p6kol                         ^
c4_pfod   сальдо исх по дебету фактическое в БВ   ^
c4_pfok   сальдо исх по кредиту фактическое в БВ  ^
c4_pdvd   дельта между расчетным и фактическим по дебету   ^
c4_pdvk   дельта между расчетным и фактическим по кредиту  ^
c4_edizm                         ^ Единица измерения количества
.end
.}
.if OkAnRSumPodr
Сумма по подразделению
c3_p1     сальдо вход по дебету  ^
c3_p1v                           ^
c3_p1kol                         ^
c3_p2     сальдо вход по кредиту ^
c3_p2v                           ^
c3_p2kol                         ^
c3_p3     обороты по дебету      ^
c3_p3v                           ^
c3_p3kol                         ^
c3_p4     обороты по кредиту     ^
c3_p4v                           ^
c3_p4kol                         ^
c3_p5     сальдо исх по дебету   ^
c3_p5v                           ^
c3_p5kol                         ^
c3_p6     сальдо исх по кредиту  ^
c3_p6v                           ^
c3_p6kol                         ^
c3_pfod   сальдо исх по дебету фактическое в БВ   ^
c3_pfok   сальдо исх по кредиту фактическое в БВ  ^
c3_pdvd   дельта между расчетным и фактическим по дебету   ^
c3_pdvk   дельта между расчетным и фактическим по кредиту  ^
c3_edizm                         ^ Единица измерения количества
.end
.}
.if OkAnRSumSub
Сумма по субсчету
c2_p1     сальдо вход по дебету  ^
c2_p1v                           ^
c2_p1kol                         ^
c2_p2     сальдо вход по кредиту ^
c2_p2v                           ^
c2_p2kol                         ^
c2_p3     обороты по дебету      ^
c2_p3v                           ^
c2_p3kol                         ^
c2_p4     обороты по кредиту     ^
c2_p4v                           ^
c2_p4kol                         ^
c2_p5     сальдо исх по дебету   ^
c2_p5v                           ^
c2_p5kol                         ^
c2_p6     сальдо исх по кредиту  ^
c2_p6v                           ^
c2_p6kol                         ^
c2_pfod   сальдо исх по дебету фактическое в БВ   ^
c2_pfok   сальдо исх по кредиту фактическое в БВ  ^
c2_pdvd   дельта между расчетным и фактическим по дебету   ^
c2_pdvk   дельта между расчетным и фактическим по кредиту  ^
c2_edizm                         ^ Единица измерения количества
.if OkRollSubAnUch
RolledSubDeb ^
RolledSubDebV ^
RollSubDebKol ^
RolledSubKred ^
RolledSubKredV ^
RollSubKredKol	^
.end
.end
.}
Итого по счету
c1_p1     сальдо вход по дебету  ^
c1_p1v                           ^
c1_p1kol                         ^
c1_p2     сальдо вход по кредиту ^
c1_p2v                           ^
c1_p2kol                         ^
c1_p3     обороты по дебету      ^
c1_p3v                           ^
c1_p3kol                         ^
c1_p4     обороты по кредиту     ^
c1_p4v                           ^
c1_p4kol                         ^
c1_p5     сальдо исх по дебету   ^
c1_p5v                           ^
c1_p5kol                         ^
c1_p6     сальдо исх по кредиту  ^
c1_p6v                           ^
c1_p6kol                         ^
c1_pfod   сальдо исх по дебету фактическое в БВ   ^
c1_pfok   сальдо исх по кредиту фактическое в БВ  ^
c1_pdvd   дельта между расчетным и фактическим по дебету   ^
c1_pdvk   дельта между расчетным и фактическим по кредиту  ^
c1_edizm                         ^  Единица измерения количества
.if OkRollSchAnUch
RolledSchDeb    ^
RolledSchDebV   ^
RollSchDebKol   ^
RolledSchKred   ^
RolledSchKredV  ^
RollSchKredKol	^
.end
#FeeSignersCycle(AnUch)
.endform
!==============================================================================
.linkform 'anuch_sh_01' prototype is 'anuch_sh'
.group 'Аналитика по операциям'
.nameinlist 'Ведомость аналитического учета по операциям'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3 c0p4
sCurPS
c1f1
c2f1 c2f2
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p8 c7p9 c7p10 c7p11
c10p1      c6_p1 c6_p2 c6_p3 c6_p4 c6_p5 c6_p6
c9p1       c10_p1 c10_p2  c10_p3 c10_p4 c10_p5 c10_p6
c8p1       c9_p1 c9_p2 c9_p3 c9_p4 c9_p5 c9_p6
c5p1       c8_p1 c8_p2 c8_p3 c8_p4 c8_p5 c8_p6
c4p1       c5_p1 c5_p2 c5_p3 c5_p4 c5_p5 c5_p6
c3p1       c4_p1 c4_p2 c4_p3 c4_p4 c4_p5 c4_p6
c2p1       c3_p1 c3_p2 c3_p3 c3_p4 c3_p5 c3_p6
c1p1 c1p1n c2_p1 c2_p2 c2_p3 c2_p4 c2_p5 c2_p6
RolledSubDeb RolledSubKred
c0p1 c0p1n c1_p1 c1_p2 c1_p3 c1_p4 c1_p5 c1_p6
RolledSchDeb RolledSchKred
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Р^
^
 Б                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г. Б
 ВВедомость сформирована в ^ В
 ВПлан счетов ^ В
.if OkFilAnS
 ВПрименен фильтр... В
.{
 В   ^ В
.{
 В      ^ ^ В
.}
.}
.end
.{
.[h
 Б                                                                                                                                                         лист @np@
──────────┬──────┬────────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────────────────────────────────────────────────────
          │      │            Корреспондирующий счет              │                                                    С у м м а
          │      ├────┬─────┬───────────────┬─────────────────────┼─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
  Д а т а │ Номер│Счет│Суб- │               │                     │                Сальдо               │               Обороты               │               Сальдо
          │ доку-│    │счет │ Подразделение │  Наименование КАУ   │               входящее              │                                     │              исходящее
          │ мента│    │     │               │                     ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
          │      │    │     │               │                     │       Дебет      │     Кредит       │       Дебет      │      Кредит      │       Дебет      │      Кредит
──────────┴──────┴────┴─────┴───────────────┴─────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴────────────────── Б
.]h
.if OkAnRSub
 БСубсчет : ^ ^ Б
.end
.{
.if OkAnRPodr
 БПодразделение : ^ Б
.end
.{
.if OkAnRKau1
 БОбъект аналитического учета : ^ Б
.end
.{
.if OkAnRKau2
    БОбъект аналитического учета : ^ Б
.end
.{
.if OkAnRKau3
       БОбъект аналитического учета : ^ Б
.end
.{
.if OkAnRKau4
         БОбъект аналитического учета : ^ Б
.end
.{
.if OkAnRKau5
           БОбъект аналитического учета : ^ Б
.end
.{
.if OkAnRKau6
             БОбъект аналитического учета : ^ Б
.end
.{
.{
@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&&
.}
.}
.if OkAnRSumKau6
            Б Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
            ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau5
           БИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau4
         БИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
        ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau3
       БИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
      ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau2
    БИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
   ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau1
 БИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumPodr
 БИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
 БИтого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.if OkRollSubAnUch
                                                                                                                                               Б &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
Итого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSchAnUch
                                                                                                                                               &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Р
 Щ.endform
!==============================================================================
.linkform 'anuch_sh_02' prototype is 'anuch_sh'
.group 'Аналитика по операциям в валюте отчетов'
.nameinlist 'Ведомость аналитического учета по операциям в валюте отчетов'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3 c0p6
sCurPS
c1f1
c2f1 c2f2
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p8v c7p9v c7p10v c7p11v
c10p1      c6_p1v c6_p2v c6_p3v c6_p4v c6_p5v c6_p6v
c9p1       c10_p1v c10_p2v c10_p3v c10_p4v c10_p5v c10_p6v
c8p1       c9_p1v c9_p2v c9_p3v c9_p4v c9_p5v c9_p6v
c5p1       c8_p1v c8_p2v c8_p3v c8_p4v c8_p5v c8_p6v
c4p1       c5_p1v c5_p2v c5_p3v c5_p4v c5_p5v c5_p6v
c3p1       c4_p1v c4_p2v c4_p3v c4_p4v c4_p5v c4_p6v
c2p1       c3_p1v c3_p2v c3_p3v c3_p4v c3_p5v c3_p6v
c1p1 c1p1n c2_p1v c2_p2v c2_p3v c2_p4v c2_p5v c2_p6v
RolledSubDebV RolledSubKredV
c0p1 c0p1n c1_p1v c1_p2v c1_p3v c1_p4v c1_p5v c1_p6v
RolledSchDebV RolledSchKredV
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end. Щ
 С^ Б
^
                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г.
 ГВедомость сформирована в ^ Г
 ГПлан счетов ^ Г
.if OkFilAnS
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                                                       лист @np@
──────────┬──────┬────────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────────────────────────────────────────────────────
          │      │            Корреспондирующий счет              │                                                    С у м м а
          │      ├────┬─────┬───────────────┬─────────────────────┼─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
  Д а т а │ Номер│Счет│Суб- │               │                     │                Сальдо               │               Обороты               │               Сальдо
          │ доку-│    │счет │ Подразделение │  Наименование КАУ   │               входящее              │                                     │              исходящее
          │ мента│    │     │               │                     ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
          │      │    │     │               │                     │       Дебет      │     Кредит       │       Дебет      │      Кредит      │       Дебет      │      Кредит
──────────┴──────┴────┴─────┴───────────────┴─────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
Объект аналитического учета : ^
.end
.{
.if OkAnRKau2
   Объект аналитического учета : ^
.end
.{
.if OkAnRKau3
      Объект аналитического учета : ^
.end
.{
.if OkAnRKau4
        Объект аналитического учета : ^
.end
.{
.if OkAnRKau5
          Объект аналитического учета : ^
.end
.{
.if OkAnRKau6
            Объект аналитического учета : ^
.end
.{
.{
 Б@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Б
.}
.}
.if OkAnRSumKau6
            Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
            ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau5
          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau4
        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
        ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau3
      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau2
   Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
   ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau1
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSubAnUch
                                                                                                                                               &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
 БИтого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.if OkRollSchAnUch
 Б                                                                                                                                               &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Р
 Й.endform
!==============================================================================
.linkform 'anuch_sh_03' prototype is 'anuch_sh'
.group 'Аналитика по операциям в валюте отчетов и НДЕ'
.nameinlist 'Ведомость оборотов по счету в валюте отчетов и НДЕ'
.p 80
.defo portrait
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3
sCurPS
c1f1
c2f1 c2f2
c0p5 c0p7 c0p5 c0p7
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p10 c7p10v c7p11 c7p11v
c10p1       c6_p3 c6_p3v c6_p4 c6_p4v
c9p1        c10_p3 c10_p3v c10_p4 c10_p4v
c8p1        c9_p3 c9_p3v c9_p4 c9_p4v
c5p1        c8_p3 c8_p3v c8_p4 c8_p4v
c4p1        c5_p3 c5_p3v c5_p4 c5_p4v
c3p1        c4_p3 c4_p3v c4_p4 c4_p4v
c2p1        c3_p3 c3_p3v c3_p4 c3_p4v
c1p1 c1p1n  c2_p3 c2_p3v c2_p4 c2_p4v
c0p1 c0p1n  c1_p3 c1_p3v c1_p4 c1_p4v
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end. Й
 Щ^ Б
^
                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г.
 ГПлан счетов ^ Г
.if OkFilAnS
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                                           лист @np@
──────────┬──────┬────────────────────────────────────────────────────────┬───────────────────────────────────────────────────────────────────────────
          │      │            Корреспондирующий счет                      │                                 С У М М А
          │      ├────┬─────┬───────────────┬─────────────────────────────┼───────────────────────────────────────────────────────────────────────────
  Д а т а │ Номер│Счет│Суб- │               │                             │                                  Обороты
          │ доку-│    │счет │ Подразделение │     Наименование КАУ        │
          │ мента│    │     │               │                             ├─────────────────────────────────────┬─────────────────────────────────────
          │      │    │     │               │                             │                Дебет                │                Кредит
          │      │    │     │               │                             ├──────────────────┬──────────────────┼──────────────────┬──────────────────
          │      │    │     │               │                             │     в @@@@@@     │   в @@@@@@       │     в @@@@@@     │     в @@@@@@
──────────┴──────┴────┴─────┴───────────────┴─────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
Объект аналитического учета : ^
.end
.{
.if OkAnRKau2
   Объект аналитического учета : ^
.end
.{
.if OkAnRKau3
      Объект аналитического учета : ^
.end
.{
.if OkAnRKau4
        Объект аналитического учета : ^
.end
.{
.if OkAnRKau5
          Объект аналитического учета : ^
.end
.{
.if OkAnRKau6
            Объект аналитического учета : ^
.end
.{
.{
 Б@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Б
.}
.}
.if OkAnRSumKau6
            Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
            ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau5
          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
          ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau4
        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
        ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau3
      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau2
   Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
   ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau1
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSubAnUch
.end
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
Итого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSchAnUch
.end
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Ш
 Й.endform
!==============================================================================
.linkform 'anuch_sh_04' prototype is 'anuch_sh'
.group 'Аналитика по содержанию'
.nameinlist 'Ведомость аналитического учета по содержанию'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3 c0p4
sCurPS
c1f1
c2f1 c2f2
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p7pl c7p7op c7p8 c7p9 c7p10 c7p11
c10p1      c6_p1 c6_p2 c6_p3 c6_p4 c6_p5 c6_p6
c9p1       c10_p1 c10_p2 c10_p3 c10_p4 c10_p5 c10_p6
c8p1       c9_p1 c9_p2 c9_p3 c9_p4 c9_p5 c9_p6
c5p1       c8_p1 c8_p2 c8_p3 c8_p4 c8_p5 c8_p6
c4p1       c5_p1 c5_p2 c5_p3 c5_p4 c5_p5 c5_p6
c3p1       c4_p1 c4_p2 c4_p3 c4_p4 c4_p5 c4_p6
c2p1       c3_p1 c3_p2 c3_p3 c3_p4 c3_p5 c3_p6
c1p1 c1p1n c2_p1 c2_p2 c2_p3 c2_p4 c2_p5 c2_p6
RolledSubDeb RolledSubKred
c0p1 c0p1n c1_p1 c1_p2 c1_p3 c1_p4 c1_p5 c1_p6
RolledSchDeb RolledSchKred
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Й
 Щ^ Б
^
                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г.
 ГВедомость сформирована в ^ Г
 ГПлан счетов Г  Г^ Г
.if OkFilAnS
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                                                                                                      лист @np@
──────────┬──────┬───────────────────────────────────────────────┬────────────────────────────────┬───────────────────────────────────┬───────────────────────────────────────────────────────────────────────────
          │      │            Корреспондирующий счет             │                                │                                   │                                 С у м м а
          │      ├────┬─────┬───────────────┬────────────────────┤                                │       С О Д Е Р Ж А Н И Е         ├─────────────────────────────────────┬─────────────────────────────────────
  Д а т а │ Номер│Счет│Суб- │               │                    │    ПЛАТЕЛЬЩИК / ПОЛУЧАТЕЛЬ     │                                   │                Сальдо               │               Обороты
          │ доку-│    │счет │ Подразделение │  Наименование КАУ  │                                │         О П Е Р А Ц И И           │                                     │
          │ мента│    │     │               │                    │                                │                                   ├──────────────────┬──────────────────┼──────────────────┬──────────────────
          │      │    │     │               │                    │                                │                                   │       Дебет      │     Кредит       │       Дебет      │      Кредит
──────────┴──────┴────┴─────┴───────────────┴────────────────────┴────────────────────────────────┴───────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
Объект аналитического учета : ^
.end
.{
.if OkAnRKau2
   Объект аналитического учета : ^
.end
.{
.if OkAnRKau3
      Объект аналитического учета : ^
.end
.{
.if OkAnRKau4
        Объект аналитического учета : ^
.end
.{
.if OkAnRKau5
          Объект аналитического учета : ^
.end
.{
.if OkAnRKau6
            Объект аналитического учета : ^
.end
.{
.{
 Б@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Б
.}
.}
.if OkAnRSumKau6
            Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
            ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau5
          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
          ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau4
        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
        ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau3
      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau2
   Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
   ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau1
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSubAnUch
                                                                                                                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
Итого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSchAnUch
                                                                                                                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Ш
 Щ.endform
!==============================================================================
.linkform 'anuch_sh_05' prototype is 'anuch_sh'
.group 'Аналитика по содержанию в валюте отчетов'
.nameinlist 'Ведомость аналитического учета по содержанию в валюте отчетов'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3 c0p6
sCurPS
c1f1
c2f1 c2f2
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p7pl c7p7op c7p8v c7p9v c7p10v c7p11v
c10p1      c6_p1v c6_p2v c6_p3v c6_p4v c6_p5v c6_p6v
c9p1       c10_p1v c10_p2v c10_p3v c10_p4v c10_p5v c10_p6v
c8p1       c9_p1v c9_p2v c9_p3v c9_p4v c9_p5v c9_p6v
c5p1       c8_p1v c8_p2v c8_p3v c8_p4v c8_p5v c8_p6v
c4p1       c5_p1v c5_p2v c5_p3v c5_p4v c5_p5v c5_p6v
c3p1       c4_p1v c4_p2v c4_p3v c4_p4v c4_p5v c4_p6v
c2p1       c3_p1v c3_p2v c3_p3v c3_p4v c3_p5v c3_p6v
c1p1 c1p1n c2_p1v c2_p2v c2_p3v c2_p4v c2_p5v c2_p6v
RolledSubDebV RolledSubKredV
c0p1 c0p1n c1_p1v c1_p2v c1_p3v c1_p4v c1_p5v c1_p6v
RolledSchDebV RolledSchKredV
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 Щ^ Б
^
                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г. Г
Ведомость сформирована в ^ Г
 ГПлан счетов ^ Г
.if OkFilAnS
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                                                                                                      лист @np@
──────────┬──────┬───────────────────────────────────────────────┬────────────────────────────────┬───────────────────────────────────┬───────────────────────────────────────────────────────────────────────────
          │      │            Корреспондирующий счет             │                                │                                   │                                 С у м м а
          │      ├────┬─────┬───────────────┬────────────────────┤                                │       С О Д Е Р Ж А Н И Е         ├─────────────────────────────────────┬─────────────────────────────────────
  Д а т а │ Номер│Счет│Суб- │               │                    │    ПЛАТЕЛЬЩИК / ПОЛУЧАТЕЛЬ     │                                   │                Сальдо               │               Обороты
          │ доку-│    │счет │ Подразделение │  Наименование КАУ  │                                │         О П Е Р А Ц И И           │                                     │
          │ мента│    │     │               │                    │                                │                                   ├──────────────────┬──────────────────┼──────────────────┬──────────────────
          │      │    │     │               │                    │                                │                                   │       ДЕБЕТ      │     КРЕДИТ       │       ДЕБЕТ      │      КРЕДИТ
──────────┴──────┴────┴─────┴───────────────┴────────────────────┴────────────────────────────────┴───────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
Объект аналитического учета : ^
.end
.{
.if OkAnRKau2
   Объект аналитического учета : ^
.end
.{
.if OkAnRKau3
      Объект аналитического учета : ^
.end
.{
.if OkAnRKau4
        Объект аналитического учета : ^
.end
.{
.if OkAnRKau5
          Объект аналитического учета : ^
.end
.{
.if OkAnRKau6
            Объект аналитического учета : ^
.end
.{
.{
 Б@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Б
.}
.}
.if OkAnRSumKau6
            Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
            ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau5
          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
          ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau4
        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
        ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau3
      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau2
   Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
   ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau1
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSubAnUch
                                                                                                                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
Итого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSchAnUch
                                                                                                                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Ш
 Щ.endform
!==============================================================================
.linkform 'anuch_sh_06' prototype is 'anuch_sh'
.group 'Аналитика по содержанию в валюте отчетов и НДЕ'
.nameinlist 'Ведомость аналитического учета по содержанию в валюте отчетов и НДЕ'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3
sCurPS
c1f1
c2f1 c2f2
c0p5 c0p7 c0p5 c0p7
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p7pl c7p7op c7p10 c7p10v c7p11 c7p11v
c10p1       c6_p3 c6_p3v c6_p4 c6_p4v
c9p1        c10_p3 c10_p3v c10_p4 c10_p4v
c8p1        c9_p3 c9_p3v c9_p4 c9_p4v
c5p1        c8_p3 c8_p3v c8_p4 c8_p4v
c4p1        c5_p3 c5_p3v c5_p4 c5_p4v
c3p1        c4_p3 c4_p3v c4_p4 c4_p4v
c2p1        c3_p3 c3_p3v c3_p4 c3_p4v
c1p1 c1p1n  c2_p3 c2_p3v c2_p4 c2_p4v
c0p1 c0p1n  c1_p3 c1_p3v c1_p4 c1_p4v
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 Щ^ Б
^
                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г.
 ГПлан счетов ^ Г
.if OkFilAnS
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                                                                                         лист @np@
──────────┬──────┬───────────────────────────────────────────────┬────────────────────────────────┬───────────────────────────────────┬───────────────────────────────────────────────────────────────────────────
          │      │            Корреспондирующий счет             │                                │                                   │                                 С У М М А
          │      ├────┬─────┬───────────────┬────────────────────┤                                │                                   ├───────────────────────────────────────────────────────────────────────────
  Д а т а │ Номер│Счет│Суб- │               │                    │                                │       С О Д Е Р Ж А Н И Е         │                                  Обороты
          │ доку-│    │счет │ Подразделение │  Наименование КАУ  │    ПЛАТЕЛЬЩИК / ПОЛУЧАТЕЛЬ     │                                   │
          │ мента│    │     │               │                    │                                │          О П Е Р А Ц И И          ├─────────────────────────────────────┬─────────────────────────────────────
          │      │    │     │               │                    │                                │                                   │                Дебет                │                Кредит
          │      │    │     │               │                    │                                │                                   ├──────────────────┬──────────────────┼──────────────────┬──────────────────
          │      │    │     │               │                    │                                │                                   │     в @@@@@@     │   в @@@@@@       │     в @@@@@@     │     в @@@@@@
──────────┴──────┴────┴─────┴───────────────┴────────────────────┴────────────────────────────────┴───────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
Объект аналитического учета : ^
.end
.{
.if OkAnRKau2
   Объект аналитического учета : ^
.end
.{
.if OkAnRKau3
      Объект аналитического учета : ^
.end
.{
.if OkAnRKau4
        Объект аналитического учета : ^
.end
.{
.if OkAnRKau5
          Объект аналитического учета : ^
.end
.{
.if OkAnRKau6
            Объект аналитического учета : ^
.end
.{
.{
 Б@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Б
.}
.}
.if OkAnRSumKau6
            Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
            ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau5
          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
          ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau4
        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
        ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau3
      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau2
   Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
   ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau1
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSubAnUch
.end
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
Итого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSchAnUch
.end
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Ш
 Щ.endform
!==============================================================================
.linkform 'anuch_sh_07' prototype is 'anuch_sh'
.group 'Аналитика по оборотам'
.nameinlist 'Ведомость аналитического учета по оборотам'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3 c0p4
sCurPS
c1f1
c2f1 c2f2
c1p1 c1p1n
c2p1
c10p1      c6_p1 c6_p2 c6_p3 c6_p4 c6_p5 c6_p6
c9p1       c10_p1 c10_p2 c10_p3 c10_p4 c10_p5 c10_p6
c8p1       c9_p1 c9_p2 c9_p3 c9_p4 c9_p5 c9_p6
c5p1       c8_p1 c8_p2 c8_p3 c8_p4 c8_p5 c8_p6
c4p1       c5_p1 c5_p2 c5_p3 c5_p4 c5_p5 c5_p6
c3p1       c4_p1 c4_p2 c4_p3 c4_p4 c4_p5 c4_p6
c2p1       c3_p1 c3_p2 c3_p3 c3_p4 c3_p5 c3_p6
c1p1 c1p1n c2_p1 c2_p2 c2_p3 c2_p4 c2_p5 c2_p6
RolledSubDeb RolledSubKred
c0p1 c0p1n c1_p1 c1_p2 c1_p3 c1_p4 c1_p5 c1_p6
RolledSchDeb RolledSchKred
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 С^ Б
^
                            Ведомость аналитического учета по счету
                       ^ - ^
                                        с ^ г. по ^ г.
 ГВедомость сформирована в ^
План счетов ^ Г
.if OkFilAnS
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                                             лист @np@
──────────────────────────────────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
                                                                  │           Сальдо  входящее          │               Обороты               │            Сальдо исходящее
                  Объект аналитического учета                     ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
                                                                  │       Дебет      │     Кредит       │       Дебет      │      Кредит      │       Дебет      │      Кредит
──────────────────────────────────────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
.end
.{
.if OkAnRKau2
.end
.{
.if OkAnRKau3
.end
.{
.if OkAnRKau4
.end
.{
.if OkAnRKau5
.end
.{
.if OkAnRKau6
.end
.{
.{
.}
.}
.if OkAnRSumKau6
            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau5
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau4
        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau3
      @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau2
   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau1
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSubAnUch
                                                                                                                                               &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
 БИтого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.if OkRollSchAnUch
 Б                                                                                                                                               &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Р
 Щ.endform
!==============================================================================
.linkform 'anuch_sh_08' prototype is 'anuch_sh'
.group 'Аналитика по оборотам в валюте отчетов'
.nameinlist '1. Ведомость аналитического учета по оборотам'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3 c0p6
sCurPS
c1f1
c2f1 c2f2
c1p1 c1p1n
c2p1
c10p1      c6_p1v c6_p2v c6_p3v c6_p4v c6_p5v c6_p6v
c9p1       c10_p1v c10_p2v c10_p3v c10_p4v c10_p5v c10_p6v
c8p1       c9_p1v c9_p2v c9_p3v c9_p4v c9_p5v c9_p6v
c5p1       c8_p1v c8_p2v c8_p3v c8_p4v c8_p5v c8_p6v
c4p1       c5_p1v c5_p2v c5_p3v c5_p4v c5_p5v c5_p6v
c3p1       c4_p1v c4_p2v c4_p3v c4_p4v c4_p5v c4_p6v
c2p1       c3_p1v c3_p2v c3_p3v c3_p4v c3_p5v c3_p6v
c1p1 c1p1n c2_p1v c2_p2v c2_p3v c2_p4v c2_p5v c2_p6v
RolledSubDebV RolledSubKredV
c0p1 c0p1n c1_p1v c1_p2v c1_p3v c1_p4v c1_p5v c1_p6v
RolledSchDebV RolledSchKredV
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 С^ Б
^
                            Ведомость аналитического учета по счету
                       ^ - ^
                                        с ^ г. по ^ г.
 ГВедомость сформирована в ^ Г
 ГПлан счетов ^ Г
.if OkFilAnS
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                                           лист @np@
──────────────────────────────────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
                                                                  │           Сальдо  входящее          │               Обороты               │            Сальдо исходящее
       Объект аналитического учета                                ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
                                                                  │       Дебет      │     Кредит       │       Дебет      │      Кредит      │       Дебет      │      Кредит
──────────────────────────────────────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
.end
.{
.if OkAnRKau2
.end
.{
.if OkAnRKau3
.end
.{
.if OkAnRKau4
.end
.{
.if OkAnRKau5
.end
.{
.if OkAnRKau6
.end
.{
.{
.}
.}
.if OkAnRSumKau6
           @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau5
         @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau4
       @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau3
     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau2
   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau1
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSubAnUch
                                                                                                                                               &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
 БИтого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.if OkRollSchAnUch
 Б                                                                                                                                               &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Р
 Щ.endform
!==============================================================================
.linkform 'anuch_sh_09' prototype is 'anuch_sh'
.group 'Аналитика по оборотам в валюте отчетов'
.nameinlist '2. Расчетные и фактические остатки в валюте'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n c0p2 c0p3 c0p6
sCurPS
c1f1
c2f1 c2f2
c1p1 c1p1n
c2p1
c10p1      c6_p5v c6_p6v c6_pfod c6_pfok  c6_pdvd  c6_pdvk
c9p1       c10_p5v c10_p6v c10_pfod c10_pfok  c10_pdvd  c10_pdvk
c8p1       c9_p5v c9_p6v c9_pfod c9_pfok  c9_pdvd  c9_pdvk
c5p1       c8_p5v c8_p6v c8_pfod c8_pfok  c8_pdvd  c8_pdvk
c4p1       c5_p5v c5_p6v c5_pfod c5_pfok  c5_pdvd  c5_pdvk
c3p1       c4_p5v c4_p6v c4_pfod c4_pfok  c4_pdvd  c4_pdvk
c2p1       c3_p5v c3_p6v c3_pfod c3_pfok  c3_pdvd  c3_pdvk
c1p1 c1p1n c2_p5v c2_p6v c2_pfod c2_pfok  c2_pdvd  c2_pdvk
RolledSubDebV RolledSubKredV
c0p1 c0p1n c1_p5v c1_p6v c1_pfod c1_pfok  c1_pdvd  c1_pdvk
RolledSchDebV RolledSchKredV
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 С^ Б
^
                  Расчетные и фактические остатки в валюте отчетов по счету
                ^ - ^
                                     с ^ г. по ^ г.
 ГВедомость сформирована в ^ Г
 ГПлан счетов ^ Г
.if OkFilAnS
 ГПрименен фильтр... Г
.{
 Г    ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                                           лист @np@
──────────────────────────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                                  │                                      С А Л Ь Д О    И С Х О Д Я Щ Е Е
                                                                  ├─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
              Объект аналитического учета                         │               расчетное             │             фактическое             │    дельта из-за колебания курса
                                                                  ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
                                                                  │       Дебет      │     Кредит       │       Дебет      │      Кредит      │       Дебет      │      Кредит
──────────────────────────────────────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
.end
.{
.if OkAnRKau2
.end
.{
.if OkAnRKau3
.end
.{
.if OkAnRKau4
.end
.{
.if OkAnRKau5
.end
.{
.if OkAnRKau6
.end
.{
.{
.}
.}
.if OkAnRSumKau6
            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau5
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau4
        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau3
      @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau2
   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau1
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSubAnUch
                                                                                                                                               &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
 БИтого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.if OkRollSchAnUch
 Б                                                                                                                                               &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Р
 Щ.endform
!==============================================================================
.linkform 'anuch_sh_10' prototype is 'anuch_sh'
.group 'Аналитика по оборотам в валюте отчетов и НДЕ'
.nameinlist 'Оборотно-сальдовая ведомость по счету в валюте отчетов и НДЕ'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3
sCurPS
c1f1
c2f1 c2f2
c0p5 c0p7 c0p5 c0p7 c0p5 c0p7 c0p5 c0p7
c1p1 c1p1n
c2p1
c10p1      c6_p1 c6_p1v c6_p2 c6_p2v c6_p3 c6_p3v c6_p4 c6_p4v c6_p5 c6_p5v c6_p6 c6_p6v
c9p1       c10_p1 c10_p1v c10_p2 c10_p2v c10_p3 c10_p3v c10_p4 c10_p4v c10_p5 c10_p5v c10_p6 c10_p6v
c8p1       c9_p1 c9_p1v c9_p2 c9_p2v c9_p3 c9_p3v c9_p4 c9_p4v c9_p5 c9_p5v c9_p6 c9_p6v
c5p1       c8_p1 c8_p1v c8_p2 c8_p2v c8_p3 c8_p3v c8_p4 c8_p4v c8_p5 c8_p5v c8_p6 c8_p6v
c4p1       c5_p1 c5_p1v c5_p2 c5_p2v c5_p3 c5_p3v c5_p4 c5_p4v c5_p5 c5_p5v c5_p6 c5_p6v
c3p1       c4_p1 c4_p1v c4_p2 c4_p2v c4_p3 c4_p3v c4_p4 c4_p4v c4_p5 c4_p5v c4_p6 c4_p6v
c2p1       c3_p1 c3_p1v c3_p2 c3_p2v c3_p3 c3_p3v c3_p4 c3_p4v c3_p5 c3_p5v c3_p6 c3_p6v
c1p1 c1p1n c2_p1 c2_p1v c2_p2 c2_p2v c2_p3 c2_p3v c2_p4 c2_p4v c2_p5 c2_p5v c2_p6 c2_p6v
RolledSubDeb RolledSubDebV RolledSubKred RolledSubKredV
c0p1 c0p1n c1_p1 c1_p1v c1_p2 c1_p2v c1_p3 c1_p3v c1_p4 c1_p4v c1_p5 c1_p5v c1_p6 c1_p6v
RolledSchDeb RolledSchDebV RolledSchKred RolledSchKredV
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 Щ^ Б
^
                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г.
 ГПлан счетов ^ Г
.if OkFilAnS
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                                                                     лист @np@
──────────────────────────────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────────
                                                                      │                              сальдо                                 │                               Обороты
                                                                      ├─────────────────────────────────┬───────────────────────────────────┼──────────────────────────────────┬──────────────────────────────────
                      Объект аналитического учета                     │              дебет              │              кредит               │               дебет              │               кредит
                                                                      ├────────────────┬────────────────┼─────────────────┬─────────────────┼─────────────────┬────────────────┼─────────────────┬────────────────
                                                                      │    в @@@@@@    │    в @@@@@@    │     в @@@@@@    │     в @@@@@@    │    в @@@@@@     │    в @@@@@@    │     в @@@@@@    │    в @@@@@@
──────────────────────────────────────────────────────────────────────┴────────────────┴────────────────┴─────────────────┴─────────────────┴─────────────────┴────────────────┴─────────────────┴────────────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
.end
.{
.if OkAnRKau2
.end
.{
.if OkAnRKau3
.end
.{
.if OkAnRKau4
.end
.{
.if OkAnRKau5
.end
.{
.if OkAnRKau6
.end
.{
.{
.}
.}
.if OkAnRSumKau6
            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau5
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau4
        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau3
      @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau2
   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau1
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumPodr
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.if OkRollSubAnUch
                                                                       &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.if OkRollSchAnUch
                                                                       &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Ш
 Щ.endform
!==============================================================================
.linkform 'cons_anuch_sh_01' prototype is 'anuch_sh'
.group '1). Аналитика по операциям'
.nameinlist '1). Ведомость аналитического учета по операциям'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3 c0p4
sCurPS
c1f1
c2f1 c2f2
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c6p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p8 c7p9 c7p10 c7p11
c6p1       c7_p1 c7_p2 c7_p3 c7_p4 c7_p5 c7_p6
c10p1      c6_p1 c6_p2 c6_p3 c6_p4 c6_p5 c6_p6
c9p1       c10_p1 c10_p2 c10_p3 c10_p4 c10_p5 c10_p6
c8p1       c9_p1 c9_p2 c9_p3 c9_p4 c9_p5 c9_p6
c5p1       c8_p1 c8_p2 c8_p3 c8_p4 c8_p5 c8_p6
c4p1       c5_p1 c5_p2 c5_p3 c5_p4 c5_p5 c5_p6
c3p1       c4_p1 c4_p2 c4_p3 c4_p4 c4_p5 c4_p6
c2p1       c3_p1 c3_p2 c3_p3 c3_p4 c3_p5 c3_p6
c1p1 c1p1n c2_p1 c2_p2 c2_p3 c2_p4 c2_p5 c2_p6
RolledSubDeb RolledSubKred
c0p1 c0p1n c1_p1 c1_p2 c1_p3 c1_p4 c1_p5 c1_p6
RolledSchDeb RolledSchKred
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 С^ Б
^
                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г.
 ГВедомость сформирована в ^ Г
 ГПлан счетов ^ Г
.if OkFilAnS
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                                                          лист @np@
──────────┬──────┬────────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────────────────────────────────────────────────────
          │      │            Корреспондирующий счет              │                                                    С у м м а
          │      ├────┬─────┬───────────────┬─────────────────────┼─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
  Д а т а │ Номер│Счет│Суб- │               │                     │                Сальдо               │               Обороты               │               Сальдо
          │ доку-│    │счет │ Подразделение │  Наименование КАУ   │               входящее              │                                     │              исходящее
          │ мента│    │     │               │                     ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
          │      │    │     │               │                     │       Дебет      │     Кредит       │       Дебет      │      Кредит      │       Дебет      │      Кредит
──────────┴──────┴────┴─────┴───────────────┴─────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
Объект аналитического учета : ^
.end
.{
.if OkAnRKau2
   Объект аналитического учета : ^
.end
.{
.if OkAnRKau3
      Объект аналитического учета : ^
.end
.{
.if OkAnRKau4
        Объект аналитического учета : ^
.end
.{
.if OkAnRKau5
          Объект аналитического учета : ^
.end
.{
.if OkAnRKau6
            Объект аналитического учета : ^
.end
.{
              Филиал : ^
.{
 Б@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Б
.}
              Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
              ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
.if OkAnRSumKau6
            Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
            ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau5
          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau4
        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
        ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau3
      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau2
   Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
   ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau1
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSubAnUch
                                                                                                                                               &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
 БИтого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.if OkRollSchAnUch
 Б                                                                                                                                               &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Р
 Щ.endform
!==============================================================================
.linkform 'cons_anuch_sh_02' prototype is 'anuch_sh'
.group '1). Аналитика по операциям в валюте отчетов'
.nameinlist '1). Ведомость аналитического учета по операциям в валюте отчетов'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3 c0p6
sCurPS
c1f1
c2f1 c2f2
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c6p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p8v c7p9v c7p10v c7p11v
c6p1       c7_p1v c7_p2v c7_p3v c7_p4v c7_p5v c7_p6v
c10p1      c6_p1v c6_p2v c6_p3v c6_p4v c6_p5v c6_p6v
c9p1       c10_p1v c10_p2v c10_p3v c10_p4v c10_p5v c10_p6v
c8p1       c9_p1v c9_p2v c9_p3v c9_p4v c9_p5v c9_p6v
c5p1       c8_p1v c8_p2v c8_p3v c8_p4v c8_p5v c8_p6v
c4p1       c5_p1v c5_p2v c5_p3v c5_p4v c5_p5v c5_p6v
c3p1       c4_p1v c4_p2v c4_p3v c4_p4v c4_p5v c4_p6v
c2p1       c3_p1v c3_p2v c3_p3v c3_p4v c3_p5v c3_p6v
c1p1 c1p1n c2_p1v c2_p2v c2_p3v c2_p4v c2_p5v c2_p6v
RolledSubDebV RolledSubKredV
c0p1 c0p1n c1_p1v c1_p2v c1_p3v c1_p4v c1_p5v c1_p6v
RolledSchDebV RolledSchKredV
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 С^ Б
^
                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г.
 ГВедомость сформирована в ^ Г
 ГПлан счетов ^ Г
.if OkFilAnS
 БПрименен фильтр... Б
.{
   ^
.{
      ^ ^
.}
.}
.end
.{
.[h
                                                                                                                                                        лист @np@
──────────┬──────┬────────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────────────────────────────────────────────────────
          │      │            Корреспондирующий счет              │                                                    С у м м а
          │      ├────┬─────┬───────────────┬─────────────────────┼─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
  Д а т а │ Номер│Счет│Суб- │               │                     │                Сальдо               │               Обороты               │               Сальдо
          │ доку-│    │счет │ Подразделение │  Наименование КАУ   │               входящее              │                                     │              исходящее
          │ мента│    │     │               │                     ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
          │      │    │     │               │                     │       Дебет      │     Кредит       │       Дебет      │      Кредит      │       Дебет      │      Кредит
──────────┴──────┴────┴─────┴───────────────┴─────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
Объект аналитического учета : ^
.end
.{
.if OkAnRKau2
   Объект аналитического учета : ^
.end
.{
.if OkAnRKau3
      Объект аналитического учета : ^
.end
.{
.if OkAnRKau4
        Объект аналитического учета : ^
.end
.{
.if OkAnRKau5
          Объект аналитического учета : ^
.end
.{
.if OkAnRKau6
            Объект аналитического учета : ^
.end
.{
              Филиал : ^
.{
 Б@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Б
.}
              Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
              ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
.if OkAnRSumKau6
            Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
            ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau5
          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau4
        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
        ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau3
      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau2
   Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
   ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau1
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSubAnUch
                                                                                                                                               &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
 БИтого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.if OkRollSchAnUch
 Б                                                                                                                                               &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Р
 Щ.endform
!==============================================================================
.linkform 'cons_anuch_sh_03' prototype is 'anuch_sh'
.group '1). Аналитика по операциям в валюте отчетов и НДЕ'
.nameinlist '1). Ведомость оборотов по счету в валюте отчетов и НДЕ'
.p 80
.defo portrait
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3
sCurPS
c1f1
c2f1 c2f2
c0p5 c0p7 c0p5 c0p7
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c6p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p10 c7p10v c7p11 c7p11v
c6p1        c7_p3 c7_p3v c7_p4 c7_p4v
c10p1       c6_p3 c6_p3v c6_p4 c6_p4v
c9p1        c10_p3 c10_p3v c10_p4 c10_p4v
c8p1        c9_p3 c9_p3v c9_p4 c9_p4v
c5p1        c8_p3 c8_p3v c8_p4 c8_p4v
c4p1        c5_p3 c5_p3v c5_p4 c5_p4v
c3p1        c4_p3 c4_p3v c4_p4 c4_p4v
c2p1        c3_p3 c3_p3v c3_p4 c3_p4v
c1p1 c1p1n  c2_p3 c2_p3v c2_p4 c2_p4v
c0p1 c0p1n  c1_p3 c1_p3v c1_p4 c1_p4v
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 Щ^ Б
^
                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г.
 ГПлан счетов ^ Г
.if OkFilAnS
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                    лист @np@
──────────┬──────┬────────────────────────────────────────────────────────┬───────────────────────────────────────────────────────────────────────────
          │      │            Корреспондирующий счет                      │                                 С У М М А
          │      ├────┬─────┬───────────────┬─────────────────────────────┼───────────────────────────────────────────────────────────────────────────
  Д а т а │ Номер│Счет│Суб- │               │                             │                                  Обороты
          │ доку-│    │счет │ Подразделение │  Наименование КАУ           │
          │ мента│    │     │               │                             ├─────────────────────────────────────┬─────────────────────────────────────
          │      │    │     │               │                             │                Дебет                │                Кредит
          │      │    │     │               │                             ├──────────────────┬──────────────────┼──────────────────┬──────────────────
          │      │    │     │               │                             │     в @@@@@@     │   в @@@@@@       │     в @@@@@@     │     в @@@@@@
──────────┴──────┴────┴─────┴───────────────┴─────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
Объект аналитического учета : ^
.end
.{
.if OkAnRKau2
   Объект аналитического учета : ^
.end
.{
.if OkAnRKau3
      Объект аналитического учета : ^
.end
.{
.if OkAnRKau4
        Объект аналитического учета : ^
.end
.{
.if OkAnRKau5
          Объект аналитического учета : ^
.end
.{
.if OkAnRKau6
            Объект аналитического учета : ^
.end
.{
              Филиал : ^
.{
 Б@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Б
.}
              Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
              ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
.if OkAnRSumKau6
            Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
            ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau5
          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
          ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau4
        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
        ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau3
      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau2
   Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
   ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau1
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSubAnUch
.end
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
Итого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSchAnUch
.end
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Ш
 Щ.endform
!==============================================================================
.linkform 'cons_anuch_sh_04' prototype is 'anuch_sh'
.group '1). Аналитика по содержанию'
.nameinlist '1). Ведомость аналитического учета по содержанию'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3 c0p4
sCurPS
c1f1
c2f1 c2f2
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c6p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p7pl c7p7op c7p8 c7p9 c7p10 c7p11
c6p1       c7_p1 c7_p2 c7_p3 c7_p4 c7_p5 c7_p6
c10p1      c6_p1 c6_p2 c6_p3 c6_p4 c6_p5 c6_p6
c9p1       c10_p1 c10_p2 c10_p3 c10_p4 c10_p5 c10_p6
c8p1       c9_p1 c9_p2 c9_p3 c9_p4 c9_p5 c9_p6
c5p1       c8_p1 c8_p2 c8_p3 c8_p4 c8_p5 c8_p6
c4p1       c5_p1 c5_p2 c5_p3 c5_p4 c5_p5 c5_p6
c3p1       c4_p1 c4_p2 c4_p3 c4_p4 c4_p5 c4_p6
c2p1       c3_p1 c3_p2 c3_p3 c3_p4 c3_p5 c3_p6
c1p1 c1p1n c2_p1 c2_p2 c2_p3 c2_p4 c2_p5 c2_p6
RolledSubDeb RolledSubKred
c0p1 c0p1n c1_p1 c1_p2 c1_p3 c1_p4 c1_p5 c1_p6
RolledSchDeb RolledSchKred
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 Щ^ Б
^
                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г.
 ГВедомость сформирована в ^ Г
 ГПлан счетов ^ Г
.if OkFilAnS
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                                                                                                      лист @np@
──────────┬──────┬───────────────────────────────────────────────┬────────────────────────────────┬───────────────────────────────────┬───────────────────────────────────────────────────────────────────────────
          │      │            Корреспондирующий счет             │                                │                                   │                                С у м м а
          │      ├────┬─────┬───────────────┬────────────────────┤                                │       С О Д Е Р Ж А Н И Е         ├─────────────────────────────────────┬─────────────────────────────────────
  Д а т а │ Номер│Счет│Суб- │               │                    │    ПЛАТЕЛЬЩИК / ПОЛУЧАТЕЛЬ     │                                   │                Сальдо               │               Обороты
          │ доку-│    │счет │ Подразделение │  Наименование КАУ  │                                │         О П Е Р А Ц И И           │                                     │
          │ мента│    │     │               │                    │                                │                                   ├──────────────────┬──────────────────┼──────────────────┬──────────────────
          │      │    │     │               │                    │                                │                                   │       Дебет      │     Кредит       │       Дебет      │      Кредит
──────────┴──────┴────┴─────┴───────────────┴────────────────────┴────────────────────────────────┴───────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
Объект аналитического учета : ^
.end
.{
.if OkAnRKau2
   Объект аналитического учета : ^
.end
.{
.if OkAnRKau3
      Объект аналитического учета : ^
.end
.{
.if OkAnRKau4
        Объект аналитического учета : ^
.end
.{
.if OkAnRKau5
          Объект аналитического учета : ^
.end
.{
.if OkAnRKau6
            Объект аналитического учета : ^
.end
.{
              Филиал : ^
.{
 Б@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Б
.}
              Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
              ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
.if OkAnRSumKau6
            Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
            ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau5
          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
          ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau4
        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
        ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau3
      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau2
   Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
   ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau1
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSubAnUch
                                                                                                                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
Итого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSchAnUch
                                                                                                                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Ш
 Щ.endform
!==============================================================================
.linkform 'cons_anuch_sh_05' prototype is 'anuch_sh'
.group '1). Аналитика по содержанию в валюте отчетов'
.nameinlist '1). Ведомость аналитического учета по содержанию в валюте отчетов'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3 c0p6
sCurPS
c1f1
c2f1 c2f2
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c6p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p7pl c7p7op c7p8v c7p9v c7p10v c7p11v
c6p1       c7_p1v c7_p2v c7_p3v c7_p4v c7_p5v c7_p6v
c10p1      c6_p1v c6_p2v c6_p3v c6_p4v c6_p5v c6_p6v
c9p1       c10_p1v c10_p2v c10_p3v c10_p4v c10_p5v c10_p6v
c8p1       c9_p1v c9_p2v c9_p3v c9_p4v c9_p5v c9_p6v
c5p1       c8_p1v c8_p2v c8_p3v c8_p4v c8_p5v c8_p6v
c4p1       c5_p1v c5_p2v c5_p3v c5_p4v c5_p5v c5_p6v
c3p1       c4_p1v c4_p2v c4_p3v c4_p4v c4_p5v c4_p6v
c2p1       c3_p1v c3_p2v c3_p3v c3_p4v c3_p5v c3_p6v
c1p1 c1p1n c2_p1v c2_p2v c2_p3v c2_p4v c2_p5v c2_p6v
RolledSubDebV RolledSubKredV
c0p1 c0p1n c1_p1v c1_p2v c1_p3v c1_p4v c1_p5v c1_p6v
RolledSchDebV RolledSchKredV
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 Щ^ Б
^
                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г.
 ГВедомость сформирована в ^
План счетов ^ Г
.if OkFilAnS
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                                                                                                       лист @np@
──────────┬──────┬───────────────────────────────────────────────┬────────────────────────────────┬───────────────────────────────────┬───────────────────────────────────────────────────────────────────────────
          │      │            Корреспондирующий счет             │                                │                                   │                                С у м м а
          │      ├────┬─────┬───────────────┬────────────────────┤                                │       С О Д Е Р Ж А Н И Е         ├─────────────────────────────────────┬─────────────────────────────────────
  Д а т а │ Номер│Счет│Суб- │               │                    │    ПЛАТЕЛЬЩИК / ПОЛУЧАТЕЛЬ     │                                   │                Сальдо               │               Обороты
          │ доку-│    │счет │ Подразделение │  Наименование КАУ  │                                │         О П Е Р А Ц И И           │                                     │
          │ мента│    │     │               │                    │                                │                                   ├──────────────────┬──────────────────┼──────────────────┬──────────────────
          │      │    │     │               │                    │                                │                                   │       Дебет      │     Кредит       │       Дебет      │      Кредит
──────────┴──────┴────┴─────┴───────────────┴────────────────────┴────────────────────────────────┴───────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
Объект аналитического учета : ^
.end
.{
.if OkAnRKau2
   Объект аналитического учета : ^
.end
.{
.if OkAnRKau3
      Объект аналитического учета : ^
.end
.{
.if OkAnRKau4
        Объект аналитического учета : ^
.end
.{
.if OkAnRKau5
          Объект аналитического учета : ^
.end
.{
.if OkAnRKau6
            Объект аналитического учета : ^
.end
.{
              Филиал : ^
.{
 Б@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Б
.}
              Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
              ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
.if OkAnRSumKau6
            Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
            ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau5
          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
          ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau4
        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
        ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau3
      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau2
   Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
   ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau1
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSubAnUch
                                                                                                                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
Итого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                    (сальдо входящее)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (суммарные обороты)                                        &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                  (сальдо исходящее)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSchAnUch
                                                                                                                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Ш
 Щ.endform
!==============================================================================
.linkform 'cons_anuch_sh_06' prototype is 'anuch_sh'
.group '1). Аналитика по содержанию в валюте отчетов и НДЕ'
.nameinlist '1). Ведомость аналитического учета по содержанию в валюте отчетов и НДЕ'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3
sCurPS
c1f1
c2f1 c2f2
c0p5 c0p7 c0p5 c0p7
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c6p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p7pl c7p7op c7p10 c7p10v c7p11 c7p11v
c6p1        c7_p3 c7_p3v c7_p4 c7_p4v
c10p1       c6_p3 c6_p3v c6_p4 c6_p4v
c9p1        c10_p3 c10_p3v c10_p4 c10_p4v
c8p1        c9_p3 c9_p3v c9_p4 c9_p4v
c5p1        c8_p3 c8_p3v c8_p4 c8_p4v
c4p1        c5_p3 c5_p3v c5_p4 c5_p4v
c3p1        c4_p3 c4_p3v c4_p4 c4_p4v
c2p1        c3_p3 c3_p3v c3_p4 c3_p4v
c1p1 c1p1n  c2_p3 c2_p3v c2_p4 c2_p4v
c0p1 c0p1n  c1_p3 c1_p3v c1_p4 c1_p4v
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 Щ^ Б
^
                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г.
 ГПлан счетов ^ Г
.if OkFilAnS
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                                                                                         лист @np@
──────────┬──────┬───────────────────────────────────────────────┬────────────────────────────────┬───────────────────────────────────┬───────────────────────────────────────────────────────────────────────────
          │      │            Корреспондирующий счет             │                                │                                   │                                 С У М М А
          │      ├────┬─────┬───────────────┬────────────────────┤                                │                                   ├───────────────────────────────────────────────────────────────────────────
  Д а т а │ Номер│Счет│Суб- │               │                    │                                │       С О Д Е Р Ж А Н И Е         │                                  Обороты
          │ доку-│    │счет │ Подразделение │  Наименование КАУ  │    ПЛАТЕЛЬЩИК / ПОЛУЧАТЕЛЬ     │                                   │
          │ мента│    │     │               │                    │                                │          О П Е Р А Ц И И          ├─────────────────────────────────────┬─────────────────────────────────────
          │      │    │     │               │                    │                                │                                   │                Дебет                │                Кредит
          │      │    │     │               │                    │                                │                                   ├──────────────────┬──────────────────┼──────────────────┬──────────────────
          │      │    │     │               │                    │                                │                                   │     в @@@@@@     │   в @@@@@@       │     в @@@@@@     │     в @@@@@@
──────────┴──────┴────┴─────┴───────────────┴────────────────────┴────────────────────────────────┴───────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
Объект аналитического учета : ^
.end
.{
.if OkAnRKau2
   Объект аналитического учета : ^
.end
.{
.if OkAnRKau3
      Объект аналитического учета : ^
.end
.{
.if OkAnRKau4
        Объект аналитического учета : ^
.end
.{
.if OkAnRKau5
          Объект аналитического учета : ^
.end
.{
.if OkAnRKau6
            Объект аналитического учета : ^
.end
.{
              Филиал : ^
.{
 Б@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Б
.}
              Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
              ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
.if OkAnRSumKau6
            Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
            ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau5
          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
          ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau4
        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
        ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau3
      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau2
   Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
   ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau1
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSubAnUch
.end
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
Итого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSchAnUch
.end
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Ш
 Щ.endform
!==============================================================================
.linkform 'cons_anuch_sh_07' prototype is 'anuch_sh'
.group '1). Аналитика по оборотам'
.nameinlist '1). Ведомость аналитического учета по оборотам'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3 c0p4
sCurPS
c1f1
c2f1 c2f2
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c6p1       c7_p1 c7_p2 c7_p3 c7_p4 c7_p5 c7_p6
c10p1      c6_p1 c6_p2 c6_p3 c6_p4 c6_p5 c6_p6
c9p1       c10_p1 c10_p2 c10_p3 c10_p4 c10_p5 c10_p6
c8p1       c9_p1 c9_p2 c9_p3 c9_p4 c9_p5 c9_p6
c5p1       c8_p1 c8_p2 c8_p3 c8_p4 c8_p5 c8_p6
c4p1       c5_p1 c5_p2 c5_p3 c5_p4 c5_p5 c5_p6
c3p1       c4_p1 c4_p2 c4_p3 c4_p4 c4_p5 c4_p6
c2p1       c3_p1 c3_p2 c3_p3 c3_p4 c3_p5 c3_p6
c1p1 c1p1n c2_p1 c2_p2 c2_p3 c2_p4 c2_p5 c2_p6
RolledSubDeb RolledSubKred
c0p1 c0p1n c1_p1 c1_p2 c1_p3 c1_p4 c1_p5 c1_p6
RolledSchDeb RolledSchKred
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 С^ Б
^
                            Ведомость аналитического учета по счету
                       ^ - ^
                                        с ^ г. по ^ г.
 ГВедомость сформирована в ^ Г
 ГПлан счетов ^ Г
.if OkFilAnS
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                                            лист @np@
──────────────────────────────────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
                                                                  │           Сальдо  входящее          │               Обороты               │            Сальдо исходящее
                         Филиал корпорации                        ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
                                                                  │       Дебет      │     Кредит       │       Дебет      │      Кредит      │       Дебет      │      Кредит
──────────────────────────────────────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
Объект аналитического учета : ^
.end
.{
.if OkAnRKau2
   Объект аналитического учета : ^
.end
.{
.if OkAnRKau3
      Объект аналитического учета : ^
.end
.{
.if OkAnRKau4
        Объект аналитического учета : ^
.end
.{
.if OkAnRKau5
          Объект аналитического учета : ^
.end
.{
.if OkAnRKau6
            Объект аналитического учета : ^
.end
.{
.{
.}
 Б         @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.}
.if OkAnRSumKau6
            Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
            ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau5
          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau4
        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
        ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau3
      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau2
   Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
   ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau1
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSubAnUch
                                                                                                                                               &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
 БИтого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.if OkRollSchAnUch
 Б                                                                                                                                               &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Р
 Щ.endform
!==============================================================================
.linkform 'cons_anuch_sh_08' prototype is 'anuch_sh'
.group '1). Аналитика по оборотам в валюте отчетов'
.nameinlist '1).Ведомость аналитического учета по оборотам'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3 c0p6
sCurPS
c1f1
c2f1 c2f2
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c6p1       c7_p1v c7_p2v c7_p3v c7_p4v c7_p5v c7_p6v
c10p1      c6_p1v c6_p2v c6_p3v c6_p4v c6_p5v c6_p6v
c9p1       c10_p1v c10_p2v c10_p3v c10_p4v c10_p5v c10_p6v
c8p1       c9_p1v c9_p2v c9_p3v c9_p4v c9_p5v c9_p6v
c5p1       c8_p1v c8_p2v c8_p3v c8_p4v c8_p5v c8_p6v
c4p1       c5_p1v c5_p2v c5_p3v c5_p4v c5_p5v c5_p6v
c3p1       c4_p1v c4_p2v c4_p3v c4_p4v c4_p5v c4_p6v
c2p1       c3_p1v c3_p2v c3_p3v c3_p4v c3_p5v c3_p6v
c1p1 c1p1n c2_p1v c2_p2v c2_p3v c2_p4v c2_p5v c2_p6v
RolledSubDebV RolledSubKredV
c0p1 c0p1n c1_p1v c1_p2v c1_p3v c1_p4v c1_p5v c1_p6v
RolledSchDebV RolledSchKredV
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 С^ Б
^
                            Ведомость аналитического учета по счету
                       ^ - ^
                                        с ^ г. по ^ г.
 ГВедомость сформирована в ^ Г
 ГПлан счетов ^ Г
.if OkFilAnS
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                                                лист @np@
──────────────────────────────────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
                                                                  │           Сальдо  входящее          │               Обороты               │            Сальдо исходящее
                       Филиал корпорации                          ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
                                                                  │       Дебет      │     Кредит       │       Дебет      │      Кредит      │       Дебет      │      Кредит
──────────────────────────────────────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
Объект аналитического учета : ^
.end
.{
.if OkAnRKau2
   Объект аналитического учета : ^
.end
.{
.if OkAnRKau3
      Объект аналитического учета : ^
.end
.{
.if OkAnRKau4
        Объект аналитического учета : ^
.end
.{
.if OkAnRKau5
          Объект аналитического учета : ^
.end
.{
.if OkAnRKau6
            Объект аналитического учета : ^
.end
.{
.{
.}
 Б         @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.}
.if OkAnRSumKau6
            Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
            ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau5
          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau4
        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
        ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau3
      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau2
   Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
   ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau1
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSubAnUch
                                                                                                                                               &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
 БИтого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.if OkRollSchAnUch
 Б                                                                                                                                               &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Р
 Щ.endform
!==============================================================================
.linkform 'cons_anuch_sh_09' prototype is 'anuch_sh'
.group '1). Аналитика по оборотам в валюте отчетов'
.nameinlist '2).Расчетные и фактические остатки в валюте'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n c0p2 c0p3 c0p6
sCurPS
c1f1
c2f1 c2f2
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c6p1       c7_p5v c7_p6v c7_pfod c7_pfok  c7_pdvd  c7_pdvk
c10p1      c6_p5v c6_p6v c6_pfod c6_pfok  c6_pdvd  c6_pdvk
c9p1       c10_p5v c10_p6v c10_pfod c10_pfok  c10_pdvd  c10_pdvk
c8p1       c9_p5v c9_p6v c9_pfod c9_pfok  c9_pdvd  c9_pdvk
c5p1       c8_p5v c8_p6v c8_pfod c8_pfok  c8_pdvd  c8_pdvk
c4p1       c5_p5v c5_p6v c5_pfod c5_pfok  c5_pdvd  c5_pdvk
c3p1       c4_p5v c4_p6v c4_pfod c4_pfok  c4_pdvd  c4_pdvk
c2p1       c3_p5v c3_p6v c3_pfod c3_pfok  c3_pdvd  c3_pdvk
c1p1 c1p1n c2_p5v c2_p6v c2_pfod c2_pfok  c2_pdvd  c2_pdvk
RolledSubDebV RolledSubKredV
c0p1 c0p1n c1_p5v c1_p6v c1_pfod c1_pfok  c1_pdvd  c1_pdvk
RolledSchDebV RolledSchKredV
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 С^ Б
^
                  Расчетные и фактические остатки в валюте отчетов по счету
                ^ - ^
                                     с ^ г. по ^ г.
 ГВедомость сформирована в ^ Г
 ГПлан счетов ^ Г
.if OkFilAnS
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                                              лист @np@
──────────────────────────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                                  │                                      С А Л Ь Д О    И С Х О Д Я Щ Е Е
                                                                  ├─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
                           Филиал корпорации                      │               расчетное             │             фактическое             │    дельта из-за колебания курса
                                                                  ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
                                                                  │       Дебет      │     Кредит       │       Дебет      │      Кредит      │       Дебет      │      Кредит
──────────────────────────────────────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
Объект аналитического учета : ^
.end
.{
.if OkAnRKau2
   Объект аналитического учета : ^
.end
.{
.if OkAnRKau3
      Объект аналитического учета : ^
.end
.{
.if OkAnRKau4
        Объект аналитического учета : ^
.end
.{
.if OkAnRKau5
          Объект аналитического учета : ^
.end
.{
.if OkAnRKau6
            Объект аналитического учета : ^
.end
.{
.{
.}
 Б          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.}
.if OkAnRSumKau6
            Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
            ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau5
          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau4
        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
        ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau3
      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau2
   Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
   ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau1
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSubAnUch
                                                                   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
Итого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if OkRollSchAnUch
                                                                   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Р
 Щ.endform
!==============================================================================
.linkform 'cons_anuch_sh_10' prototype is 'anuch_sh'
.group '1). Аналитика по оборотам в валюте отчетов и НДЕ'
.nameinlist '1). Оборотно-сальдовая ведомость по счету в валюте отчетов и НДЕ'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3
sCurPS
c1f1
c2f1 c2f2
c0p5 c0p7 c0p5 c0p7 c0p5 c0p7 c0p5 c0p7
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c6p1       c7_p1 c7_p1v c7_p2 c7_p2v c7_p3 c7_p3v c7_p4 c7_p4v c7_p5 c7_p5v c7_p6 c7_p6v
c10p1      c6_p1 c6_p1v c6_p2 c6_p2v c6_p3 c6_p3v c6_p4 c6_p4v c6_p5 c6_p5v c6_p6 c6_p6v
c9p1       c10_p1 c10_p1v c10_p2 c10_p2v c10_p3 c10_p3v c10_p4 c10_p4v c10_p5 c10_p5v c10_p6 c10_p6v
c8p1       c9_p1 c9_p1v c9_p2 c9_p2v c9_p3 c9_p3v c9_p4 c9_p4v c9_p5 c9_p5v c9_p6 c9_p6v
c5p1       c8_p1 c8_p1v c8_p2 c8_p2v c8_p3 c8_p3v c8_p4 c8_p4v c8_p5 c8_p5v c8_p6 c8_p6v
c4p1       c5_p1 c5_p1v c5_p2 c5_p2v c5_p3 c5_p3v c5_p4 c5_p4v c5_p5 c5_p5v c5_p6 c5_p6v
c3p1       c4_p1 c4_p1v c4_p2 c4_p2v c4_p3 c4_p3v c4_p4 c4_p4v c4_p5 c4_p5v c4_p6 c4_p6v
c2p1       c3_p1 c3_p1v c3_p2 c3_p2v c3_p3 c3_p3v c3_p4 c3_p4v c3_p5 c3_p5v c3_p6 c3_p6v
c1p1 c1p1n c2_p1 c2_p1v c2_p2 c2_p2v c2_p3 c2_p3v c2_p4 c2_p4v c2_p5 c2_p5v c2_p6 c2_p6v
RolledSubDeb RolledSubDebV RolledSubKred RolledSubKredV
c0p1 c0p1n c1_p1 c1_p1v c1_p2 c1_p2v c1_p3 c1_p3v c1_p4 c1_p4v c1_p5 c1_p5v c1_p6 c1_p6v
RolledSchDeb RolledSchDebV RolledSchKred RolledSchKredV
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 С^ Б
^
                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г.
 ГПлан счетов ^ Г
.if OkFilAnS
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                                                                       лист @np@
──────────────────────────────────────────┬────────────────────────────────────────────────────────────────────┬────────────────────────────────────────────────────────────────────
                                          │                              Сальдо                                │                              Обороты
                                          ├─────────────────────────────────┬──────────────────────────────────┼─────────────────────────────────┬──────────────────────────────────
          Филиал корпорации               │              дебет              │              кредит              │              дебет              │               кредит
                                          ├────────────────┬────────────────┼─────────────────┬────────────────┼────────────────┬────────────────┼─────────────────┬────────────────
                                          │     в @@@@@@   │   в @@@@@@     │     в @@@@@@    │     в @@@@@@   │    в @@@@@@    │    в @@@@@@    │     в @@@@@@    │    в @@@@@@
──────────────────────────────────────────┴────────────────┴────────────────┴─────────────────┴────────────────┴────────────────┴────────────────┴─────────────────┴────────────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
Объект аналитического учета : ^
.end
.{
.if OkAnRKau2
   Объект аналитического учета : ^
.end
.{
.if OkAnRKau3
      Объект аналитического учета : ^
.end
.{
.if OkAnRKau4
        Объект аналитического учета : ^
.end
.{
.if OkAnRKau5
          Объект аналитического учета : ^
.end
.{
.if OkAnRKau6
            Объект аналитического учета : ^
.end
.{
.{
.}
         @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                       (суммарные обороты)                                                                      &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                       (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
.}
.if OkAnRSumKau6
            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                       (суммарные обороты)                                                                      &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                       (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
            ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau5
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                       (суммарные обороты)                                                                      &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                       (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau4
        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                       (суммарные обороты)                                                                      &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                       (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
        ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau3
      @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                       (суммарные обороты)                                                                      &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                       (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
      ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau2
   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                       (суммарные обороты)                                                                      &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                       (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
   ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau1
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                       (суммарные обороты)                                                                      &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                       (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumPodr
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                       (суммарные обороты)                                                                      &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                       (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                       (суммарные обороты)                                                                      &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                       (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
.if OkRollSubAnUch
                                           &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                       (суммарные обороты)                                                                      &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                       (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
.if OkRollSchAnUch
                                           &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Р
 Щ.endform
!==============================================================================

.LinkForm 'cons_anuch_sh_11' prototype is 'anuch_sh'
.group 'Аналитика по содержанию в валюте отчетов и НДЕ'
.nameinlist 'Ведомость аналитического учета по содержанию в валюте документа, отчетов и НДЕ'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3
sCurPS
c1f1
c2f1 c2f2
! c0p5 c0p7 c0p5 c0p7 названия валют
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c7p1 c7p2 c7p4 c7p5 c7p7pl c7p7op
c7p10ov
c7p10ov_name c7p10v
if (c7p10v > 0, c7p11v_date, '') c7p10
c7p11ov
c7p11ov_name c7p11v
if (c7p11v > 0, c7p11v_date, '') c7p11
c10p1       c6_p3v c6_p3  c6_p4v c6_p4
c9p1        c10_p3v c10_p3  c10_p4v c10_p4
c8p1        c9_p3v c9_p3  c9_p4v c9_p4
c5p1        c8_p3v c8_p3  c8_p4v c8_p4
c4p1        c5_p3v c5_p3  c5_p4v c5_p4
c3p1        c4_p3v c4_p3  c4_p4v c4_p4
c2p1        c3_p3v c3_p3  c3_p4v c3_p4
c1p1 c1p1n  c2_p3v c2_p3  c2_p4v c2_p4
c0p1 c0p1n  c1_p3v c1_p3  c1_p4v c1_p4
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 Щ^ Б
^
                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г.
 ГПлан счетов ^ Г
.if OkFilAnS
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                                                                                                                   лист @np@
──────────┬───────┬──────────┬──────────────────┬─────────────────────────┬─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
   Дата   │ Номер │Корреспон-│    Плательщик/   │        Содержание       │                                                                       ОБОРОТЫ
          │ доку- │ дирующий │    получатель    │         операции        │
          │ мента ├────┬─────┤                  │                         ├──────────────────────────────────────────────────────────────────────────┬──────────────────────────────────────────────────────────────────────────
          │       │Счет│Суб- │                  │                         │                                    Дебет                                 │                                   Кредит
          │       │    │счет │                  │                         ├─────────────────────────┬─────────────────────────────┬──────────────────┼─────────────────────────┬─────────────────────────────┬──────────────────
          │       │    │     │                  │                         │    В валюте документа   │       В валюте отчетов      │       В НДЕ      │    В валюте документа   │       В валюте отчетов      │       В НДЕ
          │       │    │     │                  │                         ├──────────────────┬──────┼──────────────────┬──────────┤                  ├──────────────────┬──────┼──────────────────┬──────────┤
          │       │    │     │                  │                         │       сумма      │Валюта│       сумма      │Дата курса│                  │       сумма      │Валюта│       сумма      │Дата курса│
──────────┴───────┴────┴─────┴──────────────────┴─────────────────────────┴──────────────────┴──────┴──────────────────┴──────────┴──────────────────┴──────────────────┴──────┴──────────────────┴──────────┴──────────────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
Объект аналитического учета : ^
.end
.{
.if OkAnRKau2
   Объект аналитического учета : ^
.end
.{
.if OkAnRKau3                                                                                                                                                                                                                                                                                                                                                                                    
      Объект аналитического учета : ^
.end
.{
.if OkAnRKau4
        Объект аналитического учета : ^
.end
.{
.if OkAnRKau5
          Объект аналитического учета : ^
.end
.{
.if OkAnRKau6
            Объект аналитического учета : ^
.end
.{
.{
 Б@@@@@@@@@@ @@@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& @@@@@@ &#'&&&&&&&&&&&&&&& @@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& @@@@@@ &#'&&&&&&&&&&&&&&& @@@@@@@@@@ &#'&&&&&&&&&&&&&&& Б
.}
.}
.if OkAnRSumKau6
            Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                   &'&&&&&&&&&&&&&&&&            &'&&&&&&&&&&&&&&&&                           &'&&&&&&&&&&&&&&&&            &'&&&&&&&&&&&&&&&&
            ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau5
          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                   &'&&&&&&&&&&&&&&&&            &'&&&&&&&&&&&&&&&&                           &'&&&&&&&&&&&&&&&&            &'&&&&&&&&&&&&&&&&
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau4
        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                   &'&&&&&&&&&&&&&&&&            &'&&&&&&&&&&&&&&&&                           &'&&&&&&&&&&&&&&&&            &'&&&&&&&&&&&&&&&&
        ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau3
      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                   &'&&&&&&&&&&&&&&&&            &'&&&&&&&&&&&&&&&&                           &'&&&&&&&&&&&&&&&&            &'&&&&&&&&&&&&&&&&
      ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau2
   Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                   &'&&&&&&&&&&&&&&&&            &'&&&&&&&&&&&&&&&&                           &'&&&&&&&&&&&&&&&&            &'&&&&&&&&&&&&&&&&
   ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau1
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                   &'&&&&&&&&&&&&&&&&            &'&&&&&&&&&&&&&&&&                           &'&&&&&&&&&&&&&&&&            &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                   &'&&&&&&&&&&&&&&&&            &'&&&&&&&&&&&&&&&&                           &'&&&&&&&&&&&&&&&&            &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                   &'&&&&&&&&&&&&&&&&            &'&&&&&&&&&&&&&&&&                           &'&&&&&&&&&&&&&&&&            &'&&&&&&&&&&&&&&&&
.if OkRollSubAnUch
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
Итого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                   &'&&&&&&&&&&&&&&&&            &'&&&&&&&&&&&&&&&&                           &'&&&&&&&&&&&&&&&&            &'&&&&&&&&&&&&&&&&
.if OkRollSubAnUch
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Ш Б
.endform


!==============================================================================
.linkform 'anuch_sh_kol01' prototype is 'anuch_sh'
.group 'Аналитика по операциям количество и НДЕ'
.nameinlist 'Ведомость оборотов по счету в НДЕ и натуральных показателях'
.p 80
.defo portrait
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3
sCurPS
c1f1
c2f1 c2f2
c0p5 c0p5
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p10 c7p10kol c7p11 c7p11kol c7p11edizm
c10p1       c6_p3  c6_p3kol  c6_p4  c6_p4kol  c6_edizm
c9p1        c10_p3 c10_p3kol c10_p4 c10_p4kol c10_edizm
c8p1        c9_p3  c9_p3kol  c9_p4  c9_p4kol  c9_edizm
c5p1        c8_p3  c8_p3kol  c8_p4  c8_p4kol  c8_edizm
c4p1        c5_p3  c5_p3kol  c5_p4  c5_p4kol  c5_edizm
c3p1        c4_p3  c4_p3kol  c4_p4  c4_p4kol  c4_edizm
c2p1        c3_p3  c3_p3kol  c3_p4  c3_p4kol  c3_edizm
c1p1 c1p1n  c2_p3  c2_p3kol  c2_p4  c2_p4kol  c2_edizm
c0p1 c0p1n  c1_p3  c1_p3kol  c1_p4  c1_p4kol  c1_edizm
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Й
 Щ^ Б
^
                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г.
 ГПлан счетов ^ Г
.if OkFilAnS
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                                           лист @np@
──────────┬──────┬────────────────────────────────────────────────────────┬───────────────────────────────────────────────────────────────────────────┬──────────
          │      │            Корреспондирующий счет                      │                                 С У М М А                                 │
          │      ├────┬─────┬───────────────┬─────────────────────────────┼───────────────────────────────────────────────────────────────────────────┤
  Д а т а │ Номер│Счет│Суб- │               │                             │                                  Обороты                                  │
          │ доку-│    │счет │ Подразделение │     Наименование КАУ        │                                                                           │Единица
          │ мента│    │     │               │                             ├─────────────────────────────────────┬─────────────────────────────────────┤измерения
          │      │    │     │               │                             │                Дебет                │                Кредит               │
          │      │    │     │               │                             ├──────────────────┬──────────────────┼──────────────────┬──────────────────┤
          │      │    │     │               │                             │     в @@@@@@     │    количество    │     в @@@@@@     │    количество    │
──────────┴──────┴────┴─────┴───────────────┴─────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────
.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
Объект аналитического учета : ^
.end
.{
.if OkAnRKau2
   Объект аналитического учета : ^
.end
.{
.if OkAnRKau3
      Объект аналитического учета : ^
.end
.{
.if OkAnRKau4
        Объект аналитического учета : ^
.end
.{
.if OkAnRKau5
          Объект аналитического учета : ^
.end
.{
.if OkAnRKau6
            Объект аналитического учета : ^
.end
.{
.{
 Б@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& └ @@@@@@@@@@
.}
.}
.if OkAnRSumKau6
            Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@
            ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── И─────────── 
.end
.}
.if OkAnRSumKau5
          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── И─────────── 
.end
.}
.if OkAnRSumKau4
        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@
        ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── И─────────── 
.end
.}
.if OkAnRSumKau3
      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@
      ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── И─────────── 
.end
.}
.if OkAnRSumKau2
   Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@
   ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── И─────────── 
.end
.}
.if OkAnRSumKau1
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── И─────────── 
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── И─────────── 
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@
.if OkRollSubAnUch
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── И─────────── 
.end
.}
Итого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@
.if OkRollSchAnUch
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── И─────────── 
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Ш
 Й.endform

!==============================================================================
.linkform 'anuch_sh_kol02' prototype is 'anuch_sh'
.group 'Аналитика по содержанию количество и НДЕ'
.nameinlist 'Ведомость аналитического учета по содержанию в НДЕ и натуральных показателях'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3
sCurPS
c1f1
c2f1 c2f2
c0p5 c0p5
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p7pl c7p7op c7p10 c7p10kol c7p11 c7p11kol c7p11edIzm
c10p1       c6_p3 c6_p3kol c6_p4 c6_p4kol c6_edizm
c9p1        c10_p3 c10_p3kol c10_p4 c10_p4kol c10_edizm
c8p1        c9_p3 c9_p3kol c9_p4 c9_p4kol c9_edizm
c5p1        c8_p3 c8_p3kol c8_p4 c8_p4kol c8_edizm
c4p1        c5_p3 c5_p3kol c5_p4 c5_p4kol c5_edizm
c3p1        c4_p3 c4_p3kol c4_p4 c4_p4kol c4_edizm
c2p1        c3_p3 c3_p3kol c3_p4 c3_p4kol c3_edizm
c1p1 c1p1n  c2_p3 c2_p3kol c2_p4 c2_p4kol c2_edizm
c0p1 c0p1n  c1_p3 c1_p3kol c1_p4 c1_p4kol c1_edizm
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 Б^
^
                             БВедомость аналитического учета по счету Б
                        Б^ - ^ Б
                                       Бс ^ г. по ^ г. Б
 ВПлан счетов ^ В
.if OkFilAnS
 ВПрименен фильтр... В
.{
 В   ^ В
.{
 В      ^ ^ В
.}
.}
.end
.{
.[h
 Б                                                                                                                                                                                         лист @np@
──────────┬──────┬───────────────────────────────────────────────┬────────────────────────────────┬───────────────────────────────────┬───────────────────────────────────────────────────────────────────────────┬──────────
          │      │            Корреспондирующий счет             │                                │                                   │                                 С У М М А                                 │
          │      ├────┬─────┬───────────────┬────────────────────┤                                │                                   ├───────────────────────────────────────────────────────────────────────────┤
  Д а т а │ Номер│Счет│Суб- │               │                    │                                │       С О Д Е Р Ж А Н И Е         │                                  Обороты                                  │
          │ доку-│    │счет │ Подразделение │  Наименование КАУ  │    ПЛАТЕЛЬЩИК / ПОЛУЧАТЕЛЬ     │                                   │                                                                           │Единица
          │ мента│    │     │               │                    │                                │          О П Е Р А Ц И И          ├─────────────────────────────────────┬─────────────────────────────────────┤измерения
          │      │    │     │               │                    │                                │                                   │                Дебет                │                Кредит               │
          │      │    │     │               │                    │                                │                                   ├──────────────────┬──────────────────┼──────────────────┬──────────────────┤
          │      │    │     │               │                    │                                │                                   │     в @@@@@@     │    количество    │     в @@@@@@     │    количество    │
──────────┴──────┴────┴─────┴───────────────┴────────────────────┴────────────────────────────────┴───────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴────────── Б
 Б.]h
.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
Объект аналитического учета : ^
.end
.{
.if OkAnRKau2
   Объект аналитического учета : ^
.end
.{
.if OkAnRKau3
      Объект аналитического учета : ^
.end
.{
.if OkAnRKau4
        Объект аналитического учета : ^
.end
.{
.if OkAnRKau5
          Объект аналитического учета : ^
.end
.{
.if OkAnRKau6
            Объект аналитического учета : ^
.end Щ
 Ш.{
.{
@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& @@@@@@@@@
.}
.}
 Б.if OkAnRSumKau6
            Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@
            ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau5
          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@
          ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau4
        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@
        ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau3
      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@
      ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau2
   Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@
   ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau1
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@
.if OkRollSubAnUch
.end
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
Итого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@
.if OkRollSchAnUch
.end
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Щ.endform

!==============================================================================
.linkform 'anuch_sh_kol03' prototype is 'anuch_sh'
.group 'Аналитика по оборотам количество и НДЕ'
.nameinlist 'Оборотно-сальдовая ведомость по счету в НДЕ и натуральных показателях'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3
sCurPS
c1f1
c2f1 c2f2
c0p5 c0p5 c0p5 c0p5
c1p1 c1p1n
c2p1
c10p1      c6_p1 c6_p1kol c6_p2 c6_p2kol c6_p3 c6_p3kol c6_p4 c6_p4kol c6_edizm c6_p5 c6_p5kol c6_p6 c6_p6kol
c9p1       c10_p1 c10_p1kol c10_p2 c10_p2kol c10_p3 c10_p3kol c10_p4 c10_p4kol c10_edizm c10_p5 c10_p5kol c10_p6 c10_p6kol
c8p1       c9_p1 c9_p1kol c9_p2 c9_p2kol c9_p3 c9_p3kol c9_p4 c9_p4kol c9_edizm c9_p5 c9_p5kol c9_p6 c9_p6kol
c5p1       c8_p1 c8_p1kol c8_p2 c8_p2kol c8_p3 c8_p3kol c8_p4 c8_p4kol c8_edizm c8_p5 c8_p5kol c8_p6 c8_p6kol
c4p1       c5_p1 c5_p1kol c5_p2 c5_p2kol c5_p3 c5_p3kol c5_p4 c5_p4kol c5_edizm c5_p5 c5_p5kol c5_p6 c5_p6kol
c3p1       c4_p1 c4_p1kol c4_p2 c4_p2kol c4_p3 c4_p3kol c4_p4 c4_p4kol c4_edizm c4_p5 c4_p5kol c4_p6 c4_p6kol
c2p1       c3_p1 c3_p1kol c3_p2 c3_p2kol c3_p3 c3_p3kol c3_p4 c3_p4kol c3_edizm c3_p5 c3_p5kol c3_p6 c3_p6kol
c1p1 c1p1n c2_p1 c2_p1kol c2_p2 c2_p2kol c2_p3 c2_p3kol c2_p4 c2_p4kol c2_edizm c2_p5 c2_p5kol c2_p6 c2_p6kol
RolledSubDeb RollSubDebKol RolledSubKred RollSubKredKol 
c0p1 c0p1n c1_p1 c1_p1kol c1_p2 c1_p2kol c1_p3 c1_p3kol c1_p4 c1_p4kol c1_edizm c1_p5 c1_p5kol c1_p6 c1_p6kol
RolledSchDeb RollSchDebKol RolledSchKred RollSchKredKol 
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 Б^
^
                             БВедомость аналитического учета по счету Б
                        Б^ - ^ Б
                                       Бс ^ г. по ^ г. Б
 ВПлан счетов ^ В
.if OkFilAnS
 ВПрименен фильтр... В
.{
 В   ^ В
.{
 В      ^ ^ В
.}
.}
.end
.{
.[h
 Б                                                                                                                                                                     лист @np@
──────────────────────────────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────────┬──────────
                                                                      │                              сальдо                                 │                               Обороты                               │
                                                                      ├─────────────────────────────────┬───────────────────────────────────┼──────────────────────────────────┬──────────────────────────────────┤
                      Объект аналитического учета                     │              дебет              │              кредит               │               дебет              │               кредит             │Единица
                                                                      ├────────────────┬────────────────┼─────────────────┬─────────────────┼─────────────────┬────────────────┼─────────────────┬────────────────┤измерения
                                                                      │    в @@@@@@    │   количество   │     в @@@@@@    │    количество   │    в @@@@@@     │   количество   │     в @@@@@@    │   количество   │
──────────────────────────────────────────────────────────────────────┴────────────────┴────────────────┴─────────────────┴─────────────────┴─────────────────┴────────────────┴─────────────────┴────────────────┴────────── Б
.]h
 Б.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
.end
.{
.if OkAnRKau2
.end
.{
.if OkAnRKau3
.end
.{
.if OkAnRKau4
.end
.{
.if OkAnRKau5
.end
.{
.if OkAnRKau6
.end
.{
.{
.}
.}
.if OkAnRSumKau6
            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&  @@@@@@@@@
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau5
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&  @@@@@@@@@
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau4
        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&  @@@@@@@@@
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau3
      @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&  @@@@@@@@@
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau2
   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&  @@@@@@@@@
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau1
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&  @@@@@@@@@
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumPodr
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&  @@@@@@@@@
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&  @@@@@@@@@
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.if OkRollSubAnUch
                                                                       &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&  @@@@@@@@@
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.if OkRollSchAnUch
                                                                       &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Щ.endform


!==============================================================================
.linkform 'anuch_sh_kol04' prototype is 'anuch_sh'
.group 'Аналитика по операциям количество и валюта'
.nameinlist 'Ведомость оборотов по счету в валюте отчетов и натуральных показателях'
.p 80
.defo portrait
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3
sCurPS
c1f1
c2f1 c2f2
c0p7 c0p7
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p10v c7p10kol c7p11v c7p11kol c7p11edizm
c10p1       c6_p3v  c6_p3kol  c6_p4v  c6_p4kol c6_edizm
c9p1        c10_p3v c10_p3kol c10_p4v c10_p4kol c10_edizm
c8p1        c9_p3v  c9_p3kol  c9_p4v  c9_p4kol c9_edizm
c5p1        c8_p3v  c8_p3kol  c8_p4v  c8_p4kol c8_edizm
c4p1        c5_p3v  c5_p3kol  c5_p4v  c5_p4kol c5_edizm
c3p1        c4_p3v  c4_p3kol  c4_p4v  c4_p4kol c4_edizm
c2p1        c3_p3v  c3_p3kol  c3_p4v  c3_p4kol c3_edizm
c1p1 c1p1n  c2_p3v  c2_p3kol  c2_p4v  c2_p4kol c2_edizm
c0p1 c0p1n  c1_p3v  c1_p3kol  c1_p4v  c1_p4kol c1_edizm
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Й
 С^
^
                             БВедомость аналитического учета по счету Б
                        Б^ - ^ Б
                                       Бс ^ г. по ^ г. Б
 ВПлан счетов ^ В
.if OkFilAnS
 ВПрименен фильтр... В
.{
 В   ^ В
.{
 В      ^ ^ В
.}
.}
.end
.{
.[h
 Б                                                                                                                                           лист @np@
──────────┬──────┬────────────────────────────────────────────────────────┬───────────────────────────────────────────────────────────────────────────┬───────────
          │      │            Корреспондирующий счет                      │                                 С У М М А                                 │
          │      ├────┬─────┬───────────────┬─────────────────────────────┼───────────────────────────────────────────────────────────────────────────┤
  Д а т а │ Номер│Счет│Суб- │               │                             │                                  Обороты                                  │
          │ доку-│    │счет │ Подразделение │     Наименование КАУ        │                                                                           │Единица
          │ мента│    │     │               │                             ├─────────────────────────────────────┬─────────────────────────────────────┤измерения
          │      │    │     │               │                             │                Дебет                │                Кредит               │
          │      │    │     │               │                             ├──────────────────┬──────────────────┼──────────────────┬──────────────────┤
          │      │    │     │               │                             │     в @@@@@@     │    количество    │     в @@@@@@     │    количество    │
──────────┴──────┴────┴─────┴───────────────┴─────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴─────────── Б
.]h
 Б.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
Объект аналитического учета : ^
.end
.{
.if OkAnRKau2
   Объект аналитического учета : ^
.end
.{
.if OkAnRKau3
      Объект аналитического учета : ^
.end
.{
.if OkAnRKau4
        Объект аналитического учета : ^
.end
.{
.if OkAnRKau5
          Объект аналитического учета : ^
.end
.{
.if OkAnRKau6
            Объект аналитического учета : ^
.end Б
.{
.{
@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& @@@@@@@@@@@
.}
.}
 Б.if OkAnRSumKau6
            Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@@
            ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau5
          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@@
          ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau4
        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@@
        ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau3
      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@@
      ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau2
   Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@@
   ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau1
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@@
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@@
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@@
.if OkRollSubAnUch
.end
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
Итого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@@
.if OkRollSchAnUch
.end
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Р
 Й.endform

!==============================================================================
.linkform 'anuch_sh_kol05' prototype is 'anuch_sh'
.group 'Аналитика по содержанию количество и валюта'
.nameinlist 'Ведомость аналитического учета по содержанию в валюте отчетов и натуральных показателях'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3
sCurPS
c1f1
c2f1 c2f2
c0p7 c0p7
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p7pl c7p7op c7p10v c7p10kol c7p11v c7p11kol c7p11edizm
c10p1       c6_p3v  c6_p3kol  c6_p4v  c6_p4kol c6_edizm
c9p1        c10_p3v c10_p3kol c10_p4v c10_p4kol c10_edizm
c8p1        c9_p3v  c9_p3kol  c9_p4v  c9_p4kol c9_edizm
c5p1        c8_p3v  c8_p3kol  c8_p4v  c8_p4kol c8_edizm
c4p1        c5_p3v  c5_p3kol  c5_p4v  c5_p4kol c5_edizm
c3p1        c4_p3v  c4_p3kol  c4_p4v  c4_p4kol c4_edizm
c2p1        c3_p3v  c3_p3kol  c3_p4v  c3_p4kol c3_edizm
c1p1 c1p1n  c2_p3v  c2_p3kol  c2_p4v  c2_p4kol c2_edizm
c0p1 c0p1n  c1_p3v  c1_p3kol  c1_p4v  c1_p4kol c1_edizm
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 Б^
^
                             БВедомость аналитического учета по счету Б
                        Б^ - ^ Б
                                       Бс ^ г. по ^ г. Б
 ВПлан счетов ^ В
.if OkFilAnS
 ВПрименен фильтр... В
.{
 В   ^ В
.{
 В      ^ ^ В
.}
.}
.end
.{
.[h
 Б                                                                                                                                                                                         лист @np@
──────────┬──────┬───────────────────────────────────────────────┬────────────────────────────────┬───────────────────────────────────┬───────────────────────────────────────────────────────────────────────────┬──────────
          │      │            Корреспондирующий счет             │                                │                                   │                                 С У М М А                                 │
          │      ├────┬─────┬───────────────┬────────────────────┤                                │                                   ├───────────────────────────────────────────────────────────────────────────┤
  Д а т а │ Номер│Счет│Суб- │               │                    │                                │       С О Д Е Р Ж А Н И Е         │                                  Обороты                                  │
          │ доку-│    │счет │ Подразделение │  Наименование КАУ  │    ПЛАТЕЛЬЩИК / ПОЛУЧАТЕЛЬ     │                                   │                                                                           │Единица
          │ мента│    │     │               │                    │                                │          О П Е Р А Ц И И          ├─────────────────────────────────────┬─────────────────────────────────────┤измерения
          │      │    │     │               │                    │                                │                                   │                Дебет                │                Кредит               │
          │      │    │     │               │                    │                                │                                   ├──────────────────┬──────────────────┼──────────────────┬──────────────────┤
          │      │    │     │               │                    │                                │                                   │     в @@@@@@     │    количество    │     в @@@@@@     │    количество    │
──────────┴──────┴────┴─────┴───────────────┴────────────────────┴────────────────────────────────┴───────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴────────── Б
.]h
 Б.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
Объект аналитического учета : ^
.end
.{
.if OkAnRKau2
   Объект аналитического учета : ^
.end
.{
.if OkAnRKau3
      Объект аналитического учета : ^
.end
.{
.if OkAnRKau4
        Объект аналитического учета : ^
.end
.{
.if OkAnRKau5
          Объект аналитического учета : ^
.end
.{
.if OkAnRKau6
            Объект аналитического учета : ^
.end Б
.{
.{
@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& @@@@@@@@@@
.}
.}
 Б.if OkAnRSumKau6
            Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@
            ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau5
          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@
          ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau4
        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@
        ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau3
      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@
      ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau2
   Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@
   ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumKau1
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumPodr
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
Итого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@
.if OkRollSubAnUch
.end
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
Итого по @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& @@@@@@@@@@
.if OkRollSchAnUch
.end
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Щ.endform

!==============================================================================
.linkform 'anuch_sh_kol06' prototype is 'anuch_sh'
.group 'Аналитика по оборотам количество и валюта'
.nameinlist 'Оборотно-сальдовая ведомость по счету в валюте отчетов и натуральных показателях'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n
c0p2 c0p3
sCurPS
c1f1
c2f1 c2f2
c0p7 c0p7 c0p7 c0p7
c1p1 c1p1n
c2p1
c10p1      c6_p1v  c6_p1kol  c6_p2v  c6_p2kol  c6_p3v  c6_p3kol  c6_p4v  c6_p4kol c6_edizm c6_p5v  c6_p5kol  c6_p6v  c6_p6kol
c9p1       c10_p1v c10_p1kol c10_p2v c10_p2kol c10_p3v c10_p3kol c10_p4v c10_p4kol c10_edizm c10_p5v c10_p5kol c10_p6v c10_p6kol
c8p1       c9_p1v  c9_p1kol  c9_p2v  c9_p2kol  c9_p3v  c9_p3kol  c9_p4v  c9_p4kol c9_edizm c9_p5v  c9_p5kol  c9_p6v  c9_p6kol
c5p1       c8_p1v  c8_p1kol  c8_p2v  c8_p2kol  c8_p3v  c8_p3kol  c8_p4v  c8_p4kol c8_edizm c8_p5v  c8_p5kol  c8_p6v  c8_p6kol
c4p1       c5_p1v  c5_p1kol  c5_p2v  c5_p2kol  c5_p3v  c5_p3kol  c5_p4v  c5_p4kol c5_edizm c5_p5v  c5_p5kol  c5_p6v  c5_p6kol
c3p1       c4_p1v  c4_p1kol  c4_p2v  c4_p2kol  c4_p3v  c4_p3kol  c4_p4v  c4_p4kol c4_edizm c4_p5v  c4_p5kol  c4_p6v  c4_p6kol
c2p1       c3_p1v  c3_p1kol  c3_p2v  c3_p2kol  c3_p3v  c3_p3kol  c3_p4v  c3_p4kol c3_edizm c3_p5v  c3_p5kol  c3_p6v  c3_p6kol
c1p1 c1p1n c2_p1v  c2_p1kol  c2_p2v  c2_p2kol  c2_p3v  c2_p3kol  c2_p4v  c2_p4kol c2_edizm c2_p5v  c2_p5kol  c2_p6v  c2_p6kol
RolledSubDebV RollSubDebKol RolledSubKredV RollSubKredKol 
c0p1 c0p1n c1_p1v  c1_p1kol  c1_p2v  c1_p2kol  c1_p3v  c1_p3kol  c1_p4v  c1_p4kol c1_edizm c1_p5v  c1_p5kol  c1_p6v  c1_p6kol
RolledSchDebV RollSchDebKol RolledSchKredV RollSchKredKol 
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Щ
 Б^
^
                             БВедомость аналитического учета по счету Б
                        Б^ - ^ Б
                                       Бс ^ г. по ^ г. Б
 ВПлан счетов ^ В
.if OkFilAnS
 ВПрименен фильтр... В
.{
 В   ^ В
.{
 В      ^ ^ В
.}
.}
.end
.{
.[h
 Б                                                                                                                                                                     лист @np@
──────────────────────────────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────────┬──────────
                                                                      │                              сальдо                                 │                               Обороты                               │
                                                                      ├─────────────────────────────────┬───────────────────────────────────┼──────────────────────────────────┬──────────────────────────────────┤Единица
                      Объект аналитического учета                     │              дебет              │              кредит               │               дебет              │               кредит             │измерения
                                                                      ├────────────────┬────────────────┼─────────────────┬─────────────────┼─────────────────┬────────────────┼─────────────────┬────────────────┤
                                                                      │    в @@@@@@    │   количество   │     в @@@@@@    │    количество   │    в @@@@@@     │   количество   │     в @@@@@@    │   количество   │
──────────────────────────────────────────────────────────────────────┴────────────────┴────────────────┴─────────────────┴─────────────────┴─────────────────┴────────────────┴─────────────────┴────────────────┴────────── Б
.]h
 Б.if OkAnRSub
Субсчет : ^ ^
.end
.{
.if OkAnRPodr
Подразделение : ^
.end
.{
.if OkAnRKau1
.end
.{
.if OkAnRKau2
.end
.{
.if OkAnRKau3
.end
.{
.if OkAnRKau4
.end
.{
.if OkAnRKau5
.end
.{
.if OkAnRKau6
.end
.{
.{
.}
.}
.if OkAnRSumKau6
            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& @@@@@@@@@@
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau5
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& @@@@@@@@@@
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau4
        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& @@@@@@@@@@
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau3
      @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& @@@@@@@@@@
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau2
   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& @@@@@@@@@@
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumKau1
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& @@@@@@@@@@
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
.}
.if OkAnRSumPodr
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& @@@@@@@@@@
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkAnRSumSub
@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& @@@@@@@@@@
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.if OkRollSubAnUch
                                                                       &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (сальдо входящее)   &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   (суммарные обороты)                                                                       &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& @@@@@@@@@@
                                                   (сальдо исходящее)  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.if OkRollSchAnUch
                                                                       &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
.end
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnUch
.{checkenter FeeSignersCycle_AnUch
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.else
Бухгалтер
Ответственный за выпуск
.end
 Щ.endform
