//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
//------------------------------------------------------------------------------
// Галактика 5.0 - ФРО
// Ведомости аналитического учета в валюте
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Внимание! Существуют Slk-отчеты (копии всех присоединенных форм)
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Информация о замене полей (в порядке убывания дат)
//
//  ----------------------------------------------------------------------------
//  DD-MM-YYYY
//  ----------------------------------------------------------------------------
//  27-05-2005
//
//    Из прототипа _удалены_ поля:
//      c3p2, c4p2, c5p2, c8p2, c9p2, c10p2
//        В них выводился ключ для группировки в отчете, который содержал
//        непечатные символы. Фактически использовать поля было невозможно.
//
//    В прототип _добавлены_ поля:
//      cOborot   содержит ссылку Oborot.NRec
//      cSoprHoz  содержит ссылку Oborot.cSoprHoz
//      SodrMode  содержит режим формирования содержания операции из интерфейса
//                настройки параметров отчета
//
//  ----------------------------------------------------------------------------
//  04-07-2012
//
//    В прототип добавлены_поля для количества:
//      c7p8kol,   c7p9kol,   c7p10kol,  c7p11kol                          - по оборотам
//      c7_p1kol,  c7_p2kol,  c7_p3kol,  c7_p4kol,  c7_p5kol,  c7_p6kol    - по филиалу
//      c6_p1kol,  c6_p2kol,  c6_p3kol,  c6_p4kol,  c6_p5kol,  c6_p6kol    - по кау6
//      c10_p1kol, c10_p2kol, c10_p3kol, c10_p4kol, c10_p5kol, c10_p6kol   - по кау5
//      c9_p1kol,  c9_p2kol,  c9_p3kol,  c9_p4kol,  c9_p5kol,  c9_p6kol    - по кау4
//      c8_p1kol,  c8_p2kol,  c8_p3kol,  c8_p4kol,  c8_p5kol,  c8_p6kol    - по кау3
//      c5_p1kol,  c5_p2kol,  c5_p3kol,  c5_p4kol,  c5_p5kol,  c5_p6kol    - по кау2
//      c4_p1kol,  c4_p2kol,  c4_p3kol,  c4_p4kol,  c4_p5kol,  c4_p6kol    - по кау1
//      c3_p1kol,  c3_p2kol,  c3_p3kol,  c3_p4kol,  c3_p5kol,  c3_p6kol    - по подразделению
//      c2_p1kol,  c2_p2kol,  c2_p3kol,  c2_p4kol,  c2_p5kol,  c2_p6kol    - по субсчету
//      c1_p1kol,  c1_p2kol,  c1_p3kol,  c1_p4kol,  c1_p5kol,  c1_p6kol    - по счету
//      c7p11_edizm, c7_edizm, c6_edizm, c10_edizm, c9_edizm, c8_edizm, c5_edizm,
//      c4_edizm, c3_edizm, c2_edizm, c1_edizm                             - единица измерения
//      DSaldoIshKol
//      KSaldoIshKol
//------------------------------------------------------------------------------
#include FeeSigners.frn
#doc
Базовая форма отчета "Ведомости аналитического учета в валюте"
#end
.set name = 'AnValut'
.group 'Аналитика по операциям'
.nameinlist 'Базовая форма AnValut'
.hide
.fields
c00p1 c00p2
c0p2 c0p3 c0p4 c0p5 c0p6 c0p7
c1f1
c2f1 c2f2
c0p0 c0p11 c0p12
c1p1 c1p1n
c2p1
c3p1 Kau1KodTable:word Kau1Nrec:comp
c4p1 Kau2KodTable:word Kau2Nrec:comp
c5p1 Kau3KodTable:word Kau3Nrec:comp
c8p1 Kau4KodTable:word Kau4Nrec:comp
c9p1 Kau5KodTable:word Kau5Nrec:comp
c10p1 Kau6KodTable:word Kau6Nrec:comp
c6p1
c7p1 c7p2 c7p3 c7p4 c7p5 c7p6 c7p7 cOborot cSoprHoz SodrMode:word c7p7pl c7p7op c7p8  c7p8r  c7p8v c7p8kol c7p9  c7p9r  c7p9v c7p9kol c7p10 c7p10r c7p10v c7p10kol c7p11 c7p11r c7p11v c7p11kol c7p21 c7p22
BaseDocDate c7p11_edizm
c7_p1 c7_p1r c7_p1v c7_p1kol c7_p2 c7_p2r c7_p2v c7_p2kol c7_p3 c7_p3r c7_p3v c7_p3kol c7_p4 c7_p4r c7_p4v c7_p4kol c7_p5 c7_p5r c7_p5v c7_p5kol c7_p6 c7_p6r c7_p6v c7_p6kol c7_edizm
c6_p1 c6_p1r c6_p1v c6_p1kol c6_p2 c6_p2r c6_p2v c6_p2kol c6_p3 c6_p3r c6_p3v c6_p3kol c6_p4 c6_p4r c6_p4v c6_p4kol c6_p5 c6_p5r c6_p5v c6_p5kol c6_p6 c6_p6r c6_p6v c6_p6kol c6_edizm
c10_p1 c10_p1r c10_p1v c10_p1kol c10_p2 c10_p2r c10_p2v c10_p2kol c10_p3 c10_p3r c10_p3v c10_p3kol c10_p4 c10_p4r c10_p4v c10_p4kol c10_p5 c10_p5r c10_p5v c10_p5kol c10_p6 c10_p6r c10_p6v c10_p6kol c10_edizm
c9_p1 c9_p1r c9_p1v c9_p1kol c9_p2 c9_p2r c9_p2v c9_p2kol c9_p3 c9_p3r c9_p3v c9_p3kol c9_p4 c9_p4r c9_p4v c9_p4kol c9_p5 c9_p5r c9_p5v c9_p5kol c9_p6 c9_p6r c9_p6v c9_p6kol c9_edizm
c8_p1 c8_p1r c8_p1v c8_p1kol c8_p2 c8_p2r c8_p2v c8_p2kol c8_p3 c8_p3r c8_p3v c8_p3kol c8_p4 c8_p4r c8_p4v c8_p4kol c8_p5 c8_p5r c8_p5v c8_p5kol c8_p6 c8_p6r c8_p6v c8_p6kol c8_edizm
c5_p1 c5_p1r c5_p1v c5_p1kol c5_p2 c5_p2r c5_p2v c5_p2kol c5_p3 c5_p3r c5_p3v c5_p3kol c5_p4 c5_p4r c5_p4v c5_p4kol c5_p5 c5_p5r c5_p5v c5_p5kol c5_p6 c5_p6r c5_p6v c5_p6kol c5_edizm
c4_p1 c4_p1r c4_p1v c4_p1kol c4_p2 c4_p2r c4_p2v c4_p2kol c4_p3 c4_p3r c4_p3v c4_p3kol c4_p4 c4_p4r c4_p4v c4_p4kol c4_p5 c4_p5r c4_p5v c4_p5kol c4_p6 c4_p6r c4_p6v c4_p6kol c4_edizm
c3_p1 c3_p1r c3_p1v c3_p1kol c3_p2 c3_p2r c3_p2v c3_p2kol c3_p3 c3_p3r c3_p3v c3_p3kol c3_p4 c3_p4r c3_p4v c3_p4kol c3_p5 c3_p5r c3_p5v c3_p5kol c3_p6 c3_p6r c3_p6v c3_p6kol c3_edizm
c2_p1 c2_p1r c2_p1v c2_p1kol c2_p2 c2_p2r c2_p2v c2_p2kol c2_p3 c2_p3r c2_p3v c2_p3kol c2_p4 c2_p4r c2_p4v c2_p4kol c2_p5 c2_p5r c2_p5v c2_p5kol c2_p6 c2_p6r c2_p6v c2_p6kol c2_edizm
DSaldoIsh DSaldoIshR DSaldoIshV DSaldoIshKol KSaldoIsh KSaldoIshR KSaldoIshV KSaldoIshKol
c1_p1 c1_p1r c1_p1v c1_p1kol c1_p2 c1_p2r c1_p2v c1_p2kol c1_p3 c1_p3r c1_p3v c1_p3kol c1_p4 c1_p4r c1_p4v c1_p4kol c1_p5 c1_p5r c1_p5v c1_p5kol c1_p6 c1_p6r c1_p6v c1_p6kol c1_edizm
#FeeSignersCycleFields
.endfields
c00p1                    ^
c00p2                    ^
c0p2    Интервал начало  ^
c0p3             конец   ^
c0p4    Нац ДЕ (имя)   ^
c0p5    Нац ДЕ (симв)  ^
c0p6    Валюта отчетов (имя)  ^
c0p7    Валюта отчетов (симв) ^
.if OkFilAnV
.{
c1f1 ^
.{
c2f1 ^
c2f2 ^
.}
.}
.end
.{
c0p0    Имя валюты            ^
c0p11   дата курса            ^
c0p12   курс валюты           ^
.{
.if OkAnVSub
c1p1    Субсчет осн счета     ^
c1p1n        имя субсчета     ^
.end
.{
.if OkAnVPodr
c2p1    Подразделение         ^
.end
.{
.if OkAnVKau1
c3p1    КАУ 1 осн счета      ^
Kau1KodTable  Код таблицы КАУ 1 основного счета ^
Kau1Nrec      NRec КАУ 1 основного счета ^
.end
.{
.if OkAnVKau2
c4p1    КАУ 2 осн счета      ^
Kau2KodTable  Код таблицы КАУ 2 основного счета ^
Kau2Nrec      NRec КАУ 2 основного счета ^
.end
.{
.if OkAnVKau3
c5p1    КАУ 3 осн счета      ^
Kau3KodTable  Код таблицы КАУ 3 основного счета ^
Kau3Nrec      NRec КАУ 3 основного счета ^
.end
.{
.if OkAnVKau4
c8p1    КАУ 4 осн счета      ^
Kau4KodTable  Код таблицы КАУ 4 основного счета ^
Kau4Nrec      NRec КАУ 4 основного счета ^
.end
.{
.if OkAnVKau5
c9p1    КАУ 5 осн счета      ^
Kau5KodTable  Код таблицы КАУ 5 основного счета ^
Kau5Nrec      NRec КАУ 5 основного счета ^
.end
.{
.if OkAnVKau6
c10p1    КАУ 6 осн счета      ^
Kau6KodTable  Код таблицы КАУ 6 основного счета ^
Kau6Nrec      NRec КАУ 6 основного счета ^
.end
.{
c6p1    Филиал               ^
.{
c7p1     дата         ^
c7p2     N док        ^
c7p3     субсчет осн  ^
c7p4     кор счет     ^
c7p5     субсчет кор  ^
c7p6     КАУ кор      ^
c7p7     подразд кор  ^
cOborot  - NRec проводки                 ^
cSoprHoz - ссылка на журнал хозопераций  ^
SodrMode - режим формирования содержания ^
c7p7pl   - плательщик/получатель ^
c7p7op   - наименование операции ^
c7p8     сальдо вход по дебету  в валюте ^
c7p8r                           в НДЕ    ^
c7p8v                   в валюте отчетов ^
c7p8kol                       количество ^
c7p9     сальдо вход по кредиту ^
c7p9r                           ^
c7p9v                           ^
c7p9kol                         ^
c7p10    обороты по дебету      ^
c7p10r                          ^
c7p10v                          ^
c7p10kol                        ^
c7p11    обороты по кредиту     ^
c7p11r                          ^
c7p11v                          ^
c7p11kol                        ^
c7p21    курс по операции       ^
c7p22    курсовая разница       ^
BaseDocDate   Дата платежного документа ^
c7p11_edizm   единица измерения ^
.}
Сумма по филиалу
c7_p1     сальдо вход по дебету  ^
c7_p1r                           ^
c7_p1v                           ^
c7_p1kol                         ^
c7_p2     сальдо вход по кредиту ^
c7_p2r                           ^
c7_p2v                           ^
c7_p2kol                         ^
c7_p3     обороты по дебету      ^
c7_p3r                           ^
c7_p3v                           ^
c7_p3kol                         ^
c7_p4     обороты по кредиту     ^
c7_p4r                           ^
c7_p4v                           ^
c7_p4kol                         ^
c7_p5     сальдо исх по дебету   ^
c7_p5r                           ^
c7_p5v                           ^
c7_p5kol                         ^
c7_p6     сальдо исх по кредиту  ^
c7_p6r                           ^
c7_p6v                           ^
c7_p6kol                         ^
c7_edizm  единица измерения      ^
.}
.if OkAnVSumKau6
Сумма по КАУ 6
c10_p1     сальдо вход по дебету  ^
c10_p1r                           ^
c10_p1v                           ^
c10_p1kol                         ^
c10_6p2     сальдо вход по кредиту ^
c10_p2r                           ^
c10_p2v                           ^
c10_p2kol                         ^
c10_p3     обороты по дебету      ^
c10_p3r                           ^
c10_p3v                           ^
c10_p3kol                         ^
c10_p4     обороты по кредиту     ^
c10_p4r                           ^
c10_p4v                           ^
c10_p4kol                         ^
c10_p5     сальдо исх по дебету   ^
c10_p5r                           ^
c10_p5v                           ^
c10_p5kol                         ^
c10_p6     сальдо исх по кредиту  ^
c10_p6r                           ^
c10_p6v                           ^
c10_p6kol                         ^
c10_edizm  единица измерения      ^
.end
.}
.if OkAnVSumKau5
Сумма по КАУ 5
c9_p1     сальдо вход по дебету  ^
c9_p1r                           ^
c9_p1v                           ^
c9_p1kol                         ^
c9_6p2     сальдо вход по кредиту ^
c9_p2r                           ^
c9_p2v                           ^
c9_p2kol                         ^
c9_p3     обороты по дебету      ^
c9_p3r                           ^
c9_p3v                           ^
c9_p3kol                         ^
c9_p4     обороты по кредиту     ^
c9_p4r                           ^
c9_p4v                           ^
c9_p4kol                         ^
c9_p5     сальдо исх по дебету   ^
c9_p5r                           ^
c9_p5v                           ^
c9_p5kol                         ^
c9_p6     сальдо исх по кредиту  ^
c9_p6r                           ^
c9_p6v                           ^
c9_p6kol                         ^
c9_edizm  единица измерения      ^
.end
.}
.if OkAnVSumKau4
Сумма по КАУ 4
c8_p1     сальдо вход по дебету  ^
c8_p1r                           ^
c8_p1v                           ^
c8_p1kol                         ^
c8_6p2     сальдо вход по кредиту ^
c8_p2r                           ^
c8_p2v                           ^
c8_p2kol                         ^
c8_p3     обороты по дебету      ^
c8_p3r                           ^
c8_p3v                           ^
c8_p3kol                         ^
c8_p4     обороты по кредиту     ^
c8_p4r                           ^
c8_p4v                           ^
c8_p4kol                         ^
c8_p5     сальдо исх по дебету   ^
c8_p5r                           ^
c8_p5v                           ^
c8_p5kol                         ^
c8_p6     сальдо исх по кредиту  ^
c8_p6r                           ^
c8_p6v                           ^
c8_p6kol                         ^
c8_edizm  единица измерения      ^
.end
.}
.if OkAnVSumKau3
Сумма по КАУ 3
c6_p1     сальдо вход по дебету  ^
c6_p1r                           ^
c6_p1v                           ^
c6_p1kol                         ^
c6_p2     сальдо вход по кредиту ^
c6_p2r                           ^
c6_p2v                           ^
c6_p2kol                         ^
c6_p3     обороты по дебету      ^
c6_p3r                           ^
c6_p3v                           ^
c6_p3kol                         ^
c6_p4     обороты по кредиту     ^
c6_p4r                           ^
c6_p4v                           ^
c6_p4kol                         ^
c6_p5     сальдо исх по дебету   ^
c6_p5r                           ^
c6_p5v                           ^
c6_p5kol                         ^
c6_p6     сальдо исх по кредиту  ^
c6_p6r                           ^
c6_p6v                           ^
c6_p6kol                         ^
c6_edizm  единица измерения      ^
.end
.}
.if OkAnVSumKau2
Сумма по КАУ 2
c5_p1     сальдо вход по дебету  ^
c5_p1r                           ^
c5_p1v                           ^
c5_p1kol                         ^
c5_p2     сальдо вход по кредиту ^
c5_p2r                           ^
c5_p2v                           ^
c5_p2kol                         ^
c5_p3     обороты по дебету      ^
c5_p3r                           ^
c5_p3v                           ^
c5_p3kol                         ^
c5_p4     обороты по кредиту     ^
c5_p4r                           ^
c5_p4v                           ^
c5_p4kol                         ^
c5_p5     сальдо исх по дебету   ^
c5_p5r                           ^
c5_p5v                           ^
c5_p5kol                         ^
c5_p6     сальдо исх по кредиту  ^
c5_p6r                           ^
c5_p6v                           ^
c5_p6kol                         ^
c5_edizm  единица измерения      ^
.end
.}
.if OkAnVSumKau1
Сумма по КАУ 1
c4_p1     сальдо вход по дебету  ^
c4_p1r                           ^
c4_p1v                           ^
c4_p1kol                         ^
c4_p2     сальдо вход по кредиту ^
c4_p2r                           ^
c4_p2v                           ^
c4_p2kol                         ^
c4_p3     обороты по дебету      ^
c4_p3r                           ^
c4_p3v                           ^
c4_p3kol                         ^
c4_p4     обороты по кредиту     ^
c4_p4r                           ^
c4_p4v                           ^
c4_p4kol                         ^
c4_p5     сальдо исх по дебету   ^
c4_p5r                           ^
c4_p5v                           ^
c4_p5kol                         ^
c4_p6     сальдо исх по кредиту  ^
c4_p6r                           ^
c4_p6v                           ^
c4_p6kol                         ^
c4_edizm  единица измерения      ^
.end
.}
.if OkAnVSumPodr
Сумма по подразделению
c3_p1     сальдо вход по дебету  ^
c3_p1r                           ^
c3_p1v                           ^
c3_p1kol                         ^
c3_p2     сальдо вход по кредиту ^
c3_p2r                           ^
c3_p2v                           ^
c3_p2kol                         ^
c3_p3     обороты по дебету      ^
c3_p3r                           ^
c3_p3v                           ^
c3_p3kol                         ^
c3_p4     обороты по кредиту     ^
c3_p4r                           ^
c3_p4v                           ^
c3_p4kol                         ^
c3_p5     сальдо исх по дебету   ^
c3_p5r                           ^
c3_p5v                           ^
c3_p5kol                         ^
c3_p6     сальдо исх по кредиту  ^
c3_p6r                           ^
c3_p6v                           ^
c3_p6kol                         ^
c3_edizm  единица измерения      ^
.end
.}
.if OkAnVSumSub
Сумма по субсчету
c2_p1     сальдо вход по дебету  ^
c2_p1r                           ^
c2_p1v                           ^
c2_p1kol                         ^
c2_p2     сальдо вход по кредиту ^
c2_p2r                           ^
c2_p2v                           ^
c2_p2kol                         ^
c2_p3     обороты по дебету      ^
c2_p3r                           ^
c2_p3v                           ^
c2_p3kol                         ^
c2_p4     обороты по кредиту     ^
c2_p4r                           ^
c2_p4v                           ^
c2_p4kol                         ^
c2_p5     сальдо исх по дебету   ^
c2_p5r                           ^
c2_p5v                           ^
c2_p5kol                         ^
c2_p6     сальдо исх по кредиту  ^
c2_p6r                           ^
c2_p6v                           ^
c2_p6kol                         ^
c2_edizm  единица измерения      ^
.if OkSvertkaSubAnValut
DSaldoIsh     ^
DSaldoIshR    ^
DSaldoIshV    ^
DSaldoIshKol  ^
KSaldoIsh     ^
KSaldoIshR    ^
KSaldoIshV    ^
KSaldoIshKol  ^
.end
.end
.}
Итого по валюте
c1_p1     сальдо вход по дебету  ^
c1_p1r                           ^
c1_p1v                           ^
c1_p1kol                         ^
c1_p2     сальдо вход по кредиту ^
c1_p2r                           ^
c1_p2v                           ^
c1_p2kol                         ^
c1_p3     обороты по дебету      ^
c1_p3r                           ^
c1_p3v                           ^
c1_p3kol                         ^
c1_p4     обороты по кредиту     ^
c1_p4r                           ^
c1_p4v                           ^
c1_p4kol                         ^
c1_p5     сальдо исх по дебету   ^
c1_p5r                           ^
c1_p5v                           ^
c1_p5kol                         ^
c1_p6     сальдо исх по кредиту  ^
c1_p6r                           ^
c1_p6v                           ^
c1_p6kol                         ^
c1_edizm  единица измерения      ^
.}
#FeeSignersCycle(AnValut)
.endform
!==============================================================================
.linkform 'anvalut_01' prototype is 'anvalut'
.group 'Аналитика по операциям'
.nameinlist 'Ведомость аналитического учета по операциям'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
commonFormHeader
MyOrg
c00p1 c00p2
c0p2 c0p3
c1f1
c2f1 c2f2
c0p0
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p8 c7p9 c7p10 c7p11
c10p1      c6_p1 c6_p2 c6_p3 c6_p4 c6_p5 c6_p6
c9p1       c10_p1 c10_p2 c10_p3 c10_p4 c10_p5 c10_p6
c8p1       c9_p1 c9_p2 c9_p3 c9_p4 c9_p5 c9_p6
c5p1       c8_p1 c8_p2 c8_p3 c8_p4 c8_p5 c8_p6
c4p1       c5_p1 c5_p2 c5_p3 c5_p4 c5_p5 c5_p6
c3p1       c4_p1 c4_p2 c4_p3 c4_p4 c4_p5 c4_p6
c2p1       c3_p1 c3_p2 c3_p3 c3_p4 c3_p5 c3_p6
c1p1 c1p1n c2_p1 c2_p2 c2_p3 c2_p4 c2_p5 c2_p6
DSaldoIsh
KSaldoIsh
c0p0       c1_p1 c1_p2 c1_p3 c1_p4 c1_p5 c1_p6
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
 Б^

                          Ведомость аналитического учета в валюте по счету
                         ^ - ^
                                      с ^ г. по ^ г. Б
.if OkFilAnV
 ВПрименен фильтр... В
.{
 В   ^ В
.{
 В      ^ ^ В
.}
.}
.end
.{
.[h
                                                                                                                                                                              лист @np@
 Б──────────┬──────┬──────────────────────────────────────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────────────────────────────────────────────────────
          │      │                                Корреспондирующий счет                        │                                                    С у м м а
          │      ├──────┬─────┬───────────────────────────┬─────────────────────────────────────┼─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
  Д а т а │ Номер│ Счет │Суб- │                           │                                     │                Сальдо               │               Обороты               │               Сальдо
          │ доку-│      │счет │        Подразделение      │           Наименование КАУ          │               входящее              │                                     │              исходящее
          │ мента│      │     │                           │                                     ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
          │      │      │     │                           │                                     │       Дебет      │     Кредит       │       Дебет      │      Кредит      │       Дебет      │      Кредит
──────────┴──────┴──────┴─────┴───────────────────────────┴─────────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴────────────────── Б
.]h
 БВалюта : ^ Б
.{
.if OkAnVSub
 БСубсчет : ^ ^ Б
.end
.{
.if OkAnVPodr
 БПодразделение : ^ Б
.end
.{
.if OkAnVKau1
 БОбъект аналитического учета : ^ Б
.end
.{
.if OkAnVKau2
 Б  Объект аналитического учета : ^ Б
.end
.{
.if OkAnVKau3
 Б    Объект аналитического учета : ^ Б
.end
.{
.if OkAnVKau4
 Б      Объект аналитического учета : ^ Б
.end
.{
.if OkAnVKau5
 Б        Объект аналитического учета : ^ Б
.end
.{
.if OkAnVKau6
 Б          Объект аналитического учета : ^ Б
.end
.{
.{
@@@@@@@@@@ @@@@@@ @@@@@@ @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&&
.}
.}
.if OkAnVSumKau6
 Б          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Б
.end
.}
.if OkAnVSumKau5
 Б        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
        ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Б
.end
.}
.if OkAnVSumKau4
 Б      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Б
.end
.}
.if OkAnVSumKau3
 Б    Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
    ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Б
.end
.}
.if OkAnVSumKau2
 Б  Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
  ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Б
.end
.}
.if OkAnVSumKau1
 БИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Б
.end
.}
.if OkAnVSumPodr
 БИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Б
.end
.}
.if OkAnVSumSub
 БИтого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.if OkSvertkaSubAnValut
 Б                                                                                                                                                                             &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.end
 Б────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Б
.end
.}
 БИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════ Б
.}
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnValut
.{ checkenter FeeSignersCycle_AnValut
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
Бухгалтер
Ответственный за выпуск
.end Ш
.endform
!==============================================================================
.linkform 'anvalut_02' prototype is 'anvalut'
.group 'Аналитика по содержанию'
.nameinlist 'Ведомость аналитического учета по содержанию'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
CommonFormHeader
MyOrg
c00p1 c00p2
c0p2 c0p3
c1f1
c2f1 c2f2
c0p0
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p7pl c7p7op c7p8 c7p9 c7p10 c7p11
c10p1     c6_p1 c6_p2 c6_p3 c6_p4 c6_p5 c6_p6
c9p1      c10_p1 c10_p2 c10_p3 c10_p4 c10_p5 c10_p6
c8p1      c9_p1 c9_p2 c9_p3 c9_p4 c9_p5 c9_p6
c5p1      c8_p1 c8_p2 c8_p3 c8_p4 c8_p5 c8_p6
c4p1       c5_p1 c5_p2 c5_p3 c5_p4 c5_p5 c5_p6
c3p1       c4_p1 c4_p2 c4_p3 c4_p4 c4_p5 c4_p6
c2p1       c3_p1 c3_p2 c3_p3 c3_p4 c3_p5 c3_p6
c1p1 c1p1n c2_p1 c2_p2 c2_p3 c2_p4 c2_p5 c2_p6
DSaldoIsh
KSaldoIsh
c0p0       c1_p1 c1_p2 c1_p3 c1_p4 c1_p5 c1_p6
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
 Б^

                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г. Б
.if OkFilAnV
 ВПрименен фильтр... В
.{
 В   ^ В
.{
 В      ^ ^ В
.}
.}
.end
.{
.[h
 Б                                                                                                                                                                                                       лист @np@
──────────┬──────┬───────────────────────────────────────────────┬────────────────────────────────┬───────────────────────────────────┬───────────────────────────────────────────────────────────────────────────
          │      │            Корреспондирующий счет             │                                │                                   │                                 С у м м а
          │      ├────┬─────┬───────────────┬────────────────────┤                                │       С О Д Е Р Ж А Н И Е         ├─────────────────────────────────────┬─────────────────────────────────────
  Д а т а │ Номер│Счет│Суб- │               │                    │    ПЛАТЕЛЬЩИК / ПОЛУЧАТЕЛЬ     │                                   │                Сальдо               │               Обороты
          │ доку-│    │счет │ Подразделение │  Наименование КАУ  │                                │         О П Е Р А Ц И И           │                                     │
          │ мента│    │     │               │                    │                                │                                   ├──────────────────┬──────────────────┼──────────────────┬──────────────────
          │      │    │     │               │                    │                                │                                   │       Дебет      │     Кредит       │       Дебет      │      Кредит
──────────┴──────┴────┴─────┴───────────────┴────────────────────┴────────────────────────────────┴───────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴────────────────── Б
.]h
 БВалюта : ^ Б
.{
.if OkAnVSub
 БСубсчет : ^ ^ Б
.end
.{
.if OkAnVPodr
 БПодразделение : ^ Б
.end
.{
.if OkAnVKau1
 БОбъект аналитического учета : ^ Б
.end
.{
.if OkAnVKau2
 Б  Объект аналитического учета : ^ Б
.end
.{
.if OkAnVKau3
 Б    Объект аналитического учета : ^ Б
.end
.{
.if OkAnVKau4
 Б      Объект аналитического учета : ^ Б
.end
.{
.if OkAnVKau5
 Б        Объект аналитического учета : ^ Б
.end
.{
.if OkAnVKau6
 Б          Объект аналитического учета : ^ Б
.end
.{
.{
@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'#&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&&
.}
.}
.if OkAnVSumKau6
 Б          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                      Сальдо входящеее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Суммарные обороты                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Сальдо исходящее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Б
.end
.}
.if OkAnVSumKau5
 Б        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                      Сальдо входящеее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Суммарные обороты                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Сальдо исходящее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
        ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Б
.end
.}
.if OkAnVSumKau4
 Б      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                      Сальдо входящеее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Суммарные обороты                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Сальдо исходящее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Б
.end
.}
.if OkAnVSumKau3
 Б    Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                      Сальдо входящеее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Суммарные обороты                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Сальдо исходящее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
    ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Б
.end
.}
.if OkAnVSumKau2
 Б  Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                      Сальдо входящеее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Суммарные обороты                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Сальдо исходящее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
  ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Б
.end
.}
.if OkAnVSumKau1
 БИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                      Сальдо входящеее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Суммарные обороты                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Сальдо исходящее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Б
.end
.}
.if OkAnVSumPodr
 БИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                      Сальдо входящеее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Суммарные обороты                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Сальдо исходящее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Б
.end
.}
.if OkAnVSumSub
 БИтого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                      Сальдо входящеее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Суммарные обороты                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Сальдо исходящее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.if OkSvertkaSubAnValut
 Б                                                                                                                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.end
 Б────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Б
.end
.}
 БИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                      Сальдо входящеее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Суммарные обороты                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Сальдо исходящее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════ Б
.}
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnValut
.{ checkenter FeeSignersCycle_AnValut
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
Бухгалтер
Ответственный за выпуск
.end Ш
.endform
!==============================================================================
.linkform 'anvalut_03' prototype is 'anvalut'
.group 'Аналитика по оборотам'
.nameinlist 'Ведомость аналитического учета по оборотам'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
CommonFormHeader
MyOrg
c00p1 c00p2
c0p2 c0p3
c1f1
c2f1 c2f2
c0p0
c1p1 c1p1n
c2p1
c10p1     c6_p1 c6_p2 c6_p3 c6_p4 c6_p5 c6_p6
c9p1      c10_p1 c10_p2 c10_p3 c10_p4 c10_p5 c10_p6
c8p1      c9_p1 c9_p2 c9_p3 c9_p4 c9_p5 c9_p6
c5p1      c8_p1 c8_p2 c8_p3 c8_p4 c8_p5 c8_p6
c4p1       c5_p1 c5_p2 c5_p3 c5_p4 c5_p5 c5_p6
c3p1       c4_p1 c4_p2 c4_p3 c4_p4 c4_p5 c4_p6
c2p1       c3_p1 c3_p2 c3_p3 c3_p4 c3_p5 c3_p6
c1p1 c1p1n c2_p1 c2_p2 c2_p3 c2_p4 c2_p5 c2_p6
DSaldoIsh
KSaldoIsh
c0p0       c1_p1 c1_p2 c1_p3 c1_p4 c1_p5 c1_p6
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Р^
 Б^

                          Ведомость аналитического учета в валюте по счету
                         ^ - ^
                                      с ^ г. по ^ г. Б
.if OkFilAnV
 ВПрименен фильтр... В
.{
 В   ^ В
.{
 В      ^ ^ В
.}
.}
.end
.{
.[h
 Б                                                                                                                                             лист @np@
──────────────────────────────────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
                                                                  │           Сальдо  входящее          │               Обороты               │            Сальдо исходящее
                    Объект аналитического учета                   ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
                                                                  │       Дебет      │     Кредит       │       Дебет      │      Кредит      │       Дебет      │      Кредит
──────────────────────────────────────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴────────────────── Б
.]h
 БВалюта : ^ Б
.{
.if OkAnVSub
 БСубсчет : ^ ^ Б
.end
.{
.if OkAnVPodr
 БПодразделение : ^ Б
.end
.{
.if OkAnVKau1
.end
.{
.if OkAnVKau2
.end
.{
.if OkAnVKau3
.end
.{
.if OkAnVKau4
.end
.{
.if OkAnVKau5
.end
.{
.if OkAnVKau6
.end
.{
.{
.}
.}
.if OkAnVSumKau6
 Б          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.end
.}
.if OkAnVSumKau5
 Б        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.end
.}
.if OkAnVSumKau4
 Б      @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.end
.}
.if OkAnVSumKau3
 Б    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.end
.}
.if OkAnVSumKau2
 Б  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.end
.}
.if OkAnVSumKau1
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.end
.}
.if OkAnVSumPodr
 БИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Б
.end
.}
.if OkAnVSumSub
 БИтого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.if OkSvertkaSubAnValut
 Б                                                                                                                                               &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.end
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════
.}
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnValut
.{ checkenter FeeSignersCycle_AnValut
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
 ББухгалтер
Ответственный за выпуск С
.end
.endform
!==============================================================================
.linkform 'anvalut_04' prototype is 'anvalut'
.group 'Аналитика по операциям в валюте отчетов'
.nameinlist 'Ведомость аналитического учета по операциям в валюте отчетов'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
CommonFormHeader
MyOrg
c00p1 c00p2
c0p2 c0p3
c1f1
c2f1 c2f2
c0p7 c0p7 c0p7 c0p7
c0p0
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c7p1 c7p2 c7p4 c7p5 c7p6 c7p8 c7p8v c7p9 c7p9v c7p10 c7p10v c7p11 c7p11v
c10p1       c6_p1 c6_p1v c6_p2 c6_p2v c6_p3 c6_p3v c6_p4 c6_p4v c6_p5 c6_p5v c6_p6 c6_p6v
c9p1        c10_p1 c10_p1v c10_p2 c10_p2v c10_p3 c10_p3v c10_p4 c10_p4v c10_p5 c10_p5v c10_p6 c10_p6v
c8p1        c9_p1 c9_p1v c9_p2 c9_p2v c9_p3 c9_p3v c9_p4 c9_p4v c9_p5 c9_p5v c9_p6 c9_p6v
c5p1        c8_p1 c8_p1v c8_p2 c8_p2v c8_p3 c8_p3v c8_p4 c8_p4v c8_p5 c8_p5v c8_p6 c8_p6v
c4p1       c5_p1 c5_p1v c5_p2 c5_p2v c5_p3 c5_p3v c5_p4 c5_p4v c5_p5 c5_p5v c5_p6 c5_p6v
c3p1       c4_p1 c4_p1v c4_p2 c4_p2v c4_p3 c4_p3v c4_p4 c4_p4v c4_p5 c4_p5v c4_p6 c4_p6v
c2p1       c3_p1 c3_p1v c3_p2 c3_p2v c3_p3 c3_p3v c3_p4 c3_p4v c3_p5 c3_p5v c3_p6 c3_p6v
c1p1 c1p1n c2_p1 c2_p1v c2_p2 c2_p2v c2_p3 c2_p3v c2_p4 c2_p4v c2_p5 c2_p5v c2_p6 c2_p6v
DSaldoIsh DSaldoIshV KSaldoIsh KSaldoIshV
c0p0       c1_p1 c1_p1v c1_p2 c1_p2v c1_p3 c1_p3v c1_p4 c1_p4v c1_p5 c1_p5v c1_p6 c1_p6v
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Щ^ Б
^

                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г.
.if OkFilAnV
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                                                                                                                                                                                                      лист @np@
──────────┬──────┬──────────────────────────────────────────────────────┬────────────────────────────────────────────────────────────────────┬────────────────────────────────────────────────────────────────────
          │      │            Корреспондирующий счет                    │                                                                    │
          │      ├──────┬───────┬───────────────────────────────────────┤                              Сальдо                                │                              Обороты
  Д а т а │ Номер│ Счет │ Суб-  │                                       ├─────────────────────────────────┬──────────────────────────────────┼─────────────────────────────────┬──────────────────────────────────
          │ доку-│      │ счет  │           Наименование КАУ            │            Дебет                │            Кредит                │            Дебет                │            Кредит
          │ мента│      │       │                                       ├──────────────┬──────────────────┼──────────────┬───────────────────┼──────────────┬──────────────────┼──────────────┬───────────────────
          │      │      │       │                                       │    в валюте  │    в @@@@@@@@    │    в валюте  │    в @@@@@@@@     │  в валюте    │    в @@@@@@@@    │   в валюте   │     в @@@@@@@@
──────────┴──────┴──────┴───────┴───────────────────────────────────────┴──────────────┴──────────────────┴──────────────┴───────────────────┴──────────────┴──────────────────┴──────────────┴───────────────────
.]h
Валюта : ^
.{
.if OkAnVSub
Субсчет : ^ ^
.end
.{
.if OkAnVPodr
Подразделение : ^
.end
.{
.if OkAnVKau1
Объект аналитического учета : ^
.end
.{
.if OkAnVKau2
  Объект аналитического учета : ^
.end
.{
.if OkAnVKau3
    Объект аналитического учета : ^
.end
.{
.if OkAnVKau4
      Объект аналитического учета : ^
.end
.{
.if OkAnVKau5
        Объект аналитического учета : ^
.end
.{
.if OkAnVKau6
          Объект аналитического учета : ^
.end
.{
.{
 Б@@@@@@@@@@ @@@@@@ @@@@@@ @@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'#&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &#'&&&&&&&&&&& &#'&&&&&&&&&&&&&&&& &'#&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&& &#'&&&&&&&&&&&&&&&& Б
.}
.}
.if OkAnVSumKau6
         БИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Входящее  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
                                                               Обороты                                                                        &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
                                                               Исходящее &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau5
 б        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Входящее  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
                                                               Обороты                                                                        &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
                                                               Исходящее &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
        ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau4
 б      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Входящее  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
                                                               Обороты                                                                        &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
                                                               Исходящее &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
      ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau3
 б    Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Входящее  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
                                                               Обороты                                                                        &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
                                                               Исходящее &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
    ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau2
 б  Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Входящее  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
                                                               Обороты                                                                        &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
                                                               Исходящее &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
  ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau1
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Входящее  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
                                                               Обороты                                                                        &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
                                                               Исходящее &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumPodr
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Входящее  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
                                                               Обороты                                                                        &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
                                                               Исходящее &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumSub
 бИтого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Входящее  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
                                                               Обороты                                                                        &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
                                                               Исходящее &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&& б
.if OkSvertkaSubAnValut
 б                                                                         &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&& б
.end
 б────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Входящее  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
                                                               Обороты                                                                        &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
                                                               Исходящее &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════ б
.}
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnValut
.{ checkenter FeeSignersCycle_AnValut
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
 аБухгалтер
Ответственный за выпуск ╕
.end
.endform
!==============================================================================
.linkform 'anvalut_05' prototype is 'anvalut'
.group 'Аналитика по содержанию в валюте отчетов'
.nameinlist '1. Ведомость аналитического учета по содержанию в валюте отчетов'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
CommonFormHeader
MyOrg
c00p1 c00p2
c0p2 c0p3
c0p6
c1f1
c2f1 c2f2
c0p0
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p7pl c7p7op c7p8v c7p9v c7p10v c7p11v
c10p1       c6_p1v c6_p2v c6_p3v c6_p4v c6_p5v c6_p6v
c9p1        c10_p1v c10_p2v c10_p3v c10_p4v c10_p5v c10_p6v
c8p1        c9_p1v c9_p2v c9_p3v c9_p4v c9_p5v c9_p6v
c5p1        c8_p1v c8_p2v c8_p3v c8_p4v c8_p5v c8_p6v
c4p1       c5_p1v c5_p2v c5_p3v c5_p4v c5_p5v c5_p6v
c3p1       c4_p1v c4_p2v c4_p3v c4_p4v c4_p5v c4_p6v
c2p1       c3_p1v c3_p2v c3_p3v c3_p4v c3_p5v c3_p6v
c1p1 c1p1n c2_p1v c2_p2v c2_p3v c2_p4v c2_p5v c2_p6v
DSaldoIshV KSaldoIshV
c0p0       c1_p1v c1_p2v c1_p3v c1_p4v c1_p5v c1_p6v
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 ╕^ а
 б^

                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г. б
 вВедомость сформирована в ^ в
.if OkFilAnV
 вПрименен фильтр... в
.{
 в   ^ в
.{
 в      ^ ^ в
.}
.}
.end
.{
.[h
 б                                                                                                                                                                                                       лист @np@
──────────┬──────┬───────────────────────────────────────────────┬────────────────────────────────┬───────────────────────────────────┬───────────────────────────────────────────────────────────────────────────
          │      │            Корреспондирующий счет             │                                │                                   │                                                    С у м м а
          │      ├────┬─────┬───────────────┬────────────────────┤                                │       С О Д Е Р Ж А Н И Е         ├─────────────────────────────────────┬─────────────────────────────────────
  Д а т а │ Номер│Счет│Суб- │               │                    │    ПЛАТЕЛЬЩИК / ПОЛУЧАТЕЛЬ     │                                   │                Сальдо               │               Обороты
          │ доку-│    │счет │ Подразделение │  Наименование КАУ  │                                │         О П Е Р А Ц И И           │                                     │
          │ мента│    │     │               │                    │                                │                                   ├──────────────────┬──────────────────┼──────────────────┬──────────────────
          │      │    │     │               │                    │                                │                                   │       Дебет      │     Кредит       │       Дебет      │      Кредит
──────────┴──────┴────┴─────┴───────────────┴────────────────────┴────────────────────────────────┴───────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴────────────────── б
.]h
 бВалюта : ^ б
.{
.if OkAnVSub
 бСубсчет : ^ ^ б
.end
.{
.if OkAnVPodr
 бПодразделение : ^ б
.end
.{
.if OkAnVKau1
 бОбъект аналитического учета : ^ б
.end
.{
.if OkAnVKau2
 б  Объект аналитического учета : ^ б
.end
.{
.if OkAnVKau3
 б    Объект аналитического учета : ^ б
.end
.{
.if OkAnVKau4
 б      Объект аналитического учета : ^ б
.end
.{
.if OkAnVKau5
 б        Объект аналитического учета : ^ б
.end
.{
.if OkAnVKau6
 б          Объект аналитического учета : ^ б
.end
.{
.{
 а@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'#&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& а
.}
.}
.if OkAnVSumKau6
 б          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                      Сальдо входящее   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Суммарные обороты                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Сальдо исходящее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau5
 б        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                      Сальдо входящее   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Суммарные обороты                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Сальдо исходящее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
        ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau4
 б      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                      Сальдо входящее   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Суммарные обороты                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Сальдо исходящее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau3
 б    Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                      Сальдо входящее   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Суммарные обороты                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Сальдо исходящее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
    ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau2
 б  Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                      Сальдо входящее   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Суммарные обороты                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Сальдо исходящее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
  ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau1
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                      Сальдо входящее   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Суммарные обороты                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Сальдо исходящее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumPodr
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                      Сальдо входящее   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Суммарные обороты                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Сальдо исходящее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumSub
 бИтого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                      Сальдо входящее   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Суммарные обороты                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Сальдо исходящее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& б
.if OkSvertkaSubAnValut
 б                                                                                                                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& б
.end
 б────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                      Сальдо входящее   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Суммарные обороты                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                     Сальдо исходящее  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════ б
.}
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnValut
.{ checkenter FeeSignersCycle_AnValut
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
 аБухгалтер
Ответственный за выпуск ╕
.end
.endform
!==============================================================================
.linkform 'anvalut_06' prototype is 'anvalut'
.group 'Аналитика по содержанию в валюте отчетов'
.nameinlist '2. Ведомость оборотов в валюте по содержанию (эквивалент в валюте отчетов)'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
CommonFormHeader
MyOrg
c00p1 c00p2
c0p2 c0p3
c1f1
c2f1 c2f2
c0p7 c0p7
c0p0
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p7pl c7p7op c7p10 c7p10v c7p11 c7p11v
c10p1       c6_p3 c6_p3v c6_p4 c6_p4v
c9p1        c10_p3 c10_p3v c10_p4 c10_p4v
c8p1        c9_p3 c9_p3v c9_p4 c9_p4v
c5p1        c8_p3 c8_p3v c8_p4 c8_p4v
c4p1       c5_p3 c5_p3v c5_p4 c5_p4v
c3p1       c4_p3 c4_p3v c4_p4 c4_p4v
c2p1       c3_p3 c3_p3v c3_p4 c3_p4v
c1p1 c1p1n c2_p3 c2_p3v c2_p4 c2_p4v
c0p0       c1_p3 c1_p3v c1_p4 c1_p4v
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 ╕^ а
 б^

                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г. б
.if OkFilAnV
 вПрименен фильтр... в
.{
 в   ^ в
.{
 в      ^ ^ в
.}
.}
.end
.{
.[h
 б                                                                                                                                                                                      лист @np@
──────────┬──────┬───────────────────────────────────────────────┬────────────────────────────────┬───────────────────────────────────┬───────────────────────────────────────────────────────────────────────────
          │      │            Корреспондирующий счет             │                                │                                   │
          │      ├────┬─────┬───────────────┬────────────────────┤                                │       С О Д Е Р Ж А Н И Е         │                                  Обороты
  Д а т а │ Номер│Счет│Суб- │               │                    │    ПЛАТЕЛЬЩИК / ПОЛУЧАТЕЛЬ     │                                   ├─────────────────────────────────────┬─────────────────────────────────────
          │ доку-│    │счет │ Подразделение │  Наименование КАУ  │                                │         О П Е Р А Ц И И           │                Дебет                │                Кредит
          │ мента│    │     │               │                    │                                │                                   ├──────────────────┬──────────────────┼──────────────────┬──────────────────
          │      │    │     │               │                    │                                │                                   │     в валюте     │     в @@@@@@     │      в валюте    │     в @@@@@@
──────────┴──────┴────┴─────┴───────────────┴────────────────────┴────────────────────────────────┴───────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴────────────────── б
.]h
 бВалюта : ^ б
.{
.if OkAnVSub
 бСубсчет : ^ ^ б
.end
.{
.if OkAnVPodr
 бПодразделение : ^ б
.end
.{
.if OkAnVKau1
 бОбъект аналитического учета : ^ б
.end
.{
.if OkAnVKau2
 б  Объект аналитического учета : ^ б
.end
.{
.if OkAnVKau3
 б    Объект аналитического учета : ^ б
.end
.{
.if OkAnVKau4
 б      Объект аналитического учета : ^ б
.end
.{
.if OkAnVKau5
 б        Объект аналитического учета : ^ б
.end
.{
.if OkAnVKau6
 б          Объект аналитического учета : ^ б
.end
.{
.{
 а@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'#&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& а
.}
.}
.if OkAnVSumKau6
 б          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau5
 б        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
        ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau4
 б      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau3
 б    Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
    ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau2
 б  Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
  ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau1
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumPodr
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumSub
 бИтого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& б
.if OkSvertkaSubAnValut
.end
 б────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                                  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════ б
.}
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnValut
.{ checkenter FeeSignersCycle_AnValut
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
 аБухгалтер
Ответственный за выпуск ╕
.end
.endform
!==============================================================================
.linkform 'anvalut_07' prototype is 'anvalut'
.group 'Аналитика по оборотам в валюте отчетов'
.nameinlist 'Ведомость оборотов в валюте (эквивалент в валюте отчетов)'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
CommonFormHeader
MyOrg
c00p1 c00p2
c0p2 c0p3
c1f1
c2f1 c2f2
c0p7 c0p7 c0p7 c0p7
c0p0
c1p1 c1p1n
c2p1
c10p1       c6_p1 c6_p1v c6_p2 c6_p2v c6_p3 c6_p3v c6_p4 c6_p4v c6_p5 c6_p5v c6_p6 c6_p6v
c9p1        c10_p1 c10_p1v c10_p2 c10_p2v c10_p3 c10_p3v c10_p4 c10_p4v c10_p5 c10_p5v c10_p6 c10_p6v
c8p1        c9_p1 c9_p1v c9_p2 c9_p2v c9_p3 c9_p3v c9_p4 c9_p4v c9_p5 c9_p5v c9_p6 c9_p6v
c5p1        c8_p1 c8_p1v c8_p2 c8_p2v c8_p3 c8_p3v c8_p4 c8_p4v c8_p5 c8_p5v c8_p6 c8_p6v
c4p1       c5_p1 c5_p1v c5_p2 c5_p2v c5_p3 c5_p3v c5_p4 c5_p4v c5_p5 c5_p5v c5_p6 c5_p6v
c3p1       c4_p1 c4_p1v c4_p2 c4_p2v c4_p3 c4_p3v c4_p4 c4_p4v c4_p5 c4_p5v c4_p6 c4_p6v
c2p1       c3_p1 c3_p1v c3_p2 c3_p2v c3_p3 c3_p3v c3_p4 c3_p4v c3_p5 c3_p5v c3_p6 c3_p6v
c1p1 c1p1n c2_p1 c2_p1v c2_p2 c2_p2v c2_p3 c2_p3v c2_p4 c2_p4v c2_p5 c2_p5v c2_p6 c2_p6v
DSaldoIsh DSaldoIshV KSaldoIsh KSaldoIshV
c0p0       c1_p1 c1_p1v c1_p2 c1_p2v c1_p3 c1_p3v c1_p4 c1_p4v c1_p5 c1_p5v c1_p6 c1_p6v
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 ░^ а
 б^

                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г. б
.if OkFilAnV
 вПрименен фильтр... в
.{
 в   ^ в
.{
 в      ^ ^ в
.}
.}
.end
.{
.[h
 б                                                                                                                                                                      лист @np@
──────────────────────────────────────────────────┬────────────────────────────────────────────────────────────────┬────────────────────────────────────────────────────────────────
                                                  │                                                                │
                                                  │                            Сальдо                              │                            Обороты
       Объект аналитического учета                ├───────────────────────────────┬────────────────────────────────┼───────────────────────────────┬────────────────────────────────
                                                  │            Дебет              │            Кредит              │            Дебет              │            Кредит
                                                  ├──────────────┬────────────────┼──────────────┬─────────────────┼──────────────┬────────────────┼──────────────┬─────────────────
                                                  │    в валюте  │    в @@@@@@    │    в валюте  │    в @@@@@@     │  в валюте    │    в @@@@@@    │   в валюте   │     в @@@@@@
──────────────────────────────────────────────────┴──────────────┴────────────────┴──────────────┴─────────────────┴──────────────┴────────────────┴──────────────┴───────────────── б
.]h
 бВалюта : ^ б
.{
.if OkAnVSub
 бСубсчет : ^ ^ б
.end
.{
.if OkAnVPodr
 бПодразделение : ^ б
.end
.{
.if OkAnVKau1
.end
.{
.if OkAnVKau2
.end
.{
.if OkAnVKau3
.end
.{
.if OkAnVKau4
.end
.{
.if OkAnVKau5
.end
.{
.if OkAnVKau6
.end
.{
.{
.}
.}
.if OkAnVSumKau6
 б          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                                                                                    &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& б
.end
.}
.if OkAnVSumKau5
 б        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                                                                                    &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& б
.end
.}
.if OkAnVSumKau4
 б      @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                                                                                    &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& б
.end
.}
.if OkAnVSumKau3
 б    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                                                                                    &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& б
.end
.}
.if OkAnVSumKau2
 б  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                                                                                    &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& б
.end
.}
.if OkAnVSumKau1
 б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                                                                                    &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& б
.end
.}
.if OkAnVSumPodr
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                                                                                    &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumSub
 бИтого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                                                                                    &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& б
.if OkSvertkaSubAnValut
 б                                                   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& б
.end
 б──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                                                                                    &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════ б
.}
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnValut
.{ checkenter FeeSignersCycle_AnValut
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
 аБухгалтер
Ответственный за выпуск ░
.end
.endform
!==============================================================================
.linkform 'anvalut_08' prototype is 'anvalut'
.group 'Аналитика по операциям в национальной ДЕ'
.nameinlist 'Ведомость оборотов по операциям в валюте (эквивалент в национальной ДЕ)'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
CommonFormHeader
MyOrg
c00p1 c00p2
c0p2 c0p3
c1f1
c2f1 c2f2
c0p5 c0p5 c0p5 c0p5
c0p0
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c7p1 c7p2 c7p4 c7p5 c7p6 c7p8 c7p8r c7p9 c7p9r c7p10 c7p10r c7p11 c7p11r
c10p1       c6_p1 c6_p1r c6_p2 c6_p2r c6_p3 c6_p3r c6_p4 c6_p4r c6_p5 c6_p5r c6_p6 c6_p6r
c9p1        c10_p1 c10_p1r c10_p2 c10_p2r c10_p3 c10_p3r c10_p4 c10_p4r c10_p5 c10_p5r c10_p6 c10_p6r
c8p1        c9_p1 c9_p1r c9_p2 c9_p2r c9_p3 c9_p3r c9_p4 c9_p4r c9_p5 c9_p5r c9_p6 c9_p6r
c5p1        c8_p1 c8_p1r c8_p2 c8_p2r c8_p3 c8_p3r c8_p4 c8_p4r c8_p5 c8_p5r c8_p6 c8_p6r
c4p1       c5_p1 c5_p1r c5_p2 c5_p2r c5_p3 c5_p3r c5_p4 c5_p4r c5_p5 c5_p5r c5_p6 c5_p6r
c3p1       c4_p1 c4_p1r c4_p2 c4_p2r c4_p3 c4_p3r c4_p4 c4_p4r c4_p5 c4_p5r c4_p6 c4_p6r
c2p1       c3_p1 c3_p1r c3_p2 c3_p2r c3_p3 c3_p3r c3_p4 c3_p4r c3_p5 c3_p5r c3_p6 c3_p6r
c1p1 c1p1n c2_p1 c2_p1r c2_p2 c2_p2r c2_p3 c2_p3r c2_p4 c2_p4r c2_p5 c2_p5r c2_p6 c2_p6r
DSaldoIsh DSaldoIshR KSaldoIsh KSaldoIshR
c0p0       c1_p1 c1_p1r c1_p2 c1_p2r c1_p3 c1_p3r c1_p4 c1_p4r c1_p5 c1_p5r c1_p6 c1_p6r
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 ╕^ а
 б^

                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г. б
.if OkFilAnV
 вПрименен фильтр... в
.{
 в   ^ в
.{
 в      ^ ^ в
.}
.}
.end
.{
.[h
 б                                                                                                                                                                                        лист @np@
──────────┬──────┬──────────────────────────────────────────────────────────────┬────────────────────────────────────────────────────────────────┬────────────────────────────────────────────────────────────────
          │      │                    Корреспондирующий счет                    │                                                                │
          │      ├──────┬───────┬───────────────────────────────────────────────┤                             Сальдо                             │                            Обороты
  Д а т а │ Номер│ Счет │  Суб- │                                               ├───────────────────────────────┬────────────────────────────────┼───────────────────────────────┬────────────────────────────────
          │ доку-│      │  счет │               Наименование КАУ                │            Дебет              │            Кредит              │            Дебет              │            Кредит
          │ мента│      │       │                                               ├──────────────┬────────────────┼──────────────┬─────────────────┼──────────────┬────────────────┼──────────────┬─────────────────
          │      │      │       │                                               │    в валюте  │    в @@@@@@    │    в валюте  │    в @@@@@@     │  в валюте    │    в @@@@@@    │   в валюте   │     в @@@@@@
──────────┴──────┴──────┴───────┴───────────────────────────────────────────────┴──────────────┴────────────────┴──────────────┴─────────────────┴──────────────┴────────────────┴──────────────┴───────────────── б
.]h
 бВалюта : ^ б
.{
.if OkAnVSub
 бСубсчет : ^ ^ б
.end
.{
.if OkAnVPodr
 бПодразделение : ^ б
.end
.{
.if OkAnVKau1
 бОбъект аналитического учета : ^ б
.end
.{
.if OkAnVKau2
 б  Объект аналитического учета : ^ б
.end
.{
.if OkAnVKau3
 б    Объект аналитического учета : ^ б
.end
.{
.if OkAnVKau4
 б      Объект аналитического учета : ^ б
.end
.{
.if OkAnVKau5
 б        Объект аналитического учета : ^ б
.end
.{
.if OkAnVKau6
 б          Объект аналитического учета : ^ б
.end
.{
.{
 а@@@@@@@@@@ @@@@@@ @@@@@@ @@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'#&&&&&&&&&&& &'#&&&&&&&&&&&&& &#'&&&&&&&&&&& &#'&&&&&&&&&&&&&& &'#&&&&&&&&&&& &'#&&&&&&&&&&&&& &'#&&&&&&&&&&& &#'&&&&&&&&&&&&&& а
.}
.}
.if OkAnVSumKau6
 б          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Сальдо входящее   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                               Суммарные обороты                                                                  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                               Сальдо исходящее  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau5
 б        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Сальдо входящее   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                               Суммарные обороты                                                                  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                               Сальдо исходящее  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
        ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau4
 б      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Сальдо входящее   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                               Суммарные обороты                                                                  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                               Сальдо исходящее  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
      ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau3
 б    Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Сальдо входящее   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                               Суммарные обороты                                                                  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                               Сальдо исходящее  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
    ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau2
 б  Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Сальдо входящее   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                               Суммарные обороты                                                                  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                               Сальдо исходящее  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
  ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau1
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Сальдо входящее   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                               Суммарные обороты                                                                  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                               Сальдо исходящее  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumPodr
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Сальдо входящее   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                               Суммарные обороты                                                                  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                               Сальдо исходящее  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumSub
 бИтого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Сальдо входящее   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                               Суммарные обороты                                                                  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                               Сальдо исходящее  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& б
.if OkSvertkaSubAnValut
 б                                                                                 &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& б
.end
 б────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Сальдо входящее   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                               Суммарные обороты                                                                  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                               Сальдо исходящее  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════ б
.}
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnValut
.{ checkenter FeeSignersCycle_AnValut
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
 аБухгалтер
Ответственный за выпуск ╕
.end
.endform
!==============================================================================
.linkform 'anvalut_09' prototype is 'anvalut'
.group 'Аналитика по содержанию в национальной ДЕ'
.nameinlist '1. Оборотная ведомость по содержанию в валюте (эквивалент в национальной ДЕ)'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
CommonFormHeader
MyOrg
c00p1 c00p2
c0p2 c0p3
c1f1
c2f1 c2f2
c0p5 c0p5
c0p0 c0p11 c0p12
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p7pl c7p7op c7p10 c7p10r c7p11 c7p11r c7p21 c7p22
c10p1      c6_p1 c6_p1r c6_p2 c6_p2r c6_p3 c6_p3r c6_p4 c6_p4r c6_p5 c6_p5r c6_p6 c6_p6r
c9p1       c10_p1 c10_p1r c10_p2 c10_p2r c10_p3 c10_p3r c10_p4 c10_p4r c10_p5 c10_p5r c10_p6 c10_p6r
c8p1       c9_p1 c9_p1r c9_p2 c9_p2r c9_p3 c9_p3r c9_p4 c9_p4r c9_p5 c9_p5r c9_p6 c9_p6r
c5p1       c8_p1 c8_p1r c8_p2 c8_p2r c8_p3 c8_p3r c8_p4 c8_p4r c8_p5 c8_p5r c8_p6 c8_p6r
c4p1       c5_p1 c5_p1r c5_p2 c5_p2r c5_p3 c5_p3r c5_p4 c5_p4r c5_p5 c5_p5r c5_p6 c5_p6r
c3p1       c4_p1 c4_p1r c4_p2 c4_p2r c4_p3 c4_p3r c4_p4 c4_p4r c4_p5 c4_p5r c4_p6 c4_p6r
c2p1       c3_p1 c3_p1r c3_p2 c3_p2r c3_p3 c3_p3r c3_p4 c3_p4r c3_p5 c3_p5r c3_p6 c3_p6r
c1p1 c1p1n c2_p1 c2_p1r c2_p2 c2_p2r c2_p3 c2_p3r c2_p4 c2_p4r c2_p5 c2_p5r c2_p6 c2_p6r
DSaldoIsh DSaldoIshR KSaldoIsh KSaldoIshR
c0p0       c1_p1 c1_p1r c1_p2 c1_p2r c1_p3 c1_p3r c1_p4 c1_p4r c1_p5 c1_p5r c1_p6 c1_p6r
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 ╕^ а
 б^

                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г. б
.if OkFilAnV
 вПрименен фильтр... в
.{
 в   ^ в
.{
 в      ^ ^ в
.}
.}
.end
.{
.[h
 б                                                                                                                                                                                                             лист @np@
──────────┬──────┬──────────────────────────────────────────────────┬───────────────────────────────┬─────────────────────────────┬───────────────────────────────────────────────────────────────┬─────────┬───────────
          │      │            Корреспондирующий счет                │                               │                             │                                                               │         │
          │      ├────┬─────┬───────────────┬───────────────────────┤                               │       С О Д Е Р Ж А Н И Е   │                            Обороты                            │  Курс   │  Курсовая
  Д а т а │ Номер│Счет│Суб- │               │                       │   ПЛАТЕЛЬЩИК / ПОЛУЧАТЕЛЬ     │                             ├───────────────────────────────┬───────────────────────────────┤на момент│  разница
          │ доку-│    │счет │ Подразделение │    Наименование КАУ   │                               │         О П Е Р А Ц И И     │            Дебет              │            Кредит             │операции │  валют
          │ мента│    │     │               │                       │                               │                             ├──────────────┬────────────────┼──────────────┬────────────────┤         │
          │      │    │     │               │                       │                               │                             │   в валюте   │     в @@@@@@   │    в валюте  │    в @@@@@@    │         │
──────────┴──────┴────┴─────┴───────────────┴───────────────────────┴───────────────────────────────┴─────────────────────────────┴──────────────┴────────────────┴──────────────┴────────────────┴─────────┴─────────── б
.]h
 бВалюта : ^, курс на ^ составил ^ б
.{
.if OkAnVSub
 бСубсчет : ^ ^ б
.end
.{
.if OkAnVPodr
 бПодразделение : ^ б
.end
.{
.if OkAnVKau1
 бОбъект аналитического учета : ^ б
.end
.{
.if OkAnVKau2
 б  Объект аналитического учета : ^ б
.end
.{
.if OkAnVKau3
 б    Объект аналитического учета : ^ б
.end
.{
.if OkAnVKau4
 б      Объект аналитического учета : ^ б
.end
.{
.if OkAnVKau5
 б        Объект аналитического учета : ^ б
.end
.{
.if OkAnVKau6
 б          Объект аналитического учета : ^ б
.end
.{
.{
 а@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&& &#'&&&&&&&&&&&&& &#'&&&&&&&&&&& &#'&&&&&&&&&&&&& &&&&&&&&& &#'&&&&&&&& а
.}
.}
.if OkAnVSumKau6
 б          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  (остаток входящий)                                           &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                                      (обороты)                                                    &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                                      (остаток исходящий)                                          &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
          ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau5
 б        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  (остаток входящий)                                           &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                                      (обороты)                                                    &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                                      (остаток исходящий)                                          &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
        ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau4
 б      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  (остаток входящий)                                           &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                                      (обороты)                                                    &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                                      (остаток исходящий)                                          &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
      ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau3
 б    Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  (остаток входящий)                                           &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                                      (обороты)                                                    &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                                      (остаток исходящий)                                          &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
    ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau2
 б  Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  (остаток входящий)                                           &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                                      (обороты)                                                    &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                                      (остаток исходящий)                                          &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
  ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau1
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  (остаток входящий)                                           &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                                      (обороты)                                                    &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                                      (остаток исходящий)                                          &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumPodr
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  (остаток входящий)                                           &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                                      (обороты)                                                    &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                                      (остаток исходящий)                                          &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumSub
 бИтого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  (остаток входящий)                                           &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                                      (обороты)                                                    &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                                      (остаток исходящий)                                          &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& б
.if OkSvertkaSubAnValut
 б                                                                                                                                   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& б
.end
 б──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  (остаток входящий)                                           &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                                      (обороты)                                                    &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
                                                                      (остаток исходящий)                                          &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&
════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════ б
.}
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnValut
.{ checkenter FeeSignersCycle_AnValut
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
 аБухгалтер
Ответственный за выпуск ╕
.end
.endform
!==============================================================================
.linkform 'anvalut_10' prototype is 'anvalut'
.group 'Аналитика по содержанию в национальной ДЕ'
.nameinlist '2. Ведомость аналитического учета по содержанию в национальной ДЕ'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
CommonFormHeader
MyOrg
c00p1 c00p2
c0p2 c0p3
c0p4
c1f1
c2f1 c2f2
c0p0
c1p1 c1p1n
c2p1
c3p1
c4p1
c5p1
c8p1
c9p1
c10p1
c7p1 c7p2 c7p4 c7p5 c7p7 c7p6 c7p7pl c7p7op c7p8r c7p9r c7p10r c7p11r
c10p1       c6_p1r c6_p2r c6_p3r c6_p4r c6_p5r c6_p6r
c9p1        c10_p1r c10_p2r c10_p3r c10_p4r c10_p5r c10_p6r
c8p1        c9_p1r c9_p2r c9_p3r c9_p4r c9_p5r c9_p6r
c5p1        c8_p1r c8_p2r c8_p3r c8_p4r c8_p5r c8_p6r
c4p1       c5_p1r c5_p2r c5_p3r c5_p4r c5_p5r c5_p6r
c3p1       c4_p1r c4_p2r c4_p3r c4_p4r c4_p5r c4_p6r
c2p1       c3_p1r c3_p2r c3_p3r c3_p4r c3_p5r c3_p6r
c1p1 c1p1n c2_p1r c2_p2r c2_p3r c2_p4r c2_p5r c2_p6r
DSaldoIshR KSaldoIshR
c0p0       c1_p1r c1_p2r c1_p3r c1_p4r c1_p5r c1_p6r
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 ╕^ а
 б^

                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г. б
 вВедомость сформирована в ^ в
.if OkFilAnV
 вПрименен фильтр... в
.{
 в   ^ в
.{
 в      ^ ^ в
.}
.}
.end
.{
.[h
 б                                                                                                                                                                                                       лист @np@
──────────┬──────┬───────────────────────────────────────────────┬────────────────────────────────┬───────────────────────────────────┬───────────────────────────────────────────────────────────────────────────
          │      │            Корреспондирующий счет             │                                │                                   │                                                    С у м м а
          │      ├────┬─────┬───────────────┬────────────────────┤                                │       С О Д Е Р Ж А Н И Е         ├─────────────────────────────────────┬─────────────────────────────────────
  Д а т а │ Номер│Счет│Суб- │               │                    │    ПЛАТЕЛЬЩИК / ПОЛУЧАТЕЛЬ     │                                   │                Сальдо               │               Обороты
          │ доку-│    │счет │ Подразделение │  Наименование КАУ  │                                │         О П Е Р А Ц И И           │                                     │
          │ мента│    │     │               │                    │                                │                                   ├──────────────────┬──────────────────┼──────────────────┬──────────────────
          │      │    │     │               │                    │                                │                                   │       Дебет      │     Кредит       │       Дебет      │      Кредит
──────────┴──────┴────┴─────┴───────────────┴────────────────────┴────────────────────────────────┴───────────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴────────────────── б
.]h
 бВалюта : ^ б
.{
.if OkAnVSub
 бСубсчет : ^ ^ б
.end
.{
.if OkAnVPodr
 бПодразделение : ^ б
.end
.{
.if OkAnVKau1
 бОбъект аналитического учета : ^ б
.end
.{
.if OkAnVKau2
 б  Объект аналитического учета : ^ б
.end
.{
.if OkAnVKau3
 б    Объект аналитического учета : ^ б
.end
.{
.if OkAnVKau4
 б      Объект аналитического учета : ^ б
.end
.{
.if OkAnVKau5
 б        Объект аналитического учета : ^ б
.end
.{
.if OkAnVKau6
 б          Объект аналитического учета : ^ б
.end
.{
.{
 а@@@@@@@@@@ @@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& а
.}
.}
.if OkAnVSumKau6
 б          Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                  (остаток входящий)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                 (обороты)                                                   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                 (остаток исходящий)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau5
 б        Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                  (остаток входящий)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                 (обороты)                                                   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                 (остаток исходящий)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
        ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau4
 б      Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                  (остаток входящий)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                 (обороты)                                                   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                 (остаток исходящий)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau3
 б    Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                  (остаток входящий)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                 (обороты)                                                   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                 (остаток исходящий)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
    ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau2
 б  Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                  (остаток входящий)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                 (обороты)                                                   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                 (остаток исходящий)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
  ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumKau1
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                  (остаток входящий)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                 (обороты)                                                   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                 (остаток исходящий)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumPodr
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                  (остаток входящий)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                 (обороты)                                                   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                 (остаток исходящий)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumSub
 бИтого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                  (остаток входящий)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                 (обороты)                                                   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                 (остаток исходящий)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& б
.if OkSvertkaSubAnValut
 б                                                                                                                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& б
.end
 б────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                  (остаток входящий)    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                 (обороты)                                                   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                                                                                                 (остаток исходящий)   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════ б
.}
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnValut
.{ checkenter FeeSignersCycle_AnValut
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
 аБухгалтер
Ответственный за выпуск ╕
.end
.endform
!==============================================================================
.linkform 'anvalut_11' prototype is 'anvalut'
.group 'Аналитика по оборотам в национальной ДЕ'
.nameinlist 'Ведомость оборотов в валюте (эквивалент в национальной ДЕ)'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
CommonFormHeader
MyOrg
c00p1 c00p2
c0p2 c0p3
c1f1
c2f1 c2f2
c0p5 c0p5 c0p5 c0p5
c0p0
c1p1 c1p1n
c2p1
c10p1      c6_p1 c6_p1r c6_p2 c6_p2r c6_p3 c6_p3r c6_p4 c6_p4r c6_p5 c6_p5r c6_p6 c6_p6r
c9p1       c10_p1 c10_p1r c10_p2 c10_p2r c10_p3 c10_p3r c10_p4 c10_p4r c10_p5 c10_p5r c10_p6 c10_p6r
c8p1       c9_p1 c9_p1r c9_p2 c9_p2r c9_p3 c9_p3r c9_p4 c9_p4r c9_p5 c9_p5r c9_p6 c9_p6r
c5p1       c8_p1 c8_p1r c8_p2 c8_p2r c8_p3 c8_p3r c8_p4 c8_p4r c8_p5 c8_p5r c8_p6 c8_p6r
c4p1       c5_p1 c5_p1r c5_p2 c5_p2r c5_p3 c5_p3r c5_p4 c5_p4r c5_p5 c5_p5r c5_p6 c5_p6r
c3p1       c4_p1 c4_p1r c4_p2 c4_p2r c4_p3 c4_p3r c4_p4 c4_p4r c4_p5 c4_p5r c4_p6 c4_p6r
c2p1       c3_p1 c3_p1r c3_p2 c3_p2r c3_p3 c3_p3r c3_p4 c3_p4r c3_p5 c3_p5r c3_p6 c3_p6r
c1p1 c1p1n c2_p1 c2_p1r c2_p2 c2_p2r c2_p3 c2_p3r c2_p4 c2_p4r c2_p5 c2_p5r c2_p6 c2_p6r
DSaldoIsh DSaldoIshR KSaldoIsh KSaldoIshR
c0p0       c1_p1 c1_p1r c1_p2 c1_p2r c1_p3 c1_p3r c1_p4 c1_p4r c1_p5 c1_p5r c1_p6 c1_p6r
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 ░^ а
 б^

                            Ведомость аналитического учета по счету
                       ^ - ^
                                      с ^ г. по ^ г. б
.if OkFilAnV
 вПрименен фильтр... в
.{
 в   ^ в
.{
 в      ^ ^ в
.}
.}
.end
.{
.[h
 б                                                                                                                                                                     лист @np@
─────────────────────────────────────────────────┬────────────────────────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────
                                                 │                                                                │
                                                 │                            сальдо                              │                             Обороты
       Объект аналитического учета               ├───────────────────────────────┬────────────────────────────────┼────────────────────────────────┬────────────────────────────────
                                                 │            Дебет              │            Кредит              │            Дебет               │            Кредит
                                                 ├──────────────┬────────────────┼──────────────┬─────────────────┼──────────────┬─────────────────┼──────────────┬─────────────────
                                                 │    в валюте  │    в @@@@@@    │    в валюте  │    в @@@@@@     │  в валюте    │    в @@@@@@     │   в валюте   │     в @@@@@@
─────────────────────────────────────────────────┴──────────────┴────────────────┴──────────────┴─────────────────┴──────────────┴─────────────────┴──────────────┴───────────────── б
.]h
 бВалюта : ^ б
.{
.if OkAnVSub
 бСубсчет : ^ ^ б
.end
.{
.if OkAnVPodr
 бПодразделение : ^ б
.end
.{
.if OkAnVKau1
.end
.{
.if OkAnVKau2
.end
.{
.if OkAnVKau3
.end
.{
.if OkAnVKau4
.end
.{
.if OkAnVKau5
.end
.{
.if OkAnVKau6
.end
.{
.{
.}
.}
.if OkAnVSumKau6
 б          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                                                                                   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& б
.end
.}
.if OkAnVSumKau5
 б        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                                                                                   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& б
.end
.}
.if OkAnVSumKau4
 б      @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                                                                                   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& б
.end
.}
.if OkAnVSumKau3
 б    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                                                                                   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& б
.end
.}
.if OkAnVSumKau2
 б  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                                                                                   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& б
.end
.}
.if OkAnVSumKau1
 б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                                                                                   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& б
.end
.}
.if OkAnVSumPodr
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                                                                                   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
.if OkAnVSumSub
 бИтого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                                                                                   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& б
.if OkSvertkaSubAnValut
 б                                                  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& б
.end
 б──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── б
.end
.}
 бИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                                                                                   &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
                                                  &'&&&&&&&&&&&& &'&&&&&&&&&&&&&& &'&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════ б
.}
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnValut
.{ checkenter FeeSignersCycle_AnValut
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
 аБухгалтер
Ответственный за выпуск ░
.end
.endform
!==============================================================================
