//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
//------------------------------------------------------------------------------
// Галактика 5.8 - ФРО
// Кассовая книга, валютная касса, ежедневный учет по счету
//------------------------------------------------------------------------------

// Внимание! Существует slk-отчет по Ежедневному учету (копии всех присоединенных форм)

#doc
Базовая форма отчета "Кассовая книга, валютная касса, ежедневный учет по счету"
#end
.set name = 'DayUchVed'
!---------------------
! Кассовая книга рублевая
!---------------------
!.group 'DayUchRub_f1'
!.group 'DayUchRub_f2'
!.group 'DayUchRub_f3'
!.group 'KassaRus_f1'
!.group 'KassaBel_f1'
!---------------------
! Кассовая книга валютная
!---------------------
!.group 'DayUchVal_f1'
!.group 'DayUchVal_f2'
!.group 'DayUchVal_f3'
!.group 'DayUchBel'
!---------------------
! Ежедневный учет
!---------------------
!.group 'DayUch51_f1'
!.group 'DayUch51_f1'
!.group 'DayUch51_f1'
!---------------------
.nameinlist 'Базовая форма'
.hide
.var
  ShowDigit : word
  wKau      : tTabKau
  cKau      : tGetKau
  iSchet26  : ShowSchet26
  BudjSchet : string
  Compatibility: boolean;
.endvar
.begin
  ShowDigit := wGetTune('Fin.ShowDigit');
end.
.fields
! интервал
ИнтерДат
! месяц
МесяцДаты : integer
! дата DD mon YYYY
ДатаКассы
! счет и его имя
НомОсСчета ИмяОсСчета
! наименование кассы/раздела расчетного счета
ИмяРаздела
! наименование валюты (для валютной кассы)
ИмяТекВал
! субсчет и его имя (для валютной кассы)
НомОсСуб ИмяОсСуб
! символы НДЕ и БВ
СимвНДЕ СимвБВ
! наименование НДЕ и БВ
ИмяНДЕ ИмяБВ
! номер очередного листа с начала года
НомЛиста : integer
! количество листов с начала месяца
КолЛистов : integer
c1f1
c2f1 c2f2
!----------------------------------------------
! символ валют по страницам
СимвНДЕ_П СимвБВ_П СимвНДЕ_Р СимвБВ_Р

! входящее сальдо
ДатаВхСал
  ВхСалНДЕ : double
  ВхСалВал : double
  ВхСалБВ  : double
  БюджВхСалНДЕ : double
  БюджВхСалВал : double
  БюджВхСалБВ  : double
ПропущеноДней
ВалютаГруппир КурсВалГруппир
! обороты
OborotNRec НоДок СодОпер SchetKs КорСчет КорСуб ПлатПол
! аналитика
KauKsTbl1 : word   KauKsNrec1 : comp
KauKsTbl2 : word   KauKsNrec2 : comp
KauKsTbl3 : word   KauKsNrec3 : comp
KauKsTbl4 : word   KauKsNrec4 : comp
KauKsTbl5 : word   KauKsNrec5 : comp
KauKsTbl6 : word   KauKsNrec6 : comp

  ПрихНДЕ        : double
  ПрихВал        : double
  ПрихБВ         : double
  РасхНДЕ        : double
  РасхВал        : double
  РасхБВ         : double
  БюджПрихНДЕ    : double
  БюджПрихВал    : double
  БюджПрихБВ     : double
  БюджРасхНДЕ    : double
  БюджРасхВал    : double
  БюджРасхБВ     : double
! суммы
! СумНДЕ_П СумВал_П СумБВ_П СумНДЕ_Р СумВал_Р СумБВ_Р
!----------------------------------------------
! итоговые суммы  (приход-расход-остаток)
  ИсхПрихНДЕ     : double
  ИсхПрихВал     : double
  ИсхПрихБВ      : double
  ИсхРасхНДЕ     : double
  ИсхРасхВал     : double
  ИсхРасхБВ      : double
  ИсхСалНДЕ      : double
  ИсхСалВал      : double
  ИсхСалБВ       : double
! итоговые суммы по внебюджету (приход-расход-остаток)
  БюджИсхПрихНДЕ : double
  БюджИсхПрихВал : double
  БюджИсхПрихБВ  : double
  БюджИсхРасхНДЕ : double
  БюджИсхРасхВал : double
  БюджИсхРасхБВ  : double
  БюджИсхСалНДЕ  : double
  БюджИсхСалВал  : double
  БюджИсхСалБВ   : double
! на зарплату (только для кассы)
  ЗарплНДЕ       : double
  ЗарплВал       : double
  ЗарплБВ        : double
  БюджЗарплНДЕ   : double
  БюджЗарплВал   : double
! кол-во документов (только для кассы)
КолДок_1 КолДок_2 КолДок_3
КолДокПрих КолДокРасх
ФИОКассира ГлавБух РукПред ДолжРук

// Подписанты
  Руководитель_ФИО       : string
  Руководитель_Должн     : string
  Руководитель_Роль      : string

  ГлавБух_ФИО            : string
  ГлавБух_Должн          : string
  ГлавБух_Роль           : string

  Кассир_ФИО             : string
  Кассир_Должн           : string
  Кассир_Роль            : string

.endfields
ИнтерДат  ^
МесяцДаты  ^
ДатаКассы  ^
НомОсСчета ^
ИмяОсСчета ^
ИмяРаздела ^
ИмяТекВал  ^
НомОсСуб   ^
ИмяОсСуб   ^
СимвНДЕ    ^
СимвБВ     ^
ИмяНДЕ     ^
ИмяБВ      ^
НомЛиста   ^
КолЛистов  ^
!Фильтры
.if OkFilDch
.{
c1f1 ^
.{
c2f1 ^
c2f2 ^
.}
.}
.end
! нумерация страниц
.{
Лист @np@
! Цикл по валютам
.begin
  // ПИР 102.53967
  // установим параметр в нужное значение непосредственно перед переводом страницы
  // (из-за чего и существует проблема) и восстановим сразу после.
  // т.к. могут прервать формирование отчета, и параметр может не восстановиться
  Compatibility := GetBooleanParameter('Forms', 'Compatibility', 0);
  SetBooleanParameter('Forms', 'Compatibility', 0, false);
end.
.{
.[h
СимвНДЕ_П ^
СимвБВ_П  ^
СимвНДЕ_Р ^
СимвБВ_Р  ^
.]h
.if KassaVhSaldoDay
ДатаВхСал ^
ВхСалНДЕ  ^
ВхСалВал  ^
ВхСалБВ   ^
БюджВхСалНДЕ ^
БюджВхСалВал ^
БюджВхСалБВ  ^
ПропущеноДней ^
ВалютаГруппир ^
КурсВалГруппир ^
.end
! Цикл по документам
.{
OborotNRec ^
НоДок     ^
СодОпер   ^
SchetKs   ^
КорСчет   ^
КорСуб    ^
ПлатПол   ^

KauKsTbl1 ^   KauKsNrec1 ^
KauKsTbl2 ^   KauKsNrec2 ^
KauKsTbl3 ^   KauKsNrec3 ^
KauKsTbl4 ^   KauKsNrec4 ^
KauKsTbl5 ^   KauKsNrec5 ^
KauKsTbl6 ^   KauKsNrec6 ^

! Бюджетный счет
.begin
#ifdef Atl51
  wKau[1] := KauKsTbl1;
  wKau[2] := KauKsTbl2;
  wKau[3] := KauKsTbl3;
  wKau[4] := KauKsTbl4;
  wKau[5] := KauKsTbl5;
  wKau[6] := KauKsTbl6;
  cKau[1] := KauKsNRec1;
  cKau[2] := KauKsNRec2;
  cKau[3] := KauKsNRec3;
  cKau[4] := KauKsNRec4;
  cKau[5] := KauKsNRec5;
  cKau[6] := KauKsNRec6;
  BudjSchet := iSchet26.ShowSchetBU(SchetKs, КорСуб, wKau, cKau);
#else
  BudjSchet := iSchet26.ShowSchetBU(SchetKs, КорСуб, KauKsTbl1,  KauKsTbl2,  KauKsTbl3,  KauKsTbl4,  KauKsTbl5,  KauKsTbl6,
                                                     KauKsNRec1, KauKsNRec2, KauKsNRec3, KauKsNRec4, KauKsNRec5, KauKsNRec6)
#endif
end.

ПрихНДЕ   ^
ПрихВал   ^
ПрихБВ    ^
РасхНДЕ   ^
РасхВал   ^
РасхБВ    ^
БюджПрихНДЕ ^
БюджПрихВал ^
БюджПрихБВ  ^
БюджРасхНДЕ ^
БюджРасхВал ^
БюджРасхБВ  ^
.}
-----------------------------------------------------------------
! итоговые суммы по ведомости
ИсхПрихНДЕ   ^
ИсхПрихВал   ^
ИсхПрихБВ    ^
ИсхРасхНДЕ   ^
ИсхРасхВал   ^
ИсхРасхБВ    ^
ИсхСалНДЕ    ^
ИсхСалВал    ^
ИсхСалБВ     ^

БюджИсхПрихНДЕ ^
БюджИсхПрихВал ^
БюджИсхПрихБВ  ^
БюджИсхРасхНДЕ ^
БюджИсхРасхВал ^
БюджИсхРасхБВ  ^
БюджИсхСалНДЕ  ^
БюджИсхСалВал  ^
БюджИсхСалБВ   ^

ЗарплНДЕ     ^
ЗарплВал     ^
ЗарплБВ      ^
БюджЗарплНДЕ ^
БюджЗарплВал ^
.if BreakPage
.end
.[f
  @np@
.]f
.}
.begin
  SetBooleanParameter('Forms', 'Compatibility', 0, Compatibility);
end.
! итого по страницам
КолДок_1     ^
КолДок_2     ^
КолДок_3     ^
КолДокПрих   ^
КолДокРасх   ^
ФИОКассира   ^
ГлавБух ^
РукПред ^
ДолжРук ^
.if duPrintPage
.end
! нумерация страниц
.if Signers_DayUch
   Руководитель_ФИО        - ^
   Руководитель_Должн      - ^
   Руководитель_Роль       - ^

   ГлавБух_ФИО             - ^
   ГлавБух_Должн           - ^
   ГлавБух_Роль            - ^

   Кассир_ФИО              - ^
   Кассир_Должн            - ^
   Кассир_Роль             - ^
.end

.}
.endform

!---------------------------------------------------------------------------------------------------
! Кассовая книга рублевая
!---------------------------------------------------------------------------------------------------

.linkform 'dayuchrub_01' prototype is 'dayuchved'
.group 'dayuchrub_f1'
.nameinlist '1. Отчет кассира'
.p 25
! Функция вывода заданного количества знаков после запятой
#include printfunc.frn
.var
  СумСтрНДЕПрих : double
  СумСтрНДЕРасх : double
  СтраницМес : integer
  СтраницГод : integer
.endvar
.fields
ИнтерДат
c1f1
c2f1 c2f2
ДатаВхСал ВхСалНДЕ ПропущеноДней
НоДок СодОпер КорСчет КорСуб ПрихНДЕ РасхНДЕ
PrintSumma(СумСтрНДЕПрих) PrintSumma(СумСтрНДЕРасх)
PrintSumma(ИсхПрихНДЕ) PrintSumma(ИсхРасхНДЕ) PrintSumma(ИсхСалНДЕ)
ЗарплНДЕ
'true':'s'
ФИОКассира
КолДок_1 КолДок_2 КолДок_3
ГлавБух
.endfields
 Р

                 БОтчет кассира за @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
.if OkFilDch
 ВПрименен фильтр... В
.{
    В^ В
.{
      В ^ ^ В
.}
.}

.end
.begin
  СтраницГод := НомЛиста-1;
  СтраницМес := КолЛистов;
end.
.{
.[h
                                                                                                               Лист  @np@
.]h
.{
.[h
.begin
  СумСтрНДЕПрих := 0;
  СумСтрНДЕРасх := 0;
end.
 Б──────┬─────────────────────────────────────────────────────────────────┬─────────────┬──────────────────┬──────────────────
 Номер│                 От кого получено и кому выдано                  │ Корреспонд. │                  │
 доку-│                        и на какие цели                          ├──────┬──────┤      Приход      │     Расход
 мента│                                                                 │ Счет │СубСч.│                  │
──────┴─────────────────────────────────────────────────────────────────┴──────┴──────┴──────────────────┴────────────────── Б
.]h

.if KassaVhSaldoDay
       Остаток на начало @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&&
       @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Р
 Р
.end
.{
.begin
! ИТОГО
  СумСтрНДЕПрих := СумСтрНДЕПрих + ПрихНДЕ;
  СумСтрНДЕРасх := СумСтрНДЕРасх + РасхНДЕ;
end.
@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@ @@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&&
.[f
 Б────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                          ИТОГО по листу  @np@         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.begin
  СтраницГод := СтраницГод+1;
  СтраницМес := СтраницМес+1;
end.
.]f
.}
 Б────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                          ИТОГО за день                &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б

 Б                                                          Остаток на конец дня         &'&&&&&&&&&&&&&&&& Б
 Б                                                          В том числе на зарплату      &'&&&&&&&&&&&&&&&& Б
.if BreakPage
^
.end
.}
.if duPrintPage

.end
.if Signers_DayUch
.begin
   if Кассир_ФИО <> ''
     ФИОКассира := Кассир_ФИО

   if ГлавБух_ФИО <> ''
     ГлавБух    := ГлавБух_ФИО
end.
.end


К а с с и р                      ^

Записи в кассовой книге проверил и документы в количестве
^ ^ ^ получил.

Б у х г а л т е р                ^ Щ

.}
.endform

!---------------------------------------------------------------------------------------------------
.linkform 'dayuchrub_01ok' prototype is 'dayuchved'
.group 'dayuchrub_f1'
.nameinlist '2. Вкладной лист кассовой книги'
.p 80
! Функция вывода заданного количества знаков после запятой
#include printfunc.frn
.var
  СумСтрНДЕПрих : double
  СумСтрНДЕРасх : double
  СтраницМес : integer
  СтраницГод : integer
.endvar
.fields
ИнтерДат
c1f1
c2f1 c2f2
ДатаВхСал ВхСалНДЕ ПропущеноДней
НоДок СодОпер КорСчет КорСуб ПрихНДЕ РасхНДЕ
PrintSumma(СумСтрНДЕПрих) PrintSumma(СумСтрНДЕРасх)
PrintSumma(ИсхПрихНДЕ) PrintSumma(ИсхРасхНДЕ) PrintSumma(ИсхСалНДЕ)
ЗарплНДЕ
'true':'s'
if(МесяцДаты=12,
  'Листов за месяц '+string(СтраницМес)+'. Листов за год '+string(СтраницГод)+'.',
  'Листов за месяц '+string(СтраницМес)+'.'
  )
ФИОКассира
КолДок_1 КолДок_2 КолДок_3
ГлавБух
.endfields
 Р

 И                   Вкладной лист кассовой книги за @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И
.if OkFilDch
 ЛПрименен фильтр... Л
.{
 Л   ^ Л
.{
 Л      ^ ^ Л
.}
.}

.end
.{
.[h
 Й                                                                                                               Лист  @np@ Й
.]h
.begin
  СтраницГод := НомЛиста-1;
  СтраницМес := КолЛистов;
end.
.{
.[h
.begin
  СумСтрНДЕПрих := 0;
  СумСтрНДЕРасх := 0;
end.
 И──────┬─────────────────────────────────────────────────────────────────┬─────────────┬──────────────────┬──────────────────
 Номер│                 От кого получено и кому выдано                  │ Корреспонд. │                  │
 доку-│                        и на какие цели                          ├──────┬──────┤      Приход      │     Расход
 мента│                                                                 │ Счет │СубСч.│                  │
──────┴─────────────────────────────────────────────────────────────────┴──────┴──────┴──────────────────┴────────────────── И
.]h

.if KassaVhSaldoDay
 Й       Остаток на начало @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&&
       @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Й

.end
.{
.begin
! ИТОГО
  СумСтрНДЕПрих := СумСтрНДЕПрих + ПрихНДЕ;
  СумСтрНДЕРасх := СумСтрНДЕРасх + РасхНДЕ;
end.
 Й@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@ @@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Й
.[f
 И────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                          ИТОГО по листу  @np@         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& И
.begin
  СтраницГод := СтраницГод+1;
  СтраницМес := СтраницМес+1;
end.
.]f
.}
 И────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                          ИТОГО за день                &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&

                                                          Остаток на конец дня         &'&&&&&&&&&&&&&&&& И
 И                                                          В том числе на зарплату      &'&&&&&&&&&&&&&&&& И
.if BreakPage
 Й^ Й
.end
.}
.if duPrintPage
 Й^ Й
.end

.if Signers_DayUch
.begin
   if Кассир_ФИО <> ''
     ФИОКассира := Кассир_ФИО

   if ГлавБух_ФИО <> ''
     ГлавБух    := ГлавБух_ФИО

end.
.end

 ЙК а с с и р                      ^

Записи в кассовой книге проверил и документы в количестве
^ ^ ^ получил.

Б у х г а л т е р                ^ Р
.}
 Й.endform

!---------------------------------------------------------------------------------------------------
.linkform 'dayuchrub_02' prototype is 'dayuchved'
.group 'dayuchrub_f2'
.nameinlist '2. Кассовая книга в валюте отчетов'
.p 80
! Функция вывода заданного количества знаков после запятой
#include printfunc.frn
.var
  СумСтрБВПрих  : double
  СумСтрБВРасх  : double
  СтраницМес : integer
  СтраницГод : integer
.endvar
.fields
ИнтерДат
ИмяБВ
c1f1
c2f1 c2f2
ДатаВхСал ВхСалБВ ПропущеноДней
НоДок СодОпер КорСчет КорСуб ПрихБВ РасхБВ
PrintSumma(СумСтрБВПрих) PrintSumma(СумСтрБВРасх)
PrintSumma(ИсхПрихБВ) PrintSumma(ИсхРасхБВ) PrintSumma(ИсхСалБВ)
ЗарплБВ
'true':'s'
if(МесяцДаты=12,
  'Листов за месяц '+string(СтраницМес)+'. Листов за год '+string(СтраницГод)+'.',
  'Листов за месяц '+string(СтраницМес)+'.'
  )
ФИОКассира
КолДок_1 КолДок_2 КолДок_3
ГлавБух
.endfields
 Р

 И                         Касса за @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И

 ЛСформирована в ^ Л

.if OkFilDch
 ЛПрименен фильтр... Л
.{
 Л   ^ Л
.{
 Л      ^ ^ Л
.}
.}
.end
.{
.[h
 Й                                                                                                         Лист  @np@ Й
.]h
.begin
  СтраницГод := НомЛиста-1;
  СтраницМес := КолЛистов;
end.
.{
.[h
.begin
  СумСтрБВПрих  := 0;
  СумСтрБВРасх  := 0;
end.
 И──────┬─────────────────────────────────────────────────────────────────┬─────────────┬──────────────────┬──────────────────
 Номер│                 От кого получено и кому выдано                  │ Корреспонд. │                  │
 доку-│                        и на какие цели                          ├──────┬──────┤      Приход      │     Расход
 мента│                                                                 │ Счет │СубСч.│                  │
──────┴─────────────────────────────────────────────────────────────────┴──────┴──────┴──────────────────┴────────────────── И
.]h
.if KassaVhSaldoDay
 Й       Остаток на начало @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&&
       @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Й

.end
.{
.begin
! ИТОГО
  СумСтрБВПрих  := СумСтрБВПрих  + ПрихБВ;
  СумСтрБВРасх  := СумСтрБВРасх  + РасхБВ;
end.
 Й@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@ @@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Й
.[f
 И────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                          ИТОГО по листу  @np@         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& И
.begin
  СтраницГод := СтраницГод+1;
  СтраницМес := СтраницМес+1;
end.
.]f
.}
 И────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                          ИТОГО за день                &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&

                                                          Остаток на конец дня         &'&&&&&&&&&&&&&&&& И
 И                                                          В том числе на зарплату      &'&&&&&&&&&&&&&&&& И
.if BreakPage
 Й^ Й
.end
.}
.if duPrintPage
 Й^ Й
.end

.if Signers_DayUch
.begin
   if Кассир_ФИО <> ''
     ФИОКассира := Кассир_ФИО

   if ГлавБух_ФИО <> ''
     ГлавБух    := ГлавБух_ФИО
end.
.end

 ЙК а с с и р                      ^

Записи в кассовой книге проверил и документы в количестве
^ ^ ^ получил.

Б у х г а л т е р                ^ Щ
.}
.endform

!---------------------------------------------------------------------------------------------------
.linkform 'dayuchrub_03' prototype is 'dayuchved'
.group 'dayuchrub_f3'
.nameinlist '3. Кассовая книга, эквивалент в валюте отчетов'
.p 80
! Функция вывода заданного количества знаков после запятой
#include printfunc.frn
.var
  СумСтрНДЕПрих : double
  СумСтрНДЕРасх : double
  СумСтрБВПрих  : double
  СумСтрБВРасх  : double
  СтраницМес : integer
  СтраницГод : integer
.endvar
.fields
ИнтерДат
c1f1
c2f1 c2f2
СимвНДЕ_П СимвБВ_П СимвНДЕ_Р СимвБВ_Р
ДатаВхСал ВхСалНДЕ ВхСалБВ ПропущеноДней
НоДок СодОпер КорСчет КорСуб ПрихНДЕ ПрихБВ РасхНДЕ РасхБВ
PrintSumma(СумСтрНДЕПрих) PrintSumma(СумСтрБВПрих) PrintSumma(СумСтрНДЕРасх) PrintSumma(СумСтрБВРасх)
PrintSumma(ИсхПрихНДЕ) PrintSumma(ИсхПрихБВ) PrintSumma(ИсхРасхНДЕ) PrintSumma(ИсхРасхБВ) PrintSumma(ИсхСалНДЕ) PrintSumma(ИсхСалБВ)
ЗарплНДЕ ЗарплБВ
'true':'s'
if(МесяцДаты=12,
  'Листов за месяц '+string(СтраницМес)+'. Листов за год '+string(СтраницГод)+'.',
  'Листов за месяц '+string(СтраницМес)+'.'
  )
ФИОКассира
КолДок_1 КолДок_2 КолДок_3
ГлавБух
.endfields
 Р

 И                        Касса за @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И
.if OkFilDch
 ЛПрименен фильтр... Л
.{
 Л   ^ Л
.{
 Л      ^ ^ Л
.}
.}
.end
.{
.[h
 Л                                                                                                                    Лист @np@ Л
.]h
.begin
  СтраницГод := НомЛиста-1;
  СтраницМес := КолЛистов;
end.
.{
.[h
.begin
  СумСтрНДЕПрих := 0;
  СумСтрНДЕРасх := 0;
  СумСтрБВПрих  := 0;
  СумСтрБВРасх  := 0;
end.
 И──────┬──────────────────────────────────┬─────────────┬────────────────────────────────────┬────────────────────────────────────
 Номер│  От кого получено и кому выдано  │ Корреспонд. │                Приход              │               Расход
 доку-│         и на какие цели          ├──────┬──────┼──────────────────┬─────────────────┼──────────────────┬─────────────────
 мента│                                  │ Счет │СубСч.│     в @@@@@@     │    в @@@@@@     │     в @@@@@@     │    в @@@@@@
──────┴──────────────────────────────────┴──────┴──────┴──────────────────┴─────────────────┴──────────────────┴───────────────── И
.]h
.if KassaVhSaldoDay
 Й       Остаток на начало @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&
       @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Й
.end
.{
.begin
! ИТОГО
  СумСтрНДЕПрих := СумСтрНДЕПрих + ПрихНДЕ;
  СумСтрНДЕРасх := СумСтрНДЕРасх + РасхНДЕ;
  СумСтрБВПрих  := СумСтрБВПрих  + ПрихБВ;
  СумСтрБВРасх  := СумСтрБВРасх  + РасхБВ;
end.
 Й@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@ @@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&& Й
.[f
 И─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                 ИТОГО по листу  @np@   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& И
.begin
  СтраницГод := СтраницГод+1;
  СтраницМес := СтраницМес+1;
end.
.]f
.}
 И─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                           ИТОГО за день                &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& И

 И                           Остаток на конец дня         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&& И
 И                           В том числе на зарплату      &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&& И
.if BreakPage
 Й^ Й
.end
.}
.if duPrintPage
 Й^ Й
.end

.if Signers_DayUch
.begin
   if Кассир_ФИО <> ''
     ФИОКассира := Кассир_ФИО

   if ГлавБух_ФИО <> ''
     ГлавБух    := ГлавБух_ФИО
end.
.end

 ЙК а с с и р                      ^

Записи в кассовой книге проверил и документы в количестве
^ ^ ^ получил.

Б у х г а л т е р                ^ Щ
.}
.endform

!---------------------------------------------------------------------------------------------------
! Кассовая книга валютная
!---------------------------------------------------------------------------------------------------

.linkform 'dayuchval_01' prototype is 'dayuchved'
.group 'dayuchval_f1'
.nameinlist '1. Валютная кассовая книга (в валюте операций)'
.p 80
! Функция вывода заданного количества знаков после запятой
#include printfunc.frn
.var
  СумСтрВалПрих : double
  СумСтрВалРасх : double
  СтраницМес : integer
  СтраницГод : integer
.endvar
.fields
ИнтерДат
c1f1
c2f1 c2f2
ВалютаГруппир КурсВалГруппир СимвНДЕ ДатаВхСал ВхСалВал ПропущеноДней
НоДок СодОпер КорСчет КорСуб ПрихВал РасхВал
PrintSumma(СумСтрВалПрих) PrintSumma(СумСтрВалРасх)
PrintSumma(ИсхПрихВал) PrintSumma(ИсхРасхВал) PrintSumma(ИсхСалВал)
ЗарплВал
'true':'s'
if(МесяцДаты=12,
  'Листов за месяц '+string(СтраницМес)+'. Листов за год '+string(СтраницГод)+'.',
  'Листов за месяц '+string(СтраницМес)+'.'
  )
ФИОКассира
КолДок_1 КолДок_2 КолДок_3
ГлавБух
.endfields
 Ш

 Ш             Валютная касса за @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
.if OkFilDch
 ЫПрименен фильтр... Ы
.{
 Ы   ^ Ы
.{
 Ы      ^ ^ Ы
.}
.}
.end
.{
.[h
 Щ                                                                               Лист  @np@ Щ
.]h
.begin
  СтраницГод := НомЛиста-1;
  СтраницМес := КолЛистов;
end.
.{
.[h
.begin
  СумСтрВалПрих := 0;
  СумСтрВалРасх := 0;
end.
 Ш──────┬──────────────────────────────────┬─────────────┬──────────────────┬──────────────────
 Номер│  От кого получено и кому выдано  │ Корреспонд. │                  │
 доку-│         и на какие цели          ├──────┬──────┤      Приход      │     Расход
 мента│                                  │ Счет │СубСч.│                  │
──────┴──────────────────────────────────┴──────┴──────┴──────────────────┴────────────────── Ш
.]h
.if KassaVhSaldoDay
 Щ       Валюта: ^, курс ^ ^
       ───────────────────────────────────
       Остаток на начало @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&&
       @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Щ
.end
.{
.begin
! ИТОГО
  СумСтрВалПрих := СумСтрВалПрих + ПрихВал;
  СумСтрВалРасх := СумСтрВалРасх + РасхВал;
end.
 Щ@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@ @@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Щ
.[f
 Ш─────────────────────────────────────────────────────────────────────────────────────────────
                                 ИТОГО по листу  @np@   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Ш
.begin
  СтраницГод := СтраницГод+1;
  СтраницМес := СтраницМес+1;
end.
.]f
.}
 Ш─────────────────────────────────────────────────────────────────────────────────────────────
                           ИТОГО за день                &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Ш

 Ш                           Остаток на конец дня         &'&&&&&&&&&&&&&&&& Ш
 Ш                           В том числе на зарплату      &#'&&&&&&&&&&&&&&& Ш
.if BreakPage
 Щ^ Щ
.end
.}
.if duPrintPage
 Щ^ Щ
.end
.if Signers_DayUch
.begin
   if Кассир_ФИО <> ''
     ФИОКассира := Кассир_ФИО

   if ГлавБух_ФИО <> ''
     ГлавБух    := ГлавБух_ФИО
end.
.end
 ЩК а с с и р                      ^
Записи в кассовой книге проверил и документы в количестве
^ ^ ^ получил.
Б у х г а л т е р                ^ Б
.}
.endform

!---------------------------------------------------------------------------------------------------
.linkform 'dayuchval_02' prototype is 'dayuchved'
.group 'dayuchval_f2'
.nameinlist '1. Валютная кассовая книга, эквивалент в нац.денежной единице'
.p 80
! Функция вывода заданного количества знаков после запятой
#include printfunc.frn
.var
  СумСтрНДЕПрих : double
  СумСтрНДЕРасх : double
  СумСтрВалПрих : double
  СумСтрВалРасх : double
  СтраницМес : integer
  СтраницГод : integer
.endvar
.fields
ИнтерДат
c1f1
c2f1 c2f2
СимвНДЕ_П СимвНДЕ_Р
ВалютаГруппир КурсВалГруппир СимвНДЕ ДатаВхСал ВхСалВал ВхСалНДЕ ПропущеноДней
НоДок СодОпер КорСчет КорСуб ПрихВал ПрихНДЕ РасхВал РасхНДЕ
PrintSumma(СумСтрВалПрих) PrintSumma(СумСтрНДЕПрих) PrintSumma(СумСтрВалРасх) PrintSumma(СумСтрНДЕРасх)
PrintSumma(ИсхПрихВал) PrintSumma(ИсхПрихНДЕ) PrintSumma(ИсхРасхВал) PrintSumma(ИсхРасхНДЕ) PrintSumma(ИсхСалВал) PrintSumma(ИсхСалНДЕ)
ЗарплВал ЗарплНДЕ
'true':'s'
if(МесяцДаты=12,
  'Листов за месяц '+string(СтраницМес)+'. Листов за год '+string(СтраницГод)+'.',
  'Листов за месяц '+string(СтраницМес)+'.'
  )
ФИОКассира
КолДок_1 КолДок_2 КолДок_3
ГлавБух
.endfields
 Ш
                                Валютная касса за @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.if OkFilDch
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
 Б                                                                                                                      Лист @np@ Б
.]h
.begin
  СтраницГод := НомЛиста-1;
  СтраницМес := КолЛистов;
end.
.{
.[h
.begin
  СумСтрНДЕПрих := 0;
  СумСтрНДЕРасх := 0;
  СумСтрВалПрих := 0;
  СумСтрВалРасх := 0;
end.
──────┬──────────────────────────────────┬─────────────┬─────────────────────────────────────┬─────────────────────────────────────
 Номер│  От кого получено и кому выдано  │ Корреспонд. │                Приход               │               Расход
 доку-│         и на какие цели          ├──────┬──────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
 мента│                                  │ Счет │СубСч.│     в валюте     │    в @@@@@@      │     в валюте     │     в @@@@@@
──────┴──────────────────────────────────┴──────┴──────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if KassaVhSaldoDay
 Б       Валюта: ^, курс ^ ^
       ───────────────────────────────────
       Остаток на начало @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
       @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
.end
.{
.begin
! ИТОГО
  СумСтрНДЕПрих := СумСтрНДЕПрих + ПрихНДЕ;
  СумСтрНДЕРасх := СумСтрНДЕРасх + РасхНДЕ;
  СумСтрВалПрих := СумСтрВалПрих + ПрихВал;
  СумСтрВалРасх := СумСтрВалРасх + РасхВал;
end.
 Б@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@ @@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Б
.[f
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                 ИТОГО по листу  @np@   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.begin
  СтраницГод := СтраницГод+1;
  СтраницМес := СтраницМес+1;
end.
.]f
.}
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                           ИТОГО за день                &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&

                           Остаток на конец дня         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                           В том числе на зарплату      &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if BreakPage
 Б^ Б
.end
.}
.if duPrintPage
 Б^ Б
.end
.if Signers_DayUch
.begin
   if Кассир_ФИО <> ''
     ФИОКассира := Кассир_ФИО

   if ГлавБух_ФИО <> ''
     ГлавБух    := ГлавБух_ФИО
end.
.end
 БК а с с и р                      ^
Записи в кассовой книге проверил и документы в количестве
^ ^ ^ получил.
Б у х г а л т е р                ^ Щ
.}
.endform

!---------------------------------------------------------------------------------------------------
.linkform 'dayuchval_03' prototype is 'dayuchved'
.group 'dayuchval_f3'
.nameinlist '1. Валютная кассовая книга, эквивалент в валюте отчетов'
.p 80
! Функция вывода заданного количества знаков после запятой
#include printfunc.frn
.var
  СумСтрВалПрих : double
  СумСтрВалРасх : double
  СумСтрБВПрих  : double
  СумСтрБВРасх  : double
  СтраницМес : integer
  СтраницГод : integer
.endvar
.fields
ИнтерДат
c1f1
c2f1 c2f2
СимвБВ_П СимвБВ_Р
ВалютаГруппир КурсВалГруппир СимвНДЕ ДатаВхСал ВхСалВал ВхСалБВ ПропущеноДней
НоДок СодОпер КорСчет КорСуб ПрихВал ПрихБВ РасхВал РасхБВ
PrintSumma(СумСтрВалПрих) PrintSumma(СумСтрБВПрих) PrintSumma(СумСтрВалРасх) PrintSumma(СумСтрБВРасх)
PrintSumma(ИсхПрихВал) PrintSumma(ИсхПрихБВ) PrintSumma(ИсхРасхВал) PrintSumma(ИсхРасхБВ) PrintSumma(ИсхСалВал) PrintSumma(ИсхСалБВ)
ЗарплВал ЗарплБВ
'true':'s'
if(МесяцДаты=12,
  'Листов за месяц '+string(СтраницМес)+'. Листов за год '+string(СтраницГод)+'.',
  'Листов за месяц '+string(СтраницМес)+'.'
  )
ФИОКассира
КолДок_1 КолДок_2 КолДок_3
ГлавБух
.endfields
 Ш
                                Валютная касса за @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.if OkFilDch
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
 Б                                                                                                                      Лист @np@ Б
.]h
.begin
  СтраницГод := НомЛиста-1;
  СтраницМес := КолЛистов;
end.
.{
.[h
.begin
  СумСтрВалПрих := 0;
  СумСтрВалРасх := 0;
  СумСтрБВПрих  := 0;
  СумСтрБВРасх  := 0;
end.
──────┬──────────────────────────────────┬─────────────┬─────────────────────────────────────┬─────────────────────────────────────
 Номер│  От кого получено и кому выдано  │ Корреспонд. │                Приход               │               Расход
 доку-│         и на какие цели          ├──────┬──────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
 мента│                                  │ Счет │СубСч.│     в валюте     │    в @@@@@@      │     в валюте     │     в @@@@@@
──────┴──────────────────────────────────┴──────┴──────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if KassaVhSaldoDay
 Б       Валюта: ^, курс ^ ^
       ───────────────────────────────────
       Остаток на начало @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
       @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
.end
.{
.begin
! ИТОГО
  СумСтрВалПрих := СумСтрВалПрих + ПрихВал;
  СумСтрВалРасх := СумСтрВалРасх + РасхВал;
  СумСтрБВПрих  := СумСтрБВПрих  + ПрихБВ;
  СумСтрБВРасх  := СумСтрБВРасх  + РасхБВ;
end.
 Б@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@ @@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Б
.[f
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                 ИТОГО по листу  @np@   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.begin
  СтраницГод := СтраницГод+1;
  СтраницМес := СтраницМес+1;
end.
.]f
.}
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                           ИТОГО за день                &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&

                           Остаток на конец дня         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                           В том числе на зарплату      &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if BreakPage
 Б^ Б
.end
.}
.if duPrintPage
 Б^ Б
.end
.if Signers_DayUch
.begin
   if Кассир_ФИО <> ''
     ФИОКассира := Кассир_ФИО

   if ГлавБух_ФИО <> ''
     ГлавБух    := ГлавБух_ФИО
end.
.end
 БК а с с и р                      ^
Записи в кассовой книге проверил и документы в количестве
^ ^ ^ получил.
Б у х г а л т е р                ^ Щ

.}
.endform

!---------------------------------------------------------------------------------------------------
.linkform 'dayuchval_07' prototype is 'dayuchved'
.group 'dayuchval_f1'
.nameinlist '2. Вкладной лист валютной кассовой книги (в валюте операций)'
.p 80
! Функция вывода заданного количества знаков после запятой
#include printfunc.frn
.var
  СумСтрВалПрих : double
  СумСтрВалРасх : double
  СтраницМес : integer
  СтраницГод : integer
.endvar
.fields
c1f1
c2f1 c2f2
ИнтерДат
ВалютаГруппир КурсВалГруппир СимвНДЕ ДатаВхСал ВхСалВал ПропущеноДней
НоДок СодОпер КорСчет КорСуб ПрихВал РасхВал
PrintSumma(СумСтрВалПрих) PrintSumma(СумСтрВалРасх)
PrintSumma(ИсхПрихВал) PrintSumma(ИсхРасхВал) PrintSumma(ИсхСалВал)
ЗарплВал
'true':'s'
if(МесяцДаты=12,
  'Листов за месяц '+string(СтраницМес)+'. Листов за год '+string(СтраницГод)+'.',
  'Листов за месяц '+string(СтраницМес)+'.'
  )
ФИОКассира
КолДок_1 КолДок_2 КолДок_3
ГлавБух
.endfields
 Ш
.if OkFilDch
 ЫПрименен фильтр... Ы
.{
 Ы   ^ Ы
.{
 Ы      ^ ^ Ы
.}
.}
.end
.{
.[h
                        Вкладной лист валютной кассовой книги за ^         БЛист @np@ Б
.]h
.begin
  СтраницГод := НомЛиста-1;
  СтраницМес := КолЛистов;
end.
.{
.[h
.begin
  СумСтрВалПрих := 0;
  СумСтрВалРасх := 0;
end.
 Ш──────┬──────────────────────────────────┬─────────────┬──────────────────┬──────────────────
 Номер│  От кого получено и кому выдано  │ Корреспонд. │                  │
 доку-│         и на какие цели          ├──────┬──────┤      Приход      │     Расход
 мента│                                  │ Счет │СубСч.│                  │
──────┴──────────────────────────────────┴──────┴──────┴──────────────────┴────────────────── Ш
.]h
.if KassaVhSaldoDay
 Щ       Валюта: ^, курс ^ ^
       ───────────────────────────────────
       Остаток на начало @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&&
       @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И
 С.end
.{
.begin
! ИТОГО
  СумСтрВалПрих := СумСтрВалПрих + ПрихВал;
  СумСтрВалРасх := СумСтрВалРасх + РасхВал;
end.
 Щ@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@ @@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Щ
.[f
 Ш─────────────────────────────────────────────────────────────────────────────────────────────
                                 ИТОГО по листу  @np@   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Ш
.begin
  СтраницГод := СтраницГод+1;
  СтраницМес := СтраницМес+1;
end.
.]f
.}
 Ш─────────────────────────────────────────────────────────────────────────────────────────────
                           ИТОГО за день                &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Ш

 Ш                           Остаток на конец дня         &'&&&&&&&&&&&&&&&& Ш
 Ш                           В том числе на зарплату      &#'&&&&&&&&&&&&&&& Ш
.if BreakPage
^
.end
.}
.if duPrintPage
 Щ^ Щ
.end
.if Signers_DayUch
.begin
   if Кассир_ФИО <> ''
     ФИОКассира := Кассир_ФИО

   if ГлавБух_ФИО <> ''
     ГлавБух    := ГлавБух_ФИО
end.
.end
 ЩК а с с и р                      ^
Записи в кассовой книге проверил и документы в количестве
^ ^ ^ получил.
Б у х г а л т е р                ^ Б
.}
.endform


!---------------------------------------------------------------------------------------------------
.linkform 'dayuchval_05' prototype is 'dayuchved'
.group 'dayuchval_f2'
.nameinlist '2. Вкладной лист валютной кассовой книги, эквивалент в нац.денежной единице'
.p 80
! Функция вывода заданного количества знаков после запятой
#include printfunc.frn
.var
  СумСтрНДЕПрих : double
  СумСтрНДЕРасх : double
  СумСтрВалПрих : double
  СумСтрВалРасх : double
  СтраницМес : integer
  СтраницГод : integer
.endvar
.fields
c1f1
c2f1 c2f2
ИнтерДат
СимвНДЕ_П СимвНДЕ_Р
ВалютаГруппир КурсВалГруппир СимвНДЕ ДатаВхСал ВхСалВал ВхСалНДЕ ПропущеноДней
НоДок СодОпер КорСчет КорСуб ПрихВал ПрихНДЕ РасхВал РасхНДЕ
PrintSumma(СумСтрВалПрих) PrintSumma(СумСтрНДЕПрих) PrintSumma(СумСтрВалРасх) PrintSumma(СумСтрНДЕРасх)
PrintSumma(ИсхПрихВал) PrintSumma(ИсхПрихНДЕ) PrintSumma(ИсхРасхВал) PrintSumma(ИсхРасхНДЕ) PrintSumma(ИсхСалВал) PrintSumma(ИсхСалНДЕ)
ЗарплВал ЗарплНДЕ
'true':'s'
if(МесяцДаты=12,
  'Листов за месяц '+string(СтраницМес)+'. Листов за год '+string(СтраницГод)+'.',
  'Листов за месяц '+string(СтраницМес)+'.'
  )
ФИОКассира
КолДок_1 КолДок_2 КолДок_3
ГлавБух
.endfields
 Ш
.if OkFilDch
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                        Вкладной лист валютной кассовой книги за ^ Б                                    Лист @np@ Б
.]h
.begin
  СтраницГод := НомЛиста-1;
  СтраницМес := КолЛистов;
end.
.{
.[h
.begin
  СумСтрВалПрих := 0;
  СумСтрНДЕПрих := 0;
  СумСтрВалРасх := 0;
  СумСтрНДЕРасх := 0;
end.
──────┬──────────────────────────────────┬─────────────┬─────────────────────────────────────┬─────────────────────────────────────
 Номер│  От кого получено и кому выдано  │ Корреспонд. │                Приход               │               Расход
 доку-│         и на какие цели          ├──────┬──────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
 мента│                                  │ Счет │СубСч.│     в валюте     │    в @@@@@@      │     в валюте     │     в @@@@@@
──────┴──────────────────────────────────┴──────┴──────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if KassaVhSaldoDay
 Б       Валюта: ^, курс ^ ^
       ───────────────────────────────────
       Остаток на начало @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
       @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
.end
.{
.begin
! ИТОГО
  СумСтрНДЕПрих := СумСтрНДЕПрих + ПрихНДЕ;
  СумСтрНДЕРасх := СумСтрНДЕРасх + РасхНДЕ;
  СумСтрВалПрих := СумСтрВалПрих + ПрихВал;
  СумСтрВалРасх := СумСтрВалРасх + РасхВал;
end.
 Б@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@ @@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Б
.[f
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                 ИТОГО по листу  @np@   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.begin
  СтраницГод := СтраницГод+1;
  СтраницМес := СтраницМес+1;
end.
.]f
.}
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                           ИТОГО за день                &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&

                           Остаток на конец дня         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                           В том числе на зарплату      &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if BreakPage
 Б^ Б
.end
.}
.if duPrintPage
 Б^ Б
.end
.if Signers_DayUch
.begin
   if Кассир_ФИО <> ''
     ФИОКассира := Кассир_ФИО

   if ГлавБух_ФИО <> ''
     ГлавБух    := ГлавБух_ФИО
end.
.end
 БК а с с и р                      ^
Записи в кассовой книге проверил и документы в количестве
^ ^ ^ получил.
Б у х г а л т е р                ^ Щ
.}
.endform

!---------------------------------------------------------------------------------------------------
.linkform 'dayuchval_06' prototype is 'dayuchved'
.group 'dayuchval_f3'
.nameinlist '2. Вкладной лист валютной кассовой книги, эквивалент в валюте отчетов'
.p 80
! Функция вывода заданного количества знаков после запятой
#include printfunc.frn
.var
  СумСтрВалПрих : double
  СумСтрВалРасх : double
  СумСтрБВПрих  : double
  СумСтрБВРасх  : double
  СтраницМес : integer
  СтраницГод : integer
.endvar
.fields
c1f1
c2f1 c2f2
ИнтерДат
СимвБВ_П СимвБВ_Р
ВалютаГруппир КурсВалГруппир СимвНДЕ ДатаВхСал ВхСалВал ВхСалБВ ПропущеноДней
НоДок СодОпер КорСчет КорСуб ПрихВал ПрихБВ РасхВал РасхБВ
PrintSumma(СумСтрВалПрих) PrintSumma(СумСтрБВПрих) PrintSumma(СумСтрВалРасх) PrintSumma(СумСтрБВРасх)
PrintSumma(ИсхПрихВал) PrintSumma(ИсхПрихБВ) PrintSumma(ИсхРасхВал) PrintSumma(ИсхРасхБВ) PrintSumma(ИсхСалВал) PrintSumma(ИсхСалБВ)
ЗарплВал ЗарплБВ
'true':'s'
if(МесяцДаты=12,
  'Листов за месяц '+string(СтраницМес)+'. Листов за год '+string(СтраницГод)+'.',
  'Листов за месяц '+string(СтраницМес)+'.'
  )
ФИОКассира
КолДок_1 КолДок_2 КолДок_3
ГлавБух
.endfields
 Ш
.if OkFilDch
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
                        Вкладной лист валютной кассовой книги за ^                                       БЛист @np@ Б
.]h
.begin
  СтраницГод := НомЛиста-1;
  СтраницМес := КолЛистов;
end.
.{
.[h
.begin
  СумСтрВалПрих := 0;
  СумСтрВалРасх := 0;
  СумСтрБВПрих  := 0;
  СумСтрБВРасх  := 0;
end.
──────┬──────────────────────────────────┬─────────────┬─────────────────────────────────────┬─────────────────────────────────────
 Номер│  От кого получено и кому выдано  │ Корреспонд. │                Приход               │               Расход
 доку-│         и на какие цели          ├──────┬──────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
 мента│                                  │ Счет │СубСч.│     в валюте     │    в @@@@@@      │     в валюте     │     в @@@@@@
──────┴──────────────────────────────────┴──────┴──────┴──────────────────┴──────────────────┴──────────────────┴──────────────────
.]h
.if KassaVhSaldoDay
 Б       Валюта: ^, курс ^ ^
       ───────────────────────────────────
       Остаток на начало @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
       @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
.end
.{
.begin
! ИТОГО
  СумСтрВалПрих := СумСтрВалПрих + ПрихВал;
  СумСтрВалРасх := СумСтрВалРасх + РасхВал;
  СумСтрБВПрих  := СумСтрБВПрих  + ПрихБВ;
  СумСтрБВРасх  := СумСтрБВРасх  + РасхБВ;
end.
 Б@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@ @@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Б
.[f
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                 ИТОГО по листу  @np@   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.begin
  СтраницГод := СтраницГод+1;
  СтраницМес := СтраницМес+1;
end.
.]f
.}
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                           ИТОГО за день                &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&

                           Остаток на конец дня         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                           В том числе на зарплату      &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.if BreakPage
 Б^ Б
.end
.}
.if duPrintPage
 Б^ Б
.end
.if Signers_DayUch
.begin
   if Кассир_ФИО <> ''
     ФИОКассира := Кассир_ФИО

   if ГлавБух_ФИО <> ''
     ГлавБух    := ГлавБух_ФИО
end.
.end
 БК а с с и р                      ^
Записи в кассовой книге проверил и документы в количестве
^ ^ ^ получил.
Б у х г а л т е р                ^ Щ

.}
.endform

!---------------------------------------------------------------------------------------------------
 Й.linkform 'KassaBookValBudj' prototype is 'dayuchved'
.group 'dayuchval_f2'
.nameinlist '3. Валютная кассовая книга (Бюджетные организации)'
.p 80
! Функция вывода заданного количества знаков после запятой
#include printfunc.frn
.var
  СумСтрВалПрих : double
  СумСтрВалРасх : double
  БюджСумСтрПрих : double
  БюджСумСтрРасх : double
  СтраницМес   : integer
  СтраницГод   : integer
.endvar
.fields
c1f1  c2f1  c2f2
ДатаКассы
  ВалютаГруппир КурсВалГруппир СимвНДЕ
  PrintSumma(ВхСалВал-БюджВхСалВал)    PrintSumma(БюджВхСалВал)
НоДок СодОпер
  BudjSchet
  PrintSummaZero(ПрихВал-БюджПрихВал)      PrintSummaZero(РасхВал-БюджРасхВал)       БюджПрихВал БюджРасхВал
  PrintSumma(СумСтрВалПрих-БюджСумСтрПрих) PrintSumma(СумСтрВалРасх-БюджСумСтрРасх)  PrintSumma(БюджСумСтрПрих) PrintSumma(БюджСумСтрРасх)
  PrintSumma(ИсхПрихВал-БюджИсхПрихВал)    PrintSumma(ИсхРасхВал-БюджИсхРасхВал)     PrintSumma(БюджИсхПрихВал) PrintSumma(БюджИсхРасхВал)
  PrintSumma(ИсхСалВал-БюджИсхСалВал)      PrintSumma(БюджИсхСалВал)
  PrintSumma(ЗарплВал-БюджЗарплВал)   БюджЗарплВал
  PrintSumma(ИсхСалВал)
'true':'s'
if(МесяцДаты=12,
               'Листов за месяц: '+ UpCase(trim(NumToString(СтраницМес,''))) +'. Листов за год: ' + UpCase(trim(NumToString(СтраницГод,'')))+'.',
               'Листов за месяц: ' + UpCase(trim(NumToString(СтраницМес,'')))+'.'
  )
ФИОКассира
UpCase(КолДокПрих) UpCase(КолДокРасх)
ГлавБух
.endfields

 Ш.if OkFilDch
 ВПрименен фильтр... В
.{
 В   ^ В
.{
 В      ^ ^ В
.}
.}
.end
.begin
  СтраницГод := НомЛиста-1;
  СтраницМес := КолЛистов;
end.
                                                 БКасса за ^ г. Б
.{
.[h
                                                                                                                           Форма 0504514   Лист  @np@
.]h
.{
.[h
.begin
  СумСтрВалПрих := 0;
  СумСтрВалРасх := 0;
  БюджСумСтрПрих := 0;
  БюджСумСтрРасх := 0;
end.
 Б────────┬────────────────────────────────────────────┬──────────────────────────────┬───────────────────────────────────┬───────────────────────────────────
   №    │               От кого получено             │  № Корреспондирующего счета  │           По бюджету              │    По внебюджетным средствам
 доку-  │               или кому выдано              │                              ├─────────────────┬─────────────────┼─────────────────┬─────────────────
 мента  │                                            │                              │     Приход      │     Расход      │     Приход      │     Расход
────────┼────────────────────────────────────────────┼──────────────────────────────┼─────────────────┼─────────────────┼─────────────────┼─────────────────
   1    │                       2                    │     3                        │        4        │       5         │        6        │       7
────────┼────────────────────────────────────────────┼──────────────────────────────┼─────────────────┼─────────────────┼─────────────────┼───────────────── Б
.]h
.if KassaVhSaldoDay
           Валюта: ^, курс ^ ^
                                                              Остаток на начало дня │&'&&&&&&&&&&&&&&&│       X         │&'&&&&&&&&&&&&&&&│       X
        ├────────────────────────────────────────────┬──────────────────────────────┼─────────────────┼─────────────────┼─────────────────┼─────────────────
.end
.{
! ИТОГО
.begin
  СумСтрВалПрих := СумСтрВалПрих + ПрихВал;
  СумСтрВалРасх := СумСтрВалРасх + РасхВал;
  БюджСумСтрПрих := БюджСумСтрПрих + БюджПрихВал;
  БюджСумСтрРасх := БюджСумСтрРасх + БюджРасхВал;
end.
@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&#'&&&&&&&&&&&&&&│&#'&&&&&&&&&&&&&&│&#'&&&&&&&&&&&&&&│&#'&&&&&&&&&&&&&&
.[f
────────┴────────────────────────────────────────────┴──────────────────────────────┼─────────────────┼─────────────────┼─────────────────┼─────────────────
                                                                             БПеренос │&'&&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&&& Б
                                                                                    └─────────────────┴─────────────────┴─────────────────┴─────────────────
.begin
  СтраницГод := СтраницГод+1;
  СтраницМес := СтраницМес+1;
end.
.]f
.}
────────────────────────────────────────────────────────────────────────────────────┬─────────────────┬─────────────────┬─────────────────┬─────────────────
                                                                       БИтого за день │&'&&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&&& Б
                                                                                    ├─────────────────┼─────────────────┼─────────────────┼─────────────────
                                                                БОстаток на конец дня │&'&&&&&&&&&&&&&&&│        X        │&'&&&&&&&&&&&&&&&│        X Б
                                                                                    ├─────────────────┼─────────────────┼─────────────────┼─────────────────
                                                             Бв том числе на зарплату │&'&&&&&&&&&&&&&&&│        X        │&'&&&&&&&&&&&&&&&│        X Б
                                                                                    └─────────────────┴─────────────────┼═════════════════┼─────────────────
                                                                     БОбщий остаток денежных средств в кассе на конец дня ║&'&&&&&&&&&&&&&&&║ Б
                                                                                                                        ╚═════════════════╝
.if BreakPage
^
.end
.}
.if duPrintPage
 ^

.end

.if Signers_DayUch
.begin
   if Кассир_ФИО <> ''
     ФИОКассира := Кассир_ФИО

   if ГлавБух_ФИО <> ''
     ГлавБух    := ГлавБух_ФИО
end.
.end
 Кассир     ___________________    Д^ Д
                  подпись           расшифровка подписи

 Записи  в  кассовой  книге  проверил  и  документы  в
 количестве @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ приходных и
            ------------------------------------------------------
 @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ расходных получил.
 -----------------------------------------------------------------

 Главный бухгалтер  ___________________    Д^ Д
                          подпись           расшифровка подписи
.}
.endform
 Ш

!---------------------------------------------------------------------------------------------------
.linkform 'KassaBookVal_TitulBudget' prototype is 'dayuchved'
.group 'dayuchval_f2'
.nameinlist '4. Титульный лист (Бюджетные организации)'
.p 80
.Create view Kassa
from
  KatOrg    (ReadOnly)
where
((
    coGetTune('MYORG') == KatOrg.nRec
))
;
.begin
  Kassa.GetFirst KatOrg;
end.
.fields
  DateToStr(StrToDate(ИнтерДат,'DD/MM/YYYY'), 'Month')
  Year(StrToDate(ИнтерДат,'DD/MM/YYYY'))
  Kassa.KatOrg.Name Kassa.KatOrg.OKPO
  РукПред ГлавБух
.endfields
!------------------------------------------------------------------------------
.if OkFilDch
.{
.{
.}
.}
.end
.{
.{
.if KassaVhSaldoDay
.end
.{
.}
.if BreakPage
.end
.}
.if duPrintPage
.end
.}
!------------------------------------------------------------------------------
 И                             БКАССОВАЯ КНИГА Б

                        за  Б@~@@@@@@@@ @~@@@@ Б г.
                        ───────────────────────
                                                                      ┌─────────────────┐
                                                                      │       БКоды Б       │
                                                                      ├─────────────────┤
                                                        Форма по ОКУД │     Б0504514 Б      │
                                                                      ├─────────────────┤
                                                                 Дата │                 │
                                                                      ├─────────────────┤
 Б@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б по ОКПО │@~@@@@@@@@@@@@@@@│
──────────────────────────────────────────────────────────────────────┴─────────────────┘
                        учреждение


                                  Б В этой книге пронумеровано и прошнуровано Б

                                  Б(____________)______________________ листов Б
                                                      Р(прописью) Р


.if Signers_DayUch
.begin
   if Руководитель_ФИО <> ''
     РукПред    := Руководитель_ФИО
   if ГлавБух_ФИО <> ''
     ГлавБух := ГлавБух_ФИО
end.
.end

                                  БРуководитель                @~@@@@@@@@@@@@@@@@@@@@@@@@@ Б
                                  Бучреждения   ────────────── ─────────────────────────── Б
                                                   Р(подпись) Р                Р(расшифровка подписи) Р

                                  БГлавный                     @~@@@@@@@@@@@@@@@@@@@@@@@@@ Б
                                  Ббухгалтер    ────────────── ─────────────────────────── Б
                                                   Р(подпись) Р                Р(расшифровка подписи) Р

                                 "  " ____________________ г.


                                  БМ.П.(штампа) Б
 И
.endform

 Й

!---------------------------------------------------------------------------------------------------
! Ежедневный учет
!---------------------------------------------------------------------------------------------------

.linkform 'dayuch51_01' prototype is 'dayuchved'
.var
  СумСтрНДЕПрих : double
  СумСтрНДЕРасх : double
.endvar
.group 'dayuch51_f1'
.nameinlist '1. Ежедневный учет по счету'
.p 80
! Функция вывода заданного количества знаков после запятой
#include printfunc.frn
.fields
ИнтерДат НомОсСчета ИмяНДЕ
c1f1
c2f1 c2f2
ДатаВхСал ВхСалНДЕ ПропущеноДней
НоДок КорСчет КорСуб СодОпер ПлатПол ПрихНДЕ РасхНДЕ
PrintSumma(СумСтрНДЕПрих) PrintSumma(СумСтрНДЕРасх)
PrintSumma(ИсхПрихНДЕ) PrintSumma(ИсхРасхНДЕ) PrintSumma(ИсхСалНДЕ)
'true':'s'
.endfields
 Ш
        Ежедневный учет за ^ по счету ^

 ГВедомость сформирована в ^ Г

.if OkFilDch
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
 Б                                                                                                     Лист  @np@ Б
.]h
.{
.[h
.begin
  СумСтрНДЕПрих := 0;
  СумСтрНДЕРасх := 0;
end.
──────┬───────────┬────────────────────────────────┬─────────────────────────────┬──────────────────┬──────────────────
 Номер│Корреспонд.│                                │                             │                  │
 доку-├─────┬─────┤      Содержание операции       │    Плательщик/получатель    │      Приход      │     Расход
 мента│Счет │СубС.│                                │                             │                  │
──────┴─────┴─────┴────────────────────────────────┴─────────────────────────────┴──────────────────┴──────────────────
.]h
.if KassaVhSaldoDay
 Б                                 Остаток на начало @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&&
                                 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
.end
.{
.begin
! ИТОГО
  СумСтрНДЕПрих := СумСтрНДЕПрих + ПрихНДЕ;
  СумСтрНДЕРасх := СумСтрНДЕРасх + РасхНДЕ;
end.
 Б@@@@@@  @@@@  @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Б
.[f
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                           ИТОГО по листу  @np@   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.]f
.}
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                     ИТОГО за день                &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&&

                                                     Остаток на конец дня         &#'&&&&&&&&&&&&&&&
.if BreakPage
 Б^ Б
.end
.if Signers_DayUch
.end
.}
.if duPrintPage
.end
 ББ у х г а л т е р Щ
.}
.endform

!---------------------------------------------------------------------------------------------------
.linkform 'dayuch51_02' prototype is 'dayuchved'
.group 'dayuch51_f2'
.nameinlist '2. Ежедневный учет по счету в валюте отчетов'
.p 80
! Функция вывода заданного количества знаков после запятой
#include printfunc.frn
.var
  СумСтрБВПрих  : double
  СумСтрБВРасх  : double
.endvar
.fields
ИнтерДат НомОсСчета ИмяБВ
c1f1
c2f1 c2f2
ДатаВхСал ВхСалБВ ПропущеноДней
НоДок КорСчет КорСуб СодОпер ПлатПол ПрихБВ РасхБВ
PrintSumma(СумСтрБВПрих) PrintSumma(СумСтрБВРасх)
PrintSumma(ИсхПрихБВ) PrintSumma(ИсхРасхБВ) PrintSumma(ИсхСалБВ)
'true':'s'
.endfields

 Ш
        Ежедневный учет за ^ по счету ^

 ГВедомость сформирована в ^ Г

.if OkFilDch
 ГПрименен фильтр... Г
.{
 Г   ^ Г
.{
 Г      ^ ^ Г
.}
.}
.end
.{
.[h
 Б                                                                                                          Лист@np@ Б
.]h

.{
.[h
.begin
  СумСтрБВПрих  := 0;
  СумСтрБВРасх  := 0;
end.
──────┬───────────┬────────────────────────────────┬─────────────────────────────┬──────────────────┬──────────────────
 Номер│Корреспонд.│                                │                             │                  │
 доку-├─────┬─────┤      Содержание операции       │    Плательщик/получатель    │      Приход      │     Расход
 мента│Счет │СубС.│                                │                             │                  │
──────┴─────┴─────┴────────────────────────────────┴─────────────────────────────┴──────────────────┴──────────────────
.]h
.if KassaVhSaldoDay
 Б                                 Остаток на начало @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&&
                                 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
.end
.{
.begin
! ИТОГО
  СумСтрБВПрих  := СумСтрБВПрих  + ПрихБВ;
  СумСтрБВРасх  := СумСтрБВРасх  + РасхБВ;
end.
 Б@@@@@@  @@@@  @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Б
.[f
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                           ИТОГО по листу  @np@   &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
.]f
.}
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                     ИТОГО за день                &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&

                                                     Остаток на конец дня         &'&&&&&&&&&&&&&&&&
.if BreakPage
 Б^ Б
.end
.}
.if duPrintPage
.end
.if Signers_DayUch
.end
 ББ у х г а л т е р Щ
.}
.endform

!---------------------------------------------------------------------------------------------------
.linkform 'dayuch51_03' prototype is 'dayuchved'
.group 'dayuch51_f3'
.nameinlist '3. Ежедневный учет по счету, эквивалент в валюте отчетов'
.p 80
! Функция вывода заданного количества знаков после запятой
#include printfunc.frn
.var
  СумСтрНДЕПрих : double
  СумСтрНДЕРасх : double
  СумСтрБВПрих  : double
  СумСтрБВРасх  : double
.endvar
.fields
ИнтерДат НомОсСчета
c1f1
c2f1 c2f2
СимвНДЕ_П СимвБВ_П СимвНДЕ_Р СимвБВ_Р
ДатаВхСал ВхСалНДЕ ВхСалБВ ПропущеноДней
НоДок КорСчет КорСуб СодОпер ПлатПол ПрихНДЕ ПрихБВ РасхНДЕ РасхБВ
PrintSumma(СумСтрНДЕПрих) PrintSumma(СумСтрБВПрих) PrintSumma(СумСтрНДЕРасх) PrintSumma(СумСтрБВРасх)
PrintSumma(ИсхПрихНДЕ) PrintSumma(ИсхПрихБВ) PrintSumma(ИсхРасхНДЕ) PrintSumma(ИсхРасхБВ) PrintSumma(ИсхСалНДЕ) PrintSumma(ИсхСалБВ)
'true':'s'
.endfields

 Ш
 И                                  Ежедневный учет за ^ по счету ^ И
.if OkFilDch
 ЛПрименен фильтр... Л
.{
 Л   ^ Л
.{
 Л      ^ ^ Л
.}
.}
.end
.{
.[h
 Й                                                                                                                                              Лист  @np@ Й
.]h
.{
.[h
.begin
  СумСтрНДЕПрих := 0;
  СумСтрНДЕРасх := 0;
  СумСтрБВПрих  := 0;
  СумСтрБВРасх  := 0;
end.
 И──────┬───────────┬────────────────────────────────┬─────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
 Номер│Корреспонд.│                                │                             │                Приход               │               Расход
 доку-├─────┬─────┤      Содержание операции       │    Плательщик/получатель    ├──────────────────┬──────────────────┼──────────────────┬──────────────────
 мента│Счет │СубС.│                                │                             │     в @@@@@@     │    в @@@@@@      │     в @@@@@@     │     в @@@@@@
──────┴─────┴─────┴────────────────────────────────┴─────────────────────────────┴──────────────────┴──────────────────┴──────────────────┴────────────────── И
.]h
.if KassaVhSaldoDay
 Й                                  Остаток на начало @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
                                 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Й
.end
.{
.begin
! ИТОГО
  СумСтрНДЕПрих := СумСтрНДЕПрих + ПрихНДЕ;
  СумСтрНДЕРасх := СумСтрНДЕРасх + РасхНДЕ;
  СумСтрБВПрих  := СумСтрБВПрих  + ПрихБВ;
  СумСтрБВРасх  := СумСтрБВРасх  + РасхБВ;
end.
 Й@@@@@@  @@@@  @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Й
.[f
 И─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                     ИТОГО по листу  @np@         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& И
.]f
.}
 И─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                                                     ИТОГО за день                &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&

                                                     Остаток на конец дня         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& И
.if BreakPage
 Й^ Й
.end
.}
.if duPrintPage
.end
.if Signers_DayUch
.end
 ЙБ у х г а л т е р С
.}
.endform

#include DayUchBel.frn
#include DayUchRus.frn
