//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
//------------------------------------------------------------------------------
// Галактика 5.84 - ФРО
// Универсальный журнал-ордер
//------------------------------------------------------------------------------

#include FeeSigners.frn
//------------------------------------------------------------------------------
// Изменения в форме
// 29.06.2005
// Добавил одно поле "ВалютаОтчета" - выводится наименование валюты
//------------------------------------------------------------------------------

#doc
Базовая форма отчета "Универсальный журнал-ордер"
#end
.set name = 'jo_tuned'
.nameinlist 'Базовая форма универсального журнала-ордера'
.hide
.fields
  RepName
  RepType
  BegDate EndDate
  ВалютаОтчета
  BuhName RepUserName
  KauKodTable
  KauTableName
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
  ColumnTitle1
  ColumnTitle2
  KauGroupName
  KauGroupKolVo
  KauGroupSum
  Npp
  KauNrec
  KauName
  DateOb
  DateDoc
  NoDok
  OrgNrec
  OrgName
  Sodr
  Schet
  SubSchet
  SchSubName
  KolVo
  Sum
  ItogKolVo
  ItogSum
#FeeSignersCycleFields
.endfields
Нименование отчета  ^
RepType ^   (количество или валюта операции для шапки)
Период c  ^
       по ^
ВалютаОтчета ^
BuhName - Главный бухгалтер ^
RepBuhName - Ответственный за выпуск ^
! для разреза по аналитике
KauKodTable - код таблицы аналитики             - ^
KauTableName- наименование аналитики            - ^
.if OkJoSchet
.{
Наименование настройки ^
.{
  Значение ^
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
^
.{
^ ^
.}
.}
.end


 .{.?JoHdr01;.}
 .{.?JoHdr02;    ColumnTitle1 ^ .}
 .{.?JoHdr03;    ColumnTitle2 ^ .}
 .{.?JoHdr04;.}
 .{.?JoHdr05;.}
.{

.if JoNeedGroup
 .{.?JoBod02;.}
 KauGroupName  ^
 .{.?JoBod03;    KauGroupKolVo ^ KauGroupSum ^  .}
.end

.if JoNeedRow
Npp         - номер разреза по порядку          - ^
! разрез по аналитике
KauNrec     - значение аналитики (nrec)         - ^
KauName     - значение аналитики (наименование) - ^
! разрез по документам
DateOb      - дата операции                     - ^
DateDoc     - дата документа                    - ^
NoDok       - номер первичного документа        - ^
OrgNrec     - nrec организации                  - ^
OrgName     - наименование организации          - ^
Sodr        - содержание                        - ^
! разрез по основным счетам
Schet       - счет                              - ^
SubSchet    - субсчет                           - ^
SchSubName  - наименование счета/субсчета       - ^
  .{.?JoBod01; Количество ячейки ^ Сумма ячейки ^ .}
.end
.}
 .{.?JoFtr01;.}
 .{.?JoFtr02; Количество итого ^ Сумма итого  ^ .}
 .{.?JoFtr03;.}
#FeeSignersCycle(jo_tuned)
.endform

!-------------------------------------------------------------------------------
.linkform 'jo_tuned01' prototype is 'jo_tuned'
.group 'в разрезе аналитики'
.nameinlist 'Универсальный журнал-ордер в разрезе аналитики'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
  KauTableName  ColumnTitle1
                ColumnTitle2
                
  KauGroupName:"trim:right"  KauGroupSum
  Npp KauName:"trim:right"   Sum
  ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^

.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end
────┬────────────────────────────────────────.{.?JoHdr01;┬─────────────────.}
  № │@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoHdr02;│@~@@@@@@@@@@@@@@@.}
 п/п│                                        .{.?JoHdr03;│@~@@@@@@@@@@@@@@@.}
────┼────────────────────────────────────────.{.?JoHdr04;┼─────────────────.}  .{.?JoHdr05;.}
.{
.if JoNeedGroup
 .{.?JoBod02;.} Б   │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod03;│&'&&&&&&&&&&&&&& .} Б
.end
.if JoNeedRow
&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&& .}
.end
.}
────┴────────────────────────────────────────.{.?JoFtr01;┼─────────────────.}
 БИтого                                        .{.?JoFtr02;│&'&&&&&&&&&&&&&& .} Б
─────────────────────────────────────────────.{.?JoFtr03;┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform
!-------------------------------------------------------------------------------
.linkform 'jo_tuned01_Kol' prototype is 'jo_tuned'
.group 'в разрезе аналитики (количество)'
.nameinlist 'Универсальный журнал-ордер в разрезе аналитики'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
  KauTableName  ColumnTitle1 RepType

  KauGroupName:"trim:right"  KauGroupKolVo KauGroupSum
  Npp KauName:"trim:right"   KolVo Sum

  ItogKolVo ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^

.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end
────┬────────────────────────────────────────.{.?JoHdr01;┬──────────────────────────────────.}
  № │@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoHdr02;│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.}
 п/п│                                        .{.?JoHdr03;│────────────────┬─────────────────.}
    │                                        .{.?JoHdr04;│@~@@@@@@@@@@@@@@│      Сумма      .}
────┼────────────────────────────────────────.{.?JoHdr05;┼────────────────┼─────────────────.}
.{
.if JoNeedGroup
 .{.?JoBod02;.} Б   │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod03;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .} Б
.end
.if JoNeedRow
&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&&│&#'&&&&&&&&&&&&& .}
.end
.}
────┴────────────────────────────────────────.{.?JoFtr01;┼────────────────┼─────────────────.}
 БИтого                                        .{.?JoFtr02;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .} Б
─────────────────────────────────────────────.{.?JoFtr03;┴────────────────┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform

!-------------------------------------------------------------------------------
.linkform 'jo_tuned02' prototype is 'jo_tuned'
.group 'в разрезе дат'
.nameinlist 'Универсальный журнал-ордер в разрезе дат'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
  ColumnTitle1
  ColumnTitle2
  Npp DateOb Sum
  ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^

.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end
────┬──────────.{.?JoHdr01;┬─────────────────.}
  № │   Дата   .{.?JoHdr02;│@~@@@@@@@@@@@@@@@.}
 п/п│          .{.?JoHdr03;│@~@@@@@@@@@@@@@@@.}
────┼──────────.{.?JoHdr04;┼─────────────────.} .{.?JoHdr05;.}
.{
.if JoNeedGroup
 .{.?JoBod02;.}
 .{.?JoBod03;.}
.end
.if JoNeedRow
&&&&│@@@@@@@@@@.{.?jobod01;│&#'&&&&&&&&&&&&& .}
.end
.}
────┴──────────.{.?JoFtr01;┼─────────────────.}
 БИтого          .{.?JoFtr02;│&'&&&&&&&&&&&&&& .} Б
───────────────.{.?JoFtr03;┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform
!----------------------------------------------------------------------
.linkform 'jo_tuned02_Kol' prototype is 'jo_tuned'
.group 'в разрезе дат (количество)'
.nameinlist 'Универсальный журнал-ордер в разрезе дат'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
  ColumnTitle1 RepType
  KauGroupName:"trim:right" KauGroupKolVo KauGroupSum
  Npp DateOb KolVo Sum
  ItogKolVo ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^

.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end
────┬──────────.{.?JoHdr01;┬──────────────────────────────────.}
  № │          .{.?JoHdr02;│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.}
    │   Дата   .{.?JoHdr03;│────────────────┬─────────────────.}
 п/п│          .{.?JoHdr04;│@~@@@@@@@@@@@@@@│      Сумма      .}
────┼──────────.{.?JoHdr05;┼────────────────┼─────────────────.}
.{
.if JoNeedGroup
 .{.?JoBod02;.}   │@@@@@@@@@@.{.?JoBod03;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .}
.end
.if JoNeedRow
&&&&│@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&&│&#'&&&&&&&&&&&&& .}
.end
.}
────┴──────────.{.?JoFtr01;┼────────────────┼─────────────────.}
 БИтого          .{.?JoFtr02;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .} Б
───────────────.{.?JoFtr03;┴────────────────┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform

!-------------------------------------------------------------------------------
! Форма ананалогична форме jo_tuned02. Пришлось сделать для того чтобы расширить
! колонку ДАТА. Для динамического расширения пришлось бы править прототип
.linkform 'jo_tuned021' prototype is 'jo_tuned'
.group 'в разрезе дат по месяцам'
.nameinlist 'Универсальный журнал-ордер в разрезе дат'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
  ColumnTitle1
  ColumnTitle2
  Npp DateOb Sum
  ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^

.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end
────┬─────────────.{.?JoHdr01;┬─────────────────.}
  № │     Дата    .{.?JoHdr02;│@~@@@@@@@@@@@@@@@.}
 п/п│             .{.?JoHdr03;│@~@@@@@@@@@@@@@@@.}
────┼─────────────.{.?JoHdr04;┼─────────────────.} .{.?JoHdr05;.}
.{
.if JoNeedGroup
 .{.?JoBod02;.}
 .{.?JoBod03;.}
.end
.if JoNeedRow
&&&&│@@@@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&& .}
.end
.}
────┴─────────────.{.?JoFtr01;┼─────────────────.}
 БИтого             .{.?JoFtr02;│&'&&&&&&&&&&&&&& .} Б
──────────────────.{.?JoFtr03;┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform
!-------------------------------------------------------------------------------

.linkform 'jo_tuned021_Kol' prototype is 'jo_tuned'
.group 'в разрезе дат по месяцам (количество)'
.nameinlist 'Универсальный журнал-ордер в разрезе дат'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
  ColumnTitle1 RepType
  KauGroupName:"trim:right" KauGroupKolVo KauGroupSum
  Npp DateOb KolVo Sum
  ItogKolVo ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^

.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end
────┬─────────────.{.?JoHdr01;┬──────────────────────────────────.}
  № │     Дата    .{.?JoHdr02;│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.}
 п/п│             .{.?JoHdr03;│────────────────┬─────────────────.}
    │             .{.?JoHdr04;│@~@@@@@@@@@@@@@@│      Сумма      .}
────┼─────────────.{.?JoHdr05;┼────────────────┼─────────────────.}
.{
.if JoNeedGroup
 .{.?JoBod02;.}   │@@@@@@@@@@@@@.{.?JoBod03;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .}
.end
.if JoNeedRow
&&&&│@@@@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&&│&#'&&&&&&&&&&&&& .}
.end
.}
────┴─────────────.{.?JoFtr01;┼────────────────┼─────────────────.}
 БИтого             .{.?JoFtr02;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .} Б
──────────────────.{.?JoFtr03;┴────────────────┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform

!-------------------------------------------------------------------------------
.linkform 'jo_tuned03' prototype is 'jo_tuned'
.group 'в разрезе документов'
.nameinlist 'Универсальный журнал-ордер в разрезе документов'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
    ColumnTitle1
    ColumnTitle2
  Npp DateDoc NoDok OrgName Sodr Sum
  ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^

.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end
────┬────────────────────────────────────────────────────────────────────────────.{.?JoHdr01;┬─────────────────.}
  № │                       Д  о  к  у  м  е  н  т  ы                            .{.?JoHdr02;│@~@@@@@@@@@@@@@@@.}
 п/п│                                                                            .{.?JoHdr03;│@~@@@@@@@@@@@@@@@.}
    │   Дата   │ Номер  │     Плательщик/получатель    │   Содержание операции   .{.?JoHdr04;│                 .}
────┼──────────┼────────┼──────────────────────────────┼─────────────────────────.{.?JoHdr05;┼─────────────────.}
.{
.if JoNeedGroup
 .{.?JoBod02;.}
 .{.?JoBod03;.}
.end
.if JoNeedRow
&&&&│@@@@@@@@@@│@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&& .}
.end
.}
────┴──────────┴────────┴──────────────────────────────┴─────────────────────────.{.?JoFtr01;┼─────────────────.}
 БИтого                                                                            .{.?JoFtr02;│&'&&&&&&&&&&&&&& .} Б
─────────────────────────────────────────────────────────────────────────────────.{.?JoFtr03;┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform
!-------------------------------------------------------------------------------

.linkform 'jo_tuned03_Kol' prototype is 'jo_tuned'
.group 'в разрезе документов (количество)'
.nameinlist 'Универсальный журнал-ордер в разрезе документов'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2  ColumnTitle1 RepType
  KauGroupName:"trim:right" KauGroupKolVo KauGroupSum
  Npp DateDoc NoDok OrgName Sodr KolVo Sum
  ItogKolVo ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^

.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end
────┬────────────────────────────────────────────────────────────────────────────.{.?JoHdr01;┬──────────────────────────────────.}
  № │                       Д  о  к  у  м  е  н  т  ы                            .{.?JoHdr02;│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.}
 п/п│──────────┬────────┬──────────────────────────────┬─────────────────────────.{.?JoHdr03;│────────────────┬─────────────────.}
    │   Дата   │ Номер  │     Плательщик/получатель    │   Содержание операции   .{.?JoHdr04;│@~@@@@@@@@@@@@@@│      Сумма      .}
────┼──────────┼────────┼──────────────────────────────┼─────────────────────────.{.?JoHdr05;┼────────────────┼─────────────────.}
.{
.if JoNeedGroup
 .{.?JoBod02;.}   │@@@@@@@@@@@@@@@@@@@│                              |                         .{.?JoBod03;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .}
.end
.if JoNeedRow
&&&&│@@@@@@@@@@│@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&&│&#'&&&&&&&&&&&&& .}
.end
.}
────┴──────────┴────────┴──────────────────────────────┴─────────────────────────.{.?JoFtr01;┼────────────────┼─────────────────.}
 БИтого                                                                            .{.?JoFtr02;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .} Б
─────────────────────────────────────────────────────────────────────────────────.{.?JoFtr03;┴────────────────┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform

!-------------------------------------------------------------------------------
.linkform 'jo_tuned04' prototype is 'jo_tuned'
.group 'в разрезе счетов'
.nameinlist 'Универсальный журнал-ордер в разрезе счетов'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
    ColumnTitle1
    ColumnTitle2
  KauGroupName:"trim:right"   KauGroupSum
  Npp KauName:"trim:right"   Sum
  ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^

.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end
────┬────────────────────────────────────────.{.?JoHdr01;┬─────────────────.}
  № │            Счет/субсчет                .{.?JoHdr02;│@~@@@@@@@@@@@@@@@.}
 п/п│                                        .{.?JoHdr03;│@~@@@@@@@@@@@@@@@.}
────┼────────────────────────────────────────.{.?JoHdr04;┼─────────────────.} .{.?JoHdr05;.}
.{
.if JoNeedGroup
 .{.?JoBod02;.}   │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod03;│&'&&&&&&&&&&&&&& .}
.end
.if JoNeedRow
&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&& .}
.end
.}
────┴────────────────────────────────────────.{.?JoFtr01;┼─────────────────.}
 БИтого                                        .{.?JoFtr02;│&'&&&&&&&&&&&&&& .} Б
─────────────────────────────────────────────.{.?JoFtr03;┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform
!-------------------------------------------------------------------------------

.linkform 'jo_tuned04_Kol' prototype is 'jo_tuned'
.group 'в разрезе счетов (количество)'
.nameinlist 'Универсальный журнал-ордер в разрезе счетов'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2 ColumnTitle1  RepType
  KauGroupName:"trim:right" KauGroupKolVo KauGroupSum
  Npp KauName KolVo Sum
  ItogKolVo ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^

.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end
────┬────────────────────────────────────────.{.?JoHdr01;┬──────────────────────────────────.}
  № │            Счет/субсчет                .{.?JoHdr02;│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.}
 п/п│                                        .{.?JoHdr03;│────────────────┬─────────────────.}
    │                                        .{.?JoHdr04;│@~@@@@@@@@@@@@@@│      Сумма      .}
────┼────────────────────────────────────────.{.?JoHdr05;┼────────────────┼─────────────────.}
.{
.if JoNeedGroup
 .{.?JoBod02;.}   │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod03;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .}
.end
.if JoNeedRow
&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&&│&#'&&&&&&&&&&&&& .}
.end
.}
────┴────────────────────────────────────────.{.?JoFtr01;┼────────────────┼─────────────────.}
 БИтого                                        .{.?JoFtr02;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .} Б
─────────────────────────────────────────────.{.?JoFtr03;┴────────────────┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform

!-------------------------------------------------------------------------------
.linkform 'jo_tuned05' prototype is 'jo_tuned'
.group 'в разрезе аналитики и документов'
.nameinlist 'Универсальный журнал-ордер в разрезе аналитики и документов'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
  KauTableName  ColumnTitle1
                ColumnTitle2
  KauGroupName:"trim:right"   KauGroupSum
  Npp DateDoc NoDok OrgName Sodr Sum
  ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^

.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end
────┬────────────────────────────────────────┬────────────────────────────────────────────────────────────────────────────.{.?JoHdr01;┬─────────────────.}
  № │@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│                       Д  о  к  у  м  е  н  т  ы                            .{.?JoHdr02;│@~@@@@@@@@@@@@@@@.}
 п/п│                                        │                                                                            .{.?JoHdr03;│@~@@@@@@@@@@@@@@@.}
    │                                        │   Дата   │ Номер  │     Плательщик/получатель    │   Содержание операции   .{.?JoHdr04;│                 .}
────┼────────────────────────────────────────┼──────────┼────────┼──────────────────────────────┼─────────────────────────.{.?JoHdr05;┼─────────────────.}
.{
.if JoNeedGroup
 .{.?JoBod02;.}   │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │        │                              │                         .{.?JoBod03;│&'&&&&&&&&&&&&&& .}
.end
.if JoNeedRow
&&&&│                                        │@@@@@@@@@@│@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&& .}
.end
.}
────┴────────────────────────────────────────┴──────────┴────────┴──────────────────────────────┴─────────────────────────.{.?JoFtr01;┼─────────────────.}
 БИтого                                                                                                                     .{.?JoFtr02;│&'&&&&&&&&&&&&&& .} Б
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────.{.?JoFtr03;┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform
!-------------------------------------------------------------------------------

.linkform 'jo_tuned05_Kol' prototype is 'jo_tuned'
.group 'в разрезе аналитики и документов (количество)'
.nameinlist 'Универсальный журнал-ордер в разрезе аналитики и документов'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
  KauTableName  ColumnTitle1 RepType
  KauGroupName:"trim:right" KauGroupKolVo KauGroupSum
  Npp DateDoc NoDok OrgName Sodr KolVo Sum
  ItogKolVo ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^

.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end
────┬────────────────────────────────────────┬────────────────────────────────────────────────────────────────────────────.{.?JoHdr01;┬──────────────────────────────────.}
  № │@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│                       Д  о  к  у  м  е  н  т  ы                            .{.?JoHdr02;│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.}
 п/п│                                        │──────────┬────────┬──────────────────────────────┬─────────────────────────.{.?JoHdr03;│────────────────┬─────────────────.}
    │                                        │   Дата   │ Номер  │     Плательщик/получатель    │   Содержание операции   .{.?JoHdr04;│@~@@@@@@@@@@@@@@│      Сумма      .}
────┼────────────────────────────────────────┼──────────┼────────┼──────────────────────────────┼─────────────────────────.{.?JoHdr05;┼────────────────┼─────────────────.}
.{
.if JoNeedGroup
 .{.?JoBod02;.}   │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │        │                              │                         .{.?JoBod03;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .}
.end
.if JoNeedRow
&&&&│                                        │@@@@@@@@@@│@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&&│&#'&&&&&&&&&&&&& .}
.end
.}
────┴────────────────────────────────────────┴──────────┴────────┴──────────────────────────────┴─────────────────────────.{.?JoFtr01;┼────────────────┼─────────────────.}
 БИтого                                                                                                                     .{.?JoFtr02;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .} Б
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────.{.?JoFtr03;┴────────────────┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform

!-------------------------------------------------------------------------------
.linkform 'jo_tuned06' prototype is 'jo_tuned'
.group 'в разрезе счетов и аналитики'
.nameinlist 'Универсальный журнал-ордер в разрезе счетов и аналитики'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  KauTableName
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
  ColumnTitle1 ColumnTitle2
  KauGroupName:"trim:right"   KauGroupSum
  Npp KauName:"trim:right"    Sum
  ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^

Аналитика : ^

.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end

────┬────────────────────────────────────────.{.?JoHdr01;┬─────────────────.}
  № │              Счет Субсчет              .{.?JoHdr02;│@~@@@@@@@@@@@@@@ .}
 п/п│               Аналитика                .{.?JoHdr03;│@~@@@@@@@@@@@@@@ .}
────┼────────────────────────────────────────.{.?JoHdr04;┼─────────────────.} .{.?JoHdr05;.}
.{
.if JoNeedGroup
 .{.?JoBod02;.} Б   │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod03;│&'&&&&&&&&&&&&&& .} Б
.end
.if JoNeedRow
&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&& .}
.end
.}
────┴────────────────────────────────────────.{.?JoFtr01;┼─────────────────.}
 БИтого                                        .{.?JoFtr02;│&'&&&&&&&&&&&&&& .} Б
─────────────────────────────────────────────.{.?JoFtr03;┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform
!-------------------------------------------------------------------------------
.linkform 'jo_tuned06_Kol' prototype is 'jo_tuned'
.group 'в разрезе счетов и аналитики (количество)'
.nameinlist 'Универсальный журнал-ордер в разрезе счетов и аналитики'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  KauTableName
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
  ColumnTitle1 RepType
  KauGroupName:"trim:right" KauGroupKolVo KauGroupSum
  Npp KauName:"trim:right" KolVo Sum
  ItogKolVo ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^

Аналитика : ^

.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end

────┬────────────────────────────────────────.{.?JoHdr01;┬──────────────────────────────────.}
  № │              Счет Субсчет              .{.?JoHdr02;│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.}
 п/п│               Аналитика                .{.?JoHdr03;│────────────────┬─────────────────.}
    │                                        .{.?JoHdr04;│@~@@@@@@@@@@@@@@│      Сумма      .}
────┼────────────────────────────────────────.{.?JoHdr05;┼────────────────┼─────────────────.}
.{
.if JoNeedGroup
 .{.?JoBod02;.} Б   │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod03;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .} Б
.end
.if JoNeedRow
&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&&│&#'&&&&&&&&&&&&& .}
.end
.}
────┴────────────────────────────────────────.{.?JoFtr01;┼────────────────┼─────────────────.}
 БИтого                                        .{.?JoFtr02;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .} Б
─────────────────────────────────────────────.{.?JoFtr03;┴────────────────┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform

!-------------------------------------------------------------------------------
.linkform 'jo_tuned07' prototype is 'jo_tuned'
.group 'в разрезе счетов и дат'
.nameinlist 'Универсальный журнал-ордер в разрезе счетов и дат'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
  ColumnTitle1 ColumnTitle2
  KauGroupName:"trim:right"   KauGroupSum
  Npp DateOb:"trim:right" Sum
  ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^
.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end
────┬────────────────────────────────────────.{.?JoHdr01;┬─────────────────.}
  № │              Счет/Субсчет              .{.?JoHdr02;│@~@@@@@@@@@@@@@@ .}
 п/п│                 Дата                   .{.?JoHdr03;│@~@@@@@@@@@@@@@@ .}
────┼────────────────────────────────────────.{.?JoHdr04;┼─────────────────.} .{.?JoHdr05;.}
.{
.if JoNeedGroup
 .{.?JoBod02;.} Б   │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod03;│&'&&&&&&&&&&&&&& .} Б
.end
.if JoNeedRow
&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&& .}
.end
.}
────┴────────────────────────────────────────.{.?JoFtr01;┼─────────────────.}
 БИтого                                        .{.?JoFtr02;│&'&&&&&&&&&&&&&& .} Б
─────────────────────────────────────────────.{.?JoFtr03;┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform
!-------------------------------------------------------------------------------
.linkform 'jo_tuned07_Kol' prototype is 'jo_tuned'
.group 'в разрезе счетов и дат (количество)'
.nameinlist 'Универсальный журнал-ордер в разрезе счетов и дат'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
  ColumnTitle1 RepType
  KauGroupName:"trim:right" KauGroupKolVo KauGroupSum
  Npp DateOb:"trim:right" KolVo Sum
  ItogKolVo ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^
.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end
────┬────────────────────────────────────────.{.?JoHdr01;┬──────────────────────────────────.}
  № │              Счет/Субсчет              .{.?JoHdr02;│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.}
 п/п│                 Дата                   .{.?JoHdr03;│────────────────┬─────────────────.}
    │                                        .{.?JoHdr04;│@~@@@@@@@@@@@@@@│      Сумма      .}
────┼────────────────────────────────────────.{.?JoHdr05;┼────────────────┼─────────────────.}
.{
.if JoNeedGroup
 .{.?JoBod02;.} Б   │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod03;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .} Б
.end
.if JoNeedRow
&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&&│&#'&&&&&&&&&&&&& .}
.end
.}
────┴────────────────────────────────────────.{.?JoFtr01;┼────────────────┼─────────────────.}
 БИтого                                        .{.?JoFtr02;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .} Б
─────────────────────────────────────────────.{.?JoFtr03;┴────────────────┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform

!-------------------------------------------------------------------------------
.linkform 'jo_tuned08' prototype is 'jo_tuned'
.group 'в разрезе счетов, аналитики и документов'
.nameinlist 'Универсальный журнал-ордер в разрезе счетов, аналитики и документов'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
  KauTableName  ColumnTitle1
                ColumnTitle2
  KauGroupName:"trim:right"   KauGroupSum
  Npp DateDoc NoDok OrgName Sodr Sum
  ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^

.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end
────┬────────────────────────────────────────┬────────────────────────────────────────────────────────────────────────────.{.?JoHdr01;┬─────────────────.}
  № │@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│                       Д  о  к  у  м  е  н  т  ы                            .{.?JoHdr02;│@~@@@@@@@@@@@@@@@.}
 п/п│                                        │                                                                            .{.?JoHdr03;│@~@@@@@@@@@@@@@@@.}
    │                                        │   Дата   │ Номер  │     Плательщик/получатель    │   Содержание операции   .{.?JoHdr04;│                 .}
────┼────────────────────────────────────────┼──────────┼────────┼──────────────────────────────┼─────────────────────────.{.?JoHdr05;┼─────────────────.}
.{
.if JoNeedGroup
 .{.?JoBod02;.}   │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │        │                              │                         .{.?JoBod03;│&'&&&&&&&&&&&&&& .}
.end
.if JoNeedRow
&&&&│                                        │@@@@@@@@@@│@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&& .}
.end
.}
────┴────────────────────────────────────────┴──────────┴────────┴──────────────────────────────┴─────────────────────────.{.?JoFtr01;┼─────────────────.}
 БИтого                                                                                                                     .{.?JoFtr02;│&'&&&&&&&&&&&&&& .} Б
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────.{.?JoFtr03;┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform
!-------------------------------------------------------------------------------

.linkform 'jo_tuned08_Kol' prototype is 'jo_tuned'
.group 'в разрезе счетов, аналитики и документов (количество)'
.nameinlist 'Универсальный журнал-ордер в разрезе счетов, аналитики и документов'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
  KauTableName  ColumnTitle1 RepType
  KauGroupName:"trim:right" KauGroupKolVo KauGroupSum
  Npp DateDoc NoDok OrgName Sodr KolVo Sum
  ItogKolVo ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^

.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end
────┬────────────────────────────────────────┬────────────────────────────────────────────────────────────────────────────.{.?JoHdr01;┬──────────────────────────────────.}
  № │@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│                       Д  о  к  у  м  е  н  т  ы                            .{.?JoHdr02;│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.}
 п/п│                                        │──────────┬────────┬──────────────────────────────┬─────────────────────────.{.?JoHdr03;│────────────────┬─────────────────.}
    │                                        │   Дата   │ Номер  │     Плательщик/получатель    │   Содержание операции   .{.?JoHdr04;│@~@@@@@@@@@@@@@@│      Сумма      .}
────┼────────────────────────────────────────┼──────────┼────────┼──────────────────────────────┼─────────────────────────.{.?JoHdr05;┼────────────────┼─────────────────.}
.{
.if JoNeedGroup
 .{.?JoBod02;.}   │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │        │                              │                         .{.?JoBod03;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .}
.end
.if JoNeedRow
&&&&│                                        │@@@@@@@@@@│@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&&│&#'&&&&&&&&&&&&& .}
.end
.}
────┴────────────────────────────────────────┴──────────┴────────┴──────────────────────────────┴─────────────────────────.{.?JoFtr01;┼────────────────┼─────────────────.}
 БИтого                                                                                                                     .{.?JoFtr02;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .} Б
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────.{.?JoFtr03;┴────────────────┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform
!-------------------------------------------------------------------------------
.linkform 'jo_tuned09' prototype is 'jo_tuned'
.group 'в разрезе счетов, подразделений и субсчетов'
.nameinlist 'Универсальный журнал-ордер в разрезе счетов, подразделений и субсчетов'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
  ColumnTitle1 ColumnTitle2
  KauGroupName:"trim:right"   KauGroupSum
  Npp KauName:"trim:right"    Sum
  ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^


.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end

────┬────────────────────────────────────────.{.?JoHdr01;┬─────────────────.}
  № │          Счет Подразделение            .{.?JoHdr02;│@~@@@@@@@@@@@@@@ .}
 п/п│              Субсчет                   .{.?JoHdr03;│@~@@@@@@@@@@@@@@ .}
────┼────────────────────────────────────────.{.?JoHdr04;┼─────────────────.} .{.?JoHdr05;.}
.{
.if JoNeedGroup
 .{.?JoBod02;.} Б   │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod03;│&'&&&&&&&&&&&&&& .} Б
.end
.if JoNeedRow
&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&& .}
.end
.}
────┴────────────────────────────────────────.{.?JoFtr01;┼─────────────────.}
 БИтого                                        .{.?JoFtr02;│&'&&&&&&&&&&&&&& .} Б
─────────────────────────────────────────────.{.?JoFtr03;┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform
!-------------------------------------------------------------------------------
.linkform 'jo_tuned09_Kol' prototype is 'jo_tuned'
.group 'в разрезе счетов, подразделений и субсчетов (количество)'
.nameinlist 'Универсальный журнал-ордер в разрезе счетов, подразделений и субсчетов'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
  ColumnTitle1 RepType
  KauGroupName:"trim:right" KauGroupKolVo KauGroupSum
  Npp KauName:"trim:right" KolVo Sum
  ItogKolVo ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^


.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end

────┬────────────────────────────────────────.{.?JoHdr01;┬──────────────────────────────────.}
  № │              Счет Подразделение        .{.?JoHdr02;│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.}
 п/п│                  Субсчет               .{.?JoHdr03;│────────────────┬─────────────────.}
    │                                        .{.?JoHdr04;│@~@@@@@@@@@@@@@@│      Сумма      .}
────┼────────────────────────────────────────.{.?JoHdr05;┼────────────────┼─────────────────.}
.{
.if JoNeedGroup
 .{.?JoBod02;.} Б   │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod03;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .} Б
.end
.if JoNeedRow
&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&&│&#'&&&&&&&&&&&&& .}
.end
.}
────┴────────────────────────────────────────.{.?JoFtr01;┼────────────────┼─────────────────.}
 БИтого                                        .{.?JoFtr02;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .} Б
─────────────────────────────────────────────.{.?JoFtr03;┴────────────────┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform
!-------------------------------------------------------------------------------
.linkform 'jo_tuned10' prototype is 'jo_tuned'
.group 'в разрезе счетов и документов'
.nameinlist 'Универсальный журнал-ордер в разрезе счетов и документов'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
  KauTableName  ColumnTitle1
                ColumnTitle2
  KauGroupName:"trim:right"   KauGroupSum
  Npp DateDoc NoDok OrgName Sodr Sum
  ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^

.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end
────┬────────────────────────────────────────┬────────────────────────────────────────────────────────────────────────────.{.?JoHdr01;┬─────────────────.}
  № │@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│                       Д  о  к  у  м  е  н  т  ы                            .{.?JoHdr02;│@~@@@@@@@@@@@@@@@.}
 п/п│                                        │                                                                            .{.?JoHdr03;│@~@@@@@@@@@@@@@@@.}
    │                                        │   Дата   │ Номер  │     Плательщик/получатель    │   Содержание операции   .{.?JoHdr04;│                 .}
────┼────────────────────────────────────────┼──────────┼────────┼──────────────────────────────┼─────────────────────────.{.?JoHdr05;┼─────────────────.}
.{
.if JoNeedGroup
 .{.?JoBod02;.}   │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │        │                              │                         .{.?JoBod03;│&'&&&&&&&&&&&&&& .}
.end
.if JoNeedRow
&&&&│                                        │@@@@@@@@@@│@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&& .}
.end
.}
────┴────────────────────────────────────────┴──────────┴────────┴──────────────────────────────┴─────────────────────────.{.?JoFtr01;┼─────────────────.}
 БИтого                                                                                                                     .{.?JoFtr02;│&'&&&&&&&&&&&&&& .} Б
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────.{.?JoFtr03;┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform
!-------------------------------------------------------------------------------

.linkform 'jo_tuned10_Kol' prototype is 'jo_tuned'
.group 'в разрезе счетов и документов (количество)'
.nameinlist 'Универсальный журнал-ордер в разрезе счетов и документов'
.defo landscape
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
  CommonFormHeader
  MyOrg
  RepName
  BegDate EndDate
  ВалютаОтчета
  TuneSchetTitle
  TuneSchetName
  FltName FltSpec FltSpec2
  KauTableName  ColumnTitle1 RepType
  KauGroupName:"trim:right" KauGroupKolVo KauGroupSum
  Npp DateDoc NoDok OrgName Sodr KolVo Sum
  ItogKolVo ItogSum
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

 Б  ^  c ^ по ^ Б

Ведомость сформирована в ^

.if OkJoSchet
.{
 В^ В
.{
 В  ^ В
.}
.}
.end
.if OkJoFilter
Применен фильтр...
.{
   В^ В
.{
     В^ ^ В
.}
.}
.end
────┬────────────────────────────────────────┬────────────────────────────────────────────────────────────────────────────.{.?JoHdr01;┬──────────────────────────────────.}
  № │@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│                       Д  о  к  у  м  е  н  т  ы                            .{.?JoHdr02;│@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.}
 п/п│                                        │──────────┬────────┬──────────────────────────────┬─────────────────────────.{.?JoHdr03;│────────────────┬─────────────────.}
    │                                        │   Дата   │ Номер  │     Плательщик/получатель    │   Содержание операции   .{.?JoHdr04;│@~@@@@@@@@@@@@@@│      Сумма      .}
────┼────────────────────────────────────────┼──────────┼────────┼──────────────────────────────┼─────────────────────────.{.?JoHdr05;┼────────────────┼─────────────────.}
.{
.if JoNeedGroup
 .{.?JoBod02;.}   │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │        │                              │                         .{.?JoBod03;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .}
.end
.if JoNeedRow
&&&&│                                        │@@@@@@@@@@│@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@.{.?JoBod01;│&#'&&&&&&&&&&&&&│&#'&&&&&&&&&&&&& .}
.end
.}
────┴────────────────────────────────────────┴──────────┴────────┴──────────────────────────────┴─────────────────────────.{.?JoFtr01;┼────────────────┼─────────────────.}
 БИтого                                                                                                                     .{.?JoFtr02;│&'&&&&&&&&&&&&&&│&'&&&&&&&&&&&&&& .} Б
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────.{.?JoFtr03;┴────────────────┴─────────────────.}
 Б
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_jo_tuned
.{checkenter FeeSignersCycle_jo_tuned
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
BuhName
RepUserName
.endfields
Главный бухгалтер  ___________________  ^
                           подпись
Ответственный за выпуск ___________________ ^
                              подпись
.end
 Щ
.endform
