//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
//------------------------------------------------------------------------------
// Галактика 7.12 - ФРО
// Обороты в валюте в разрезе субсчетов
//------------------------------------------------------------------------------

#doc
Базовая форма отчета "Обороты в валюте в разрезе субсчетов"
#end
.set name = 'ObSubVal'
.group 'obsubval_f1'
.nameinlist 'Базовая форма ObSubVal'
.hide
.fields
c00p1 c00p2
c0p2 c0p3 c0p4 c0p5 c0p6 c0p7
c1f1
c2f1 c2f2
c0p0
c1p1 c1p1n
c2p1 c2p2
c3p1 c3p2
c4p1 c4p2 c4p3 c4p4 c4p5 c4p6 c4p7 c4p71 c4p8 c4p9
c4p10 c4p10r c4p10v c4p11 c4p11r c4p11v
c4_p3 c4_p3r c4_p3v c4_p4 c4_p4r c4_p4v
c3_p3 c3_p3r c3_p3v c3_p4 c3_p4r c3_p4v
c2_p1 c2_p1r c2_p1v c2_p2 c2_p2r c2_p2v c2_p3 c2_p3r c2_p3v c2_p4 c2_p4r c2_p4v c2_p5 c2_p5r c2_p5v c2_p6 c2_p6r c2_p6v
c1_p1 c1_p1r c1_p1v c1_p2 c1_p2r c1_p2v c1_p3 c1_p3r c1_p3v c1_p4 c1_p4r c1_p4v c1_p5 c1_p5r c1_p5v c1_p6 c1_p6r c1_p6v
.endfields
c00p1   счет             ^
c00p2   имя счета        ^
c0p2    Интервал начало  ^
c0p3             конец   ^
c0p4    Нац ДЕ (имя)   ^
c0p5    Нац ДЕ (симв)  ^
c0p6    Валюта отчетов (имя)   ^
c0p7    Валюта отчетов (симв)  ^
.if OkFilOval
.{
c1f1 ^
.{
c2f1 ^
c2f2 ^
.}
.}
.end
.{
----------------------------------------------------------------------------
c0p0    Имя валюты     ^
.{
.if OkSubValSubO
c1p1    Субсчет осн счета  ^
c1p1n        имя субсчета  ^
.end
.{
c2p1    Корресп. счет   ^
c2p2         имя счета  ^
.{
.if OkSubValSubK
c3p1    Субсчет корр. счета ^
c3p2          имя субсчета  ^
.end
.{
c4p1   дата         ^
c4p2   N док        ^
c4p3   кор счет     ^
c4p4   субсчет кор  ^
c4p5   Плательщик   ^
c4p6   Операция     ^
c4p7   Операция в валюте   ^
c4p71  Курс валюты         ^
c4p8   оборот в НДЕ        ^
c4p9   оборот в БВ         ^
c4p10    обороты по дебету      ^
c4p10r                          ^
c4p10v                          ^
c4p11    обороты по кредиту     ^
c4p11r                          ^
c4p11v                          ^
----------------------------------------------------------------------------
.}
.if OkSubValSumSubK
Сумма по субсчету корреспонд.
c4_p3     обороты по дебету      ^
c4_p3r                           ^
c4_p3v                           ^
c4_p4     обороты по кредиту     ^
c4_p4r                           ^
c4_p4v                           ^
.end
.}
.if OkSubValSumSchK
Сумма по корресп. счету
c3_p3     обороты по дебету      ^
c3_p3r                           ^
c3_p3v                           ^
c3_p4     обороты по кредиту     ^
c3_p4r                           ^
c3_p4v                           ^
.end
.}
.if OkSubValSumSubO
Сумма по субсчету
c2_p1     сальдо вход по дебету  ^
c2_p1r                           ^
c2_p1v                           ^
c2_p2     сальдо вход по кредиту ^
c2_p2r                           ^
c2_p2v                           ^
c2_p3     обороты по дебету      ^
c2_p3r                           ^
c2_p3v                           ^
c2_p4     обороты по кредиту     ^
c2_p4r                           ^
c2_p4v                           ^
c2_p5     сальдо исх по дебету   ^
c2_p5r                           ^
c2_p5v                           ^
c2_p6     сальдо исх по кредиту  ^
c2_p6r                           ^
c2_p6v                           ^
.end
.}
Итого по валюте
c1_p1     сальдо вход по дебету  ^
c1_p1r                           ^
c1_p1v                           ^
c1_p2     сальдо вход по кредиту ^
c1_p2r                           ^
c1_p2v                           ^
c1_p3     обороты по дебету      ^
c1_p3r                           ^
c1_p3v                           ^
c1_p4     обороты по кредиту     ^
c1_p4r                           ^
c1_p4v                           ^
c1_p5     сальдо исх по дебету   ^
c1_p5r                           ^
c1_p5v                           ^
c1_p6     сальдо исх по кредиту  ^
c1_p6r                           ^
c1_p6v                           ^
----------------------------------------------------------------------------
.}
.endform
!==============================================================================
.linkform 'ObSubVal_01' prototype is 'ObSubVal'
.group 'obsubval_f1'
.nameinlist '1. Обороты в разрезе валют по операциям (эквивалент в НДЕ)'
.p 60
.defo landscape
.nonextheader
.fields
CommonFormHeader
c00p1 c00p2
c0p2 c0p3
c1f1
c2f1 c2f2
c0p0
c1p1 c1p1n
c4p1 c4p2 c4p3 c4p4 c4p10 c4p11 c4p8 c4p71 c4p6 c4p5
c3p1 c3p2  c4_p3 c4_p4 c4_p3r c4_p4r
c2p1 c2p2  c3_p3 c3_p4 c3_p3r c3_p4r
c1p1 c1p1n c0p5  c2_p1 c2_p2  c2_p1r c2_p2r c2_p3 c2_p4 c2_p3r c2_p4r c2_p5 c2_p6 c2_p5r c2_p6r
c0p0       c0p5  c1_p1 c1_p2  c1_p1r c1_p2r c1_p3 c1_p4 c1_p3r c1_p4r c1_p5 c1_p6 c1_p5r c1_p6r
.endfields
 Р^
                          Ведомость оборотов в валюте по счету
                          Б^ - ^ Б
                                      с  Б^ Б г. по  Б^ Б г.
.if OkFilOval
 БПрименен фильтр... Б
.{
   ^
.{
      ^ ^
.}
.}
.end
.{
.[h
                                                                                                                                                                 лист @np@
──────────┬──────┬──────────┬───────────────────────────────────┬──────────────────┬──────────┬──────────────────────────────────────────┬──────────────────────────────────────────
          │ Номер│ Корресп. │              Обороты              │                  │          │                                          │
  Д а т а │ доку-├────┬─────┤                                   │    Эквивалент    │   Курс   │           Содержание                     │               Плательщик /
          │ мента│Счет│Суб- ├─────────────────┬─────────────────┤  операции в НДЕ  │  валюты  │            операции                      │               Получатель
          │      │    │счет │      Дебет      │      Кредит     │                  │          │                                          │
──────────┴──────┴────┴─────┴─────────────────┴─────────────────┴──────────────────┴──────────┴──────────────────────────────────────────┴──────────────────────────────────────────
.]h
 БВалюта : ^ Б
.{
.if OkSubValSubO
 БСубсчет : ^ ^ Б
.end
.{
.{
.if OkSubValSubK
.end
.{
@@@@@@@@@@ @@@@@@ @@@@ @@@@@ &#'&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&& @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.if OkSubValSumSubK
 БИтого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
                                Б___Д Е Б Е Т___         ___К Р Е Д И Т___ Б
         обороты в валюте : &'&&&&&&&&&&&&&&&&&&&    &'&&&&&&&&&&&&&&&&&&&
         обороты в НДЕ    : &'&&&&&&&&&&&&&&&&&&&    &'&&&&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkSubValSumSchK
 БИтого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
                                Б___Д Е Б Е Т___         ___К Р Е Д И Т___ Б
         обороты в валюте : &'&&&&&&&&&&&&&&&&&&&    &'&&&&&&&&&&&&&&&&&&&
         обороты в НДЕ    : &'&&&&&&&&&&&&&&&&&&&    &'&&&&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.if OkSubValSumSubO
 БИтого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
                          Б___Д Е Б Е Т___          ___К Р Е Д И Т___           ___Д Е Б Е Т___    @@@@@@  ___К Р Е Д И Т___ Б
   сальдо входящее  : &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&
   обороты          : &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&
   сальдо исходящее : &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                          Б___Д Е Б Е Т___          ___К Р Е Д И Т___           ___Д Е Б Е Т___    @@@@@@  ___К Р Е Д И Т___ Б
   сальдо входящее  : &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&
   обороты          : &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&
   сальдо исходящее : &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&
════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════
.}
Бухгалтер
Ответственный за выпуск Р
.endform
!==============================================================================
.linkform 'ObSubVal_011' prototype is 'ObSubVal'
.group 'obsubval_f1'
.nameinlist '2. Обороты в разрезе валют по субсчетам, итоговые суммы'
.p 80
.defo portrait
.nonextheader
.fields
CommonFormHeader
c00p1 c00p2
c0p2 c0p3
c1f1
c2f1 c2f2
c0p0
c1p1 c2p1 c3p1  c4_p3 c4_p3r c4_p4 c4_p4r
c2p1            c3_p3 c3_p3r c3_p4 c3_p4r
c00p1 c1p1 c2_p1 c2_p1r c2_p2 c2_p2r
           c2_p3 c2_p3r c2_p4 c2_p4r
           c2_p5 c2_p5r c2_p6 c2_p6r
c0p0       c1_p1 c1_p1r c1_p2 c1_p2r
           c1_p3 c1_p3r c1_p4 c1_p4r
           c1_p5 c1_p5r c1_p6 c1_p6r
.endfields
 И^
                          Ведомость оборотов в валюте по счету
                          Б^ - ^ Б
                                      с  Б^ Б г. по  Б^ Б г.
.if OkFilOval
 БПрименен фильтр... Б
.{
   ^
.{
      ^ ^
.}
.}
.end
.{
.[h
                                                                      лист @np@
─────┬──────────┬─────────────────────────────────────────────────────────────────────────
Суб- │ Корресп. │                                 Обороты
счет ├────┬─────┼────────────────────────────────────┬────────────────────────────────────
осн. │счет│суб- │               Дебет                │               Кредит
счт. │    │счет ├─────────────────┬──────────────────┼─────────────────┬──────────────────
     │    │     │     в валюте    │      в НДЕ       │     в валюте    │      в НДЕ
─────┴────┴─────┴─────────────────┴──────────────────┴─────────────────┴──────────────────
.]h
 БВалюта : ^ Б
.{
.if OkSubValSubO
.end
.{
.{
.if OkSubValSubK
.end
.{
.}
.if OkSubValSumSubK
 Б@@@@@ @@@@ @@@@@ Б &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&&
.end
.}
.if OkSubValSumSchK
 БИтого по  @@@@@ Б  &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&&
.end
.}
.if OkSubValSumSubO
 БИтого по счету @@@@ субсчету @@@@@ Б
 сальдо вход.  &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
 обороты       &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
 сальдо исход. &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
──────────────────────────────────────────────────────────────────────────────────────────
.end
.}
 БИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
 сальдо вход.  &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
 обороты       &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
 сальдо исход. &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
══════════════════════════════════════════════════════════════════════════════════════════
.}
Бухгалтер
Ответственный за выпуск И
.endform
!==============================================================================
.linkform 'ObSubVal_02' prototype is 'ObSubVal'
.group 'obsubval_f2'
.nameinlist '1. Обороты в разрезе валют по операциям (эквивалент в валюте отчетов)'
.p 80
.defo portrait
.nonextheader
.fields
CommonFormHeader
c00p1 c00p2
c0p2 c0p3
c0p6
c1f1
c2f1 c2f2
c0p0
c1p1 c1p1n
c4p1 c4p2 c4p3 c4p4 c4p10 c4p11 c4p9 c4p6 c4p5
c3p1 c3p2  c4_p3 c4_p4 c4_p3v c4_p4v
c2p1 c2p2  c3_p3 c3_p4 c3_p3v c3_p4v
c1p1 c1p1n c0p7  c2_p1 c2_p2  c2_p1v c2_p2v c2_p3 c2_p4 c2_p3v c2_p4v c2_p5 c2_p6 c2_p5v c2_p6v
c0p0       c0p7  c1_p1 c1_p2  c1_p1v c1_p2v c1_p3 c1_p4 c1_p3v c1_p4v c1_p5 c1_p6 c1_p5v c1_p6v
.endfields
 Ш^
                          Ведомость оборотов в валюте по счету
                          Б^ - ^ Б
                                      с  Б^ Б г. по  Б^ Б г.
Валюта отчетов : в  Б^ Б
.if OkFilOval
 БПрименен фильтр... Б
.{
   ^
.{
      ^ ^
.}
.}
.end
.{
.[h
                                                                                                                                        лист @np@
──────────┬──────┬──────────┬───────────────────────────────────┬──────────────────┬──────────────────────────────────┬───────────────────────────────
          │ Номер│ Корресп. │              Обороты              │                  │                                  │
  Д а т а │ доку-├────┬─────┤                                   │    Эквивалент    │            Содержание            │           Плательщик /
          │ мента│Счет│Суб- ├─────────────────┬─────────────────┤    операции в    │             операции             │           Получатель
          │      │    │счет │      Дебет      │      Кредит     │  валюте отчетов  │                                  │
──────────┴──────┴────┴─────┴─────────────────┴─────────────────┴──────────────────┴──────────────────────────────────┴───────────────────────────────
.]h
 БВалюта : ^ Б
.{
.if OkSubValSubO
 БСубсчет : ^ ^ Б
.end
.{
.{
.if OkSubValSubK
.end
.{
@@@@@@@@@@ @@@@@@ @@@@ @@@@@ &#'&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.if OkSubValSumSubK
 БИтого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
                                Б___Д Е Б Е Т___         ___К Р Е Д И Т___ Б
         обороты в валюте : &'&&&&&&&&&&&&&&&&&&&    &'&&&&&&&&&&&&&&&&&&&
         обороты в ВО     : &'&&&&&&&&&&&&&&&&&&&    &'&&&&&&&&&&&&&&&&&&&
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── А─
.end
.}
.if OkSubValSumSchK
 БИтого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
                                Б___Д Е Б Е Т___         ___К Р Е Д И Т___ Б
         обороты в валюте : &'&&&&&&&&&&&&&&&&&&&    &'&&&&&&&&&&&&&&&&&&&
         обороты в ВО     : &'&&&&&&&&&&&&&&&&&&&    &'&&&&&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── А────
.end
.}
.if OkSubValSumSubO
 БИтого по @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
                          Б___Д Е Б Е Т___          ___К Р Е Д И Т___           ___Д Е Б Е Т___    @@@@@@  ___К Р Е Д И Т___ Б
   сальдо входящее  : &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&
   обороты          : &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&
   сальдо исходящее : &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── А───
.end
.}
 БИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
                          Б___Д Е Б Е Т___          ___К Р Е Д И Т___           ___Д Е Б Е Т___    @@@@@@  ___К Р Е Д И Т___ Б
   сальдо входящее  : &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&
   обороты          : &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&
   сальдо исходящее : &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&      &'&&&&&&&&&&&&&&&&&&&
═══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════ А═══
.}
Бухгалтер
Ответственный за выпуск Ш
.endform
!==============================================================================
.linkform 'ObSubVal_031' prototype is 'ObSubVal'
.group 'obsubval_f3'
.nameinlist '1. Обороты в разрезе валют по субсчетам, итоговые суммы'
.p 80
.defo portrait
.nonextheader
.fields
CommonFormHeader
c00p1 c00p2
c0p2 c0p3
c1f1
c2f1 c2f2
c0p7 c0p5 c0p7 c0p5
c0p0
c1p1 c2p1 c3p1  c4_p3 c4_p3v c4_p3r c4_p4 c4_p4v c4_p4r
c2p1            c3_p3 c3_p3v c3_p3r c3_p4 c3_p4v c3_p4r
c00p1 c1p1      c2_p1 c2_p1v c2_p1r c2_p2 c2_p2v c2_p2r
                c2_p3 c2_p3v c2_p3r c2_p4 c2_p4v c2_p4r
                c2_p5 c2_p5v c2_p5r c2_p6 c2_p6v c2_p6r
c0p0            c1_p1 c1_p1v c1_p1r c1_p2 c1_p2v c1_p2r
                c1_p3 c1_p3v c1_p3r c1_p4 c1_p4v c1_p4r
                c1_p5 c1_p5v c1_p5r c1_p6 c1_p6v c1_p6r
.endfields
 Р^
                          Б Ведомость оборотов в валюте по счету Б
                          Б^ - ^ Б
                          Б             с ^ г. по ^ г. Б
.if OkFilOval
 БПрименен фильтр... Б
.{
   ^
.{
      ^ ^
.}
.}
.end
.{
.[h
                                                                                                                    лист @np@
─────┬──────────┬───────────────────────────────────────────────────────────────────────────────────────────────────────────────
Суб- │ Корресп. │                                                   Обороты
счет ├────┬─────┼───────────────────────────────────────────────────────┬───────────────────────────────────────────────────────
осн. │счет│суб- │                        Дебет                          │                       Кредит
счт. │    │счет ├─────────────────┬──────────────────┬──────────────────┼─────────────────┬──────────────────┬──────────────────
     │    │     │     в валюте    │    в @@@@@       │      в @@@@@     │     в валюте    │      в @@@@@     │      в @@@@@
─────┴────┴─────┴─────────────────┴──────────────────┴──────────────────┴─────────────────┴──────────────────┴──────────────────
.]h
 БВалюта : ^ Б
.{
.if OkSubValSubO
.end
.{
.{
.if OkSubValSubK
.end
.{
.}
.if OkSubValSumSubK
@@@@@ @@@@ @@@@@ &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&&
.end
.}
.if OkSubValSumSchK
 БИтого по  @@@@@ Б  &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&&
.end
.}
.if OkSubValSumSubO
 БИтого по счету @@@@ субсчету @@@@@ Б
 сальдо вход.    &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&&
 обороты         &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&&
 сальдо исход.   &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&&
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
 БИтого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
 Б сальдо вход.    &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&&
 обороты         &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&&
 сальдо исход.   &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& С
 Р════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════
.}
Бухгалтер
Ответственный за выпуск Р
.endform
!==============================================================================
 А
