//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
//------------------------------------------------------------------------------
// Галактика 7.12 - ФРО
// Обороты в валюте
//------------------------------------------------------------------------------
#include FeeSigners.frn
#doc
Базовая форма отчета "Обороты в валюте"
#end
.set name = 'obvalut'
.group 'obvalut_f1'
.nameinlist 'Базовая форма ObValut'
.hide
.fields
c0p1 c0p1n c0p2 c0p3 c0p4 c0p5 c0p6 c0p7
c1f1
c2f1 c2f2
c3p1 c3p2 c3p3 c3p4 c3p5 c3p6 c3p7 c3p8 c3p9 c3p9r c3p9v c3p10 c3p10r c3p10v
c3_p9r c3_p9v c3_p10r c3_p10v
c2_p9r c2_p9v c2_p10r c2_p10v
c1_p9r c1_p9v c1_p10r c1_p10v
#FeeSignersCycleFields
.endfields
c0p1    Счет N           ^
c0p1n   Счет имя         ^
c0p2    Интервал начало  ^
c0p3             конец   ^
c0p4    Нац ДЕ (имя)     ^
c0p5    Нац ДЕ (симв)    ^
c0p6    Валюта отчетов (имя)   ^
c0p7    Валюта отчетов (симв)  ^
.if OkFilOvalut
.{
c1f1 ^
.{
c2f1 ^
c2f2 ^
.}
.}
.end
.{
.{
.{
c3p1   дата         ^
c3p2   N док        ^
c3p3   кор счет     ^
c3p4   субсчет кор  ^
c3p5   Плательщик   ^
c3p6   Операция     ^
c3p7   Операция в валюте      ^
c3p8   Курс валюты            ^
c3p9     обороты по дебету      ^
c3p9r                           ^
c3p9v                           ^
c3p10    обороты по кредиту     ^
c3p10r                          ^
c3p10v                          ^
.}
Сумма по корр. субсчету
c3_p9r     обороты по дебету      ^
c3_p9v                           ^
c3_p10r    обороты по кредиту     ^
c3_p10v                          ^
.}
Сумма по корр. счету
c2_p9r     обороты по дебету      ^
c2_p9v                           ^
c2_p10r    обороты по кредиту     ^
c2_p10v                          ^
.}
Итого по счету
c1_p9r    обороты по дебету      ^
c1_p9v                           ^
c1_p10r   обороты по кредиту     ^
c1_p10v                          ^
#FeeSignersCycle(ObValut)
.endform
!==============================================================================
.linkform 'obvalut_01' prototype is 'obvalut'
.group 'obvalut_f1'
.nameinlist '1. Обороты по счету в валюте (по операциям)'
.p 80
.defo portrait
.nonextheader
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n c0p2 c0p3
c1f1
c2f1 c2f2
c0p5 c0p5
c3p1 c3p2 c3p3 c3p4 c3p9 c3p9r c3p10 c3p10r c3p7 c3p8
c3_p9r c3_p10r
c2_p9r c2_p10r
c1_p9r c1_p10r
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Р^
^

                       Ведомость оборотов в валюте по счету
                 Б@@@ : ^ Б
                               с  Б^ Б г. по  Б^ Б г.
.if OkFilOvalut
 БПрименен фильтр... Б
.{
   ^
.{
      ^ ^
.}
.}
.end
.{
.[h
                                                                                                       лист @np@
──────────┬──────┬────────────┬─────────────────────────────────────────────────────────────────────┬───────────────┬─────────────
          │      │Корреспон-  │                              Обороты                                │               │
          │Номер │дирующий    ├──────────────────────────────────┬──────────────────────────────────┤ Наименование  │  К у р с
   Дата   │доку- ├─────┬──────┤              Дебет               │             Кредит               │               │
          │мента │Счет │Суб-  ├────────────────┬─────────────────┼────────────────┬─────────────────┤    валюты     │  валюты
          │      │     │счет  │    в валюте    │    в @@@@@@@    │   в валюте     │   в @@@@@@      │               │
──────────┴──────┴─────┴──────┴────────────────┴─────────────────┴────────────────┴─────────────────┴───────────────┴─────────────
.]h
.{
.{
@@@@@@@@@@ @@@@@@ @@@@@ @@@@@@ &'#&&&&&&&&&&&&& &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&& &'#&&&&&&&&&&&&&& @@@@@@@@@@@@@@@ &#'&&&&&&&&&&
.}
 БСумма по корр. субсчету                         &'&&&&&&&&&&&&&&&                  &'&&&&&&&&&&&&&&& Б
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
 БСумма по корр. счету                            &'&&&&&&&&&&&&&&&                  &'&&&&&&&&&&&&&&& Б
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
 БИтого по счету                                  &'&&&&&&&&&&&&&&&                  &'&&&&&&&&&&&&&&& Б
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_ObValut
.{ checkenter FeeSignersCycle_ObValut
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
Бухгалтер
Ответственный за выпуск
.end Р
.endform
!==============================================================================
.linkform 'obvalut_02' prototype is 'obvalut'
.group 'obvalut_f1'
.nameinlist '2. Обороты по счету в валюте (по содержанию)'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n c0p2 c0p3
c1f1
c2f1 c2f2
c0p5 c0p5
c3p1 c3p2 c3p3 c3p4 c3p6 c3p5 c3p7 c3p8 c3p9 c3p9r c3p10 c3p10r
c3_p9r c3_p10r
c2_p9r c2_p10r
c1_p9r c1_p10r
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Ш^
^

                       Ведомость оборотов в валюте по счету
                 Б@@@ : ^ Б
                               с  Б^ Б г. по  Б^ Б г.
.if OkFilOvalut
 БПрименен фильтр... Б
.{
   ^
.{
      ^ ^
.}
.}
.end
.{
.[h
                                                                                                                                                                                             лист @np@
──────────┬───────┬───────────┬────────────────────────────────────────┬─────────────────────────────────────────┬───────────────┬────────────┬───────────────────────────────────────────────────────────────────
          │       │Корреспон- │                                        │                                         │               │            │                             Обороты
          │ Номер │дирующий   │               Содержание               │               Плательщик/               │  Наименование │  К у р с   ├─────────────────────────────────┬─────────────────────────────────
   Дата   │ доку- ├─────┬─────┤                                        │                                         │               │            │              Дебет              │             Кредит
          │ мента │Счет │Суб- │                операции                │               Получатель                │     валюты    │  валюты    ├────────────────┬────────────────┼────────────────┬────────────────
          │       │     │счет │                                        │                                         │               │            │    в валюте    │    в @@@@@@    │   в валюте     │   в @@@@@@
──────────┴───────┴─────┴─────┴────────────────────────────────────────┴─────────────────────────────────────────┴───────────────┴────────────┴────────────────┴────────────────┴────────────────┴────────────────
.]h
.{
.{
@@@@@@@@@@ @@@@@@@ @@@@@ @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &#'&&&&&&&&& &'#&&&&&&&&&&&&& &'#&&&&&&&&&&&&& &'#&&&&&&&&&&&&& &'#&&&&&&&&&&&&&
.}
 БСумма по корр. субсчету                                                                                                                                         &'&&&&&&&&&&&&&&                  &'&&&&&&&&&&&&&& Б
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
 БСумма по корр. счету                                                                                                                                            &'&&&&&&&&&&&&&&                  &'&&&&&&&&&&&&&& Б
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
 БИтого по счету                                                                                                                                                  &'&&&&&&&&&&&&&&                  &'&&&&&&&&&&&&&& Б
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_ObValut
.{ checkenter FeeSignersCycle_ObValut
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
Бухгалтер
Ответственный за выпуск
.end Ш
.endform
!==============================================================================
.linkform 'obvalut_03' prototype is 'obvalut'
.group 'obvalut_f2'
.nameinlist '1. Обороты по счету в валюте (по операциям в валюте отчетов)'
.p 80
.defo portrait
.nonextheader
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n c0p2 c0p3
c1f1
c2f1 c2f2
c0p7 c0p7
c3p1 c3p2 c3p3 c3p4 c3p9 c3p9v c3p10 c3p10v c3p7 c3p8
c3_p9v c3_p10v
c2_p9v c2_p10v
c1_p9v c1_p10v
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Р^
^

                       Ведомость оборотов в валюте по счету
                 Б@@@ : ^ Б
                               с  Б^ Б г. по  Б^ Б г.
.if OkFilOvalut
 БПрименен фильтр... Б
.{
   ^
.{
      ^ ^
.}
.}
.end
.{
.[h
                                                                                                      лист @np@
──────────┬──────┬───────────┬─────────────────────────────────────────────────────────────────────┬───────────────┬───────────
          │      │Корреспон- │                              Обороты                                │               │
          │Номер │дирующий   ├──────────────────────────────────┬──────────────────────────────────┤ Наименование  │  К у р с
   Дата   │доку- ├─────┬─────┤              Дебет               │             Кредит               │               │
          │мента │Счет │Суб- ├────────────────┬─────────────────┼────────────────┬─────────────────┤    валюты     │  валюты
          │      │     │счет │    в валюте    │    в @@@@@@@    │   в валюте     │   в @@@@@@@     │               │
──────────┴──────┴─────┴─────┴────────────────┴─────────────────┴────────────────┴─────────────────┴───────────────┴───────────
.]h
.{
.{
@@@@@@@@@@ @@@@@@ @@@@@ @@@@@ &'#&&&&&&&&&&&&& &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&& &'#&&&&&&&&&&&&&& @@@@@@@@@@@@@@@ &#'&&&&&&&&
.}
 БСумма по корр. субсчету                        &'&&&&&&&&&&&&&&&                  &'&&&&&&&&&&&&&&& Б
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
 БСумма по корр. счету                           &'&&&&&&&&&&&&&&&                  &'&&&&&&&&&&&&&&& Б
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
 БИтого по счету                                 &'&&&&&&&&&&&&&&&                  &'&&&&&&&&&&&&&&& Б
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_ObValut
.{ checkenter FeeSignersCycle_ObValut
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
Бухгалтер
Ответственный за выпуск
.end Р
.endform
!==============================================================================
.linkform 'obvalut_04' prototype is 'obvalut'
.group 'obvalut_f3'
.nameinlist '1. Обороты по счету в валюте (по операциям в НДЕ и валюте отчетов)'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p1n c0p2 c0p3
c1f1
c2f1 c2f2
c0p5 c0p7 c0p5 c0p7
c3p1 c3p2 c3p3 c3p4 c3p9 c3p9r c3p9v c3p10 c3p10r c3p10v c3p7 c3p8
c3_p9r c3_p9v c3_p10r c3_p10v
c2_p9r c2_p9v c2_p10r c2_p10v
c1_p9r c1_p9v c1_p10r c1_p10v
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Р^
^

                       Ведомость оборотов в валюте по счету
                 Б@@@ : ^ Б
                               с  Б^ Б г. по  Б^ Б г.
.if OkFilOvalut
 БПрименен фильтр... Б
.{
   ^
.{
      ^ ^
.}
.}
.end
.{
.[h
                                                                                                                                       лист @np@
──────────┬──────┬───────────┬──────────────────────────────────────────────────────────────────────────────────────────────────────────┬───────────────┬─────────────
          │      │Корреспон- │                                                    Обороты                                               │               │
          │Номер │дирующий   ├───────────────────────────────────────────────────┬──────────────────────────────────────────────────────┤ Наименование  │  К у р с
   Дата   │доку- ├─────┬─────┤                        Дебет                      │                       Кредит                         │               │
          │мента │Счет │Суб- ├─────────────────┬────────────────┬────────────────┼─────────────────┬─────────────────┬──────────────────┤    валюты     │  валюты
          │      │     │счет │    в валюте     │    в @@@@@@    │    в @@@@@@    │   в валюте      │    в @@@@@@     │   в @@@@@@@@     │               │
──────────┴──────┴─────┴─────┴─────────────────┴────────────────┴────────────────┴─────────────────┴─────────────────┴──────────────────┴───────────────┴─────────────
.]h
.{
.{
@@@@@@@@@@ @@@@@@ @@@@@ @@@@@ &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&& &'#&&&&&&&&&&&&& &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&& &'#&&&&&&&&&&&&&&& @@@@@@@@@@@@@@@ &#'&&&&&&&&&&
.}
 БСумма по корр. субсчету                         &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&                   &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
 БСумма по корр. счету                            &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&                   &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
 БИтого по счету                                  &'&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&                   &'&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_ObValut
.{ checkenter FeeSignersCycle_ObValut
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
Бухгалтер
Ответственный за выпуск
.end Р
.endform
!==============================================================================
