//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
//------------------------------------------------------------------------------
// Галактика 7.12
// Интерактивная Главная книга - Отчет
//------------------------------------------------------------------------------

!-------------------------------------------------------------------------------
#doc
Базовая форма отчета "Интерактивная Главная книга"
#end
.set name = 'OnLineMB'
.hide
.fields
  НачальнаяДата
  КонечнаяДата
  НазваниеНДЕ
  НазваниеВалютыОтчета
  
  ФильтрНазвание
  ФильтрЗначение

  ОсновнойСчет
  ОсновнойСубсчет
  КоррСчет
  КоррСубсчет

  ВСДебетНДЕ
  ВСКредитНДЕ
  ОбДебетНДЕ
  ОбКредитНДЕ
  ИСДебетНДЕ
  ИСКредитНДЕ

  ВСДебетВО
  ВСКредитВО
  ОбДебетВО
  ОбКредитВО
  ИСДебетВО
  ИСКредитВО

  ИтоговыйСчет
  ИтоговыйСубсчет

  ИтогоВСДебетНДЕ
  ИтогоВСКредитНДЕ
  ИтогоОбДебетНДЕ
  ИтогоОбКредитНДЕ
  ИтогоИСДебетНДЕ
  ИтогоИСКредитНДЕ

  ИтогоВСДебетВО
  ИтогоВСКредитВО
  ИтогоОбДебетВО
  ИтогоОбКредитВО
  ИтогоИСДебетВО
  ИтогоИСКредитВО
.endfields
НачальнаяДата          ^
КонечнаяДата           ^
НазваниеНДЕ            ^
НазваниеВалютыОтчета   ^
.if OnlineMB_Filter
.{
  ^
.{
    ^
.}
.}
.end
.{
.{ GroupData CheckEnter
ОсновнойСчет    ^
ОсновнойСубсчет ^
КоррСчет        ^
КоррСубсчет     ^

ВСДебетНДЕ      ^
ВСКредитНДЕ     ^
ОбДебетНДЕ      ^
ОбКредитНДЕ     ^
ИСДебетНДЕ      ^
ИСКредитНДЕ     ^

ВСДебетВО       ^
ВСКредитВО      ^
ОбДебетВО       ^
ОбКредитВО      ^
ИСДебетВО       ^
ИСКредитВО      ^
.}
.{ Schet_GroupFooter CheckEnter
ИтоговыйСчет     ^
ИтоговыйСубсчет  ^

ИтогоВСДебетНДЕ  ^
ИтогоВСКредитНДЕ ^
ИтогоОбДебетНДЕ  ^
ИтогоОбКредитНДЕ ^
ИтогоИСДебетНДЕ  ^
ИтогоИСКредитНДЕ ^

ИтогоВСДебетВО   ^
ИтогоВСКредитВО  ^
ИтогоОбДебетВО   ^
ИтогоОбКредитВО  ^
ИтогоИСДебетВО   ^
ИтогоИСКредитВО  ^
.if EndLine
.end
.}
.}
.endform
!-------------------------------------------------------------------------------
.LinkForm 'OnLineMB_01_Nde' prototype is 'OnLineMB'
.NameInList 'Главная книга (НДЕ)'
.Defo Portrait
.NoNextHeader
.fields
  CommonFormHeader
  НачальнаяДата
  КонечнаяДата
  НазваниеНДЕ
  
  ФильтрНазвание
  ФильтрЗначение

  ОсновнойСчет
  ОсновнойСубсчет
  КоррСчет
  КоррСубсчет

  ВСДебетНДЕ
  ВСКредитНДЕ
  ОбДебетНДЕ
  ОбКредитНДЕ
  ИСДебетНДЕ
  ИСКредитНДЕ

  ИтоговыйСчет
  ИтоговыйСубсчет

  ИтогоВСДебетНДЕ
  ИтогоВСКредитНДЕ
  ИтогоОбДебетНДЕ
  ИтогоОбКредитНДЕ
  ИтогоИСДебетНДЕ
  ИтогоИСКредитНДЕ
.endfields
 И^
                                         БГлавная книга Й
 И                                с @@@@@@@@@@@ по @@@@@@@@@@@ И
 ЪВедомость сформирована в ^ Ъ
.if OnlineMB_Filter
 ЪПрименен фильтр Ъ
.{
   Ъ^ Ъ
.{
     Ъ^ Ъ
.}
.}
.end
.{
.[H
 Щ──────────┬──────────┬─────────────────────────────────────────────────────────────────────────────────────────────────────────────────
  ОСНОВН. │ КОРРЕСП. │                                                      Сумма
────┬─────┼────┬─────┼─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
Счет│Суб- │Счет│Суб- │          Входящее сальдо            │               Обороты               │         Исходящее сальдо
    │счет │    │счет ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
    │     │    │     │       Дебет      │     Кредит       │       Дебет      │      Кредит      │       Дебет      │      Кредит
────┴─────┴────┴─────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴────────────────── Щ
.]H
.{ GroupData CheckEnter
 Ш@@@@ @@@@@ @@@@ @@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Ш
.}
.{ Schet_GroupFooter CheckEnter
 Щ@@@@ @@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Щ
.if EndLine
 Щ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Щ
.end
.}
.}
.endform
!-------------------------------------------------------------------------------
.LinkForm 'OnLineMB_01_ValRep' prototype is 'OnLineMB'
.NameInList 'Главная книга (валюта отчетов)'
.Defo Portrait
.NoNextHeader
.fields
  CommonFormHeader
  НачальнаяДата
  КонечнаяДата
  НазваниеВалютыОтчета
  
  ФильтрНазвание
  ФильтрЗначение

  ОсновнойСчет
  ОсновнойСубсчет
  КоррСчет
  КоррСубсчет

  ВСДебетВО
  ВСКредитВО
  ОбДебетВО
  ОбКредитВО
  ИСДебетВО
  ИСКредитВО

  ИтоговыйСчет
  ИтоговыйСубсчет

  ИтогоВСДебетВО
  ИтогоВСКредитВО
  ИтогоОбДебетВО
  ИтогоОбКредитВО
  ИтогоИСДебетВО
  ИтогоИСКредитВО
.endfields
 И^
                                         БГлавная книга Й
 И                                с @@@@@@@@@@@ по @@@@@@@@@@@ И
 ЪВедомость сформирована в ^ Ъ
.if OnlineMB_Filter
 ЪПрименен фильтр Ъ
.{
   Ъ^ Ъ
.{
     Ъ^ Ъ
.}
.}
.end
.{
.[H
 Щ──────────┬──────────┬─────────────────────────────────────────────────────────────────────────────────────────────────────────────────
  ОСНОВН. │ КОРРЕСП. │                                                      Сумма
────┬─────┼────┬─────┼─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
Счет│Суб- │Счет│Суб- │          Входящее сальдо            │               Обороты               │         Исходящее сальдо
    │счет │    │счет ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
    │     │    │     │       Дебет      │     Кредит       │       Дебет      │      Кредит      │       Дебет      │      Кредит
────┴─────┴────┴─────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴────────────────── Щ
.]H
.{ GroupData CheckEnter
 Ш@@@@ @@@@@ @@@@ @@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Ш
.}
.{ Schet_GroupFooter CheckEnter
 Щ@@@@ @@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Щ
.if EndLine
 Щ─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Щ
.end
.}
.}
.endform
!-------------------------------------------------------------------------------
