//------------------------------------------------------------------------------
//                                                      (c) Љ®аЇ®а жЁп ѓЂ‹ЂЉ’€ЉЂ
//------------------------------------------------------------------------------
// ѓ « ЄвЁЄ  5.8 - ЃгеЈ «вҐабЄЁ© Є®­вга
// Џа®б¬®ва б «м¤® §  ¬Ґбпж (нв  д®а¬  ЁбЇ®«м§гҐвбп в®«мЄ® ў Є®­б®«Ё¤ жЁЁ)
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// ”®а¬л Ё§ ЈагЇЇл "‘ «м¤® §  ¬Ґбпж" ­Ґ ЁбЇ®«м§говбп Ї®е®¦Ґ - ЇҐаҐўҐ¤Ґ­® ўбҐ ­ 
// д®а¬г SeeSaldMonth2
//------------------------------------------------------------------------------

#doc
Ѓ §®ў п д®а¬  ®взҐв  "‘ «м¤® §  ¬Ґбпж" (ў Є®­б®«Ё¤Ёа®ў ­­®© ®взҐв­®бвЁ)
#end
.set name = 'SeeSaldMonth'
.group '_‘ «м¤® §  ¬Ґбпж'
.nameinlist 'Ѓ §®ў п д®а¬  SeeSaldMonth'
.hide
.fields
c0p1 c0p1x c0p2 c0p3 c0p4 c0p5
cCurPS sCurPS
c1f1
c2f1 c2f2
c1p1 c1p2
c2p1 c2p2
c3p1
c4p1 c4p2
c5p1 c5p2
c6p1 c6p2
c20p1 c20p2
c21p1 c21p2
c22p1 c22p2
c7p1
c8p1 c8p2 c8p3 c8p4 c8p4v c8p5 c8p5v c8p6 c8p7 c8p8
c8_p1 c8_p1v c8_p2 c8_p2v
c7_p1 c7_p1v c7_p2 c7_p2v
c22_p1 c22_p1v c22_p2 c22_p2v
c21_p1 c21_p1v c21_p2 c21_p2v
c20_p1 c20_p1v c20_p2 c20_p2v
c6_p1 c6_p1v c6_p2 c6_p2v
c5_p1 c5_p1v c5_p2 c5_p2v
c4_p1 c4_p1v c4_p2 c4_p2v
c3_p1 c3_p1v c3_p2 c3_p2v
c2_p1 c2_p1v c2_p2 c2_p2v
c1_p1 c1_p1v c1_p2 c1_p2v
.endfields
c0p1    ЋвзҐв ­  ¤ вг Ј.       ^
c0p1x   ЋЄ®­з ­ЁҐ Ё­вҐаў «     ^
c0p2    Ќ ж „… (Ё¬п)   ^
c0p3    Ќ ж „… (бЁ¬ў)  ^
c0p4    ‚ «ов  ®взҐв®ў (Ё¬п)   ^
c0p5    ‚ «ов  ®взҐв®ў (бЁ¬ў)  ^
cCurPS  ’ҐЄгйЁ© Ї« ­ бзҐв®ў (nrec) ^
sCurPS  ’ҐЄгйЁ© Ї« ­ бзҐв®ў (Ё¬п)  ^
.if OkFilSdm
.{
c1f1 ^
.{
c2f1 ^
c2f2 ^
.}
.}
.end
.{
c1p1    Ё¬п бзҐв           ^
c1p2    ­®¬Ґа бзҐв         ^
.{
.if OkSub
c2p1    Ё¬п бгЎбзҐв        ^
c2p2    ­®¬Ґа бгЎбзҐв      ^
.end
.{
.if OkPodr
c3p1    Џ®¤а §¤Ґ«Ґ­ЁҐ      ^
.end
.{
.if OkKau1
c4p1    Ё¬п ЉЂ“ 1          ^
c4p2    Є®¤ ЉЂ“ 1          ^
.end
.{
.if OkKau2
c5p1    ЉЂ“ 2              ^
c5p2    Є®¤ ЉЂ“ 2          ^
.end
.{
.if OkKau3
c6p1    ЉЂ“ 3              ^
c6p2    Є®¤ ЉЂ“ 3          ^
.end
.{
.if OkKau4
c20p1    ЉЂ“ 4              ^
c20p2    Є®¤ ЉЂ“ 4          ^
.end
.{
.if OkKau5
c21p1    ЉЂ“ 5              ^
c21p2    Є®¤ ЉЂ“ 5          ^
.end
.{
.if OkKau6
c22p1    ЉЂ“ 6              ^
c22p2    Є®¤ ЉЂ“ 6          ^
.end
.{
c7p1    ”Ё«Ё «             ^
.{
c8p1    бзҐв               ^
c8p2    бгЎбзҐв            ^
c8p3    Љ г (Ї®«­®Ґ Ё¬п)   ^
c8p4    ‘ «м¤® Ї® ¤ҐЎҐвг   ^
c8p4v                      ^
c8p5           Ї® ЄаҐ¤Ёвг  ^
c8p5v                      ^
c8p6    ‚ ў «овҐ Ї® ¤ҐЎҐвг ^
c8p7                       ^
c8p8    ‚ «ов              ^
.}
€’ЋѓЋ Ї® ”€‹€Ђ‹“
c8_p1      ¤ҐЎҐв    ^
c8_p1v              ^
c8_p2      ЄаҐ¤Ёв   ^
c8_p2v              ^
.}
.if OkSumKau6
€’ЋѓЋ Ї® ЉЂ“ 6
c22_p1      ¤ҐЎҐв    ^
c22_p1v              ^
c22_p2      ЄаҐ¤Ёв   ^
c22_p2v              ^
.end
.}
.if OkSumKau5
€’ЋѓЋ Ї® ЉЂ“ 5
c21_p1      ¤ҐЎҐв    ^
c21_p1v              ^
c21_p2      ЄаҐ¤Ёв   ^
c21_p2v              ^
.end
.}
.if OkSumKau4
€’ЋѓЋ Ї® ЉЂ“ 4
c20_p1      ¤ҐЎҐв    ^
c20_p1v              ^
c20_p2      ЄаҐ¤Ёв   ^
c20_p2v              ^
.end
.}
.if OkSumKau3
€’ЋѓЋ Ї® ЉЂ“ 3
c7_p1      ¤ҐЎҐв    ^
c7_p1v              ^
c7_p2      ЄаҐ¤Ёв   ^
c7_p2v              ^
.end
.}
.if OkSumKau2
€’ЋѓЋ Ї® ЉЂ“ 2
c6_p1      ¤ҐЎҐв    ^
c6_p1v              ^
c6_p2      ЄаҐ¤Ёв   ^
c6_p2v              ^
.end
.}
.if OkSumKau1
€’ЋѓЋ Ї® ЉЂ“ 1
c5_p1      ¤ҐЎҐв    ^
c5_p1v              ^
c5_p2      ЄаҐ¤Ёв   ^
c5_p2v              ^
.end
.}
.if OkSumPodr
€’ЋѓЋ Ї® Ї®¤а §¤Ґ«Ґ­Ёо
c4_p1      ¤ҐЎҐв    ^
c4_p1v              ^
c4_p2      ЄаҐ¤Ёв   ^
c4_p2v              ^
.end
.}
.if OkSumSub
€’ЋѓЋ Ї® бгЎбзҐвг
c3_p1      ¤ҐЎҐв    ^
c3_p1v              ^
c3_p2      ЄаҐ¤Ёв   ^
c3_p2v              ^
.end
.}
€’ЋѓЋ Ї® бзҐвг
c2_p1      ¤ҐЎҐв    ^
c2_p1v              ^
c2_p2      ЄаҐ¤Ёв   ^
c2_p2v              ^
.}
€’ЋѓЋ Ї® ўҐ¤®¬®бвЁ
c1_p1      ¤ҐЎҐв    ^
c1_p1v              ^
c1_p2      ЄаҐ¤Ёв   ^
c1_p2v              ^
.endform
!==============================================================================
.linkform 'SeeSaldMonth_01' prototype is 'SeeSaldMonth'
.group '‘ «м¤® §  ¬Ґбпж'
.nameinlist '1. ‚е®¤пйҐҐ б «м¤® ­  ­ з «® ¬Ґбпж '
.p 80
.defo portrait
.nonextheader
.fields
CommonFormHeader
c0p1 c0p2
sCurPS
c1f1
c2f1 c2f2
c3p1
c4p1
c5p1
c6p1
c20p1
c21p1
c22p1
c8p1 c8p2 c8p3 c8p4 c8p5 c8p6 c8p7 c8p8
c22p1 c7_p1  c7_p2
c21p1 c22_p1 c22_p2
c20p1 c21_p1 c21_p2
c6p1  c20_p1 c20_p2
c5p1 c6_p1 c6_p2
c4p1 c5_p1 c5_p2
c3p1 c4_p1 c4_p2
c2p1 c3_p1 c3_p2
c1p1 c2_p1 c2_p2
c1_p1 c1_p2
.endfields
я^
                                           яЃ‚е®¤пйҐҐ б «м¤® ­   ^яЃ
‚Ґ¤®¬®бвм бд®а¬Ёа®ў ­  ў яЃ^яЃ
Џ« ­ бзҐв®ў яЃ^яЃ
.if OkFilSdm
яЃЏаЁ¬Ґ­Ґ­ дЁ«мва...яЃ
.{
   ^
.{
      ^ ^
.}
.}
.end
.{
.[h
                                                                                                                     «Ёбв @np@
ДДДДДДВДДДДДДДВДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДД
      і       і                                         і         ‘ Ђ ‹ њ „ Ћ ( ў Ќ„… )       і ‘ Ђ ‹ њ „ Ћ (®бв вЄЁ ў ў «овҐ)і
 ‘зҐв і‘гЎбзҐві          Ќ Ё¬Ґ­®ў ­ЁҐ ЉЂ“               ГДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДДЕДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДґ   Ќ Ё¬Ґ­®ў ­ЁҐ
      і       і                                         і       „ҐЎҐв      і      ЉаҐ¤Ёв      і     „ҐЎҐв     і    ЉаҐ¤Ёв     і      ў «овл
ДДДДДДБДДДДДДДБДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДД
.]h
.{
.if OkSub
.end
.{
.if OkPodr
яЃЏ®¤а §¤Ґ«Ґ­ЁҐ : ^яЃ
.end
.{
.if OkKau1
яЃЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau2
   яЃЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau3
      яЃЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau4
        яЃ ЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau5
          яЃ  ЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau6
            яЃ   ЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.{
@@@@@@ @@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&& &#'&&&&&&&&&&&& @@@@@@@@@@@@@@@@@
.}
.}
.if OkSumKau6
            яЃ   €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@яЃ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
               ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau5
          яЃ  €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@яЃ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
            ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau4
        яЃ €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@яЃ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
         ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau3
      яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@яЃ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau2
   яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@яЃ@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
   ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau1
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@яЃ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumPodr
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@яЃ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumSub
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@яЃ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.}
яЃ€в®Ј® Ї® ўҐ¤®¬®бвЁ                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДя
.endform
!==============================================================================
.linkform 'SeeSaldMonth_02' prototype is 'SeeSaldMonth'
.group '‘ «м¤® §  ¬Ґбпж ў ў «овҐ ®взҐв®ў'
.nameinlist '2. ‚е®¤пйҐҐ б «м¤® ­  ­ з «® ¬Ґбпж  ў ў «овҐ ®взҐв®ў'
.p 80
.defo portrait
.nonextheader
.fields
CommonFormHeader
c0p1 c0p4
c1f1
c2f1 c2f2
c3p1
c4p1
c5p1
c6p1
c20p1
c21p1
c22p1
c8p1 c8p2 c8p3 c8p4v c8p5v c8p6 c8p7 c8p8
c22p1 c7_p1v c7_p2v
c21p1 c22_p1v c22_p2v
c20p1 c21_p1v c21_p2v
c6p1  c20_p1v c20_p2v
c5p1 c6_p1v c6_p2v
c4p1 c5_p1v c5_p2v
c3p1 c4_p1v c4_p2v
c2p1 c3_p1v c3_p2v
c1p1 c2_p1v c2_p2v
c1_p1v c1_p2v
.endfields
я^
                                           яЃ‚е®¤пйҐҐ б «м¤® ­   ^яЃ
яЃ‚Ґ¤®¬®бвм бд®а¬Ёа®ў ­  ў ^яЃ
.if OkFilSdm
яЃЏаЁ¬Ґ­Ґ­ дЁ«мва...яЃ
.{
   ^
.{
      ^ ^
.}
.}
.end
.{
.[h
                                                                                                                     «Ёбв @np@
ДДДДДДВДДДДДДДВДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДД
      і       і                                         і      ‘ Ђ ‹ њ „ Ћ (ў «ов  ®взҐв®ў)   і ‘ Ђ ‹ њ „ Ћ (®бв вЄЁ ў ў «овҐ)і
 ‘зҐв і‘гЎбзҐві          Ќ Ё¬Ґ­®ў ­ЁҐ ЉЂ“               ГДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДДЕДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДґ   Ќ Ё¬Ґ­®ў ­ЁҐ
      і       і                                         і       „ҐЎҐв      і      ЉаҐ¤Ёв      і     „ҐЎҐв     і    ЉаҐ¤Ёв     і      ў «овл
ДДДДДДБДДДДДДДБДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДД
.]h
.{
.if OkSub
.end
.{
.if OkPodr
Џ®¤а §¤Ґ«Ґ­ЁҐ : ^
.end
.{
.if OkKau1
ЋЎкҐЄв гзҐв  : ^
.end
.{
.if OkKau2
   ЋЎкҐЄв гзҐв  : ^
.end
.{
.if OkKau3
      ЋЎкҐЄв гзҐв  : ^
.end
.{
.if OkKau4
         ЋЎкҐЄв гзҐв  : ^
.end
.{
.if OkKau5
            ЋЎкҐЄв гзҐв  : ^
.end
.{
.if OkKau6
               ЋЎкҐЄв гзҐв  : ^
.end
.{
.{
@@@@@@ @@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&& &#'&&&&&&&&&&&& @@@@@@@@@@@@@@@@@
.}
.}
.if OkSumKau6
               €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
               ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau5
            €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
            ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau4
         €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
         ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau3
      €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
      ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau2
   €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
   ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau1
€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumPodr
€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumSub
€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.}
яЃ€в®Ј® Ї® ўҐ¤®¬®бвЁ                                       &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДя
.endform
!==============================================================================
.linkform 'SeeSaldMonth_03' prototype is 'SeeSaldMonth'
.nameinlist '3. ‚е®¤пйҐҐ б «м¤® ­  ­ з «® ¬Ґбпж  ў Ќ„… Ё ў «овҐ'
.group '‘ «м¤® §  ¬Ґбпж ў ў «овҐ ®взҐв®ў Ё Ќ„…'
.p 60
.defo landscape
.nonextheader
.fields
CommonFormHeader
c0p1
c1f1
c2f1 c2f2
c0p3 c0p5 c0p3 c0p5
c3p1
c4p1
c5p1
c6p1
c20p1
c21p1
c22p1
c8p1 c8p2 c8p3 c8p4 c8p4v c8p5 c8p5v c8p6 c8p7 c8p8
c22p1 c7_p1 c7_p1v c7_p2 c7_p2v
c21p1 c22_p1 c22_p1v c22_p2 c22_p2v
c20p1 c21_p1 c21_p1v c21_p2 c21_p2v
c6p1 c20_p1 c20_p1v c20_p2 c20_p2v
c5p1 c6_p1 c6_p1v c6_p2 c6_p2v
c4p1 c5_p1 c5_p1v c5_p2 c5_p2v
c3p1 c4_p1 c4_p1v c4_p2 c4_p2v
c2p1 c3_p1 c3_p1v c3_p2 c3_p2v
c1p1 c2_p1 c2_p1v c2_p2 c2_p2v
    c1_p1  c1_p1v c1_p2 c1_p2v
.endfields
яђ^
                                            ‚е®¤пйҐҐ б «м¤® ­  яЃ^яЃ
.if OkFilSdm
яЃЏаЁ¬Ґ­Ґ­ дЁ«мва...яЃ
.{
   ^
.{
      ^ ^
.}
.}
.end
.{
.[h
                                                                                                                                                     «Ёбв @np@
ДДДДДДВДДДДДДДВДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДД
 ‘зҐв і‘гЎбзҐві                                    і         ‘ «м¤® Ї® ¤ҐЎҐвг            і          ‘ «м¤® Ї® ЄаҐ¤Ёвг          і ‘ Ђ ‹ њ „ Ћ (®бв вЄЁ ў ў «овҐ)і   Ќ Ё¬Ґ­®ў ­ЁҐ
      і       і        Ќ Ё¬Ґ­®ў ­ЁҐ ЉЂ“            ГДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДДЕДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДДЕДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДґ     ў «овл
      і       і                                    і     ў @@@@@@     і    ў @@@@@@      і     ў @@@@@@     і     ў @@@@@@     і     „ҐЎҐв     і   ЉаҐ¤Ёв      і
ДДДДДДБДДДДДДДБДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДДД
.]h
.{
.if OkSub
.end
.{
.if OkPodr
яЃЏ®¤а §¤Ґ«Ґ­ЁҐ : ^яЃ
.end
.{
.if OkKau1
яЃЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau2
   яЃЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau3
      яЃЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau4
        яЃ ЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau5
          яЃ  ЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau6
            яЃ   ЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.{
@@@@@@ @@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&& &#'&&&&&&&&&&&& @@@@@@@@@@@@@@@@@@
.}
.}
.if OkSumKau6
            яЃ   €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
               ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau5
          яЃ  €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
            ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau4
        яЃ €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
         ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau3
      яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
      ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau2
   яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
   ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau1
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumPodr
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumSub
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.}
яЃ€в®Ј® Ї® ўҐ¤®¬®бвЁ                                  &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДяђ
.endform
!==============================================================================
.linkform 'SeeSaldMonth_04' prototype is 'SeeSaldMonth'
.group '_‘ «м¤® §  ¬Ґбпж'
.nameinlist '1. ‚е®¤пйҐҐ б «м¤® ­  ­ з «® ¬Ґбпж  ў а §аҐ§Ґ дЁ«Ё «®ў'
.p 80
.defo portrait
.nonextheader
.fields
CommonFormHeader
c0p1 c0p2
c1f1
c2f1 c2f2
c3p1
c4p1
c5p1
c6p1
c20p1
c21p1
c22p1
c7p1
c8p1 c8p2 c8p3 c8p4 c8p5 c8p6 c8p7 c8p8
c7p1 c8_p1 c8_p2
c22p1 c7_p1  c7_p2
c21p1 c22_p1 c22_p2
c20p1 c21_p1 c21_p2
c6p1  c20_p1 c20_p2
c5p1 c6_p1 c6_p2
c4p1 c5_p1 c5_p2
c3p1 c4_p1 c4_p2
c2p1 c3_p1 c3_p2
c1p1 c2_p1 c2_p2
c1_p1 c1_p2
.endfields
я^
                                           яЃ‚е®¤пйҐҐ б «м¤® ­   ^яЃ
яЃ‚Ґ¤®¬®бвм бд®а¬Ёа®ў ­  ў ^яЃ
.if OkFilSdm
яЃЏаЁ¬Ґ­Ґ­ дЁ«мва...яЃ
.{
   ^
.{
      ^ ^
.}
.}
.end
.{
.[h
                                                                                                                      «Ёбв @np@
 ДДДДВДДДДДВДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДД
     і     і                                         і         ‘ Ђ ‹ њ „ Ћ ( ў Ќ„…  )      і ‘ Ђ ‹ њ „ Ћ (®бв вЄЁ ў ў «овҐ)і
 ‘зҐві‘гЎ- і          Ќ Ё¬Ґ­®ў ­ЁҐ дЁ«Ё «            ГДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДДЕДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДґ   Ќ Ё¬Ґ­®ў ­ЁҐ
     ібзҐв і                                         і       „ҐЎҐв      і      ЉаҐ¤Ёв      і     „ҐЎҐв     і    ЉаҐ¤Ёв     і      ў «овл
 ДДДДБДДДДДБДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДДД
.]h
.{
.if OkSub
.end
.{
.if OkPodr
яЃЏ®¤а §¤Ґ«Ґ­ЁҐ : ^яЃ
.end
.{
.if OkKau1
яЃЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau2
   яЃЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau3
     яЃ ЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau4
       яЃ  ЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau5
         яЃ   ЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau6
           яЃ    ЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
               ”Ё«Ё « : ^яЃ
.{
 @@@@ @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&&  &#'&&&&&&&&&&&& &#'&&&&&&&&&&&& @@@@@@@@@@@@@@@@@
.}
          яЃ     €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
               ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.}
.if OkSumKau6
           яЃ    €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
               ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau5
         яЃ   €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
            ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau4
       яЃ  €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
         ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau3
     яЃ €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
      ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau2
   яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
   ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau1
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumPodr
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumSub
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.}
яЃ€в®Ј® Ї® ўҐ¤®¬®бвЁ                                    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДя
.endform
!==============================================================================
.linkform 'SeeSaldMonth_05' prototype is 'SeeSaldMonth'
.group '_‘ «м¤® §  ¬Ґбпж ў ў «овҐ ®взҐв®ў'
.nameinlist '2. ‚е®¤пйҐҐ б «м¤® ­  ­ з «® ¬Ґбпж  ў а §аҐ§Ґ дЁ«Ё «®ў ў ў «овҐ ®взҐв®ў'
.p 80
.defo portrait
.nonextheader
.fields
CommonFormHeader
c0p1 c0p4
c1f1
c2f1 c2f2
c3p1
c4p1
c5p1
c6p1
c20p1
c21p1
c22p1
c7p1
c8p1 c8p2 c8p3 c8p4v c8p5v c8p6 c8p7 c8p8
c7p1 c8_p1v c8_p2v
c22p1 c7_p1v  c7_p2v
c21p1 c22_p1v c22_p2v
c20p1 c21_p1v c21_p2v
c6p1  c20_p1v c20_p2v
c5p1 c6_p1v c6_p2v
c4p1 c5_p1v c5_p2v
c3p1 c4_p1v c4_p2v
c2p1 c3_p1v c3_p2v
c1p1 c2_p1v c2_p2v
c1_p1v c1_p2v
.endfields
я^
                                           яЃ‚е®¤пйҐҐ б «м¤® ­   ^яЃ
яЃ‚Ґ¤®¬®бвм бд®а¬Ёа®ў ­  ў ^яЃ
.if OkFilSdm
яЃЏаЁ¬Ґ­Ґ­ дЁ«мва...яЃ
.{
   ^
.{
      ^ ^
.}
.}
.end
.{
.[h
                                                                                                                     «Ёбв @np@
 ДДДДВДДДДДВДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДД
     і     і                                         і         ‘ Ђ ‹ њ „ Ћ ( ў Ѓ.‚.   )    і ‘ Ђ ‹ њ „ Ћ (®бв вЄЁ ў ў «овҐ)і
 ‘зҐві‘гЎ- і          Ќ Ё¬Ґ­®ў ­ЁҐ дЁ«Ё «            ГДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДДЕДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДґ   Ќ Ё¬Ґ­®ў ­ЁҐ
     ібзҐв і                                         і       „ҐЎҐв      і      ЉаҐ¤Ёв      і     „ҐЎҐв     і    ЉаҐ¤Ёв     і      ў «овл
 ДДДДБДДДДДБДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДДД
.]h
.{
.if OkSub
.end
.{
.if OkPodr
яЃЏ®¤а §¤Ґ«Ґ­ЁҐ : ^яЃ
.end
.{
.if OkKau1
яЃЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau2
   яЃЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau3
      яЃЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau4
         яЃЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau5
           яЃ ЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau6
             яЃ  ЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
               ”Ё«Ё « : ^яЃ
.{
 @@@@ @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&&  &#'&&&&&&&&&&&& &#'&&&&&&&&&&&& @@@@@@@@@@@@@@@@@
.}
          яЃ     €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
               ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.}
.if OkSumKau6
           яЃ    €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
               ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau5
         яЃ   €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
            ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau4
       яЃ  €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
         ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau3
     яЃ €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
      ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau2
   яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
   ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau1
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumPodr
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumSub
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.}
яЃ€в®Ј® Ї® ўҐ¤®¬®бвЁ                                    &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДя
.endform
!==============================================================================
.linkform 'SeeSaldMonth_06' prototype is 'SeeSaldMonth'
.nameinlist '3. ‚е®¤пйҐҐ б «м¤® ­  ­ з «® ¬Ґбпж  ў а §аҐ§Ґ дЁ«Ё «®ў ў Ќ„… Ё ў «овҐ'
.group '_‘ «м¤® §  ¬Ґбпж ў ў «овҐ ®взҐв®ў Ё Ќ„…'
.p 60
.defo landscape
.nonextheader
.fields
CommonFormHeader
c0p1
c1f1
c2f1 c2f2
c0p3 c0p5 c0p3 c0p5
c3p1
c4p1
c5p1
c6p1
c20p1
c21p1
c22p1
c7p1
c8p1 c8p2 c8p3 c8p4 c8p4v c8p5 c8p5v c8p6 c8p7 c8p8
c7p1 c8_p1 c8_p1v c8_p2 c8_p2v
c22p1 c7_p1 c7_p1v c7_p2 c7_p2v
c21p1 c22_p1 c22_p1v c22_p2 c22_p2v
c20p1 c21_p1 c21_p1v c21_p2 c21_p2v
c6p1  c20_p1 c20_p1v c20_p2 c20_p2v
c5p1 c6_p1 c6_p1v c6_p2 c6_p2v
c4p1 c5_p1 c5_p1v c5_p2 c5_p2v
c3p1 c4_p1 c4_p1v c4_p2 c4_p2v
c2p1 c3_p1 c3_p1v c3_p2 c3_p2v
c1p1 c2_p1 c2_p1v c2_p2 c2_p2v
    c1_p1  c1_p1v c1_p2 c1_p2v
.endfields
яђ^
                                            ‚е®¤пйҐҐ б «м¤® ­  яЃ^яЃ
.if OkFilSdm
яЃЏаЁ¬Ґ­Ґ­ дЁ«мва...яЃ
.{
   ^
.{
      ^ ^
.}
.}
.end
.{
.[h
                                                                                                                                                     «Ёбв @np@
 ДДДДВДДДДДВДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДД
 ‘зҐві‘гЎ- і                                  і         ‘ «м¤® Ї® ¤ҐЎҐвг            і          ‘ «м¤® Ї® ЄаҐ¤Ёвг          і ‘ Ђ ‹ њ „ Ћ (®бв вЄЁ ў ў «овҐ)і   Ќ Ё¬Ґ­®ў ­ЁҐ
     ібзҐв і        Ќ Ё¬Ґ­®ў ­ЁҐ дЁ«Ё «       ГДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДДЕДДДДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДДДДЕДДДДДДДДДДДДДДДВДДДДДДДДДДДДДДДґ     ў «овл
     і     і                                  і     ў @@@@@@     і    ў @@@@@@      і     ў @@@@@@     і     ў @@@@@@     і     „ҐЎҐв     і   ЉаҐ¤Ёв      і
 ДДДДБДДДДДБДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДБДДДДДДДДДДДДДДДДДД
.]h
.{
.if OkSub
.end
.{
.if OkPodr
яЃЏ®¤а §¤Ґ«Ґ­ЁҐ : ^яЃ
.end
.{
.if OkKau1
яЃЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau2
   яЃЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau3
     яЃ ЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau4
       яЃ  ЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau5
         яЃ   ЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
.if OkKau6
           яЃ    ЋЎкҐЄв гзҐв  : ^яЃ
.end
.{
          яЃ     ”Ё«Ё « : ^яЃ
.{
 @@@@ @@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&& &#'&&&&&&&&&&&& @@@@@@@@@@@@@@@@@@
.}
               €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
               ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.}
.if OkSumKau6
           яЃ    €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
               ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau5
         яЃ   €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
            ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau4
       яЃ  €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
         ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau3
     яЃ €в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
      ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau2
   яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
   ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumKau1
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumPodr
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
.if OkSumSub
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.end
.}
яЃ€в®Ј® Ї® @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДД
.}
яЃ€в®Ј® Ї® ўҐ¤®¬®бвЁ                             &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&яЃ
ДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДДяђ
.endform
!==============================================================================
