//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
//------------------------------------------------------------------------------
// Галактика 7.12 - ФРО
// Интерактивный аналитический учет
//------------------------------------------------------------------------------
#include FeeSigners.frn

#doc
Базовая форма отчета "Интерактивный аналитический учет"
#end
.set name = 'TreeAn'
.hide
.var
   FrmUserName,
   MainBuhName : string;
.endvar
.fields
  MyOrgName            // собственная организация
  PeriodName           // Период
  NdeName              // название НДЕ
  ValRepName           // название валюты отчетов
  PlanSchetName        // План счетов
  GroupName            // Группировка отчета

  // фильтры
  FilterTitle
  FilterSpace FilterSpec

  // заголовок группы
  h_LevelName          // номер и наименование уровня группировки
  h_SpaceBeforeName    // пробелы для печати "лесенкой" (перед наименованием группировки)
  h_GroupName          // наименование группировки
  h_SpaceAfterName     // пробелы для печати "лесенкой" (после наименованием группировки)

  h_SaldoNdeInDb       // входящее сальдо дебет (НДЕ)
  h_SaldoDocInDb       // входящее сальдо дебет (валюта документа)
  h_SaldoRepInDb       // входящее сальдо дебет (валюта отчетов)
  h_SaldoKolInDb       // входящее сальдо дебет (количество)
  h_SaldoNdeInKr       // -//- по кредиту
  h_SaldoDocInKr       //
  h_SaldoRepInKr       //
  h_SaldoKolInKr       //

  h_SumNdeDb           // оборот дебет (НДЕ)
  h_SumDocDb           // оборот дебет (валюта документа)
  h_SumRepDb           // оборот дебет (валюта отчетов)
  h_SumKolDb           // дебет (количество)
  h_SumNdeKr           // -//- по кредиту
  h_SumDocKr           //
  h_SumRepKr           //
  h_SumKolKr           //

  h_SaldoNdeOutDb      // исходящее сальдо
  h_SaldoDocOutDb      //
  h_SaldoRepOutDb      //
  h_SaldoKolOutDb      //
  h_SaldoNdeOutKr      //
  h_SaldoDocOutKr      //
  h_SaldoRepOutKr      //
  h_SaldoKolOutKr      //

  h_EdIzm             // единица измерения

  // детальные данные
  OborotNrec
  SaldoNrec
  DocDate              // дата проводки/сальдо
  DocNumber            // номер проводки
  DocNrec
  DocName              //тип документа
  Sodr                 //содержание(в зависимости от выбранного параметра)
  SodrPlat             //содержание платежного документа
  SodrSopr             //содержание сопроводительного документа
  SchetO               // основной счет
  SubSchetO            // субсчет основного счета
  KauNameO             // КАУ основного счета
  PodrNameO            // подразделение основного счета

  TblOs1               // значения кау основного счета
  KauOs1               // для всех уровней
  TblOs2
  KauOs2
  TblOs3
  KauOs3
  TblOs4
  KauOs4
  TblOs5
  KauOs5
  TblOs6
  KauOs6

  SchetK               // корреспондирующий счет
  SubSchetK            // субсчет корреспондирующего счета
  KauNameK             // КАУ корреспондирующего счета
  PodrNameK            // подразделение корреспондирующего счета

  SaldoNdeInDb         // входящее сальдо дебет (НДЕ)
  SaldoDocInDb         // входящее сальдо дебет (валюта документа)
  SaldoRepInDb         // входящее сальдо дебет (валюта отчетов)
  SaldoKolInDb         // входящее сальдо дебет (количество)
  SaldoNdeInKr         // -//- по кредиту
  SaldoDocInKr         //
  SaldoRepInKr         //
  SaldoKolInKr         //

  SumNdeDb             // оборот дебет (НДЕ)
  SumDocDb             // оборот дебет (валюта документа)
  SumRepDb             // оборот дебет (валюта отчетов)
  SumKolDb             // дебет (количество)
  SumNdeKr             // -//- по кредиту
  SumDocKr             //
  SumRepKr             //
  SumKolKr             //

  EdIzm             // единица измерения

  // подножие группы
  f_SpaceBeforeName    // пробелы для печати "лесенкой" (перед наименованием группировки)
  f_GroupName          // наименование группировки
  f_SpaceAfterName     // пробелы для печати "лесенкой" (после наименованием группировки)

  f_SaldoNdeInDb       // входящее сальдо дебет (НДЕ)
  f_SaldoDocInDb       // входящее сальдо дебет (валюта документа)
  f_SaldoRepInDb       // входящее сальдо дебет (валюта отчетов)
  f_SaldoKolInDb       // входящее сальдо дебет (количество)
  f_SaldoNdeInKr       // -//- по кредиту
  f_SaldoDocInKr       //
  f_SaldoRepInKr       //
  f_SaldoKolInKr       //

  f_SumNdeDb           // оборот дебет (НДЕ)
  f_SumDocDb           // оборот дебет (валюта документа)
  f_SumRepDb           // оборот дебет (валюта отчетов)
  f_SumKolDb           // дебет (количество)
  f_SumNdeKr           // -//- по кредиту
  f_SumDocKr           //
  f_SumRepKr           //
  f_SumKolKr           //

  f_SaldoNdeOutDb      // исходящее сальдо
  f_SaldoDocOutDb      //
  f_SaldoRepOutDb      //
  f_SaldoKolOutDb      //
  f_SaldoNdeOutKr      //
  f_SaldoDocOutKr      //
  f_SaldoRepOutKr      //
  f_SaldoKolOutKr      //

  f_EdIzm             // единица измерения
#FeeSignersCycleFields
.endfields
.begin
  MainBuhName := sGetTune('MainBuh');
  FrmUserName    := sGetTune('User.Fio');
end.
  MyOrgName            ^
  PeriodName           ^
  NdeName              ^
  ValRepName           ^
  PlanSchetName        ^
  GroupName            ^
.if TreeAn_Filter
.{
   ^
.{
   ^ ^
.}
.}
.end
.{
.{ TreeAn_GroupHeader CheckEnter
^
^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^
^
.}
.{ TreeAn_Data CheckEnter
^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^
^
.}
.{ TreeAn_GroupFooter CheckEnter
^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^
^
.if TreeAn_Divider
.end
.}
.}
#FeeSignersCycle(TreeAn)
.endform

.LinkForm 'TreeAn_01_Nde' prototype is 'TreeAn'
.NameInList 'Аналитический отчет (НДЕ)'
.p 40
.Defo Landscape
.NoNextHeader
.fields
  CommonFormHeader
  MyOrgName
  PeriodName
  NdeName
  PlanSchetName
  FilterTitle
  FilterSpace FilterSpec
  h_SpaceBeforeName  h_GroupName  h_SpaceAfterName               h_SaldoNdeInDb  h_SaldoNdeInKr  h_SumNdeDb  h_SumNdeKr  h_SaldoNdeOutDb  h_SaldoNdeOutKr
  DocDate  DocNumber SchetK  SubSchetK  PodrNameK  KauNameK      SaldoNdeInDb    SaldoNdeInKr    SumNdeDb    SumNdeKr
  f_SpaceBeforeName  f_GroupName  f_SpaceAfterName               f_SaldoNdeInDb  f_SaldoNdeInKr  f_SumNdeDb  f_SumNdeKr  f_SaldoNdeOutDb  f_SaldoNdeOutKr
.endfields
 И^
^
                                       БАналитический отчет Й
 И                            @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И
 ЪВедомость сформирована в ^ Ъ
 ЪПлан счетов ^ Ъ
.if TreeAn_Filter
 ЪПрименен фильтр... Ъ
.{
 Ъ  ^ Ъ
.{
 Ъ     ^ ^ Ъ
.}
.}
.end
.{
.[H
 Щ                                                                                                                                                                     лист  @np@
──────────┬───────┬───────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────────────────────────────────────────────────────
          │       │            Корреспондирующий счет             │                                                      Сумма
          │       ├────┬─────┬───────────────┬────────────────────┼─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
   Дата   │ Номер │Счет│Суб- │               │                    │                Сальдо               │               Обороты               │               Сальдо
          │ доку- │    │счет │ Подразделение │  Наименование КАУ  │               входящее              │                                     │              исходящее
          │ мента │    │     │               │                    ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
          │       │    │     │               │                    │       Дебет      │     Кредит       │       Дебет      │      Кредит      │       Дебет      │      Кредит
──────────┴───────┴────┴─────┴───────────────┴────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴────────────────── Щ
.]H
.{ TreeAn_GroupHeader CheckEnter
 Щ^@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@^ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Щ
.}
.{ TreeAn_Data CheckEnter
 Ш@@@@@@@@@@ @@@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Ш
.}
.{ TreeAn_GroupFooter CheckEnter
 Щ^@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@^ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Щ
.if TreeAn_Divider
 Щ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Щ
.end
.}
.}
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_TreeAn
.{checkenter FeeSignersCycle_TreeAn
 Ш
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи) Ш
.}
.else
.fields
MainBuhName
FrmUserName
.endfields
 ШБухгалтер               ^
Ответственный за выпуск ^ Ш
.end
.EndForm

//--------------------------------------------------------------------------------------------------
.LinkForm 'TreeAn_01_ValRep' prototype is 'TreeAn'
.NameInList 'Аналитический отчет (валюта отчетов)'
.p 40
.Defo Landscape
.NoNextHeader
.fields
  CommonFormHeader
  MyOrgName
  PeriodName
  ValRepName
  PlanSchetName
  FilterTitle
  FilterSpace FilterSpec
  h_SpaceBeforeName  h_GroupName  h_SpaceAfterName               h_SaldoRepInDb  h_SaldoRepInKr  h_SumRepDb  h_SumRepKr  h_SaldoRepOutDb  h_SaldoRepOutKr
  DocDate  DocNumber SchetK  SubSchetK  PodrNameK  KauNameK      SaldoRepInDb    SaldoRepInKr    SumRepDb    SumRepKr
  f_SpaceBeforeName  f_GroupName  f_SpaceAfterName               f_SaldoRepInDb  f_SaldoRepInKr  f_SumRepDb  f_SumRepKr  f_SaldoRepOutDb  f_SaldoRepOutKr
.endfields
 И^
^
                                       БАналитический отчет Й
 И                            @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И
 ЪВедомость сформирована в ^ Ъ
 ЪПлан счетов ^ Ъ
.if TreeAn_Filter
 ЪПрименен фильтр... Ъ
.{
 Ъ  ^ Ъ
.{
 Ъ     ^ ^ Ъ
.}
.}
.end
.{
.[H
 Щ                                                                                                                                                                     лист  @np@
──────────┬───────┬───────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────────────────────────────────────────────────────
          │       │            Корреспондирующий счет             │                                                      Сумма
          │       ├────┬─────┬───────────────┬────────────────────┼─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
   Дата   │ Номер │Счет│Суб- │               │                    │                Сальдо               │               Обороты               │               Сальдо
          │ доку- │    │счет │ Подразделение │  Наименование КАУ  │               входящее              │                                     │              исходящее
          │ мента │    │     │               │                    ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
          │       │    │     │               │                    │       Дебет      │     Кредит       │       Дебет      │      Кредит      │       Дебет      │      Кредит
──────────┴───────┴────┴─────┴───────────────┴────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴────────────────── Щ
.]H
.{ TreeAn_GroupHeader CheckEnter
 Щ^@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@^ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Щ
.}
.{ TreeAn_Data CheckEnter
 Ш@@@@@@@@@@ @@@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Ш
.}
.{ TreeAn_GroupFooter CheckEnter
 Щ^@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@^ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Щ
.if TreeAn_Divider
 Щ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Щ
.end
.}
.}

.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_TreeAn
.{checkenter FeeSignersCycle_TreeAn
 Ш
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи) Ш
.}
.else
.fields
MainBuhName
FrmUserName
.endfields
 ЩБухгалтер               ^
Ответственный за выпуск ^ Щ
.end
.EndForm

//--------------------------------------------------------------------------------------------------
.LinkForm 'TreeAn_01_ValDoc' prototype is 'TreeAn'
.NameInList 'Аналитический отчет (валюта документов)'
.p 40
.Defo Landscape
.NoNextHeader
.fields
  CommonFormHeader
  MyOrgName
  PeriodName
  PlanSchetName
  FilterTitle
  FilterSpace FilterSpec
  h_SpaceBeforeName  h_GroupName  h_SpaceAfterName               h_SaldoDocInDb  h_SaldoDocInKr  h_SumDocDb  h_SumDocKr  h_SaldoDocOutDb  h_SaldoDocOutKr
  DocDate  DocNumber SchetK  SubSchetK  PodrNameK  KauNameK      SaldoDocInDb    SaldoDocInKr    SumDocDb    SumDocKr
  f_SpaceBeforeName  f_GroupName  f_SpaceAfterName               f_SaldoDocInDb  f_SaldoDocInKr  f_SumDocDb  f_SumDocKr  f_SaldoDocOutDb  f_SaldoDocOutKr
.endfields
 И^
^
                                       БАналитический отчет Й
 И                            @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И
 ЪПлан счетов ^ Ъ
.if TreeAn_Filter
 ЪПрименен фильтр... Ъ
.{
 Ъ  ^ Ъ
.{
 Ъ     ^ ^ Ъ
.}
.}
.end
.{
.[H
 Щ                                                                                                                                                                     лист  @np@
──────────┬───────┬───────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────────────────────────────────────────────────────
          │       │            Корреспондирующий счет             │                                                      Сумма
          │       ├────┬─────┬───────────────┬────────────────────┼─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
   Дата   │ Номер │Счет│Суб- │               │                    │                Сальдо               │               Обороты               │               Сальдо
          │ доку- │    │счет │ Подразделение │  Наименование КАУ  │               входящее              │                                     │              исходящее
          │ мента │    │     │               │                    ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
          │       │    │     │               │                    │       Дебет      │     Кредит       │       Дебет      │      Кредит      │       Дебет      │      Кредит
──────────┴───────┴────┴─────┴───────────────┴────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴────────────────── Щ
.]H
.{ TreeAn_GroupHeader CheckEnter
 Щ^@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@^ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Щ
.}
.{ TreeAn_Data CheckEnter
 Ш@@@@@@@@@@ @@@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Ш
.}
.{ TreeAn_GroupFooter CheckEnter
 Щ^@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@^ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Щ
.if TreeAn_Divider
 Щ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Щ
.end
.}
.}
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_TreeAn
.{checkenter FeeSignersCycle_TreeAn
 Ш
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи) Ш
.}
.else
.fields
MainBuhName
FrmUserName
.endfields
 ШБухгалтер               ^
Ответственный за выпуск ^ Ш
.end
.EndForm

//--------------------------------------------------------------------------------------------------
.LinkForm 'TreeAn_01_Kol' prototype is 'TreeAn'
.NameInList 'Аналитический отчет (количество)'
.p 40
.Defo Landscape
.NoNextHeader
.fields
  CommonFormHeader
  MyOrgName
  PeriodName
  PlanSchetName
  FilterTitle
  FilterSpace FilterSpec
  h_SpaceBeforeName  h_GroupName  h_SpaceAfterName               h_SaldoKolInDb  h_SaldoKolInKr  h_SumKolDb  h_SumKolKr  h_SaldoKolOutDb  h_SaldoKolOutKr
  DocDate  DocNumber SchetK  SubSchetK  PodrNameK  KauNameK      SaldoKolInDb    SaldoKolInKr    SumKolDb    SumKolKr
  f_SpaceBeforeName  f_GroupName  f_SpaceAfterName               f_SaldoKolInDb  f_SaldoKolInKr  f_SumKolDb  f_SumKolKr  f_SaldoKolOutDb  f_SaldoKolOutKr
.endfields
 И^
^
                                       БАналитический отчет Й
 И                            @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ И
 ЪПлан счетов ^ Ъ
.if TreeAn_Filter
 ЪПрименен фильтр... Ъ
.{
 Ъ  ^ Ъ
.{
 Ъ     ^ ^ Ъ
.}
.}
.end
.{
.[H
 Щ                                                                                                                                                                     лист  @np@
──────────┬───────┬───────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────────────────────────────────────────────────────
          │       │            Корреспондирующий счет             │                                                      Количество
          │       ├────┬─────┬───────────────┬────────────────────┼─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
   Дата   │ Номер │Счет│Суб- │               │                    │                Сальдо               │               Обороты               │               Сальдо
          │ доку- │    │счет │ Подразделение │  Наименование КАУ  │               входящее              │                                     │              исходящее
          │ мента │    │     │               │                    ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
          │       │    │     │               │                    │       Дебет      │     Кредит       │       Дебет      │      Кредит      │       Дебет      │      Кредит
──────────┴───────┴────┴─────┴───────────────┴────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴────────────────── Щ
.]H
.{ TreeAn_GroupHeader CheckEnter
 Щ^@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@^ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Щ
.}
.{ TreeAn_Data CheckEnter
 Ш@@@@@@@@@@ @@@@@@@ @@@@ @@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&& Ш
.}
.{ TreeAn_GroupFooter CheckEnter
 Щ^@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@^ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Щ
.if TreeAn_Divider
 Щ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Щ
.end
.}
.}
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_TreeAn
.{checkenter FeeSignersCycle_TreeAn
 Ш
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи) Ш
.}
.else
.fields
MainBuhName
FrmUserName
.endfields
 ШБухгалтер               ^
Ответственный за выпуск ^ Ш
.end
.EndForm
