/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,97 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Заработная плата                                          ║
 ║ Версия        : 5.70                                                      ║
 ║ Ответственный : Корзюк Виталий Францевич                                  ║
 ║ Назначение    : Расценки работ и операций                                 ║
 ║                                                                           ║
 ║ Изменения                                                                 ║
 ║     Автор: ___________________ Дата: __________________                   ║
 ║     Цель : ____________________________________________                   ║
 ║                                                                           ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
#doc
Расценки работ и операций
#end
.FORM 'RatesForm'
.HIDE
.FIELDS
  CurrentDate: Date: 'M:DD/MM/YYYY'
  CurrentTime

  Код_работы
  Наименование
  Расценка
  Норма_времени
  Счет
  Субсчет
  КАУ

  Номер_операции1
  Наименование1
  Расценка1
  Норма_времени1
  Счет1
  Субсчет1
  КАУ1
.ENDFIELDS
^, ^
.{
  ^ ^ ^ ^ ^ ^ ^
.{ RatesFormOperationLoop CHECKENTER
  ^ ^ ^ ^ ^ ^ ^
.}
.IF RatesFormPrintSeparator
.END
.}
.ENDFORM

!-------------------------------------------------------------------------------
.LINKFORM 'RatesLinkedForm' PROTOTYPE IS 'RatesForm'
.NAMEINLIST 'Итоговая ведомость по бригадным нарядам'
.DEFP PA4
.P 80
.DEFO PORTRAIT
.SET FILLER = '0'
.[H OVERWRITE
.FIELDS
  CurrentDate
  CurrentTime

  Код_работы
  Наименование
  Расценка
  Норма_времени
  Счет
  Субсчет
  КАУ

  Номер_операции1
  Наименование1
  Расценка1
  Норма_времени1
  Счет1
  Субсчет1
  КАУ1
.ENDFIELDS
 Р^, ^ Р
.]H

 С                                          Справочник норм времени и расценок С

.{
.[H
 С┌───────┬────────┬──────────────────────────────┬─────────────┬──────────┬─────┬────┬────────────────────────────────┐
│Код    │Номер   │Наименование                  │Расценка     │Норма     │Счет │Суб-│КАУ                             │
│работы │операции│                              │             │времени   │     │счет│                                │
├───────┼────────┼──────────────────────────────┼─────────────┼──────────┼─────┼────┼────────────────────────────────┤ С
.]H
 С│&&&&&&&│        │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&'&&&&&&&&.&&│&&&&&&&&&&│@@@@@│@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│ С
.{ RatesFormOperationLoop CHECKENTER
 Р│       │&&&&&&&&│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&'&&&&&&&&.&&│&&&&&&&&&&│@@@@@│@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│ Р
.}
.IF RatesFormPrintSeparator
 Р├───────┼────────┼──────────────────────────────┼─────────────┼──────────┼─────┼────┼────────────────────────────────┤ Р
.END
.[F
 Р└───────┴────────┴──────────────────────────────┴─────────────┴──────────┴─────┴────┴────────────────────────────────┘ Р
.]F
.}
.ENDFORM