/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,97 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Заработная плата                                          ║
 ║ Версия        : 5.50                                                      ║
 ║ Назначение    : Форма                                                     ║
 ║ Ответственный : Мелех   Василий  Евгеньевич                               ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
#doc
Форма
#end
.set name = 'fnotch2004'
.hide
.fields
КонМесяц
ГодОтчета
НаименОрг2
ПочтовыйАдрес

Графа_01_1 Графа_01_2

Графа_02_1 Графа_02_2
Графа_03_1 Графа_03_2
Графа_04_1 Графа_04_2

Графа_05_1 Графа_05_2
Графа_06_1 Графа_06_2
Графа_07_1 Графа_07_2
Графа_08_1 Графа_08_2
Графа_09_1 Графа_09_2
Графа_10_1 Графа_10_2
Графа_11_1 Графа_11_2
Графа_12_1 Графа_12_2
Графа_13_1 Графа_13_2
Графа_14_1 Графа_14_2
Графа_15_1 Графа_15_2
Графа_16_1 Графа_16_2
Графа_17_1 Графа_17_2
Графа_18_1 Графа_18_2
Графа_19_1 Графа_19_2
Графа_20_1 Графа_20_2

ФИОРуководителя
ФИОГлавБух
ДолжИсполнителя
ФИОИсполнителя
Число Месяц Год
.endfields
^^
^
^
! графы
^^

^^
^^
^^

^^
^^
^^
^^
^^
^^
^^
^^
^^
^^
^^
^^
^^
^^
^^
^^
! подножие
^
^
^
^
^^^
.endform