/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,97 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Заработная плата                                          ║
 ║ Версия        : 5.50                                                      ║
 ║ Назначение    : Форма                                                     ║
 ║ Ответственный : Мелех   Василий  Евгеньевич                               ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
#doc
Форма
#end
.set name = 'fnotch2007'
.hide
.fields
КонМесяц
ГодОтчета
НаименОрг2
ПочтовыйАдрес
ЭлАдрес
AddrPodr
ОКПО
УНП
Tel_Org

Графа_01

Графа_02
Графа_03
Графа_04

Графа_05
Графа_06
Графа_07
Графа_08
Графа_09
Графа_10
Графа_11
Графа_12
Графа_13
Графа_14
Графа_15
Графа_16

Графа_20_1 Графа_20_2
Графа_21_1 Графа_21_2
Графа_22_1 Графа_22_2
Графа_23_1 Графа_23_2
Графа_24_1 Графа_24_2

ФИОРуководителя
ДолжРуководителя
ФИОГлавБух
ДолжИсполнителя
ФИОИсполнителя
Число Месяц Год
.endfields
^^
^
^
^
^
^
^
^
! графы
^^

^^
^^
^^

^^
^^
^^
^^
^^
^^
^^
^^
^^
! подножие
^
^
^
^
^
^^^
.endform