/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,97 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Заработная плата                                          ║
 ║ Версия        :                                                           ║
 ║ Назначение    :                                                           ║
 ║ Ответственный : Мелех Василий Евгеньевич                                  ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
.set name = 'RPVedGor'
.Set Filler ='-'
.hide
.DEFO LANDSCAPE
.DEFP PA4
.p 72
.{ CommonForAllCicle CheckEnter
.fields
FlagRo : word
.endfields
^
.fields
РукПред_Имя ГлавБух_Имя
НазвОрган
КодПодразделение
ЗаМесяц
Год
.endfields
.{ Shapka CheckEnter
               Руководитель                    Гл.бухгалтер
               организации                     организации
          @~@@@@@@@@@@@@@@@@@@@@@@@      @~@@@@@@@@@@@@@@@@@@@@@@@

          Организация : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                    РАСЧЕТНО-ПЛАТЕЖНАЯ ВЕДОМОСТЬ No__
                    за  @@@@@@@@@@ месяц   @@@@  г.
.}
.{ NachBegEndWithTimeCicle CheckEnter
.{ PeopC1 CheckEnter
.[h
.fields
Шапка1_11 Шапка1_12 Шапка1_13 Шапка1_14 Шапка1_15 Шапка1_16 Шапка1_17 Шапка1_18 Шапка1_19 Шапка1_110
Шапка1_21 Шапка1_22 Шапка1_23 Шапка1_24 Шапка1_25 Шапка1_26 Шапка1_27 Шапка1_28 Шапка1_29 Шапка1_210
Шапка1_31 Шапка1_32 Шапка1_33 Шапка1_34 Шапка1_35 Шапка1_36 Шапка1_37 Шапка1_38 Шапка1_39 Шапка1_310
Шапка1_41 Шапка1_42 Шапка1_43 Шапка1_44 Шапка1_45 Шапка1_46 Шапка1_47 Шапка1_48 Шапка1_49 Шапка1_410
Шапка1_51 Шапка1_52 Шапка1_53 Шапка1_54 Шапка1_55 Шапка1_56 Шапка1_57 Шапка1_58 Шапка1_59 Шапка1_510
Шапка1_61 Шапка1_62 Шапка1_63 Шапка1_64 Шапка1_65 Шапка1_66 Шапка1_67 Шапка1_68 Шапка1_69 Шапка1_610
Шапка1_71 Шапка1_72 Шапка1_73 Шапка1_74 Шапка1_75 Шапка1_76 Шапка1_77 Шапка1_78 Шапка1_79 Шапка1_710
Шапка1_81 Шапка1_82 Шапка1_83 Шапка1_84 Шапка1_85 Шапка1_86 Шапка1_87 Шапка1_88 Шапка1_89 Шапка1_810
Шапка1_91 Шапка1_92 Шапка1_93 Шапка1_94 Шапка1_95 Шапка1_96 Шапка1_97 Шапка1_98 Шапка1_99 Шапка1_910
.endfields
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
.]h
.fields
Нпп1 ТабНом1 ФИО1 Дней1 Часов1 ВсегоДней1 ВсегоЧасов1
Долж1 СуммаНач1 ВсегоНач1
.endfields
│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBET9;@@@│@@@@│.}@@@│@@@@│
│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBET10;@'~@@@@@│.}@'~@@@@@│
├───┼──────────┼──────────────────┼.{.?NBET11;───┬────┼.}───┬────┤
.}
.fields
ИтогоДней1 ИтогоЧасов1 ВсегоИтогоДней1 ВсегоИтогоЧасов1
Итого1 ВсегоИтого1
.endfields
│   │  ИТОГО   │                  │.{.?NBET12;@@@│@@@@│.}@@@│@@@@│
│   │          │                  │.{.?NBET13;@'~@@@@@│.}@'~@@@@@│
└───┴──────────┴──────────────────┴.{.?NBET14;────────┴.}────────┘
.}
.{ NachBegEndCicle CheckEnter
.{ PeopC2 CheckEnter
.[h
.fields
Шапка2_11 Шапка2_12 Шапка2_13 Шапка2_14 Шапка2_15 Шапка2_16 Шапка2_17 Шапка2_18 Шапка2_19 Шапка2_110
Шапка2_21 Шапка2_22 Шапка2_23 Шапка2_24 Шапка2_25 Шапка2_26 Шапка2_27 Шапка2_28 Шапка2_29 Шапка2_210
Шапка2_31 Шапка2_32 Шапка2_33 Шапка2_34 Шапка2_35 Шапка2_36 Шапка2_37 Шапка2_38 Шапка2_39 Шапка2_310
Шапка2_41 Шапка2_42 Шапка2_43 Шапка2_44 Шапка2_45 Шапка2_46 Шапка2_47 Шапка2_48 Шапка2_49 Шапка2_410
Шапка2_51 Шапка2_52 Шапка2_53 Шапка2_54 Шапка2_55 Шапка2_56 Шапка2_57 Шапка2_58 Шапка2_59 Шапка2_510
Шапка2_61 Шапка2_62 Шапка2_63 Шапка2_64 Шапка2_65 Шапка2_66 Шапка2_67 Шапка2_68 Шапка2_69 Шапка2_610
Шапка2_71 Шапка2_72 Шапка2_73 Шапка2_74 Шапка2_75 Шапка2_76 Шапка2_77 Шапка2_78 Шапка2_79 Шапка2_710
Шапка2_81 Шапка2_82 Шапка2_83 Шапка2_84 Шапка2_85 Шапка2_86 Шапка2_87 Шапка2_88 Шапка2_89 Шапка2_810
Шапка2_91 Шапка2_92 Шапка2_93 Шапка2_94 Шапка2_95 Шапка2_96 Шапка2_97 Шапка2_98 Шапка2_99 Шапка2_910
.endfields
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
.]h
.fields
Нпп2 ТабНом2 ФИО2
Долж2 СуммаНач2 ВсегоНач2
.endfields
│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBEWT9;        │.}        │
│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBEWT10;@'~@@@@@│.}@'~@@@@@│
├───┼──────────┼──────────────────┼.{.?NBEWT11;────────┼.}────────┤
.}
.fields
Итого2 ВсегоИтого2
.endfields
│   │  ИТОГО   │                  │.{.?NBEWT12;@'~@@@@@│.}@'~@@@@@│
│   │          │                  │.{.?NBEWT13;        │.}        │
└───┴──────────┴──────────────────┴.{.?NBEWT14;────────┴.}────────┘
.}
.{ NeNachBegEndCicle CheckEnter
.{ PeopC103 CheckEnter
.[h
.fields
Шапка103_11 Шапка103_12 Шапка103_13 Шапка103_14 Шапка103_15 Шапка103_16 Шапка103_17 Шапка103_18 Шапка103_19 Шапка103_110
Шапка103_21 Шапка103_22 Шапка103_23 Шапка103_24 Шапка103_25 Шапка103_26 Шапка103_27 Шапка103_28 Шапка103_29 Шапка103_210
Шапка103_31 Шапка103_32 Шапка103_33 Шапка103_34 Шапка103_35 Шапка103_36 Шапка103_37 Шапка103_38 Шапка103_39 Шапка103_310
Шапка103_41 Шапка103_42 Шапка103_43 Шапка103_44 Шапка103_45 Шапка103_46 Шапка103_47 Шапка103_48 Шапка103_49 Шапка103_410
Шапка103_51 Шапка103_52 Шапка103_53 Шапка103_54 Шапка103_55 Шапка103_56 Шапка103_57 Шапка103_58 Шапка103_59 Шапка103_510
Шапка103_61 Шапка103_62 Шапка103_63 Шапка103_64 Шапка103_65 Шапка103_66 Шапка103_67 Шапка103_68 Шапка103_69 Шапка103_610
Шапка103_71 Шапка103_72 Шапка103_73 Шапка103_74 Шапка103_75 Шапка103_76 Шапка103_77 Шапка103_78 Шапка103_79 Шапка103_710
Шапка103_81 Шапка103_82 Шапка103_83 Шапка103_84 Шапка103_85 Шапка103_86 Шапка103_87 Шапка103_88 Шапка103_89 Шапка103_810
Шапка103_91 Шапка103_92 Шапка103_93 Шапка103_94 Шапка103_95 Шапка103_96 Шапка103_97 Шапка103_98 Шапка103_99 Шапка103_910
.endfields
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
.]h
.fields
Нпп103 ТабНом103 ФИО103
Долж103 СуммаУдер103 ВсегоУдер103:double СуммаНеНач103 СумКвыд103
.endfields
│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUBEN9;             │.}             │             │              │         │
│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUBEN10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@@│         │
├───┼──────────┼──────────────────┼.{.?NUBEN11;─────────────┼.}─────────────│─────────────┤──────────────┼─────────┤
.}
.fields
Итого103 ВсегоИтого103 ИтогоСуммаНач103 ВсеКВыдаче103
ИтогоСтр103 ИтогоПоВед103
СтрГлавБух103
ИтогоПоВедПрпись103
ИтогоПоВедПрписьСтрока103
.endfields
│   │  ИТОГО   │                  │.{.?NUBEN12;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@@│         │
│   │          │                  │.{.?NUBEN13;             │.}             │             │              │         │
└───┴──────────┴──────────────────┴.{.?NUBEN14;─────────────┴.}─────────────│─────────────┴──────────────┴─────────┘
 @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.{ NachUdBegEndCicle CheckEnter









.{ PeopC3 CheckEnter
.[h
.fields
Шапка3_11 Шапка3_12 Шапка3_13 Шапка3_14 Шапка3_15 Шапка3_16 Шапка3_17 Шапка3_18 Шапка3_19 Шапка3_110
Шапка3_21 Шапка3_22 Шапка3_23 Шапка3_24 Шапка3_25 Шапка3_26 Шапка3_27 Шапка3_28 Шапка3_29 Шапка3_210
Шапка3_31 Шапка3_32 Шапка3_33 Шапка3_34 Шапка3_35 Шапка3_36 Шапка3_37 Шапка3_38 Шапка3_39 Шапка3_310
Шапка3_41 Шапка3_42 Шапка3_43 Шапка3_44 Шапка3_45 Шапка3_46 Шапка3_47 Шапка3_48 Шапка3_49 Шапка3_410
Шапка3_51 Шапка3_52 Шапка3_53 Шапка3_54 Шапка3_55 Шапка3_56 Шапка3_57 Шапка3_58 Шапка3_59 Шапка3_510
Шапка3_61 Шапка3_62 Шапка3_63 Шапка3_64 Шапка3_65 Шапка3_66 Шапка3_67 Шапка3_68 Шапка3_69 Шапка3_610
Шапка3_71 Шапка3_72 Шапка3_73 Шапка3_74 Шапка3_75 Шапка3_76 Шапка3_77 Шапка3_78 Шапка3_79 Шапка3_710
Шапка3_81 Шапка3_82 Шапка3_83 Шапка3_84 Шапка3_85 Шапка3_86 Шапка3_87 Шапка3_88 Шапка3_89 Шапка3_810
Шапка3_91 Шапка3_92 Шапка3_93 Шапка3_94 Шапка3_95 Шапка3_96 Шапка3_97 Шапка3_98 Шапка3_99 Шапка3_910
.endfields
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
.]h
.fields
Нпп3 ТабНом3 ФИО3
Долж3 СуммаУдер3 ВсегоУдер3:double СумКвыд3
.endfields
│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUBEWT9;        │.}        │        │         │
│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUBEWT10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│         │
├───┼──────────┼──────────────────┼.{.?NUBEWT11;────────┼.}────────┤────────┼─────────┤
.[f
.]f
.}
.fields
Итого3 ВсегоИтого3 ВсеКВыдаче3
ИтогоСтр3 ИтогоПоВед3
СтрГлавБух3
ИтогоПоВедПрпись3
ИтогоПоВедПрписьСтрока3
.endfields
│   │  ИТОГО   │                  │.{.?NUBEWT12;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│         │
│   │          │                  │.{.?NUBEWT13;        │.}        │        │         │
└───┴──────────┴──────────────────┴.{.?NUBEWT14;────────┴.}────────┴────────┴─────────┘
 @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.{ NachBgWithTimeCicle CheckEnter
.{  PeopC4 CheckEnter
.[h
.fields
Шапка4_11 Шапка4_12 Шапка4_13 Шапка4_14 Шапка4_15 Шапка4_16 Шапка4_17 Шапка4_18 Шапка4_19 Шапка4_110
Шапка4_21 Шапка4_22 Шапка4_23 Шапка4_24 Шапка4_25 Шапка4_26 Шапка4_27 Шапка4_28 Шапка4_29 Шапка4_210
Шапка4_31 Шапка4_32 Шапка4_33 Шапка4_34 Шапка4_35 Шапка4_36 Шапка4_37 Шапка4_38 Шапка4_39 Шапка4_310
Шапка4_41 Шапка4_42 Шапка4_43 Шапка4_44 Шапка4_45 Шапка4_46 Шапка4_47 Шапка4_48 Шапка4_49 Шапка4_410
Шапка4_51 Шапка4_52 Шапка4_53 Шапка4_54 Шапка4_55 Шапка4_56 Шапка4_57 Шапка4_58 Шапка4_59 Шапка4_510
Шапка4_61 Шапка4_62 Шапка4_63 Шапка4_64 Шапка4_65 Шапка4_66 Шапка4_67 Шапка4_68 Шапка4_69 Шапка4_610
Шапка4_71 Шапка4_72 Шапка4_73 Шапка4_74 Шапка4_75 Шапка4_76 Шапка4_77 Шапка4_78 Шапка4_79 Шапка4_710
Шапка4_81 Шапка4_82 Шапка4_83 Шапка4_84 Шапка4_85 Шапка4_86 Шапка4_87 Шапка4_88 Шапка4_89 Шапка4_810
Шапка4_91 Шапка4_92 Шапка4_93 Шапка4_94 Шапка4_95 Шапка4_96 Шапка4_97 Шапка4_98 Шапка4_99 Шапка4_910
.endfields
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
.]h
.fields
Нпп4 ТабНом4 ФИО4 Дней4 Часов4
Долж4 СуммаНач4
.endfields
│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBT9;@@@│@@@@│.}
│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBT10;@'~@@@@@│.}
├───┼──────────┼──────────────────┼.{.?NBT11;───┬────┼.}
.[f
.]f
.}
.fields
ИтогоДней4 ИтогоЧасов4
Итого4
.endfields
│   │  ИТОГО   │                  │.{.?NBT12;@@@│@@@@│.}
│   │          │                  │.{.?NBT13;@'~@@@@@│.}
└───┴──────────┴──────────────────┴.{.?NBT14;────────┴.}
.}
.{ NachUdBegCicle CheckEnter
.if NeedSpace









.end
.{ PeopC5 CheckEnter
.[h
.fields
Шапка5_11 Шапка5_12 Шапка5_13 Шапка5_14 Шапка5_15 Шапка5_16 Шапка5_17 Шапка5_18 Шапка5_19 Шапка5_110
Шапка5_21 Шапка5_22 Шапка5_23 Шапка5_24 Шапка5_25 Шапка5_26 Шапка5_27 Шапка5_28 Шапка5_29 Шапка5_210
Шапка5_31 Шапка5_32 Шапка5_33 Шапка5_34 Шапка5_35 Шапка5_36 Шапка5_37 Шапка5_38 Шапка5_39 Шапка5_310
Шапка5_41 Шапка5_42 Шапка5_43 Шапка5_44 Шапка5_45 Шапка5_46 Шапка5_47 Шапка5_48 Шапка5_49 Шапка5_410
Шапка5_51 Шапка5_52 Шапка5_53 Шапка5_54 Шапка5_55 Шапка5_56 Шапка5_57 Шапка5_58 Шапка5_59 Шапка5_510
Шапка5_61 Шапка5_62 Шапка5_63 Шапка5_64 Шапка5_65 Шапка5_66 Шапка5_67 Шапка5_68 Шапка5_69 Шапка5_610
Шапка5_71 Шапка5_72 Шапка5_73 Шапка5_74 Шапка5_75 Шапка5_76 Шапка5_77 Шапка5_78 Шапка5_79 Шапка5_710
Шапка5_81 Шапка5_82 Шапка5_83 Шапка5_84 Шапка5_85 Шапка5_86 Шапка5_87 Шапка5_88 Шапка5_89 Шапка5_810
Шапка5_91 Шапка5_92 Шапка5_93 Шапка5_94 Шапка5_95 Шапка5_96 Шапка5_97 Шапка5_98 Шапка5_99 Шапка5_910
.endfields
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
.]h
.fields
Нпп5 ТабНом5 ФИО5
Долж5 СуммаНач5
.endfields
│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBWT9;        │.}
│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBWT10;@'~@@@@@│.}
├───┼──────────┼──────────────────┼.{.?NBWT11;────────┼.}
.[f
.]f
.}
.fields
Итого5
.endfields
│   │  ИТОГО   │                  │.{.?NBWT12;@'~@@@@@│.}
│   │          │                  │.{.?NBWT13;        │.}
└───┴──────────┴──────────────────┴.{.?NBWT14;────────┴.}
.}
.{ NachConWithTimeCicle CheckEnter
.{ PeopC6 CheckEnter
.[h
.fields
Шапка6_11 Шапка6_12 Шапка6_13 Шапка6_14 Шапка6_15 Шапка6_16 Шапка6_17 Шапка6_18 Шапка6_19 Шапка6_110
Шапка6_21 Шапка6_22 Шапка6_23 Шапка6_24 Шапка6_25 Шапка6_26 Шапка6_27 Шапка6_28 Шапка6_29 Шапка6_210
Шапка6_31 Шапка6_32 Шапка6_33 Шапка6_34 Шапка6_35 Шапка6_36 Шапка6_37 Шапка6_38 Шапка6_39 Шапка6_310
Шапка6_41 Шапка6_42 Шапка6_43 Шапка6_44 Шапка6_45 Шапка6_46 Шапка6_47 Шапка6_48 Шапка6_49 Шапка6_410
Шапка6_51 Шапка6_52 Шапка6_53 Шапка6_54 Шапка6_55 Шапка6_56 Шапка6_57 Шапка6_58 Шапка6_59 Шапка6_510
Шапка6_61 Шапка6_62 Шапка6_63 Шапка6_64 Шапка6_65 Шапка6_66 Шапка6_67 Шапка6_68 Шапка6_69 Шапка6_610
Шапка6_71 Шапка6_72 Шапка6_73 Шапка6_74 Шапка6_75 Шапка6_76 Шапка6_77 Шапка6_78 Шапка6_79 Шапка6_710
Шапка6_81 Шапка6_82 Шапка6_83 Шапка6_84 Шапка6_85 Шапка6_86 Шапка6_87 Шапка6_88 Шапка6_89 Шапка6_810
Шапка6_91 Шапка6_92 Шапка6_93 Шапка6_94 Шапка6_95 Шапка6_96 Шапка6_97 Шапка6_98 Шапка6_99 Шапка6_910
.endfields
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
.]h
.fields
Дней6 Часов6
СуммаНач6
.endfields
 .{.?NCT9;@@@│@@@@│.}
 .{.?NCT10;@'~@@@@@│.}
 .{.?NCT11;───┬────┼.}
.}
.fields
ИтогоДней6 ИтогоЧасов6
Итого6
.endfields
 .{.?NCT12;@@@│@@@@│.}
 .{.?NCT13;@'~@@@@@│.}
 .{.?NCT14;────────┴.}
.}
.{ NachUdConCicle CheckEnter
.{ PeopC7 CheckEnter
.[h
.fields
Шапка7_11 Шапка7_12 Шапка7_13 Шапка7_14 Шапка7_15 Шапка7_16 Шапка7_17 Шапка7_18 Шапка7_19 Шапка7_110
Шапка7_21 Шапка7_22 Шапка7_23 Шапка7_24 Шапка7_25 Шапка7_26 Шапка7_27 Шапка7_28 Шапка7_29 Шапка7_210
Шапка7_31 Шапка7_32 Шапка7_33 Шапка7_34 Шапка7_35 Шапка7_36 Шапка7_37 Шапка7_38 Шапка7_39 Шапка7_310
Шапка7_41 Шапка7_42 Шапка7_43 Шапка7_44 Шапка7_45 Шапка7_46 Шапка7_47 Шапка7_48 Шапка7_49 Шапка7_410
Шапка7_51 Шапка7_52 Шапка7_53 Шапка7_54 Шапка7_55 Шапка7_56 Шапка7_57 Шапка7_58 Шапка7_59 Шапка7_510
Шапка7_61 Шапка7_62 Шапка7_63 Шапка7_64 Шапка7_65 Шапка7_66 Шапка7_67 Шапка7_68 Шапка7_69 Шапка7_610
Шапка7_71 Шапка7_72 Шапка7_73 Шапка7_74 Шапка7_75 Шапка7_76 Шапка7_77 Шапка7_78 Шапка7_79 Шапка7_710
Шапка7_81 Шапка7_82 Шапка7_83 Шапка7_84 Шапка7_85 Шапка7_86 Шапка7_87 Шапка7_88 Шапка7_89 Шапка7_810
Шапка7_91 Шапка7_92 Шапка7_93 Шапка7_94 Шапка7_95 Шапка7_96 Шапка7_97 Шапка7_98 Шапка7_99 Шапка7_910
.endfields
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
.]h
.fields
Символ17
Символ27 СуммаНач7
Символ47
.endfields
 @.{.?NUC9;        │.}
 @.{.?NUC10;@'~@@@@@│.}
 @.{.?NUC11;────────┼.}
.}
.fields
Итого7
.endfields
  .{.?NUC12;@'~@@@@@│.}
  .{.?NUC13;        │.}
  .{.?NUC14;────────┴.}
.}
.{ LastUdColmsCircle CheckEnter
.{ PeopC8 CheckEnter
.[h
.fields
Шапка8_11 Шапка8_12 Шапка8_13 Шапка8_14 Шапка8_15 Шапка8_16 Шапка8_17 Шапка8_18 Шапка8_19 Шапка8_110
Шапка8_21 Шапка8_22 Шапка8_23 Шапка8_24 Шапка8_25 Шапка8_26 Шапка8_27 Шапка8_28 Шапка8_29 Шапка8_210
Шапка8_31 Шапка8_32 Шапка8_33 Шапка8_34 Шапка8_35 Шапка8_36 Шапка8_37 Шапка8_38 Шапка8_39 Шапка8_310
Шапка8_41 Шапка8_42 Шапка8_43 Шапка8_44 Шапка8_45 Шапка8_46 Шапка8_47 Шапка8_48 Шапка8_49 Шапка8_410
Шапка8_51 Шапка8_52 Шапка8_53 Шапка8_54 Шапка8_55 Шапка8_56 Шапка8_57 Шапка8_58 Шапка8_59 Шапка8_510
Шапка8_61 Шапка8_62 Шапка8_63 Шапка8_64 Шапка8_65 Шапка8_66 Шапка8_67 Шапка8_68 Шапка8_69 Шапка8_610
Шапка8_71 Шапка8_72 Шапка8_73 Шапка8_74 Шапка8_75 Шапка8_76 Шапка8_77 Шапка8_78 Шапка8_79 Шапка8_710
Шапка8_81 Шапка8_82 Шапка8_83 Шапка8_84 Шапка8_85 Шапка8_86 Шапка8_87 Шапка8_88 Шапка8_89 Шапка8_810
Шапка8_91 Шапка8_92 Шапка8_93 Шапка8_94 Шапка8_95 Шапка8_96 Шапка8_97 Шапка8_98 Шапка8_99 Шапка8_910
.endfields
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
.]h
.fields
Символ18
Символ28 СуммаНач8 ВсегоУдер8 СумКвыд8
Символ48
.endfields
@.{.?LUCC9;        │.}        │        │         │
@.{.?LUCC10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│         │
@.{.?LUCC11;────────┼.}────────┤────────┼─────────┤
.}
.fields
Итого8 ИтогоВсегоУдер8 ИтогоСумКвыд8
ИтогоСтр8 ИтогоПоВед8
СтрГлавБух8
ИтогоПоВедПрпись8
ИтогоПоВедПрписьСтрока8
.endfields
 .{.?LUCC12;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│         │
 .{.?LUCC13;        │.}        │        │         │
 .{.?LUCC14;────────┴.}────────┴────────┴─────────┘
@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.{ LastNachTimeColmsCircle CheckEnter









.{ PeopC9 CheckEnter
.[h
.fields
Шапка9_11 Шапка9_12 Шапка9_13 Шапка9_14 Шапка9_15 Шапка9_16 Шапка9_17 Шапка9_18 Шапка9_19 Шапка9_110
Шапка9_21 Шапка9_22 Шапка9_23 Шапка9_24 Шапка9_25 Шапка9_26 Шапка9_27 Шапка9_28 Шапка9_29 Шапка9_210
Шапка9_31 Шапка9_32 Шапка9_33 Шапка9_34 Шапка9_35 Шапка9_36 Шапка9_37 Шапка9_38 Шапка9_39 Шапка9_310
Шапка9_41 Шапка9_42 Шапка9_43 Шапка9_44 Шапка9_45 Шапка9_46 Шапка9_47 Шапка9_48 Шапка9_49 Шапка9_410
Шапка9_51 Шапка9_52 Шапка9_53 Шапка9_54 Шапка9_55 Шапка9_56 Шапка9_57 Шапка9_58 Шапка9_59 Шапка9_510
Шапка9_61 Шапка9_62 Шапка9_63 Шапка9_64 Шапка9_65 Шапка9_66 Шапка9_67 Шапка9_68 Шапка9_69 Шапка9_610
Шапка9_71 Шапка9_72 Шапка9_73 Шапка9_74 Шапка9_75 Шапка9_76 Шапка9_77 Шапка9_78 Шапка9_79 Шапка9_710
Шапка9_81 Шапка9_82 Шапка9_83 Шапка9_84 Шапка9_85 Шапка9_86 Шапка9_87 Шапка9_88 Шапка9_89 Шапка9_810
Шапка9_91 Шапка9_92 Шапка9_93 Шапка9_94 Шапка9_95 Шапка9_96 Шапка9_97 Шапка9_98 Шапка9_99 Шапка9_910
.endfields
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
.]h
.fields
Дней9 Часов9 Дни9 Час9
СуммаНач9 ВсегоНач9
.endfields
 .{.?LNTCC9;@@@│@@@@│.}@@@│@@@@│
 .{.?LNTCC10;@'~@@@@@│.}@'~@@@@@│
 .{.?LNTCC11;───┬────┼.}───┬────┤
.}
.fields
ИтогоДней9 ИтогоЧасов9 ИтогоВсегоДни9 ИтогоВсегоЧас9
Итого9 ИтогоВсегоНач9
.endfields
 .{.?LNTCC12;@@@│@@@@│.}@@@│@@@@│
 .{.?LNTCC13;@'~@@@@@│.}@'~@@@@@│
 .{.?LNTCC14;────────┴.}────────┘
.}
.{ LastNachColmsCircle CheckEnter









.{ PeopC10 CheckEnter
.[h
.fields
Шапка10_11 Шапка10_12 Шапка10_13 Шапка10_14 Шапка10_15 Шапка10_16 Шапка10_17 Шапка10_18 Шапка10_19 Шапка10_110
Шапка10_21 Шапка10_22 Шапка10_23 Шапка10_24 Шапка10_25 Шапка10_26 Шапка10_27 Шапка10_28 Шапка10_29 Шапка10_210
Шапка10_31 Шапка10_32 Шапка10_33 Шапка10_34 Шапка10_35 Шапка10_36 Шапка10_37 Шапка10_38 Шапка10_39 Шапка10_310
Шапка10_41 Шапка10_42 Шапка10_43 Шапка10_44 Шапка10_45 Шапка10_46 Шапка10_47 Шапка10_48 Шапка10_49 Шапка10_410
Шапка10_51 Шапка10_52 Шапка10_53 Шапка10_54 Шапка10_55 Шапка10_56 Шапка10_57 Шапка10_58 Шапка10_59 Шапка10_510
Шапка10_61 Шапка10_62 Шапка10_63 Шапка10_64 Шапка10_65 Шапка10_66 Шапка10_67 Шапка10_68 Шапка10_69 Шапка10_610
Шапка10_71 Шапка10_72 Шапка10_73 Шапка10_74 Шапка10_75 Шапка10_76 Шапка10_77 Шапка10_78 Шапка10_79 Шапка10_710
Шапка10_81 Шапка10_82 Шапка10_83 Шапка10_84 Шапка10_85 Шапка10_86 Шапка10_87 Шапка10_88 Шапка10_89 Шапка10_810
Шапка10_91 Шапка10_92 Шапка10_93 Шапка10_94 Шапка10_95 Шапка10_96 Шапка10_97 Шапка10_98 Шапка10_99 Шапка10_910
.endfields
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
.]h
.fields
Символ110
Символ210 СуммаНач10 ВсегоНач10
Символ410
.endfields
@.{.?LNCC9;        │.}        │
@.{.?LNCC10;@'~@@@@@│.}@'~@@@@@│
@.{.?LNCC11;────────┼.}────────┤
.}
.fields
Итого10 ИтогоВсегоУдер10
.endfields
 .{.?LNCC12;@'~@@@@@│.}@'~@@@@@│
 .{.?LNCC13;        │.}        │
 .{.?LNCC14;────────┴.}────────┘
.}
.{ LastNeNachCC CheckEnter













.{ PeopC105 CheckEnter
.[h
.fields
Шапка105_11 Шапка105_12 Шапка105_13 Шапка105_14 Шапка105_15 Шапка105_16 Шапка105_17 Шапка105_18 Шапка105_19 Шапка105_110
Шапка105_21 Шапка105_22 Шапка105_23 Шапка105_24 Шапка105_25 Шапка105_26 Шапка105_27 Шапка105_28 Шапка105_29 Шапка105_210
Шапка105_31 Шапка105_32 Шапка105_33 Шапка105_34 Шапка105_35 Шапка105_36 Шапка105_37 Шапка105_38 Шапка105_39 Шапка105_310
Шапка105_41 Шапка105_42 Шапка105_43 Шапка105_44 Шапка105_45 Шапка105_46 Шапка105_47 Шапка105_48 Шапка105_49 Шапка105_410
Шапка105_51 Шапка105_52 Шапка105_53 Шапка105_54 Шапка105_55 Шапка105_56 Шапка105_57 Шапка105_58 Шапка105_59 Шапка105_510
Шапка105_61 Шапка105_62 Шапка105_63 Шапка105_64 Шапка105_65 Шапка105_66 Шапка105_67 Шапка105_68 Шапка105_69 Шапка105_610
Шапка105_71 Шапка105_72 Шапка105_73 Шапка105_74 Шапка105_75 Шапка105_76 Шапка105_77 Шапка105_78 Шапка105_79 Шапка105_710
Шапка105_81 Шапка105_82 Шапка105_83 Шапка105_84 Шапка105_85 Шапка105_86 Шапка105_87 Шапка105_88 Шапка105_89 Шапка105_810
Шапка105_91 Шапка105_92 Шапка105_93 Шапка105_94 Шапка105_95 Шапка105_96 Шапка105_97 Шапка105_98 Шапка105_99 Шапка105_910
.endfields
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
.]h
.fields
Символ105_18
Символ105_28 СуммаНач105 ВсегоУдер105 ВсегоНенач105 СумКвыд105
Символ105_48
.endfields
@.{.?LUNC9;             │.}             │             │              │         │
@.{.?LUNC10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@@│@'~@@@@@@@@@@@│         │
@.{.?LUNC11;─────────────┼.}─────────────┼──────────────┼──────────────┼─────────┤
.}
.fields
Итого105 ИтогоВсегоУдер105 ИтогоНенач105 ИтогоСумКвыд105
ИтогоСтр105 ИтогоПоВед105
СтрГлавБух105
ИтогоПоВедПрпись105
ИтогоПоВедПрписьСтрока105
.endfields
 .{.?LUNC12;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@@│@'~@@@@@@@@@@@│         │
 .{.?LUNC13;             │.}             │              │              │         │
 .{.?LUNC14;─────────────┴.}─────────────┴──────────────┴──────────────┴─────────┘
@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.{ NachUdWithTimeCicle CheckEnter
.{ PeopC11 CheckEnter
.[h
.fields
Шапка11_11 Шапка11_12 Шапка11_13 Шапка11_14 Шапка11_15 Шапка11_16 Шапка11_17 Шапка11_18 Шапка11_19 Шапка11_110
Шапка11_21 Шапка11_22 Шапка11_23 Шапка11_24 Шапка11_25 Шапка11_26 Шапка11_27 Шапка11_28 Шапка11_29 Шапка11_210
Шапка11_31 Шапка11_32 Шапка11_33 Шапка11_34 Шапка11_35 Шапка11_36 Шапка11_37 Шапка11_38 Шапка11_39 Шапка11_310
Шапка11_41 Шапка11_42 Шапка11_43 Шапка11_44 Шапка11_45 Шапка11_46 Шапка11_47 Шапка11_48 Шапка11_49 Шапка11_410
Шапка11_51 Шапка11_52 Шапка11_53 Шапка11_54 Шапка11_55 Шапка11_56 Шапка11_57 Шапка11_58 Шапка11_59 Шапка11_510
Шапка11_61 Шапка11_62 Шапка11_63 Шапка11_64 Шапка11_65 Шапка11_66 Шапка11_67 Шапка11_68 Шапка11_69 Шапка11_610
Шапка11_71 Шапка11_72 Шапка11_73 Шапка11_74 Шапка11_75 Шапка11_76 Шапка11_77 Шапка11_78 Шапка11_79 Шапка11_710
Шапка11_81 Шапка11_82 Шапка11_83 Шапка11_84 Шапка11_85 Шапка11_86 Шапка11_87 Шапка11_88 Шапка11_89 Шапка11_810
Шапка11_91 Шапка11_92 Шапка11_93 Шапка11_94 Шапка11_95 Шапка11_96 Шапка11_97 Шапка11_98 Шапка11_99 Шапка11_910
.endfields
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
.]h
.fields
Нпп11 ТабНом11 ФИО11 Дней11 Часов11 ВсегоДней11 ВсегоЧасов11
Долж11 СуммаНач11 ВсегоНач11 СуммаУд11 ВсегоУд11 СумКВыдаче11
ИтогоДней11 ИтогоЧасов11 ВсегоИтогоДней11 ВсегоИтогоЧасов11
ИтогоНач11 ВсегоИтогоНач11 ИтогоУд11 ВсегоИтогоУд11 ИтогоКВыдаче11
ИтогоСтр11 ИтогоПоВед11
СтрГлавБух11
ИтогоПоВедПрпись11
ИтогоПоВедПрписьСтрока11
.endfields
│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNUWT9;@@@│@@@@│.}@@@│@@@@│.{.?NUUWT9;        │.}        │        │         │
│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNUWT10;@'~@@@@@│.}@'~@@@@@│.{.?NUUWT10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│         │
├───┼──────────┼──────────────────┼.{.?NNUWT11;───┬────┼.}───┬────┼.{.?NUUWT11;────────┼.}────────┤────────┼─────────┤
.}
│   │  ИТОГО   │                  │.{.?NNUWT12;@@@│@@@@│.}@@@│@@@@│.{.?NUUWT12;        │.}        │        │         │
│   │          │                  │.{.?NNUWT13;@'~@@@@@│.}@'~@@@@@│.{.?NUUWT13;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│         │
└───┴──────────┴──────────────────┴.{.?NNUWT14;────────┴.}────────┴.{.?NUUWT14;────────┴.}────────┴────────┴─────────┘
 @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.{ NNachUdWithTimeCicle CheckEnter



.{ PeopC111 CheckEnter
.[h
.fields
Шапка111_11 Шапка111_12 Шапка111_13 Шапка111_14 Шапка111_15 Шапка111_16 Шапка111_17 Шапка111_18 Шапка111_19 Шапка111_110
Шапка111_21 Шапка111_22 Шапка111_23 Шапка111_24 Шапка111_25 Шапка111_26 Шапка111_27 Шапка111_28 Шапка111_29 Шапка111_210
Шапка111_31 Шапка111_32 Шапка111_33 Шапка111_34 Шапка111_35 Шапка111_36 Шапка111_37 Шапка111_38 Шапка111_39 Шапка111_310
Шапка111_41 Шапка111_42 Шапка111_43 Шапка111_44 Шапка111_45 Шапка111_46 Шапка111_47 Шапка111_48 Шапка111_49 Шапка111_410
Шапка111_51 Шапка111_52 Шапка111_53 Шапка111_54 Шапка111_55 Шапка111_56 Шапка111_57 Шапка111_58 Шапка111_59 Шапка111_510
Шапка111_61 Шапка111_62 Шапка111_63 Шапка111_64 Шапка111_65 Шапка111_66 Шапка111_67 Шапка111_68 Шапка111_69 Шапка111_610
Шапка111_71 Шапка111_72 Шапка111_73 Шапка111_74 Шапка111_75 Шапка111_76 Шапка111_77 Шапка111_78 Шапка111_79 Шапка111_710
Шапка111_81 Шапка111_82 Шапка111_83 Шапка111_84 Шапка111_85 Шапка111_86 Шапка111_87 Шапка111_88 Шапка111_89 Шапка111_810
Шапка111_91 Шапка111_92 Шапка111_93 Шапка111_94 Шапка111_95 Шапка111_96 Шапка111_97 Шапка111_98 Шапка111_99 Шапка111_910
.endfields
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
.]h
.fields
Нпп111 ТабНом111 ФИО111 Дней111 Часов111 ВсегоДней111 ВсегоЧасов111
Долж111 СуммаНач111 ВсегоНач111 СуммаУд111 ВсегоУд111 ВсегоНеНач111 СумКВыдаче111
ИтогоДней111 ИтогоЧасов111 ВсегоИтогоДней111 ВсегоИтогоЧасов111
ИтогоНач111 ВсегоИтогоНач111 ИтогоУд111 ВсегоИтогоУд111 ИтогоНеНач111 ИтогоКВыдаче111
ИтогоСтр111 ИтогоПоВед111
СтрГлавБух111
ИтогоПоВедПрпись111
ИтогоПоВедПрписьСтрока111
.endfields
│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUN9;@@@│@@@@│.}@@@│@@@@│.{.?UUN9;        │.}        │        │        │         │
│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUN10;@'~@@@@@│.}@'~@@@@@│.{.?UUN10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│         │
├───┼──────────┼──────────────────┼.{.?NUN11;───┬────┼.}───┬────┼.{.?UUN11;────────┼.}────────┤────────┤────────┼─────────┤
.}
│   │  ИТОГО   │                  │.{.?NUN12;@@@│@@@@│.}@@@│@@@@│.{.?UUN12;        │.}        │        │        │         │
│   │          │                  │.{.?NUN13;@'~@@@@@│.}@'~@@@@@│.{.?UUN13;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│         │
└───┴──────────┴──────────────────┴.{.?NUN14;────────┴.}────────┴.{.?UUN14;────────┴.}────────┴────────┴────────┴─────────┘
 @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.{ NachUdCicle CheckEnter
.{ PeopC12 CheckEnter
.[h
.fields
Шапка12_11 Шапка12_12 Шапка12_13 Шапка12_14 Шапка12_15 Шапка12_16 Шапка12_17 Шапка12_18 Шапка12_19 Шапка12_110
Шапка12_21 Шапка12_22 Шапка12_23 Шапка12_24 Шапка12_25 Шапка12_26 Шапка12_27 Шапка12_28 Шапка12_29 Шапка12_210
Шапка12_31 Шапка12_32 Шапка12_33 Шапка12_34 Шапка12_35 Шапка12_36 Шапка12_37 Шапка12_38 Шапка12_39 Шапка12_310
Шапка12_41 Шапка12_42 Шапка12_43 Шапка12_44 Шапка12_45 Шапка12_46 Шапка12_47 Шапка12_48 Шапка12_49 Шапка12_410
Шапка12_51 Шапка12_52 Шапка12_53 Шапка12_54 Шапка12_55 Шапка12_56 Шапка12_57 Шапка12_58 Шапка12_59 Шапка12_510
Шапка12_61 Шапка12_62 Шапка12_63 Шапка12_64 Шапка12_65 Шапка12_66 Шапка12_67 Шапка12_68 Шапка12_69 Шапка12_610
Шапка12_71 Шапка12_72 Шапка12_73 Шапка12_74 Шапка12_75 Шапка12_76 Шапка12_77 Шапка12_78 Шапка12_79 Шапка12_710
Шапка12_81 Шапка12_82 Шапка12_83 Шапка12_84 Шапка12_85 Шапка12_86 Шапка12_87 Шапка12_88 Шапка12_89 Шапка12_810
Шапка12_91 Шапка12_92 Шапка12_93 Шапка12_94 Шапка12_95 Шапка12_96 Шапка12_97 Шапка12_98 Шапка12_99 Шапка12_910
.endfields
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
.]h
.fields
Нпп12 ТабНом12 ФИО12
Долж12 СуммаНач12 ВсегоНач12 СуммаУд12 ВсегоУд12 СумКВыдаче12
ИтогоНач12 ВсегоИтогоНач12 ИтогоУд12 ВсегоИтогоУд12 ИтогоКВыдаче12
ИтогоСтр12 ИтогоПоВед12
СтрГлавБух12
ИтогоПоВедПрпись12
ИтогоПоВедПрписьСтрока12
.endfields
│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNU9;        │.}        │.{.?NUU9;        │.}        │        │         │
│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNU10;@'~@@@@@│.}@'~@@@@@│.{.?NUU10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│         │
├───┼──────────┼──────────────────┼.{.?NNU11;────────┼.}────────┼.{.?NUU11;────────┼.}────────┤────────┼─────────┤
.}
│   │  ИТОГО   │                  │.{.?NNU12;        │.}        │.{.?NUU12;        │.}        │        │         │
│   │          │                  │.{.?NNU13;@'~@@@@@│.}@'~@@@@@│.{.?NUU13;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│         │
└───┴──────────┴──────────────────┴.{.?NNU14;────────┴.}────────┴.{.?NUU14;────────┴.}────────┴────────┴─────────┘
@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.{ NNachUdCicle CheckEnter
.{ PeopC112 CheckEnter
.[h
.fields
Шапка112_11 Шапка112_12 Шапка112_13 Шапка112_14 Шапка112_15 Шапка112_16 Шапка112_17 Шапка112_18 Шапка112_19 Шапка112_110
Шапка112_21 Шапка112_22 Шапка112_23 Шапка112_24 Шапка112_25 Шапка112_26 Шапка112_27 Шапка112_28 Шапка112_29 Шапка112_210
Шапка112_31 Шапка112_32 Шапка112_33 Шапка112_34 Шапка112_35 Шапка112_36 Шапка112_37 Шапка112_38 Шапка112_39 Шапка112_310
Шапка112_41 Шапка112_42 Шапка112_43 Шапка112_44 Шапка112_45 Шапка112_46 Шапка112_47 Шапка112_48 Шапка112_49 Шапка112_410
Шапка112_51 Шапка112_52 Шапка112_53 Шапка112_54 Шапка112_55 Шапка112_56 Шапка112_57 Шапка112_58 Шапка112_59 Шапка112_510
Шапка112_61 Шапка112_62 Шапка112_63 Шапка112_64 Шапка112_65 Шапка112_66 Шапка112_67 Шапка112_68 Шапка112_69 Шапка112_610
Шапка112_71 Шапка112_72 Шапка112_73 Шапка112_74 Шапка112_75 Шапка112_76 Шапка112_77 Шапка112_78 Шапка112_79 Шапка112_710
Шапка112_81 Шапка112_82 Шапка112_83 Шапка112_84 Шапка112_85 Шапка112_86 Шапка112_87 Шапка112_88 Шапка112_89 Шапка112_810
Шапка112_91 Шапка112_92 Шапка112_93 Шапка112_94 Шапка112_95 Шапка112_96 Шапка112_97 Шапка112_98 Шапка112_99 Шапка112_910
.endfields
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
.]h
.fields
Нпп112 ТабНом112 ФИО112
Долж112 СуммаНач112 ВсегоНач112 СуммаУд112 ВсегоУд112 ВсегоНеНач112 СумКВыдаче112
ИтогоНач112 ВсегоИтогоНач112 ИтогоУд112 ВсегоИтогоУд112 ИтогоНеНач112 ИтогоКВыдаче112
ИтогоСтр112 ИтогоПоВед112
СтрГлавБух112
ИтогоПоВедПрпись112
ИтогоПоВедПрписьСтрока112
.endfields
│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNUN9;        │.}        │.{.?UNUN9;        │.}        │        │         │
│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNUN10;@'~@@@@@│.}@'~@@@@@│.{.?UNUN10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│ ^        │
├───┼──────────┼──────────────────┼.{.?NNUN11;────────┼.}────────┼.{.?UNUN11;────────┼.}────────┤────────┼─────────┤
.}
│   │  ИТОГО   │                  │.{.?NNUN12;        │.}        │.{.?UNUN12;        │.}        │        │         │
│   │          │                  │.{.?NNUN13;@'~@@@@@│.}@'~@@@@@│.{.?UNUN13;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│^        │
└───┴──────────┴──────────────────┴.{.?NNUN14;────────┴.}────────┴.{.?UNUN14;────────┴.}────────┴────────┴─────────┘
@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.}
.fields
ИтогоВедомость
.endfields
ИТОГО ВЫПЛАЧЕНО: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
( сумма к выдаче прописью)
.endform

.linkform 'RPVedGor_L1' prototype is 'RPVedGor'
.nameinlist 'Расчетно-платежная ведомость для больших сумм'
.Set Filler ='-'
.DEFO LANDSCAPE
.DEFP PA4
.p 72
.var
     InShap    : integer;
     SumList1  : double
     SumList2  : double
     SumList3  : double
     List      : Longint
 .endvar
.group '1_Первая группа'
.begin InShap := 0    end.
.{ CommonForAllCicle CheckEnter
.fields
РукПред_Имя ГлавБух_Имя
НазвОрган
КодПодразделение
ЗаМесяц
Год
.endfields
.{ Shapka CheckEnter
                БРуководитель Б                     БГл.бухгалтер Б
                Борганизации Б                      Борганизации Б
          @~@@@@@@@@@@@@@@@@@@@@@@@      @~@@@@@@@@@@@@@@@@@@@@@@@

           БОрганизация Б : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{?internal;InShap=0

.begin InShap := InShap + 1 end.
.}
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                     БРАСЧЕТНО-ПЛАТЕЖНАЯ ВЕДОМОСТЬ No__ Б
                     Бза Б  @@@@@@@@@@ Б месяц Б   @@@@   Бг. Б
.}
.begin
  SumList1 :=0;
  List     :=1;
end.
.{ NachBegEndWithTimeCicle CheckEnter
.{ PeopC1 CheckEnter
.[h
.fields
Шапка1_11 Шапка1_12 Шапка1_13 Шапка1_14 Шапка1_15 Шапка1_16 Шапка1_17 Шапка1_18 Шапка1_19 Шапка1_110
Шапка1_21 Шапка1_22 Шапка1_23 Шапка1_24 Шапка1_25 Шапка1_26 Шапка1_27 Шапка1_28 Шапка1_29 Шапка1_210
Шапка1_31 Шапка1_32 Шапка1_33 Шапка1_34 Шапка1_35 Шапка1_36 Шапка1_37 Шапка1_38 Шапка1_39 Шапка1_310
Шапка1_41 Шапка1_42 Шапка1_43 Шапка1_44 Шапка1_45 Шапка1_46 Шапка1_47 Шапка1_48 Шапка1_49 Шапка1_410
Шапка1_51 Шапка1_52 Шапка1_53 Шапка1_54 Шапка1_55 Шапка1_56 Шапка1_57 Шапка1_58 Шапка1_59 Шапка1_510
Шапка1_61 Шапка1_62 Шапка1_63 Шапка1_64 Шапка1_65 Шапка1_66 Шапка1_67 Шапка1_68 Шапка1_69 Шапка1_610
Шапка1_71 Шапка1_72 Шапка1_73 Шапка1_74 Шапка1_75 Шапка1_76 Шапка1_77 Шапка1_78 Шапка1_79 Шапка1_710
Шапка1_81 Шапка1_82 Шапка1_83 Шапка1_84 Шапка1_85 Шапка1_86 Шапка1_87 Шапка1_88 Шапка1_89 Шапка1_810
Шапка1_91 Шапка1_92 Шапка1_93 Шапка1_94 Шапка1_95 Шапка1_96 Шапка1_97 Шапка1_98 Шапка1_99 Шапка1_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп1 ТабНом1 ФИО1:'d:r' Дней1 Часов1 ВсегоДней1 ВсегоЧасов1
Долж1:'d:r' СуммаНач1 ВсегоНач1
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач1;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBET9;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBET10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBET11;──────┬──────┼.}──────┬──────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!  end
!end.
!.fields
!  List
!  SumList1
! СуммаНач1:'SUM'
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней1 ИтогоЧасов1 ВсегоИтогоДней1 ВсегоИтогоЧасов1
Итого1 ВсегоИтого1
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NBET12;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│ Ш
 Ш│   │          │                  │.{.?NBET13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBET14;─────────────┴.}─────────────┘
 Ш^
.}
.begin
  SumList1 :=0;
  List := 1;
end.
.{ NachBegEndCicle CheckEnter
.{ PeopC2 CheckEnter
.[h
.fields
Шапка2_11 Шапка2_12 Шапка2_13 Шапка2_14 Шапка2_15 Шапка2_16 Шапка2_17 Шапка2_18 Шапка2_19 Шапка2_110
Шапка2_21 Шапка2_22 Шапка2_23 Шапка2_24 Шапка2_25 Шапка2_26 Шапка2_27 Шапка2_28 Шапка2_29 Шапка2_210
Шапка2_31 Шапка2_32 Шапка2_33 Шапка2_34 Шапка2_35 Шапка2_36 Шапка2_37 Шапка2_38 Шапка2_39 Шапка2_310
Шапка2_41 Шапка2_42 Шапка2_43 Шапка2_44 Шапка2_45 Шапка2_46 Шапка2_47 Шапка2_48 Шапка2_49 Шапка2_410
Шапка2_51 Шапка2_52 Шапка2_53 Шапка2_54 Шапка2_55 Шапка2_56 Шапка2_57 Шапка2_58 Шапка2_59 Шапка2_510
Шапка2_61 Шапка2_62 Шапка2_63 Шапка2_64 Шапка2_65 Шапка2_66 Шапка2_67 Шапка2_68 Шапка2_69 Шапка2_610
Шапка2_71 Шапка2_72 Шапка2_73 Шапка2_74 Шапка2_75 Шапка2_76 Шапка2_77 Шапка2_78 Шапка2_79 Шапка2_710
Шапка2_81 Шапка2_82 Шапка2_83 Шапка2_84 Шапка2_85 Шапка2_86 Шапка2_87 Шапка2_88 Шапка2_89 Шапка2_810
Шапка2_91 Шапка2_92 Шапка2_93 Шапка2_94 Шапка2_95 Шапка2_96 Шапка2_97 Шапка2_98 Шапка2_99 Шапка2_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп2 ТабНом2 ФИО2:'d:r'
Долж2:'d:r' СуммаНач2 ВсегоНач2
!Итого2 ВсегоИтого2
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач2;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBEWT9;             │.}             │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBEWT10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBEWT11;─────────────┼.}─────────────┤ Ш
!.[f OverWrite
!.begin
!Message(' FlagRo  '+String(FlagRo),1);
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!  end
!end.
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого2 ВсегоИтого2
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NBEWT12;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш│   │          │                  │.{.?NBEWT13;             │.}             │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBEWT14;─────────────┴.}─────────────┘ Ш
^
.begin
  SumList1 :=0;
  SumList2 :=0;
  List := 1;
end.
.fields
.endfields
.}
.{ NeNachBegEndCicle CheckEnter








.{ PeopC103 CheckEnter
.[h
.fields
Шапка103_11 Шапка103_12 Шапка103_13 Шапка103_14 Шапка103_15 Шапка103_16 Шапка103_17 Шапка103_18 Шапка103_19 Шапка103_110
Шапка103_21 Шапка103_22 Шапка103_23 Шапка103_24 Шапка103_25 Шапка103_26 Шапка103_27 Шапка103_28 Шапка103_29 Шапка103_210
Шапка103_31 Шапка103_32 Шапка103_33 Шапка103_34 Шапка103_35 Шапка103_36 Шапка103_37 Шапка103_38 Шапка103_39 Шапка103_310
Шапка103_41 Шапка103_42 Шапка103_43 Шапка103_44 Шапка103_45 Шапка103_46 Шапка103_47 Шапка103_48 Шапка103_49 Шапка103_410
Шапка103_51 Шапка103_52 Шапка103_53 Шапка103_54 Шапка103_55 Шапка103_56 Шапка103_57 Шапка103_58 Шапка103_59 Шапка103_510
Шапка103_61 Шапка103_62 Шапка103_63 Шапка103_64 Шапка103_65 Шапка103_66 Шапка103_67 Шапка103_68 Шапка103_69 Шапка103_610
Шапка103_71 Шапка103_72 Шапка103_73 Шапка103_74 Шапка103_75 Шапка103_76 Шапка103_77 Шапка103_78 Шапка103_79 Шапка103_710
Шапка103_81 Шапка103_82 Шапка103_83 Шапка103_84 Шапка103_85 Шапка103_86 Шапка103_87 Шапка103_88 Шапка103_89 Шапка103_810
Шапка103_91 Шапка103_92 Шапка103_93 Шапка103_94 Шапка103_95 Шапка103_96 Шапка103_97 Шапка103_98 Шапка103_99 Шапка103_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп103 ТабНом103 ФИО103:'d:r'
Долж103:'d:r' СуммаУдер103 ВсегоУдер103 СуммаНеНач103 СумКвыд103
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер103;
!  SumList2 := SumList2 + СумКвыд103;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUBEN9;             │.}             │             │             │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUBEN10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NUBEN11;─────────────┼.}─────────────┼─────────────┼─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:      удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List + 1;
!end.
!.]f
.}
.fields
Итого103 ВсегоИтого103 ИтогоСуммаНач103 ВсеКВыдаче103
ИтогоСтр103 ИтогоПоВед103
СтрГлавБух103
ИтогоПоВедПрпись103
ИтогоПоВедПрписьСтрока103
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NUBEN12;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш│   │          │                  │.{.?NUBEN13;             │.}             │             │             │               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NUBEN14;─────────────┴.}─────────────┴─────────────┴─────────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
!.}
.}
.{ NachUdBegEndCicle CheckEnter








.{ PeopC3 CheckEnter
.[h
.fields
Шапка3_11 Шапка3_12 Шапка3_13 Шапка3_14 Шапка3_15 Шапка3_16 Шапка3_17 Шапка3_18 Шапка3_19 Шапка3_110
Шапка3_21 Шапка3_22 Шапка3_23 Шапка3_24 Шапка3_25 Шапка3_26 Шапка3_27 Шапка3_28 Шапка3_29 Шапка3_210
Шапка3_31 Шапка3_32 Шапка3_33 Шапка3_34 Шапка3_35 Шапка3_36 Шапка3_37 Шапка3_38 Шапка3_39 Шапка3_310
Шапка3_41 Шапка3_42 Шапка3_43 Шапка3_44 Шапка3_45 Шапка3_46 Шапка3_47 Шапка3_48 Шапка3_49 Шапка3_410
Шапка3_51 Шапка3_52 Шапка3_53 Шапка3_54 Шапка3_55 Шапка3_56 Шапка3_57 Шапка3_58 Шапка3_59 Шапка3_510
Шапка3_61 Шапка3_62 Шапка3_63 Шапка3_64 Шапка3_65 Шапка3_66 Шапка3_67 Шапка3_68 Шапка3_69 Шапка3_610
Шапка3_71 Шапка3_72 Шапка3_73 Шапка3_74 Шапка3_75 Шапка3_76 Шапка3_77 Шапка3_78 Шапка3_79 Шапка3_710
Шапка3_81 Шапка3_82 Шапка3_83 Шапка3_84 Шапка3_85 Шапка3_86 Шапка3_87 Шапка3_88 Шапка3_89 Шапка3_810
Шапка3_91 Шапка3_92 Шапка3_93 Шапка3_94 Шапка3_95 Шапка3_96 Шапка3_97 Шапка3_98 Шапка3_99 Шапка3_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп3 ТабНом3 ФИО3:'d:r'
Долж3:'d:r' СуммаУдер3 ВсегоУдер3 СумКвыд3
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер3;
!  SumList2 := SumList2 + СумКвыд3;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUBEWT9;             │.}             │             │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUBEWT10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NUBEWT11;─────────────┼.}─────────────┤─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:      удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List + 1;
!end.
!.]f
.}
.fields
Итого3 ВсегоИтого3 ВсеКВыдаче3
ИтогоСтр3 ИтогоПоВед3
СтрГлавБух3
ИтогоПоВедПрпись3
ИтогоПоВедПрписьСтрока3
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NUBEWT12;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш│   │          │                  │.{.?NUBEWT13;             │.}             │             │               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NUBEWT14;─────────────┴.}─────────────┴─────────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.{ NachBgWithTimeCicle CheckEnter
.{  PeopC4 CheckEnter
.[h
.fields
Шапка4_11 Шапка4_12 Шапка4_13 Шапка4_14 Шапка4_15 Шапка4_16 Шапка4_17 Шапка4_18 Шапка4_19 Шапка4_110
Шапка4_21 Шапка4_22 Шапка4_23 Шапка4_24 Шапка4_25 Шапка4_26 Шапка4_27 Шапка4_28 Шапка4_29 Шапка4_210
Шапка4_31 Шапка4_32 Шапка4_33 Шапка4_34 Шапка4_35 Шапка4_36 Шапка4_37 Шапка4_38 Шапка4_39 Шапка4_310
Шапка4_41 Шапка4_42 Шапка4_43 Шапка4_44 Шапка4_45 Шапка4_46 Шапка4_47 Шапка4_48 Шапка4_49 Шапка4_410
Шапка4_51 Шапка4_52 Шапка4_53 Шапка4_54 Шапка4_55 Шапка4_56 Шапка4_57 Шапка4_58 Шапка4_59 Шапка4_510
Шапка4_61 Шапка4_62 Шапка4_63 Шапка4_64 Шапка4_65 Шапка4_66 Шапка4_67 Шапка4_68 Шапка4_69 Шапка4_610
Шапка4_71 Шапка4_72 Шапка4_73 Шапка4_74 Шапка4_75 Шапка4_76 Шапка4_77 Шапка4_78 Шапка4_79 Шапка4_710
Шапка4_81 Шапка4_82 Шапка4_83 Шапка4_84 Шапка4_85 Шапка4_86 Шапка4_87 Шапка4_88 Шапка4_89 Шапка4_810
Шапка4_91 Шапка4_92 Шапка4_93 Шапка4_94 Шапка4_95 Шапка4_96 Шапка4_97 Шапка4_98 Шапка4_99 Шапка4_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп4 ТабНом4 ФИО4:'d:r' Дней4 Часов4
Долж4:'d:r' СуммаНач4
.endfields
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBT9;@@@@@@│@@@@@@│.} Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBT10;@'~@@@@@@@@@@│.} Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBT11;──────┬──────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
ИтогоДней4 ИтогоЧасов4
Итого4
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NBT12;@@@@@@│@@@@@@│.} Ш
 Ш│   │          │                  │.{.?NBT13;@'~@@@@@@@@@@│.} Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBT14;─────────────┴.} Ш
^
.}
.{NachUdBegCicle CheckEnter
.if NeedSpace








.end
.{ PeopC5 CheckEnter
.[h
.fields
Шапка5_11 Шапка5_12 Шапка5_13 Шапка5_14 Шапка5_15 Шапка5_16 Шапка5_17 Шапка5_18 Шапка5_19 Шапка5_110
Шапка5_21 Шапка5_22 Шапка5_23 Шапка5_24 Шапка5_25 Шапка5_26 Шапка5_27 Шапка5_28 Шапка5_29 Шапка5_210
Шапка5_31 Шапка5_32 Шапка5_33 Шапка5_34 Шапка5_35 Шапка5_36 Шапка5_37 Шапка5_38 Шапка5_39 Шапка5_310
Шапка5_41 Шапка5_42 Шапка5_43 Шапка5_44 Шапка5_45 Шапка5_46 Шапка5_47 Шапка5_48 Шапка5_49 Шапка5_410
Шапка5_51 Шапка5_52 Шапка5_53 Шапка5_54 Шапка5_55 Шапка5_56 Шапка5_57 Шапка5_58 Шапка5_59 Шапка5_510
Шапка5_61 Шапка5_62 Шапка5_63 Шапка5_64 Шапка5_65 Шапка5_66 Шапка5_67 Шапка5_68 Шапка5_69 Шапка5_610
Шапка5_71 Шапка5_72 Шапка5_73 Шапка5_74 Шапка5_75 Шапка5_76 Шапка5_77 Шапка5_78 Шапка5_79 Шапка5_710
Шапка5_81 Шапка5_82 Шапка5_83 Шапка5_84 Шапка5_85 Шапка5_86 Шапка5_87 Шапка5_88 Шапка5_89 Шапка5_810
Шапка5_91 Шапка5_92 Шапка5_93 Шапка5_94 Шапка5_95 Шапка5_96 Шапка5_97 Шапка5_98 Шапка5_99 Шапка5_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп5 ТабНом5 ФИО5:'d:r'
Долж5:'d:r' СуммаНач5
.endfields
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBWT9;             │.} Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBWT10;@'~@@@@@@@@@@│.} Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBWT11;─────────────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
Итого5
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NBWT12;@'~@@@@@@@@@@│.} Ш
 Ш│   │          │                  │.{.?NBWT13;             │.} Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBWT14;─────────────┴.} Ш
^
.}
.{ NachConWithTimeCicle CheckEnter
.{ PeopC6 CheckEnter
.[h
.fields
Шапка6_11 Шапка6_12 Шапка6_13 Шапка6_14 Шапка6_15 Шапка6_16 Шапка6_17 Шапка6_18 Шапка6_19 Шапка6_110
Шапка6_21 Шапка6_22 Шапка6_23 Шапка6_24 Шапка6_25 Шапка6_26 Шапка6_27 Шапка6_28 Шапка6_29 Шапка6_210
Шапка6_31 Шапка6_32 Шапка6_33 Шапка6_34 Шапка6_35 Шапка6_36 Шапка6_37 Шапка6_38 Шапка6_39 Шапка6_310
Шапка6_41 Шапка6_42 Шапка6_43 Шапка6_44 Шапка6_45 Шапка6_46 Шапка6_47 Шапка6_48 Шапка6_49 Шапка6_410
Шапка6_51 Шапка6_52 Шапка6_53 Шапка6_54 Шапка6_55 Шапка6_56 Шапка6_57 Шапка6_58 Шапка6_59 Шапка6_510
Шапка6_61 Шапка6_62 Шапка6_63 Шапка6_64 Шапка6_65 Шапка6_66 Шапка6_67 Шапка6_68 Шапка6_69 Шапка6_610
Шапка6_71 Шапка6_72 Шапка6_73 Шапка6_74 Шапка6_75 Шапка6_76 Шапка6_77 Шапка6_78 Шапка6_79 Шапка6_710
Шапка6_81 Шапка6_82 Шапка6_83 Шапка6_84 Шапка6_85 Шапка6_86 Шапка6_87 Шапка6_88 Шапка6_89 Шапка6_810
Шапка6_91 Шапка6_92 Шапка6_93 Шапка6_94 Шапка6_95 Шапка6_96 Шапка6_97 Шапка6_98 Шапка6_99 Шапка6_910
.endfields








 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Дней6 Часов6
СуммаНач6
.endfields
 Ш .{.?NCT9;@@@@@@│@@@@@@│.} Ш
 Ш .{.?NCT10;@'~@@@@@@@@@@│.} Ш
 Ш .{.?NCT11;──────┬──────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
ИтогоДней6 ИтогоЧасов6
Итого6
'true':'s'
.endfields
 Ш .{.?NCT12;@@@@@@│@@@@@@│.} Ш
 Ш .{.?NCT13;@'~@@@@@@@@@@│.} Ш
 Ш .{.?NCT14;─────────────┴.} Ш
^
.}
.{ NachUdConCicle CheckEnter
.{ PeopC7 CheckEnter
.[h
.fields
Шапка7_11 Шапка7_12 Шапка7_13 Шапка7_14 Шапка7_15 Шапка7_16 Шапка7_17 Шапка7_18 Шапка7_19 Шапка7_110
Шапка7_21 Шапка7_22 Шапка7_23 Шапка7_24 Шапка7_25 Шапка7_26 Шапка7_27 Шапка7_28 Шапка7_29 Шапка7_210
Шапка7_31 Шапка7_32 Шапка7_33 Шапка7_34 Шапка7_35 Шапка7_36 Шапка7_37 Шапка7_38 Шапка7_39 Шапка7_310
Шапка7_41 Шапка7_42 Шапка7_43 Шапка7_44 Шапка7_45 Шапка7_46 Шапка7_47 Шапка7_48 Шапка7_49 Шапка7_410
Шапка7_51 Шапка7_52 Шапка7_53 Шапка7_54 Шапка7_55 Шапка7_56 Шапка7_57 Шапка7_58 Шапка7_59 Шапка7_510
Шапка7_61 Шапка7_62 Шапка7_63 Шапка7_64 Шапка7_65 Шапка7_66 Шапка7_67 Шапка7_68 Шапка7_69 Шапка7_610
Шапка7_71 Шапка7_72 Шапка7_73 Шапка7_74 Шапка7_75 Шапка7_76 Шапка7_77 Шапка7_78 Шапка7_79 Шапка7_710
Шапка7_81 Шапка7_82 Шапка7_83 Шапка7_84 Шапка7_85 Шапка7_86 Шапка7_87 Шапка7_88 Шапка7_89 Шапка7_810
Шапка7_91 Шапка7_92 Шапка7_93 Шапка7_94 Шапка7_95 Шапка7_96 Шапка7_97 Шапка7_98 Шапка7_99 Шапка7_910
.endfields








 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ17
Символ27 СуммаНач7
Символ47
.endfields
 Ш@.{.?NUC9;             │.} Ш
 Ш@.{.?NUC10;@'~@@@@@@@@@@│.} Ш
 Ш@.{.?NUC11;─────────────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
Итого7
'true':'s'
.endfields
 Ш .{.?NUC12;@'~@@@@@@@@@@│.} Ш
 Ш .{.?NUC13;             │.} Ш
 Ш .{.?NUC14;─────────────┴.} Ш
^
.}
.begin
  SumList1 :=0;
  SumList2 :=0;
  List := 1;
end.
.{ LastUdColmsCircle CheckEnter








.{ PeopC8 CheckEnter
.[h
.fields
Шапка8_11 Шапка8_12 Шапка8_13 Шапка8_14 Шапка8_15 Шапка8_16 Шапка8_17 Шапка8_18 Шапка8_19 Шапка8_110
Шапка8_21 Шапка8_22 Шапка8_23 Шапка8_24 Шапка8_25 Шапка8_26 Шапка8_27 Шапка8_28 Шапка8_29 Шапка8_210
Шапка8_31 Шапка8_32 Шапка8_33 Шапка8_34 Шапка8_35 Шапка8_36 Шапка8_37 Шапка8_38 Шапка8_39 Шапка8_310
Шапка8_41 Шапка8_42 Шапка8_43 Шапка8_44 Шапка8_45 Шапка8_46 Шапка8_47 Шапка8_48 Шапка8_49 Шапка8_410
Шапка8_51 Шапка8_52 Шапка8_53 Шапка8_54 Шапка8_55 Шапка8_56 Шапка8_57 Шапка8_58 Шапка8_59 Шапка8_510
Шапка8_61 Шапка8_62 Шапка8_63 Шапка8_64 Шапка8_65 Шапка8_66 Шапка8_67 Шапка8_68 Шапка8_69 Шапка8_610
Шапка8_71 Шапка8_72 Шапка8_73 Шапка8_74 Шапка8_75 Шапка8_76 Шапка8_77 Шапка8_78 Шапка8_79 Шапка8_710
Шапка8_81 Шапка8_82 Шапка8_83 Шапка8_84 Шапка8_85 Шапка8_86 Шапка8_87 Шапка8_88 Шапка8_89 Шапка8_810
Шапка8_91 Шапка8_92 Шапка8_93 Шапка8_94 Шапка8_95 Шапка8_96 Шапка8_97 Шапка8_98 Шапка8_99 Шапка8_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ18
Символ28 СуммаНач8 ВсегоУдер8 СумКвыд8
Символ48
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер8;
!  SumList2 := SumList2 + СумКвыд8;
end.
 Ш@.{.?LUCC9;             │.}             │             │               │ Ш
 Ш@.{.?LUCC10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш@.{.?LUCC11;─────────────┼.}─────────────┤─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@: удержано : &'#&&&&&&&&&&&&&.&&   к выдаче :  &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого8 ИтогоВсегоУдер8 ИтогоСумКвыд8
ИтогоСтр8 ИтогоПоВед8
СтрГлавБух8
ИтогоПоВедПрпись8
ИтогоПоВедПрписьСтрока8
'true':'s'
.endfields
 Ш .{.?LUCC12;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш .{.?LUCC13;             │.}             │             │               │ Ш
 Ш .{.?LUCC14;─────────────┴.}─────────────┴─────────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.begin
  SumList1 :=0;
  List := 1;
end.
.{ LastNachTimeColmsCircle CheckEnter








.{ PeopC9 CheckEnter
.[h
.fields
Шапка9_11 Шапка9_12 Шапка9_13 Шапка9_14 Шапка9_15 Шапка9_16 Шапка9_17 Шапка9_18 Шапка9_19 Шапка9_110
Шапка9_21 Шапка9_22 Шапка9_23 Шапка9_24 Шапка9_25 Шапка9_26 Шапка9_27 Шапка9_28 Шапка9_29 Шапка9_210
Шапка9_31 Шапка9_32 Шапка9_33 Шапка9_34 Шапка9_35 Шапка9_36 Шапка9_37 Шапка9_38 Шапка9_39 Шапка9_310
Шапка9_41 Шапка9_42 Шапка9_43 Шапка9_44 Шапка9_45 Шапка9_46 Шапка9_47 Шапка9_48 Шапка9_49 Шапка9_410
Шапка9_51 Шапка9_52 Шапка9_53 Шапка9_54 Шапка9_55 Шапка9_56 Шапка9_57 Шапка9_58 Шапка9_59 Шапка9_510
Шапка9_61 Шапка9_62 Шапка9_63 Шапка9_64 Шапка9_65 Шапка9_66 Шапка9_67 Шапка9_68 Шапка9_69 Шапка9_610
Шапка9_71 Шапка9_72 Шапка9_73 Шапка9_74 Шапка9_75 Шапка9_76 Шапка9_77 Шапка9_78 Шапка9_79 Шапка9_710
Шапка9_81 Шапка9_82 Шапка9_83 Шапка9_84 Шапка9_85 Шапка9_86 Шапка9_87 Шапка9_88 Шапка9_89 Шапка9_810
Шапка9_91 Шапка9_92 Шапка9_93 Шапка9_94 Шапка9_95 Шапка9_96 Шапка9_97 Шапка9_98 Шапка9_99 Шапка9_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Дней9 Часов9 Дни9 Час9
СуммаНач9 ВсегоНач9
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач9;
end.
 Ш .{.?LNTCC9;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│ Ш
 Ш .{.?LNTCC10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш .{.?LNTCC11;──────┬──────┼.}──────┬──────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!  end
!end.
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней9 ИтогоЧасов9 ИтогоВсегоДни9 ИтогоВсегоЧас9
Итого9 ИтогоВсегоНач9
'true':'s'
.endfields
 Ш .{.?LNTCC12;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│ Ш
 Ш .{.?LNTCC13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш .{.?LNTCC14;─────────────┴.}─────────────┘ Ш
^
.}
.begin
  SumList1 :=0;
  List := 1;
end.
.{ LastNachColmsCircle CheckEnter








.{ PeopC10 CheckEnter
.[h
.fields
Шапка10_11 Шапка10_12 Шапка10_13 Шапка10_14 Шапка10_15 Шапка10_16 Шапка10_17 Шапка10_18 Шапка10_19 Шапка10_110
Шапка10_21 Шапка10_22 Шапка10_23 Шапка10_24 Шапка10_25 Шапка10_26 Шапка10_27 Шапка10_28 Шапка10_29 Шапка10_210
Шапка10_31 Шапка10_32 Шапка10_33 Шапка10_34 Шапка10_35 Шапка10_36 Шапка10_37 Шапка10_38 Шапка10_39 Шапка10_310
Шапка10_41 Шапка10_42 Шапка10_43 Шапка10_44 Шапка10_45 Шапка10_46 Шапка10_47 Шапка10_48 Шапка10_49 Шапка10_410
Шапка10_51 Шапка10_52 Шапка10_53 Шапка10_54 Шапка10_55 Шапка10_56 Шапка10_57 Шапка10_58 Шапка10_59 Шапка10_510
Шапка10_61 Шапка10_62 Шапка10_63 Шапка10_64 Шапка10_65 Шапка10_66 Шапка10_67 Шапка10_68 Шапка10_69 Шапка10_610
Шапка10_71 Шапка10_72 Шапка10_73 Шапка10_74 Шапка10_75 Шапка10_76 Шапка10_77 Шапка10_78 Шапка10_79 Шапка10_710
Шапка10_81 Шапка10_82 Шапка10_83 Шапка10_84 Шапка10_85 Шапка10_86 Шапка10_87 Шапка10_88 Шапка10_89 Шапка10_810
Шапка10_91 Шапка10_92 Шапка10_93 Шапка10_94 Шапка10_95 Шапка10_96 Шапка10_97 Шапка10_98 Шапка10_99 Шапка10_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ110
Символ210 СуммаНач10 ВсегоНач10
Символ410
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач10;
end.
 Ш@.{.?LNCC9;             │.}             │ Ш
 Ш@.{.?LNCC10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш@.{.?LNCC11;─────────────┼.}─────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!  end
!end.
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого10 ИтогоВсегоУдер10
'true':'s'
.endfields
 Ш .{.?LNCC12;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш .{.?LNCC13;             │.}             │ Ш
 Ш .{.?LNCC14;─────────────┴.}─────────────┘ Ш
^
.}
.begin
  SumList1 :=0;
  SumList2 :=0;
  SumList3 :=0;
  List := 1;
end.
.{ LastNeNachCC CheckEnter
.{ PeopC105 CheckEnter
.[h
.fields
Шапка105_11 Шапка105_12 Шапка105_13 Шапка105_14 Шапка105_15 Шапка105_16 Шапка105_17 Шапка105_18 Шапка105_19 Шапка105_110
Шапка105_21 Шапка105_22 Шапка105_23 Шапка105_24 Шапка105_25 Шапка105_26 Шапка105_27 Шапка105_28 Шапка105_29 Шапка105_210
Шапка105_31 Шапка105_32 Шапка105_33 Шапка105_34 Шапка105_35 Шапка105_36 Шапка105_37 Шапка105_38 Шапка105_39 Шапка105_310
Шапка105_41 Шапка105_42 Шапка105_43 Шапка105_44 Шапка105_45 Шапка105_46 Шапка105_47 Шапка105_48 Шапка105_49 Шапка105_410
Шапка105_51 Шапка105_52 Шапка105_53 Шапка105_54 Шапка105_55 Шапка105_56 Шапка105_57 Шапка105_58 Шапка105_59 Шапка105_510
Шапка105_61 Шапка105_62 Шапка105_63 Шапка105_64 Шапка105_65 Шапка105_66 Шапка105_67 Шапка105_68 Шапка105_69 Шапка105_610
Шапка105_71 Шапка105_72 Шапка105_73 Шапка105_74 Шапка105_75 Шапка105_76 Шапка105_77 Шапка105_78 Шапка105_79 Шапка105_710
Шапка105_81 Шапка105_82 Шапка105_83 Шапка105_84 Шапка105_85 Шапка105_86 Шапка105_87 Шапка105_88 Шапка105_89 Шапка105_810
Шапка105_91 Шапка105_92 Шапка105_93 Шапка105_94 Шапка105_95 Шапка105_96 Шапка105_97 Шапка105_98 Шапка105_99 Шапка105_910
.endfields








 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ105_18
Символ105_28 СуммаНач105 ВсегоУдер105 ВсегоНенач105 СумКвыд105
Символ105_48
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер8;
!  SumList2 := SumList2 + СумКвыд8;
end.
 Ш@.{.?LUNC9;             │.}             │             │             │               │ Ш
 Ш@.{.?LUNC10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш@.{.?LUNC11;─────────────┼.}─────────────┼─────────────┼─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@: удержано : &'#&&&&&&&&&&&&&.&&   к выдаче :  &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого105 ИтогоВсегоУдер105 ИтогоНенач105 ИтогоСумКвыд105
ИтогоСтр105 ИтогоПоВед105
СтрГлавБух105
ИтогоПоВедПрпись105
ИтогоПоВедПрписьСтрока105
'true':'s'
.endfields
 Ш .{.?LUNC12;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш .{.?LUNC13;             │.}             │             │             │               │ Ш
 Ш .{.?LUNC14;─────────────┴.}─────────────┴─────────────┴─────────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.begin
  SumList1 :=0;
  List := 1;
end.
.{ NachUdWithTimeCicle CheckEnter
.{ PeopC11 CheckEnter
.[h
.fields
Шапка11_11 Шапка11_12 Шапка11_13 Шапка11_14 Шапка11_15 Шапка11_16 Шапка11_17 Шапка11_18 Шапка11_19 Шапка11_110
Шапка11_21 Шапка11_22 Шапка11_23 Шапка11_24 Шапка11_25 Шапка11_26 Шапка11_27 Шапка11_28 Шапка11_29 Шапка11_210
Шапка11_31 Шапка11_32 Шапка11_33 Шапка11_34 Шапка11_35 Шапка11_36 Шапка11_37 Шапка11_38 Шапка11_39 Шапка11_310
Шапка11_41 Шапка11_42 Шапка11_43 Шапка11_44 Шапка11_45 Шапка11_46 Шапка11_47 Шапка11_48 Шапка11_49 Шапка11_410
Шапка11_51 Шапка11_52 Шапка11_53 Шапка11_54 Шапка11_55 Шапка11_56 Шапка11_57 Шапка11_58 Шапка11_59 Шапка11_510
Шапка11_61 Шапка11_62 Шапка11_63 Шапка11_64 Шапка11_65 Шапка11_66 Шапка11_67 Шапка11_68 Шапка11_69 Шапка11_610
Шапка11_71 Шапка11_72 Шапка11_73 Шапка11_74 Шапка11_75 Шапка11_76 Шапка11_77 Шапка11_78 Шапка11_79 Шапка11_710
Шапка11_81 Шапка11_82 Шапка11_83 Шапка11_84 Шапка11_85 Шапка11_86 Шапка11_87 Шапка11_88 Шапка11_89 Шапка11_810
Шапка11_91 Шапка11_92 Шапка11_93 Шапка11_94 Шапка11_95 Шапка11_96 Шапка11_97 Шапка11_98 Шапка11_99 Шапка11_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп11 ТабНом11 ФИО11:'d:r' Дней11 Часов11 ВсегоДней11 ВсегоЧасов11
Долж11:'d:r' СуммаНач11 ВсегоНач11 СуммаУд11 ВсегоУд11 СумКВыдаче11
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач11;
!  SumList2 := SumList2 + ВсегоУд11;
!  SumList3 := SumList3 + СумКВыдаче11;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNUWT9;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│.{.?NUUWT9;             │.}             │             │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNUWT10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?NUUWT10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NNUWT11;──────┬──────┼.}──────┬──────┼.{.?NUUWT11;─────────────┼.}─────────────┤─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!     SumList3 := Round(SumList3);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш---------------------------------------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней11 ИтогоЧасов11 ВсегоИтогоДней11 ВсегоИтогоЧасов11
ИтогоНач11 ВсегоИтогоНач11 ИтогоУд11 ВсегоИтогоУд11 ИтогоКВыдаче11
ИтогоСтр11 ИтогоПоВед11
СтрГлавБух11
ИтогоПоВедПрпись11
ИтогоПоВедПрписьСтрока11
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NNUWT12;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│.{.?NUUWT12;             │.}             │             │               │ Ш
 Ш│   │          │                  │.{.?NNUWT13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?NUUWT13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NNUWT14;─────────────┴.}─────────────┴.{.?NUUWT14;─────────────┴.}─────────────┴─────────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.begin
  SumList1 :=0;
  SumList2 := 0;
  SumList3 := 0;
  List := 1;
end.
.{ NNachUdWithTimeCicle CheckEnter
.{ PeopC111 CheckEnter
.[h
.fields
Шапка111_11 Шапка111_12 Шапка111_13 Шапка111_14 Шапка111_15 Шапка111_16 Шапка111_17 Шапка111_18 Шапка111_19 Шапка111_110
Шапка111_21 Шапка111_22 Шапка111_23 Шапка111_24 Шапка111_25 Шапка111_26 Шапка111_27 Шапка111_28 Шапка111_29 Шапка111_210
Шапка111_31 Шапка111_32 Шапка111_33 Шапка111_34 Шапка111_35 Шапка111_36 Шапка111_37 Шапка111_38 Шапка111_39 Шапка111_310
Шапка111_41 Шапка111_42 Шапка111_43 Шапка111_44 Шапка111_45 Шапка111_46 Шапка111_47 Шапка111_48 Шапка111_49 Шапка111_410
Шапка111_51 Шапка111_52 Шапка111_53 Шапка111_54 Шапка111_55 Шапка111_56 Шапка111_57 Шапка111_58 Шапка111_59 Шапка111_510
Шапка111_61 Шапка111_62 Шапка111_63 Шапка111_64 Шапка111_65 Шапка111_66 Шапка111_67 Шапка111_68 Шапка111_69 Шапка111_610
Шапка111_71 Шапка111_72 Шапка111_73 Шапка111_74 Шапка111_75 Шапка111_76 Шапка111_77 Шапка111_78 Шапка111_79 Шапка111_710
Шапка111_81 Шапка111_82 Шапка111_83 Шапка111_84 Шапка111_85 Шапка111_86 Шапка111_87 Шапка111_88 Шапка111_89 Шапка111_810
Шапка111_91 Шапка111_92 Шапка111_93 Шапка111_94 Шапка111_95 Шапка111_96 Шапка111_97 Шапка111_98 Шапка111_99 Шапка111_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп111 ТабНом111 ФИО111:'d:r' Дней111 Часов111 ВсегоДней111 ВсегоЧасов111
Долж111:'d:r' СуммаНач111 ВсегоНач111 СуммаУд111 ВсегоУд111 ВсегоНеНач111 СумКВыдаче111
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач111;
!  SumList2 := SumList2 + ВсегоУд111;
!  SumList3 := SumList3 + СумКВыдаче111;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUN9;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│.{.?UUN9;             │.}             │             │             │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUN10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?UUN10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NUN11;──────┬──────┼.}──────┬──────┼.{.?UUN11;─────────────┼.}─────────────┤─────────────┼─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!     SumList3 := Round(SumList3);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш---------------------------------------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней111 ИтогоЧасов111 ВсегоИтогоДней111 ВсегоИтогоЧасов111
ИтогоНач111 ВсегоИтогоНач111 ИтогоУд111 ВсегоИтогоУд111 ИтогоНеНач111 ИтогоКВыдаче111
ИтогоСтр111 ИтогоПоВед111
СтрГлавБух111
ИтогоПоВедПрпись111
ИтогоПоВедПрписьСтрока111
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NUN12;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│.{.?UUN12;             │.}             │             │             │               │ Ш
 Ш│   │          │                  │.{.?NUN13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?UUN13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NUN14;─────────────┴.}─────────────┴.{.?UUN14;─────────────┴.}─────────────┴─────────────┴─────────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.begin
  SumList1 :=0;
  SumList2 := 0;
  SumList3 := 0;
  List := 1;
end.
.{ NachUdCicle CheckEnter
.{ PeopC12 CheckEnter
.[h
.fields
Шапка12_11 Шапка12_12 Шапка12_13 Шапка12_14 Шапка12_15 Шапка12_16 Шапка12_17 Шапка12_18 Шапка12_19 Шапка12_110
Шапка12_21 Шапка12_22 Шапка12_23 Шапка12_24 Шапка12_25 Шапка12_26 Шапка12_27 Шапка12_28 Шапка12_29 Шапка12_210
Шапка12_31 Шапка12_32 Шапка12_33 Шапка12_34 Шапка12_35 Шапка12_36 Шапка12_37 Шапка12_38 Шапка12_39 Шапка12_310
Шапка12_41 Шапка12_42 Шапка12_43 Шапка12_44 Шапка12_45 Шапка12_46 Шапка12_47 Шапка12_48 Шапка12_49 Шапка12_410
Шапка12_51 Шапка12_52 Шапка12_53 Шапка12_54 Шапка12_55 Шапка12_56 Шапка12_57 Шапка12_58 Шапка12_59 Шапка12_510
Шапка12_61 Шапка12_62 Шапка12_63 Шапка12_64 Шапка12_65 Шапка12_66 Шапка12_67 Шапка12_68 Шапка12_69 Шапка12_610
Шапка12_71 Шапка12_72 Шапка12_73 Шапка12_74 Шапка12_75 Шапка12_76 Шапка12_77 Шапка12_78 Шапка12_79 Шапка12_710
Шапка12_81 Шапка12_82 Шапка12_83 Шапка12_84 Шапка12_85 Шапка12_86 Шапка12_87 Шапка12_88 Шапка12_89 Шапка12_810
Шапка12_91 Шапка12_92 Шапка12_93 Шапка12_94 Шапка12_95 Шапка12_96 Шапка12_97 Шапка12_98 Шапка12_99 Шапка12_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп12 ТабНом12 ФИО12:'d:r'
Долж12:'d:r' СуммаНач12 ВсегоНач12 СуммаУд12 ВсегоУд12 СумКВыдаче12
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач12;
!  SumList2 := SumList2 + ВсегоУд12;
!  SumList3 := SumList3 + СумКВыдаче12;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNU9;             │.}             │.{.?NUU9;             │.}             │             │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNU10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?NUU10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NNU11;─────────────┼.}─────────────┼.{.?NUU11;─────────────┼.}─────────────┤─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!     SumList3 := Round(SumList3);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш---------------------------------------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоНач12 ВсегоИтогоНач12 ИтогоУд12 ВсегоИтогоУд12 ИтогоКВыдаче12
ИтогоСтр12 ИтогоПоВед12
СтрГлавБух12
ИтогоПоВедПрпись12
ИтогоПоВедПрписьСтрока12
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NNU12;             │.}             │.{.?NUU12;             │.}             │             │               │ Ш
 Ш│   │          │                  │.{.?NNU13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?NUU13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NNU14;─────────────┴.}─────────────┴.{.?NUU14;─────────────┴.}─────────────┴─────────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.{ NNachUdCicle CheckEnter
.{ PeopC112 CheckEnter
.[h
.fields
Шапка112_11 Шапка112_12 Шапка112_13 Шапка112_14 Шапка112_15 Шапка112_16 Шапка112_17 Шапка112_18 Шапка112_19 Шапка112_110
Шапка112_21 Шапка112_22 Шапка112_23 Шапка112_24 Шапка112_25 Шапка112_26 Шапка112_27 Шапка112_28 Шапка112_29 Шапка112_210
Шапка112_31 Шапка112_32 Шапка112_33 Шапка112_34 Шапка112_35 Шапка112_36 Шапка112_37 Шапка112_38 Шапка112_39 Шапка112_310
Шапка112_41 Шапка112_42 Шапка112_43 Шапка112_44 Шапка112_45 Шапка112_46 Шапка112_47 Шапка112_48 Шапка112_49 Шапка112_410
Шапка112_51 Шапка112_52 Шапка112_53 Шапка112_54 Шапка112_55 Шапка112_56 Шапка112_57 Шапка112_58 Шапка112_59 Шапка112_510
Шапка112_61 Шапка112_62 Шапка112_63 Шапка112_64 Шапка112_65 Шапка112_66 Шапка112_67 Шапка112_68 Шапка112_69 Шапка112_610
Шапка112_71 Шапка112_72 Шапка112_73 Шапка112_74 Шапка112_75 Шапка112_76 Шапка112_77 Шапка112_78 Шапка112_79 Шапка112_710
Шапка112_81 Шапка112_82 Шапка112_83 Шапка112_84 Шапка112_85 Шапка112_86 Шапка112_87 Шапка112_88 Шапка112_89 Шапка112_810
Шапка112_91 Шапка112_92 Шапка112_93 Шапка112_94 Шапка112_95 Шапка112_96 Шапка112_97 Шапка112_98 Шапка112_99 Шапка112_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп112 ТабНом112 ФИО112:'d:r'
Долж112:'d:r' СуммаНач112 ВсегоНач112 СуммаУд112 ВсегоУд112 ВсегоНеНач112 СумКВыдаче112
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач112;
!  SumList2 := SumList2 + ВсегоУд112;
!  SumList3 := SumList3 + СумКВыдаче112;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNUN9;             │.}             │.{.?UNUN9;             │.}             │             │             │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNUN10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?UNUN10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NNUN11;─────────────┼.}─────────────┼.{.?UNUN11;─────────────┼.}─────────────┼─────────────┼─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!     SumList3 := Round(SumList3);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш---------------------------------------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоНач112 ВсегоИтогоНач112 ИтогоУд112 ВсегоИтогоУд112 ИтогоНеНач112 ИтогоКВыдаче112
ИтогоСтр112 ИтогоПоВед112
СтрГлавБух112
ИтогоПоВедПрпись112
ИтогоПоВедПрписьСтрока112
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NNUN12;             │.}             │.{.?UNUN12;             │.}             │             │             │               │ Ш
 Ш│   │          │                  │.{.?NNUN13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?UNUN13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NNUN14;─────────────┴.}─────────────┴.{.?UNUN14;─────────────┴.}─────────────┴─────────────┴─────────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.}
.fields
ИтогоВедомость
.endfields
 БИТОГО ВЫПЛАЧЕНО: Б  Р@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Р
( сумма к выдаче прописью)
.endform

.linkform 'RPVedGor_L2' prototype is 'RPVedGor'
.nameinlist 'Расчетно-платежная ведомость для больших сумм'
.Set Filler ='-'
.DEFO LANDSCAPE
.DEFP PA4
.p 72
.var
     InShap    : integer;
     SumList1  : double
     SumList2  : double
     SumList3  : double
     Count     : LongInt
     List      : Longint
     SSS       : string;
 .endvar
.Set Dot '-'
.group '1_Вторая группа'
.begin InShap := 0    end.
.{ CommonForAllCicle CheckEnter
.fields
РукПред_Имя ГлавБух_Имя
НазвОрган
КодПодразделение
ЗаМесяц
Год
.endfields
.{ Shapka CheckEnter
                БРуководитель Б                     БГл.бухгалтер Б
                Борганизации Б                      Борганизации Б
          @~@@@@@@@@@@@@@@@@@@@@@@@      @~@@@@@@@@@@@@@@@@@@@@@@@

           БОрганизация Б : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{?internal;InShap=0

.begin InShap := InShap + 1 end.
.}
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                     БРАСЧЕТНО-ПЛАТЕЖНАЯ ВЕДОМОСТЬ No__ Б
                     Бза Б  @@@@@@@@@@ Б месяц Б   @@@@   Бг. Б
.}
.begin
  SumList1 :=0;
  List     :=1;
end.
.{ NachBegEndWithTimeCicle CheckEnter
.{ PeopC1 CheckEnter
.[h
.fields
Шапка1_11 Шапка1_12 Шапка1_13 Шапка1_14 Шапка1_15 Шапка1_16 Шапка1_17 Шапка1_18 Шапка1_19 Шапка1_110
Шапка1_21 Шапка1_22 Шапка1_23 Шапка1_24 Шапка1_25 Шапка1_26 Шапка1_27 Шапка1_28 Шапка1_29 Шапка1_210
Шапка1_31 Шапка1_32 Шапка1_33 Шапка1_34 Шапка1_35 Шапка1_36 Шапка1_37 Шапка1_38 Шапка1_39 Шапка1_310
Шапка1_41 Шапка1_42 Шапка1_43 Шапка1_44 Шапка1_45 Шапка1_46 Шапка1_47 Шапка1_48 Шапка1_49 Шапка1_410
Шапка1_51 Шапка1_52 Шапка1_53 Шапка1_54 Шапка1_55 Шапка1_56 Шапка1_57 Шапка1_58 Шапка1_59 Шапка1_510
Шапка1_61 Шапка1_62 Шапка1_63 Шапка1_64 Шапка1_65 Шапка1_66 Шапка1_67 Шапка1_68 Шапка1_69 Шапка1_610
Шапка1_71 Шапка1_72 Шапка1_73 Шапка1_74 Шапка1_75 Шапка1_76 Шапка1_77 Шапка1_78 Шапка1_79 Шапка1_710
Шапка1_81 Шапка1_82 Шапка1_83 Шапка1_84 Шапка1_85 Шапка1_86 Шапка1_87 Шапка1_88 Шапка1_89 Шапка1_810
Шапка1_91 Шапка1_92 Шапка1_93 Шапка1_94 Шапка1_95 Шапка1_96 Шапка1_97 Шапка1_98 Шапка1_99 Шапка1_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп1 ТабНом1 ФИО1:'d:r' Дней1 Часов1 ВсегоДней1 ВсегоЧасов1
Долж1:'d:r' СуммаНач1 ВсегоНач1
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач1;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBET9;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBET10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBET11;──────┬──────┼.}──────┬──────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!  end
!end.
!.fields
!  List
!  SumList1
! СуммаНач1:'SUM'
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней1 ИтогоЧасов1 ВсегоИтогоДней1 ВсегоИтогоЧасов1
Итого1 ВсегоИтого1
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NBET12;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│ Ш
 Ш│   │          │                  │.{.?NBET13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBET14;─────────────┴.}─────────────┘
 Ш^
.}
.begin
  SumList1 :=0;
  List := 1;
end.
.{ NachBegEndCicle CheckEnter
.{ PeopC2 CheckEnter
.[h
.fields
Шапка2_11 Шапка2_12 Шапка2_13 Шапка2_14 Шапка2_15 Шапка2_16 Шапка2_17 Шапка2_18 Шапка2_19 Шапка2_110
Шапка2_21 Шапка2_22 Шапка2_23 Шапка2_24 Шапка2_25 Шапка2_26 Шапка2_27 Шапка2_28 Шапка2_29 Шапка2_210
Шапка2_31 Шапка2_32 Шапка2_33 Шапка2_34 Шапка2_35 Шапка2_36 Шапка2_37 Шапка2_38 Шапка2_39 Шапка2_310
Шапка2_41 Шапка2_42 Шапка2_43 Шапка2_44 Шапка2_45 Шапка2_46 Шапка2_47 Шапка2_48 Шапка2_49 Шапка2_410
Шапка2_51 Шапка2_52 Шапка2_53 Шапка2_54 Шапка2_55 Шапка2_56 Шапка2_57 Шапка2_58 Шапка2_59 Шапка2_510
Шапка2_61 Шапка2_62 Шапка2_63 Шапка2_64 Шапка2_65 Шапка2_66 Шапка2_67 Шапка2_68 Шапка2_69 Шапка2_610
Шапка2_71 Шапка2_72 Шапка2_73 Шапка2_74 Шапка2_75 Шапка2_76 Шапка2_77 Шапка2_78 Шапка2_79 Шапка2_710
Шапка2_81 Шапка2_82 Шапка2_83 Шапка2_84 Шапка2_85 Шапка2_86 Шапка2_87 Шапка2_88 Шапка2_89 Шапка2_810
Шапка2_91 Шапка2_92 Шапка2_93 Шапка2_94 Шапка2_95 Шапка2_96 Шапка2_97 Шапка2_98 Шапка2_99 Шапка2_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп2 ТабНом2 ФИО2:'d:r'
Долж2:'d:r' СуммаНач2 ВсегоНач2
!Итого2 ВсегоИтого2
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач2;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBEWT9;             │.}             │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBEWT10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBEWT11;─────────────┼.}─────────────┤ Ш
!.[f OverWrite
!.begin
!Message(' FlagRo  '+String(FlagRo),1);
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!  end
!end.
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого2 ВсегоИтого2
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NBEWT12;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш│   │          │                  │.{.?NBEWT13;             │.}             │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBEWT14;─────────────┴.}─────────────┘ Ш
^
.begin
  SumList1 :=0;
  SumList2 :=0;
  List := 1;
end.
.fields
.endfields
.}
.{ NeNachBegEndCicle CheckEnter








.{ PeopC103 CheckEnter
.[h
.fields
Шапка103_11 Шапка103_12 Шапка103_13 Шапка103_14 Шапка103_15 Шапка103_16 Шапка103_17 Шапка103_18 Шапка103_19 Шапка103_110
Шапка103_21 Шапка103_22 Шапка103_23 Шапка103_24 Шапка103_25 Шапка103_26 Шапка103_27 Шапка103_28 Шапка103_29 Шапка103_210
Шапка103_31 Шапка103_32 Шапка103_33 Шапка103_34 Шапка103_35 Шапка103_36 Шапка103_37 Шапка103_38 Шапка103_39 Шапка103_310
Шапка103_41 Шапка103_42 Шапка103_43 Шапка103_44 Шапка103_45 Шапка103_46 Шапка103_47 Шапка103_48 Шапка103_49 Шапка103_410
Шапка103_51 Шапка103_52 Шапка103_53 Шапка103_54 Шапка103_55 Шапка103_56 Шапка103_57 Шапка103_58 Шапка103_59 Шапка103_510
Шапка103_61 Шапка103_62 Шапка103_63 Шапка103_64 Шапка103_65 Шапка103_66 Шапка103_67 Шапка103_68 Шапка103_69 Шапка103_610
Шапка103_71 Шапка103_72 Шапка103_73 Шапка103_74 Шапка103_75 Шапка103_76 Шапка103_77 Шапка103_78 Шапка103_79 Шапка103_710
Шапка103_81 Шапка103_82 Шапка103_83 Шапка103_84 Шапка103_85 Шапка103_86 Шапка103_87 Шапка103_88 Шапка103_89 Шапка103_810
Шапка103_91 Шапка103_92 Шапка103_93 Шапка103_94 Шапка103_95 Шапка103_96 Шапка103_97 Шапка103_98 Шапка103_99 Шапка103_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп103 ТабНом103 ФИО103:'d:r'
Долж103:'d:r' СуммаУдер103 ВсегоУдер103 СуммаНеНач103 СумКвыд103
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер103;
!  SumList2 := SumList2 + СумКвыд103;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUBEN9;             │.}             │             │             │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUBEN10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NUBEN11;─────────────┼.}─────────────┼─────────────┼─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:      удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List + 1;
!end.
!.]f
.}
.fields
Итого103 ВсегоИтого103 ИтогоСуммаНач103 ВсеКВыдаче103
ИтогоСтр103 ИтогоПоВед103
СтрГлавБух103
ИтогоПоВедПрпись103
ИтогоПоВедПрписьСтрока103
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NUBEN12;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш│   │          │                  │.{.?NUBEN13;             │.}             │             │             │               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NUBEN14;─────────────┴.}─────────────┴─────────────┴─────────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
!.}
.}
.{ NachUdBegEndCicle CheckEnter








.{ PeopC3 CheckEnter
.[h
.fields
Шапка3_11 Шапка3_12 Шапка3_13 Шапка3_14 Шапка3_15 Шапка3_16 Шапка3_17 Шапка3_18 Шапка3_19 Шапка3_110
Шапка3_21 Шапка3_22 Шапка3_23 Шапка3_24 Шапка3_25 Шапка3_26 Шапка3_27 Шапка3_28 Шапка3_29 Шапка3_210
Шапка3_31 Шапка3_32 Шапка3_33 Шапка3_34 Шапка3_35 Шапка3_36 Шапка3_37 Шапка3_38 Шапка3_39 Шапка3_310
Шапка3_41 Шапка3_42 Шапка3_43 Шапка3_44 Шапка3_45 Шапка3_46 Шапка3_47 Шапка3_48 Шапка3_49 Шапка3_410
Шапка3_51 Шапка3_52 Шапка3_53 Шапка3_54 Шапка3_55 Шапка3_56 Шапка3_57 Шапка3_58 Шапка3_59 Шапка3_510
Шапка3_61 Шапка3_62 Шапка3_63 Шапка3_64 Шапка3_65 Шапка3_66 Шапка3_67 Шапка3_68 Шапка3_69 Шапка3_610
Шапка3_71 Шапка3_72 Шапка3_73 Шапка3_74 Шапка3_75 Шапка3_76 Шапка3_77 Шапка3_78 Шапка3_79 Шапка3_710
Шапка3_81 Шапка3_82 Шапка3_83 Шапка3_84 Шапка3_85 Шапка3_86 Шапка3_87 Шапка3_88 Шапка3_89 Шапка3_810
Шапка3_91 Шапка3_92 Шапка3_93 Шапка3_94 Шапка3_95 Шапка3_96 Шапка3_97 Шапка3_98 Шапка3_99 Шапка3_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп3 ТабНом3 ФИО3:'d:r'
Долж3:'d:r' СуммаУдер3 ВсегоУдер3 СумКвыд3
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер3;
!  SumList2 := SumList2 + СумКвыд3;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUBEWT9;             │.}             │             │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUBEWT10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NUBEWT11;─────────────┼.}─────────────┤─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:      удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List + 1;
!end.
!.]f
.}
.fields
Итого3 ВсегоИтого3 ВсеКВыдаче3
ИтогоСтр3 ИтогоПоВед3
СтрГлавБух3
ИтогоПоВедПрпись3
ИтогоПоВедПрписьСтрока3
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NUBEWT12;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш│   │          │                  │.{.?NUBEWT13;             │.}             │             │               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NUBEWT14;─────────────┴.}─────────────┴─────────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.{ NachBgWithTimeCicle CheckEnter
.{  PeopC4 CheckEnter
.[h
.fields
Шапка4_11 Шапка4_12 Шапка4_13 Шапка4_14 Шапка4_15 Шапка4_16 Шапка4_17 Шапка4_18 Шапка4_19 Шапка4_110
Шапка4_21 Шапка4_22 Шапка4_23 Шапка4_24 Шапка4_25 Шапка4_26 Шапка4_27 Шапка4_28 Шапка4_29 Шапка4_210
Шапка4_31 Шапка4_32 Шапка4_33 Шапка4_34 Шапка4_35 Шапка4_36 Шапка4_37 Шапка4_38 Шапка4_39 Шапка4_310
Шапка4_41 Шапка4_42 Шапка4_43 Шапка4_44 Шапка4_45 Шапка4_46 Шапка4_47 Шапка4_48 Шапка4_49 Шапка4_410
Шапка4_51 Шапка4_52 Шапка4_53 Шапка4_54 Шапка4_55 Шапка4_56 Шапка4_57 Шапка4_58 Шапка4_59 Шапка4_510
Шапка4_61 Шапка4_62 Шапка4_63 Шапка4_64 Шапка4_65 Шапка4_66 Шапка4_67 Шапка4_68 Шапка4_69 Шапка4_610
Шапка4_71 Шапка4_72 Шапка4_73 Шапка4_74 Шапка4_75 Шапка4_76 Шапка4_77 Шапка4_78 Шапка4_79 Шапка4_710
Шапка4_81 Шапка4_82 Шапка4_83 Шапка4_84 Шапка4_85 Шапка4_86 Шапка4_87 Шапка4_88 Шапка4_89 Шапка4_810
Шапка4_91 Шапка4_92 Шапка4_93 Шапка4_94 Шапка4_95 Шапка4_96 Шапка4_97 Шапка4_98 Шапка4_99 Шапка4_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп4 ТабНом4 ФИО4:'d:r' Дней4 Часов4
Долж4:'d:r' СуммаНач4
.endfields
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBT9;@@@@@@│@@@@@@│.} Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBT10;@'~@@@@@@@@@@│.} Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBT11;──────┬──────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
ИтогоДней4 ИтогоЧасов4
Итого4
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NBT12;@@@@@@│@@@@@@│.} Ш
 Ш│   │          │                  │.{.?NBT13;@'~@@@@@@@@@@│.} Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBT14;─────────────┴.} Ш
^
.}
.{NachUdBegCicle CheckEnter
.if NeedSpace








.end
.{ PeopC5 CheckEnter
.[h
.fields
Шапка5_11 Шапка5_12 Шапка5_13 Шапка5_14 Шапка5_15 Шапка5_16 Шапка5_17 Шапка5_18 Шапка5_19 Шапка5_110
Шапка5_21 Шапка5_22 Шапка5_23 Шапка5_24 Шапка5_25 Шапка5_26 Шапка5_27 Шапка5_28 Шапка5_29 Шапка5_210
Шапка5_31 Шапка5_32 Шапка5_33 Шапка5_34 Шапка5_35 Шапка5_36 Шапка5_37 Шапка5_38 Шапка5_39 Шапка5_310
Шапка5_41 Шапка5_42 Шапка5_43 Шапка5_44 Шапка5_45 Шапка5_46 Шапка5_47 Шапка5_48 Шапка5_49 Шапка5_410
Шапка5_51 Шапка5_52 Шапка5_53 Шапка5_54 Шапка5_55 Шапка5_56 Шапка5_57 Шапка5_58 Шапка5_59 Шапка5_510
Шапка5_61 Шапка5_62 Шапка5_63 Шапка5_64 Шапка5_65 Шапка5_66 Шапка5_67 Шапка5_68 Шапка5_69 Шапка5_610
Шапка5_71 Шапка5_72 Шапка5_73 Шапка5_74 Шапка5_75 Шапка5_76 Шапка5_77 Шапка5_78 Шапка5_79 Шапка5_710
Шапка5_81 Шапка5_82 Шапка5_83 Шапка5_84 Шапка5_85 Шапка5_86 Шапка5_87 Шапка5_88 Шапка5_89 Шапка5_810
Шапка5_91 Шапка5_92 Шапка5_93 Шапка5_94 Шапка5_95 Шапка5_96 Шапка5_97 Шапка5_98 Шапка5_99 Шапка5_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп5 ТабНом5 ФИО5:'d:r'
Долж5:'d:r' СуммаНач5
.endfields
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBWT9;             │.} Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBWT10;@'~@@@@@@@@@@│.} Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBWT11;─────────────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
Итого5
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NBWT12;@'~@@@@@@@@@@│.} Ш
 Ш│   │          │                  │.{.?NBWT13;             │.} Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBWT14;─────────────┴.} Ш
^
.}
.{ NachConWithTimeCicle CheckEnter
.{ PeopC6 CheckEnter
.[h
.fields
Шапка6_11 Шапка6_12 Шапка6_13 Шапка6_14 Шапка6_15 Шапка6_16 Шапка6_17 Шапка6_18 Шапка6_19 Шапка6_110
Шапка6_21 Шапка6_22 Шапка6_23 Шапка6_24 Шапка6_25 Шапка6_26 Шапка6_27 Шапка6_28 Шапка6_29 Шапка6_210
Шапка6_31 Шапка6_32 Шапка6_33 Шапка6_34 Шапка6_35 Шапка6_36 Шапка6_37 Шапка6_38 Шапка6_39 Шапка6_310
Шапка6_41 Шапка6_42 Шапка6_43 Шапка6_44 Шапка6_45 Шапка6_46 Шапка6_47 Шапка6_48 Шапка6_49 Шапка6_410
Шапка6_51 Шапка6_52 Шапка6_53 Шапка6_54 Шапка6_55 Шапка6_56 Шапка6_57 Шапка6_58 Шапка6_59 Шапка6_510
Шапка6_61 Шапка6_62 Шапка6_63 Шапка6_64 Шапка6_65 Шапка6_66 Шапка6_67 Шапка6_68 Шапка6_69 Шапка6_610
Шапка6_71 Шапка6_72 Шапка6_73 Шапка6_74 Шапка6_75 Шапка6_76 Шапка6_77 Шапка6_78 Шапка6_79 Шапка6_710
Шапка6_81 Шапка6_82 Шапка6_83 Шапка6_84 Шапка6_85 Шапка6_86 Шапка6_87 Шапка6_88 Шапка6_89 Шапка6_810
Шапка6_91 Шапка6_92 Шапка6_93 Шапка6_94 Шапка6_95 Шапка6_96 Шапка6_97 Шапка6_98 Шапка6_99 Шапка6_910
.endfields








 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Дней6 Часов6
СуммаНач6
.endfields
 Ш .{.?NCT9;@@@@@@│@@@@@@│.} Ш
 Ш .{.?NCT10;@'~@@@@@@@@@@│.} Ш
 Ш .{.?NCT11;──────┬──────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
ИтогоДней6 ИтогоЧасов6
Итого6
'true':'s'
.endfields
 Ш .{.?NCT12;@@@@@@│@@@@@@│.} Ш
 Ш .{.?NCT13;@'~@@@@@@@@@@│.} Ш
 Ш .{.?NCT14;─────────────┴.} Ш
^
.}
.{ NachUdConCicle CheckEnter
.{ PeopC7 CheckEnter
.[h
.fields
Шапка7_11 Шапка7_12 Шапка7_13 Шапка7_14 Шапка7_15 Шапка7_16 Шапка7_17 Шапка7_18 Шапка7_19 Шапка7_110
Шапка7_21 Шапка7_22 Шапка7_23 Шапка7_24 Шапка7_25 Шапка7_26 Шапка7_27 Шапка7_28 Шапка7_29 Шапка7_210
Шапка7_31 Шапка7_32 Шапка7_33 Шапка7_34 Шапка7_35 Шапка7_36 Шапка7_37 Шапка7_38 Шапка7_39 Шапка7_310
Шапка7_41 Шапка7_42 Шапка7_43 Шапка7_44 Шапка7_45 Шапка7_46 Шапка7_47 Шапка7_48 Шапка7_49 Шапка7_410
Шапка7_51 Шапка7_52 Шапка7_53 Шапка7_54 Шапка7_55 Шапка7_56 Шапка7_57 Шапка7_58 Шапка7_59 Шапка7_510
Шапка7_61 Шапка7_62 Шапка7_63 Шапка7_64 Шапка7_65 Шапка7_66 Шапка7_67 Шапка7_68 Шапка7_69 Шапка7_610
Шапка7_71 Шапка7_72 Шапка7_73 Шапка7_74 Шапка7_75 Шапка7_76 Шапка7_77 Шапка7_78 Шапка7_79 Шапка7_710
Шапка7_81 Шапка7_82 Шапка7_83 Шапка7_84 Шапка7_85 Шапка7_86 Шапка7_87 Шапка7_88 Шапка7_89 Шапка7_810
Шапка7_91 Шапка7_92 Шапка7_93 Шапка7_94 Шапка7_95 Шапка7_96 Шапка7_97 Шапка7_98 Шапка7_99 Шапка7_910
.endfields








 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ17
Символ27 СуммаНач7
Символ47
.endfields
 Ш@.{.?NUC9;             │.} Ш
 Ш@.{.?NUC10;@'~@@@@@@@@@@│.} Ш
 Ш@.{.?NUC11;─────────────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
Итого7
'true':'s'
.endfields
 Ш .{.?NUC12;@'~@@@@@@@@@@│.} Ш
 Ш .{.?NUC13;             │.} Ш
 Ш .{.?NUC14;─────────────┴.} Ш
^
.}
.begin
  SumList1 :=0;
  SumList2 :=0;
  List := 1;
end.
.{ LastUdColmsCircle CheckEnter








.{ PeopC8 CheckEnter
.[h
.fields
Шапка8_11 Шапка8_12 Шапка8_13 Шапка8_14 Шапка8_15 Шапка8_16 Шапка8_17 Шапка8_18 Шапка8_19 Шапка8_110
Шапка8_21 Шапка8_22 Шапка8_23 Шапка8_24 Шапка8_25 Шапка8_26 Шапка8_27 Шапка8_28 Шапка8_29 Шапка8_210
Шапка8_31 Шапка8_32 Шапка8_33 Шапка8_34 Шапка8_35 Шапка8_36 Шапка8_37 Шапка8_38 Шапка8_39 Шапка8_310
Шапка8_41 Шапка8_42 Шапка8_43 Шапка8_44 Шапка8_45 Шапка8_46 Шапка8_47 Шапка8_48 Шапка8_49 Шапка8_410
Шапка8_51 Шапка8_52 Шапка8_53 Шапка8_54 Шапка8_55 Шапка8_56 Шапка8_57 Шапка8_58 Шапка8_59 Шапка8_510
Шапка8_61 Шапка8_62 Шапка8_63 Шапка8_64 Шапка8_65 Шапка8_66 Шапка8_67 Шапка8_68 Шапка8_69 Шапка8_610
Шапка8_71 Шапка8_72 Шапка8_73 Шапка8_74 Шапка8_75 Шапка8_76 Шапка8_77 Шапка8_78 Шапка8_79 Шапка8_710
Шапка8_81 Шапка8_82 Шапка8_83 Шапка8_84 Шапка8_85 Шапка8_86 Шапка8_87 Шапка8_88 Шапка8_89 Шапка8_810
Шапка8_91 Шапка8_92 Шапка8_93 Шапка8_94 Шапка8_95 Шапка8_96 Шапка8_97 Шапка8_98 Шапка8_99 Шапка8_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ18
Символ28 СуммаНач8 ВсегоУдер8 СумКвыд8
Символ48
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер8;
!  SumList2 := SumList2 + СумКвыд8;
end.
 Ш@.{.?LUCC9;             │.}             │             │               │ Ш
 Ш@.{.?LUCC10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш@.{.?LUCC11;─────────────┼.}─────────────┤─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@: удержано : &'#&&&&&&&&&&&&&.&&   к выдаче :  &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого8 ИтогоВсегоУдер8 ИтогоСумКвыд8
ИтогоСтр8 ИтогоПоВед8
СтрГлавБух8
ИтогоПоВедПрпись8
ИтогоПоВедПрписьСтрока8
'true':'s'
.endfields
 Ш .{.?LUCC12;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш .{.?LUCC13;             │.}             │             │               │ Ш
 Ш .{.?LUCC14;─────────────┴.}─────────────┴─────────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.begin
  SumList1 :=0;
  List := 1;
end.
.{ LastNachTimeColmsCircle CheckEnter








.{ PeopC9 CheckEnter
.[h
.fields
Шапка9_11 Шапка9_12 Шапка9_13 Шапка9_14 Шапка9_15 Шапка9_16 Шапка9_17 Шапка9_18 Шапка9_19 Шапка9_110
Шапка9_21 Шапка9_22 Шапка9_23 Шапка9_24 Шапка9_25 Шапка9_26 Шапка9_27 Шапка9_28 Шапка9_29 Шапка9_210
Шапка9_31 Шапка9_32 Шапка9_33 Шапка9_34 Шапка9_35 Шапка9_36 Шапка9_37 Шапка9_38 Шапка9_39 Шапка9_310
Шапка9_41 Шапка9_42 Шапка9_43 Шапка9_44 Шапка9_45 Шапка9_46 Шапка9_47 Шапка9_48 Шапка9_49 Шапка9_410
Шапка9_51 Шапка9_52 Шапка9_53 Шапка9_54 Шапка9_55 Шапка9_56 Шапка9_57 Шапка9_58 Шапка9_59 Шапка9_510
Шапка9_61 Шапка9_62 Шапка9_63 Шапка9_64 Шапка9_65 Шапка9_66 Шапка9_67 Шапка9_68 Шапка9_69 Шапка9_610
Шапка9_71 Шапка9_72 Шапка9_73 Шапка9_74 Шапка9_75 Шапка9_76 Шапка9_77 Шапка9_78 Шапка9_79 Шапка9_710
Шапка9_81 Шапка9_82 Шапка9_83 Шапка9_84 Шапка9_85 Шапка9_86 Шапка9_87 Шапка9_88 Шапка9_89 Шапка9_810
Шапка9_91 Шапка9_92 Шапка9_93 Шапка9_94 Шапка9_95 Шапка9_96 Шапка9_97 Шапка9_98 Шапка9_99 Шапка9_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Дней9 Часов9 Дни9 Час9
СуммаНач9 ВсегоНач9
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач9;
end.
 Ш .{.?LNTCC9;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│ Ш
 Ш .{.?LNTCC10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш .{.?LNTCC11;──────┬──────┼.}──────┬──────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!  end
!end.
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней9 ИтогоЧасов9 ИтогоВсегоДни9 ИтогоВсегоЧас9
Итого9 ИтогоВсегоНач9
'true':'s'
.endfields
 Ш .{.?LNTCC12;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│ Ш
 Ш .{.?LNTCC13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш .{.?LNTCC14;─────────────┴.}─────────────┘ Ш
^
.}
.begin
  SumList1 :=0;
  List := 1;
end.
.{ LastNachColmsCircle CheckEnter








.{ PeopC10 CheckEnter
.[h
.fields
Шапка10_11 Шапка10_12 Шапка10_13 Шапка10_14 Шапка10_15 Шапка10_16 Шапка10_17 Шапка10_18 Шапка10_19 Шапка10_110
Шапка10_21 Шапка10_22 Шапка10_23 Шапка10_24 Шапка10_25 Шапка10_26 Шапка10_27 Шапка10_28 Шапка10_29 Шапка10_210
Шапка10_31 Шапка10_32 Шапка10_33 Шапка10_34 Шапка10_35 Шапка10_36 Шапка10_37 Шапка10_38 Шапка10_39 Шапка10_310
Шапка10_41 Шапка10_42 Шапка10_43 Шапка10_44 Шапка10_45 Шапка10_46 Шапка10_47 Шапка10_48 Шапка10_49 Шапка10_410
Шапка10_51 Шапка10_52 Шапка10_53 Шапка10_54 Шапка10_55 Шапка10_56 Шапка10_57 Шапка10_58 Шапка10_59 Шапка10_510
Шапка10_61 Шапка10_62 Шапка10_63 Шапка10_64 Шапка10_65 Шапка10_66 Шапка10_67 Шапка10_68 Шапка10_69 Шапка10_610
Шапка10_71 Шапка10_72 Шапка10_73 Шапка10_74 Шапка10_75 Шапка10_76 Шапка10_77 Шапка10_78 Шапка10_79 Шапка10_710
Шапка10_81 Шапка10_82 Шапка10_83 Шапка10_84 Шапка10_85 Шапка10_86 Шапка10_87 Шапка10_88 Шапка10_89 Шапка10_810
Шапка10_91 Шапка10_92 Шапка10_93 Шапка10_94 Шапка10_95 Шапка10_96 Шапка10_97 Шапка10_98 Шапка10_99 Шапка10_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ110
Символ210 СуммаНач10 ВсегоНач10
Символ410
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач10;
end.
 Ш@.{.?LNCC9;             │.}             │ Ш
 Ш@.{.?LNCC10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш@.{.?LNCC11;─────────────┼.}─────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!  end
!end.
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого10 ИтогоВсегоУдер10
'true':'s'
.endfields
 Ш .{.?LNCC12;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш .{.?LNCC13;             │.}             │ Ш
 Ш .{.?LNCC14;─────────────┴.}─────────────┘ Ш
^
.}
.begin
  SumList1 :=0;
  SumList2 :=0;
  SumList3 :=0;
  List := 1;
end.
.{ LastNeNachCC CheckEnter
.{ PeopC105 CheckEnter
.[h
.fields
Шапка105_11 Шапка105_12 Шапка105_13 Шапка105_14 Шапка105_15 Шапка105_16 Шапка105_17 Шапка105_18 Шапка105_19 Шапка105_110
Шапка105_21 Шапка105_22 Шапка105_23 Шапка105_24 Шапка105_25 Шапка105_26 Шапка105_27 Шапка105_28 Шапка105_29 Шапка105_210
Шапка105_31 Шапка105_32 Шапка105_33 Шапка105_34 Шапка105_35 Шапка105_36 Шапка105_37 Шапка105_38 Шапка105_39 Шапка105_310
Шапка105_41 Шапка105_42 Шапка105_43 Шапка105_44 Шапка105_45 Шапка105_46 Шапка105_47 Шапка105_48 Шапка105_49 Шапка105_410
Шапка105_51 Шапка105_52 Шапка105_53 Шапка105_54 Шапка105_55 Шапка105_56 Шапка105_57 Шапка105_58 Шапка105_59 Шапка105_510
Шапка105_61 Шапка105_62 Шапка105_63 Шапка105_64 Шапка105_65 Шапка105_66 Шапка105_67 Шапка105_68 Шапка105_69 Шапка105_610
Шапка105_71 Шапка105_72 Шапка105_73 Шапка105_74 Шапка105_75 Шапка105_76 Шапка105_77 Шапка105_78 Шапка105_79 Шапка105_710
Шапка105_81 Шапка105_82 Шапка105_83 Шапка105_84 Шапка105_85 Шапка105_86 Шапка105_87 Шапка105_88 Шапка105_89 Шапка105_810
Шапка105_91 Шапка105_92 Шапка105_93 Шапка105_94 Шапка105_95 Шапка105_96 Шапка105_97 Шапка105_98 Шапка105_99 Шапка105_910
.endfields








 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ105_18
Символ105_28 СуммаНач105 ВсегоУдер105 ВсегоНенач105 СумКвыд105
Символ105_48
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер8;
!  SumList2 := SumList2 + СумКвыд8;
end.
 Ш@.{.?LUNC9;             │.}             │             │             │               │ Ш
 Ш@.{.?LUNC10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш@.{.?LUNC11;─────────────┼.}─────────────┼─────────────┼─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@: удержано : &'#&&&&&&&&&&&&&.&&   к выдаче :  &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого105 ИтогоВсегоУдер105 ИтогоНенач105 ИтогоСумКвыд105
ИтогоСтр105 ИтогоПоВед105
СтрГлавБух105
ИтогоПоВедПрпись105
ИтогоПоВедПрписьСтрока105
'true':'s'
.endfields
 Ш .{.?LUNC12;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш .{.?LUNC13;             │.}             │             │             │               │ Ш
 Ш .{.?LUNC14;─────────────┴.}─────────────┴─────────────┴─────────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.begin
  SumList1 :=0;
  List := 1;
end.
.{ NachUdWithTimeCicle CheckEnter
.{ PeopC11 CheckEnter
.[h
.fields
Шапка11_11 Шапка11_12 Шапка11_13 Шапка11_14 Шапка11_15 Шапка11_16 Шапка11_17 Шапка11_18 Шапка11_19 Шапка11_110
Шапка11_21 Шапка11_22 Шапка11_23 Шапка11_24 Шапка11_25 Шапка11_26 Шапка11_27 Шапка11_28 Шапка11_29 Шапка11_210
Шапка11_31 Шапка11_32 Шапка11_33 Шапка11_34 Шапка11_35 Шапка11_36 Шапка11_37 Шапка11_38 Шапка11_39 Шапка11_310
Шапка11_41 Шапка11_42 Шапка11_43 Шапка11_44 Шапка11_45 Шапка11_46 Шапка11_47 Шапка11_48 Шапка11_49 Шапка11_410
Шапка11_51 Шапка11_52 Шапка11_53 Шапка11_54 Шапка11_55 Шапка11_56 Шапка11_57 Шапка11_58 Шапка11_59 Шапка11_510
Шапка11_61 Шапка11_62 Шапка11_63 Шапка11_64 Шапка11_65 Шапка11_66 Шапка11_67 Шапка11_68 Шапка11_69 Шапка11_610
Шапка11_71 Шапка11_72 Шапка11_73 Шапка11_74 Шапка11_75 Шапка11_76 Шапка11_77 Шапка11_78 Шапка11_79 Шапка11_710
Шапка11_81 Шапка11_82 Шапка11_83 Шапка11_84 Шапка11_85 Шапка11_86 Шапка11_87 Шапка11_88 Шапка11_89 Шапка11_810
Шапка11_91 Шапка11_92 Шапка11_93 Шапка11_94 Шапка11_95 Шапка11_96 Шапка11_97 Шапка11_98 Шапка11_99 Шапка11_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп11 ТабНом11 ФИО11:'d:r' Дней11 Часов11 ВсегоДней11 ВсегоЧасов11
Долж11:'d:r' СуммаНач11 ВсегоНач11 СуммаУд11 ВсегоУд11 СумКВыдаче11
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач11;
!  SumList2 := SumList2 + ВсегоУд11;
!  SumList3 := SumList3 + СумКВыдаче11;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNUWT9;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│.{.?NUUWT9;             │.}             │             │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNUWT10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?NUUWT10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NNUWT11;──────┬──────┼.}──────┬──────┼.{.?NUUWT11;─────────────┼.}─────────────┤─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!     SumList3 := Round(SumList3);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш---------------------------------------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней11 ИтогоЧасов11 ВсегоИтогоДней11 ВсегоИтогоЧасов11
ИтогоНач11 ВсегоИтогоНач11 ИтогоУд11 ВсегоИтогоУд11 ИтогоКВыдаче11
ИтогоСтр11 ИтогоПоВед11
СтрГлавБух11
ИтогоПоВедПрпись11
ИтогоПоВедПрписьСтрока11
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NNUWT12;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│.{.?NUUWT12;             │.}             │             │               │ Ш
 Ш│   │          │                  │.{.?NNUWT13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?NUUWT13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NNUWT14;─────────────┴.}─────────────┴.{.?NUUWT14;─────────────┴.}─────────────┴─────────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.begin
  SumList1 :=0;
  SumList2 := 0;
  SumList3 := 0;
  List := 1;
end.
.{ NNachUdWithTimeCicle CheckEnter
.{ PeopC111 CheckEnter
.[h
.fields
Шапка111_11 Шапка111_12 Шапка111_13 Шапка111_14 Шапка111_15 Шапка111_16 Шапка111_17 Шапка111_18 Шапка111_19 Шапка111_110
Шапка111_21 Шапка111_22 Шапка111_23 Шапка111_24 Шапка111_25 Шапка111_26 Шапка111_27 Шапка111_28 Шапка111_29 Шапка111_210
Шапка111_31 Шапка111_32 Шапка111_33 Шапка111_34 Шапка111_35 Шапка111_36 Шапка111_37 Шапка111_38 Шапка111_39 Шапка111_310
Шапка111_41 Шапка111_42 Шапка111_43 Шапка111_44 Шапка111_45 Шапка111_46 Шапка111_47 Шапка111_48 Шапка111_49 Шапка111_410
Шапка111_51 Шапка111_52 Шапка111_53 Шапка111_54 Шапка111_55 Шапка111_56 Шапка111_57 Шапка111_58 Шапка111_59 Шапка111_510
Шапка111_61 Шапка111_62 Шапка111_63 Шапка111_64 Шапка111_65 Шапка111_66 Шапка111_67 Шапка111_68 Шапка111_69 Шапка111_610
Шапка111_71 Шапка111_72 Шапка111_73 Шапка111_74 Шапка111_75 Шапка111_76 Шапка111_77 Шапка111_78 Шапка111_79 Шапка111_710
Шапка111_81 Шапка111_82 Шапка111_83 Шапка111_84 Шапка111_85 Шапка111_86 Шапка111_87 Шапка111_88 Шапка111_89 Шапка111_810
Шапка111_91 Шапка111_92 Шапка111_93 Шапка111_94 Шапка111_95 Шапка111_96 Шапка111_97 Шапка111_98 Шапка111_99 Шапка111_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп111 ТабНом111 ФИО111:'d:r' Дней111 Часов111 ВсегоДней111 ВсегоЧасов111
Долж111:'d:r' СуммаНач111 ВсегоНач111 СуммаУд111 ВсегоУд111 ВсегоНеНач111 СумКВыдаче111
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач111;
!  SumList2 := SumList2 + ВсегоУд111;
!  SumList3 := SumList3 + СумКВыдаче111;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUN9;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│.{.?UUN9;             │.}             │             │             │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUN10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?UUN10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NUN11;──────┬──────┼.}──────┬──────┼.{.?UUN11;─────────────┼.}─────────────┤─────────────┼─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!     SumList3 := Round(SumList3);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш---------------------------------------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней111 ИтогоЧасов111 ВсегоИтогоДней111 ВсегоИтогоЧасов111
ИтогоНач111 ВсегоИтогоНач111 ИтогоУд111 ВсегоИтогоУд111 ИтогоНеНач111 ИтогоКВыдаче111
ИтогоСтр111 ИтогоПоВед111
СтрГлавБух111
ИтогоПоВедПрпись111
ИтогоПоВедПрписьСтрока111
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NUN12;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│.{.?UUN12;             │.}             │             │             │               │ Ш
 Ш│   │          │                  │.{.?NUN13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?UUN13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NUN14;─────────────┴.}─────────────┴.{.?UUN14;─────────────┴.}─────────────┴─────────────┴─────────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.begin
  SumList1 :=0;
  SumList2 := 0;
  SumList3 := 0;
  List := 1;
end.
.{ NachUdCicle CheckEnter
.{ PeopC12 CheckEnter
.[h
.fields
Шапка12_11 Шапка12_12 Шапка12_13 Шапка12_14 Шапка12_15 Шапка12_16 Шапка12_17 Шапка12_18 Шапка12_19 Шапка12_110
Шапка12_21 Шапка12_22 Шапка12_23 Шапка12_24 Шапка12_25 Шапка12_26 Шапка12_27 Шапка12_28 Шапка12_29 Шапка12_210
Шапка12_31 Шапка12_32 Шапка12_33 Шапка12_34 Шапка12_35 Шапка12_36 Шапка12_37 Шапка12_38 Шапка12_39 Шапка12_310
Шапка12_41 Шапка12_42 Шапка12_43 Шапка12_44 Шапка12_45 Шапка12_46 Шапка12_47 Шапка12_48 Шапка12_49 Шапка12_410
Шапка12_51 Шапка12_52 Шапка12_53 Шапка12_54 Шапка12_55 Шапка12_56 Шапка12_57 Шапка12_58 Шапка12_59 Шапка12_510
Шапка12_61 Шапка12_62 Шапка12_63 Шапка12_64 Шапка12_65 Шапка12_66 Шапка12_67 Шапка12_68 Шапка12_69 Шапка12_610
Шапка12_71 Шапка12_72 Шапка12_73 Шапка12_74 Шапка12_75 Шапка12_76 Шапка12_77 Шапка12_78 Шапка12_79 Шапка12_710
Шапка12_81 Шапка12_82 Шапка12_83 Шапка12_84 Шапка12_85 Шапка12_86 Шапка12_87 Шапка12_88 Шапка12_89 Шапка12_810
Шапка12_91 Шапка12_92 Шапка12_93 Шапка12_94 Шапка12_95 Шапка12_96 Шапка12_97 Шапка12_98 Шапка12_99 Шапка12_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп12 ТабНом12 ФИО12:'d:r'
Долж12:'d:r' СуммаНач12 ВсегоНач12 СуммаУд12 ВсегоУд12 СумКВыдаче12
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач12;
!  SumList2 := SumList2 + ВсегоУд12;
!  SumList3 := SumList3 + СумКВыдаче12;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNU9;             │.}             │.{.?NUU9;             │.}             │             │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNU10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?NUU10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NNU11;─────────────┼.}─────────────┼.{.?NUU11;─────────────┼.}─────────────┤─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!     SumList3 := Round(SumList3);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш---------------------------------------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоНач12 ВсегоИтогоНач12 ИтогоУд12 ВсегоИтогоУд12 ИтогоКВыдаче12
ИтогоСтр12 ИтогоПоВед12
СтрГлавБух12
ИтогоПоВедПрпись12
ИтогоПоВедПрписьСтрока12
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NNU12;             │.}             │.{.?NUU12;             │.}             │             │               │ Ш
 Ш│   │          │                  │.{.?NNU13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?NUU13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NNU14;─────────────┴.}─────────────┴.{.?NUU14;─────────────┴.}─────────────┴─────────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.{ NNachUdCicle CheckEnter
.{ PeopC112 CheckEnter
.[h
.fields
Шапка112_11 Шапка112_12 Шапка112_13 Шапка112_14 Шапка112_15 Шапка112_16 Шапка112_17 Шапка112_18 Шапка112_19 Шапка112_110
Шапка112_21 Шапка112_22 Шапка112_23 Шапка112_24 Шапка112_25 Шапка112_26 Шапка112_27 Шапка112_28 Шапка112_29 Шапка112_210
Шапка112_31 Шапка112_32 Шапка112_33 Шапка112_34 Шапка112_35 Шапка112_36 Шапка112_37 Шапка112_38 Шапка112_39 Шапка112_310
Шапка112_41 Шапка112_42 Шапка112_43 Шапка112_44 Шапка112_45 Шапка112_46 Шапка112_47 Шапка112_48 Шапка112_49 Шапка112_410
Шапка112_51 Шапка112_52 Шапка112_53 Шапка112_54 Шапка112_55 Шапка112_56 Шапка112_57 Шапка112_58 Шапка112_59 Шапка112_510
Шапка112_61 Шапка112_62 Шапка112_63 Шапка112_64 Шапка112_65 Шапка112_66 Шапка112_67 Шапка112_68 Шапка112_69 Шапка112_610
Шапка112_71 Шапка112_72 Шапка112_73 Шапка112_74 Шапка112_75 Шапка112_76 Шапка112_77 Шапка112_78 Шапка112_79 Шапка112_710
Шапка112_81 Шапка112_82 Шапка112_83 Шапка112_84 Шапка112_85 Шапка112_86 Шапка112_87 Шапка112_88 Шапка112_89 Шапка112_810
Шапка112_91 Шапка112_92 Шапка112_93 Шапка112_94 Шапка112_95 Шапка112_96 Шапка112_97 Шапка112_98 Шапка112_99 Шапка112_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп112 ТабНом112 ФИО112:'d:r'
Долж112:'d:r' СуммаНач112 ВсегоНач112 СуммаУд112 ВсегоУд112 ВсегоНеНач112 СумКВыдаче112
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач112;
!  SumList2 := SumList2 + ВсегоУд112;
!  SumList3 := SumList3 + СумКВыдаче112;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNUN9;             │.}             │.{.?UNUN9;             │.}             │             │             │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNUN10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?UNUN10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NNUN11;─────────────┼.}─────────────┼.{.?UNUN11;─────────────┼.}─────────────┼─────────────┼─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!     SumList3 := Round(SumList3);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш---------------------------------------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоНач112 ВсегоИтогоНач112 ИтогоУд112 ВсегоИтогоУд112 ИтогоНеНач112 ИтогоКВыдаче112
ИтогоСтр112 ИтогоПоВед112
СтрГлавБух112
ИтогоПоВедПрпись112
ИтогоПоВедПрписьСтрока112
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NNUN12;             │.}             │.{.?UNUN12;             │.}             │             │             │               │ Ш
 Ш│   │          │                  │.{.?NNUN13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?UNUN13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NNUN14;─────────────┴.}─────────────┴.{.?UNUN14;─────────────┴.}─────────────┴─────────────┴─────────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.}
.fields
ИтогоВедомость
.endfields
 БИТОГО ВЫПЛАЧЕНО: Б  Р@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Р
( сумма к выдаче прописью)
.endform


.linkform 'RPVedGor_L3' prototype is 'RPVedGor'
.nameinlist 'Расчетно-платежная ведомость для больших сумм'
.Set Filler ='-'
.DEFO LANDSCAPE
.DEFP PA4
.p 72
.var
    InShap    : integer;
    SumList1  : double
    SumList2  : double
    SumList3  : double
    Count     : LongInt
    List      : Longint
    SSS       : string;
.endvar
.Set Dot '='
.group '1_Третья группа'
.begin InShap := 0    end.
.{ CommonForAllCicle CheckEnter
.fields
РукПред_Имя ГлавБух_Имя
НазвОрган
КодПодразделение
ЗаМесяц
Год
.endfields
.{ Shapka CheckEnter
                БРуководитель Б                     БГл.бухгалтер Б
                Борганизации Б                      Борганизации Б
          @~@@@@@@@@@@@@@@@@@@@@@@@      @~@@@@@@@@@@@@@@@@@@@@@@@

           БОрганизация Б : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{?internal;InShap=0

.begin InShap := InShap + 1 end.
.}
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                     БРАСЧЕТНО-ПЛАТЕЖНАЯ ВЕДОМОСТЬ No__ Б
                     Бза Б  @@@@@@@@@@ Б месяц Б   @@@@   Бг. Б
.}
.begin
  SumList1 :=0;
  List     :=1;
end.
.{ NachBegEndWithTimeCicle CheckEnter
.{ PeopC1 CheckEnter
.[h
.fields
Шапка1_11 Шапка1_12 Шапка1_13 Шапка1_14 Шапка1_15 Шапка1_16 Шапка1_17 Шапка1_18 Шапка1_19 Шапка1_110
Шапка1_21 Шапка1_22 Шапка1_23 Шапка1_24 Шапка1_25 Шапка1_26 Шапка1_27 Шапка1_28 Шапка1_29 Шапка1_210
Шапка1_31 Шапка1_32 Шапка1_33 Шапка1_34 Шапка1_35 Шапка1_36 Шапка1_37 Шапка1_38 Шапка1_39 Шапка1_310
Шапка1_41 Шапка1_42 Шапка1_43 Шапка1_44 Шапка1_45 Шапка1_46 Шапка1_47 Шапка1_48 Шапка1_49 Шапка1_410
Шапка1_51 Шапка1_52 Шапка1_53 Шапка1_54 Шапка1_55 Шапка1_56 Шапка1_57 Шапка1_58 Шапка1_59 Шапка1_510
Шапка1_61 Шапка1_62 Шапка1_63 Шапка1_64 Шапка1_65 Шапка1_66 Шапка1_67 Шапка1_68 Шапка1_69 Шапка1_610
Шапка1_71 Шапка1_72 Шапка1_73 Шапка1_74 Шапка1_75 Шапка1_76 Шапка1_77 Шапка1_78 Шапка1_79 Шапка1_710
Шапка1_81 Шапка1_82 Шапка1_83 Шапка1_84 Шапка1_85 Шапка1_86 Шапка1_87 Шапка1_88 Шапка1_89 Шапка1_810
Шапка1_91 Шапка1_92 Шапка1_93 Шапка1_94 Шапка1_95 Шапка1_96 Шапка1_97 Шапка1_98 Шапка1_99 Шапка1_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп1 ТабНом1 ФИО1:'d:r' Дней1 Часов1 ВсегоДней1 ВсегоЧасов1
Долж1:'d:r' СуммаНач1 ВсегоНач1
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач1;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBET9;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBET10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBET11;──────┬──────┼.}──────┬──────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!  end
!end.
!.fields
!  List
!  SumList1
! СуммаНач1:'SUM'
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней1 ИтогоЧасов1 ВсегоИтогоДней1 ВсегоИтогоЧасов1
Итого1 ВсегоИтого1
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NBET12;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│ Ш
 Ш│   │          │                  │.{.?NBET13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBET14;─────────────┴.}─────────────┘
 Ш^
.}
.begin
  SumList1 :=0;
  List := 1;
end.
.{ NachBegEndCicle CheckEnter
.{ PeopC2 CheckEnter
.[h
.fields
Шапка2_11 Шапка2_12 Шапка2_13 Шапка2_14 Шапка2_15 Шапка2_16 Шапка2_17 Шапка2_18 Шапка2_19 Шапка2_110
Шапка2_21 Шапка2_22 Шапка2_23 Шапка2_24 Шапка2_25 Шапка2_26 Шапка2_27 Шапка2_28 Шапка2_29 Шапка2_210
Шапка2_31 Шапка2_32 Шапка2_33 Шапка2_34 Шапка2_35 Шапка2_36 Шапка2_37 Шапка2_38 Шапка2_39 Шапка2_310
Шапка2_41 Шапка2_42 Шапка2_43 Шапка2_44 Шапка2_45 Шапка2_46 Шапка2_47 Шапка2_48 Шапка2_49 Шапка2_410
Шапка2_51 Шапка2_52 Шапка2_53 Шапка2_54 Шапка2_55 Шапка2_56 Шапка2_57 Шапка2_58 Шапка2_59 Шапка2_510
Шапка2_61 Шапка2_62 Шапка2_63 Шапка2_64 Шапка2_65 Шапка2_66 Шапка2_67 Шапка2_68 Шапка2_69 Шапка2_610
Шапка2_71 Шапка2_72 Шапка2_73 Шапка2_74 Шапка2_75 Шапка2_76 Шапка2_77 Шапка2_78 Шапка2_79 Шапка2_710
Шапка2_81 Шапка2_82 Шапка2_83 Шапка2_84 Шапка2_85 Шапка2_86 Шапка2_87 Шапка2_88 Шапка2_89 Шапка2_810
Шапка2_91 Шапка2_92 Шапка2_93 Шапка2_94 Шапка2_95 Шапка2_96 Шапка2_97 Шапка2_98 Шапка2_99 Шапка2_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп2 ТабНом2 ФИО2:'d:r'
Долж2:'d:r' СуммаНач2 ВсегоНач2
!Итого2 ВсегоИтого2
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач2;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBEWT9;             │.}             │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBEWT10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBEWT11;─────────────┼.}─────────────┤ Ш
!.[f OverWrite
!.begin
!Message(' FlagRo  '+String(FlagRo),1);
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!  end
!end.
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого2 ВсегоИтого2
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NBEWT12;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш│   │          │                  │.{.?NBEWT13;             │.}             │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBEWT14;─────────────┴.}─────────────┘ Ш
^
.begin
  SumList1 :=0;
  SumList2 :=0;
  List := 1;
end.
.fields
.endfields
.}
.{ NeNachBegEndCicle CheckEnter








.{ PeopC103 CheckEnter
.[h
.fields
Шапка103_11 Шапка103_12 Шапка103_13 Шапка103_14 Шапка103_15 Шапка103_16 Шапка103_17 Шапка103_18 Шапка103_19 Шапка103_110
Шапка103_21 Шапка103_22 Шапка103_23 Шапка103_24 Шапка103_25 Шапка103_26 Шапка103_27 Шапка103_28 Шапка103_29 Шапка103_210
Шапка103_31 Шапка103_32 Шапка103_33 Шапка103_34 Шапка103_35 Шапка103_36 Шапка103_37 Шапка103_38 Шапка103_39 Шапка103_310
Шапка103_41 Шапка103_42 Шапка103_43 Шапка103_44 Шапка103_45 Шапка103_46 Шапка103_47 Шапка103_48 Шапка103_49 Шапка103_410
Шапка103_51 Шапка103_52 Шапка103_53 Шапка103_54 Шапка103_55 Шапка103_56 Шапка103_57 Шапка103_58 Шапка103_59 Шапка103_510
Шапка103_61 Шапка103_62 Шапка103_63 Шапка103_64 Шапка103_65 Шапка103_66 Шапка103_67 Шапка103_68 Шапка103_69 Шапка103_610
Шапка103_71 Шапка103_72 Шапка103_73 Шапка103_74 Шапка103_75 Шапка103_76 Шапка103_77 Шапка103_78 Шапка103_79 Шапка103_710
Шапка103_81 Шапка103_82 Шапка103_83 Шапка103_84 Шапка103_85 Шапка103_86 Шапка103_87 Шапка103_88 Шапка103_89 Шапка103_810
Шапка103_91 Шапка103_92 Шапка103_93 Шапка103_94 Шапка103_95 Шапка103_96 Шапка103_97 Шапка103_98 Шапка103_99 Шапка103_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп103 ТабНом103 ФИО103:'d:r'
Долж103:'d:r' СуммаУдер103 ВсегоУдер103 СуммаНеНач103 СумКвыд103
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер103;
!  SumList2 := SumList2 + СумКвыд103;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUBEN9;             │.}             │             │             │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUBEN10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NUBEN11;─────────────┼.}─────────────┼─────────────┼─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:      удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List + 1;
!end.
!.]f
.}
.fields
Итого103 ВсегоИтого103 ИтогоСуммаНач103 ВсеКВыдаче103
ИтогоСтр103 ИтогоПоВед103
СтрГлавБух103
ИтогоПоВедПрпись103
ИтогоПоВедПрписьСтрока103
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NUBEN12;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш│   │          │                  │.{.?NUBEN13;             │.}             │             │             │               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NUBEN14;─────────────┴.}─────────────┴─────────────┴─────────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
!.}
.}
.{ NachUdBegEndCicle CheckEnter








.{ PeopC3 CheckEnter
.[h
.fields
Шапка3_11 Шапка3_12 Шапка3_13 Шапка3_14 Шапка3_15 Шапка3_16 Шапка3_17 Шапка3_18 Шапка3_19 Шапка3_110
Шапка3_21 Шапка3_22 Шапка3_23 Шапка3_24 Шапка3_25 Шапка3_26 Шапка3_27 Шапка3_28 Шапка3_29 Шапка3_210
Шапка3_31 Шапка3_32 Шапка3_33 Шапка3_34 Шапка3_35 Шапка3_36 Шапка3_37 Шапка3_38 Шапка3_39 Шапка3_310
Шапка3_41 Шапка3_42 Шапка3_43 Шапка3_44 Шапка3_45 Шапка3_46 Шапка3_47 Шапка3_48 Шапка3_49 Шапка3_410
Шапка3_51 Шапка3_52 Шапка3_53 Шапка3_54 Шапка3_55 Шапка3_56 Шапка3_57 Шапка3_58 Шапка3_59 Шапка3_510
Шапка3_61 Шапка3_62 Шапка3_63 Шапка3_64 Шапка3_65 Шапка3_66 Шапка3_67 Шапка3_68 Шапка3_69 Шапка3_610
Шапка3_71 Шапка3_72 Шапка3_73 Шапка3_74 Шапка3_75 Шапка3_76 Шапка3_77 Шапка3_78 Шапка3_79 Шапка3_710
Шапка3_81 Шапка3_82 Шапка3_83 Шапка3_84 Шапка3_85 Шапка3_86 Шапка3_87 Шапка3_88 Шапка3_89 Шапка3_810
Шапка3_91 Шапка3_92 Шапка3_93 Шапка3_94 Шапка3_95 Шапка3_96 Шапка3_97 Шапка3_98 Шапка3_99 Шапка3_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп3 ТабНом3 ФИО3:'d:r'
Долж3:'d:r' СуммаУдер3 ВсегоУдер3 СумКвыд3
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер3;
!  SumList2 := SumList2 + СумКвыд3;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUBEWT9;             │.}             │             │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUBEWT10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NUBEWT11;─────────────┼.}─────────────┤─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:      удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List + 1;
!end.
!.]f
.}
.fields
Итого3 ВсегоИтого3 ВсеКВыдаче3
ИтогоСтр3 ИтогоПоВед3
СтрГлавБух3
ИтогоПоВедПрпись3
ИтогоПоВедПрписьСтрока3
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NUBEWT12;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш│   │          │                  │.{.?NUBEWT13;             │.}             │             │               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NUBEWT14;─────────────┴.}─────────────┴─────────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.{ NachBgWithTimeCicle CheckEnter
.{  PeopC4 CheckEnter
.[h
.fields
Шапка4_11 Шапка4_12 Шапка4_13 Шапка4_14 Шапка4_15 Шапка4_16 Шапка4_17 Шапка4_18 Шапка4_19 Шапка4_110
Шапка4_21 Шапка4_22 Шапка4_23 Шапка4_24 Шапка4_25 Шапка4_26 Шапка4_27 Шапка4_28 Шапка4_29 Шапка4_210
Шапка4_31 Шапка4_32 Шапка4_33 Шапка4_34 Шапка4_35 Шапка4_36 Шапка4_37 Шапка4_38 Шапка4_39 Шапка4_310
Шапка4_41 Шапка4_42 Шапка4_43 Шапка4_44 Шапка4_45 Шапка4_46 Шапка4_47 Шапка4_48 Шапка4_49 Шапка4_410
Шапка4_51 Шапка4_52 Шапка4_53 Шапка4_54 Шапка4_55 Шапка4_56 Шапка4_57 Шапка4_58 Шапка4_59 Шапка4_510
Шапка4_61 Шапка4_62 Шапка4_63 Шапка4_64 Шапка4_65 Шапка4_66 Шапка4_67 Шапка4_68 Шапка4_69 Шапка4_610
Шапка4_71 Шапка4_72 Шапка4_73 Шапка4_74 Шапка4_75 Шапка4_76 Шапка4_77 Шапка4_78 Шапка4_79 Шапка4_710
Шапка4_81 Шапка4_82 Шапка4_83 Шапка4_84 Шапка4_85 Шапка4_86 Шапка4_87 Шапка4_88 Шапка4_89 Шапка4_810
Шапка4_91 Шапка4_92 Шапка4_93 Шапка4_94 Шапка4_95 Шапка4_96 Шапка4_97 Шапка4_98 Шапка4_99 Шапка4_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп4 ТабНом4 ФИО4:'d:r' Дней4 Часов4
Долж4:'d:r' СуммаНач4
.endfields
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBT9;@@@@@@│@@@@@@│.} Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBT10;@'~@@@@@@@@@@│.} Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBT11;──────┬──────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
ИтогоДней4 ИтогоЧасов4
Итого4
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NBT12;@@@@@@│@@@@@@│.} Ш
 Ш│   │          │                  │.{.?NBT13;@'~@@@@@@@@@@│.} Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBT14;─────────────┴.} Ш
^
.}
.{NachUdBegCicle CheckEnter
.if NeedSpace








.end
.{ PeopC5 CheckEnter
.[h
.fields
Шапка5_11 Шапка5_12 Шапка5_13 Шапка5_14 Шапка5_15 Шапка5_16 Шапка5_17 Шапка5_18 Шапка5_19 Шапка5_110
Шапка5_21 Шапка5_22 Шапка5_23 Шапка5_24 Шапка5_25 Шапка5_26 Шапка5_27 Шапка5_28 Шапка5_29 Шапка5_210
Шапка5_31 Шапка5_32 Шапка5_33 Шапка5_34 Шапка5_35 Шапка5_36 Шапка5_37 Шапка5_38 Шапка5_39 Шапка5_310
Шапка5_41 Шапка5_42 Шапка5_43 Шапка5_44 Шапка5_45 Шапка5_46 Шапка5_47 Шапка5_48 Шапка5_49 Шапка5_410
Шапка5_51 Шапка5_52 Шапка5_53 Шапка5_54 Шапка5_55 Шапка5_56 Шапка5_57 Шапка5_58 Шапка5_59 Шапка5_510
Шапка5_61 Шапка5_62 Шапка5_63 Шапка5_64 Шапка5_65 Шапка5_66 Шапка5_67 Шапка5_68 Шапка5_69 Шапка5_610
Шапка5_71 Шапка5_72 Шапка5_73 Шапка5_74 Шапка5_75 Шапка5_76 Шапка5_77 Шапка5_78 Шапка5_79 Шапка5_710
Шапка5_81 Шапка5_82 Шапка5_83 Шапка5_84 Шапка5_85 Шапка5_86 Шапка5_87 Шапка5_88 Шапка5_89 Шапка5_810
Шапка5_91 Шапка5_92 Шапка5_93 Шапка5_94 Шапка5_95 Шапка5_96 Шапка5_97 Шапка5_98 Шапка5_99 Шапка5_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп5 ТабНом5 ФИО5:'d:r'
Долж5:'d:r' СуммаНач5
.endfields
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBWT9;             │.} Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBWT10;@'~@@@@@@@@@@│.} Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBWT11;─────────────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
Итого5
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NBWT12;@'~@@@@@@@@@@│.} Ш
 Ш│   │          │                  │.{.?NBWT13;             │.} Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBWT14;─────────────┴.} Ш
^
.}
.{ NachConWithTimeCicle CheckEnter
.{ PeopC6 CheckEnter
.[h
.fields
Шапка6_11 Шапка6_12 Шапка6_13 Шапка6_14 Шапка6_15 Шапка6_16 Шапка6_17 Шапка6_18 Шапка6_19 Шапка6_110
Шапка6_21 Шапка6_22 Шапка6_23 Шапка6_24 Шапка6_25 Шапка6_26 Шапка6_27 Шапка6_28 Шапка6_29 Шапка6_210
Шапка6_31 Шапка6_32 Шапка6_33 Шапка6_34 Шапка6_35 Шапка6_36 Шапка6_37 Шапка6_38 Шапка6_39 Шапка6_310
Шапка6_41 Шапка6_42 Шапка6_43 Шапка6_44 Шапка6_45 Шапка6_46 Шапка6_47 Шапка6_48 Шапка6_49 Шапка6_410
Шапка6_51 Шапка6_52 Шапка6_53 Шапка6_54 Шапка6_55 Шапка6_56 Шапка6_57 Шапка6_58 Шапка6_59 Шапка6_510
Шапка6_61 Шапка6_62 Шапка6_63 Шапка6_64 Шапка6_65 Шапка6_66 Шапка6_67 Шапка6_68 Шапка6_69 Шапка6_610
Шапка6_71 Шапка6_72 Шапка6_73 Шапка6_74 Шапка6_75 Шапка6_76 Шапка6_77 Шапка6_78 Шапка6_79 Шапка6_710
Шапка6_81 Шапка6_82 Шапка6_83 Шапка6_84 Шапка6_85 Шапка6_86 Шапка6_87 Шапка6_88 Шапка6_89 Шапка6_810
Шапка6_91 Шапка6_92 Шапка6_93 Шапка6_94 Шапка6_95 Шапка6_96 Шапка6_97 Шапка6_98 Шапка6_99 Шапка6_910
.endfields








 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Дней6 Часов6
СуммаНач6
.endfields
 Ш .{.?NCT9;@@@@@@│@@@@@@│.} Ш
 Ш .{.?NCT10;@'~@@@@@@@@@@│.} Ш
 Ш .{.?NCT11;──────┬──────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
ИтогоДней6 ИтогоЧасов6
Итого6
'true':'s'
.endfields
 Ш .{.?NCT12;@@@@@@│@@@@@@│.} Ш
 Ш .{.?NCT13;@'~@@@@@@@@@@│.} Ш
 Ш .{.?NCT14;─────────────┴.} Ш
^
.}
.{ NachUdConCicle CheckEnter
.{ PeopC7 CheckEnter
.[h
.fields
Шапка7_11 Шапка7_12 Шапка7_13 Шапка7_14 Шапка7_15 Шапка7_16 Шапка7_17 Шапка7_18 Шапка7_19 Шапка7_110
Шапка7_21 Шапка7_22 Шапка7_23 Шапка7_24 Шапка7_25 Шапка7_26 Шапка7_27 Шапка7_28 Шапка7_29 Шапка7_210
Шапка7_31 Шапка7_32 Шапка7_33 Шапка7_34 Шапка7_35 Шапка7_36 Шапка7_37 Шапка7_38 Шапка7_39 Шапка7_310
Шапка7_41 Шапка7_42 Шапка7_43 Шапка7_44 Шапка7_45 Шапка7_46 Шапка7_47 Шапка7_48 Шапка7_49 Шапка7_410
Шапка7_51 Шапка7_52 Шапка7_53 Шапка7_54 Шапка7_55 Шапка7_56 Шапка7_57 Шапка7_58 Шапка7_59 Шапка7_510
Шапка7_61 Шапка7_62 Шапка7_63 Шапка7_64 Шапка7_65 Шапка7_66 Шапка7_67 Шапка7_68 Шапка7_69 Шапка7_610
Шапка7_71 Шапка7_72 Шапка7_73 Шапка7_74 Шапка7_75 Шапка7_76 Шапка7_77 Шапка7_78 Шапка7_79 Шапка7_710
Шапка7_81 Шапка7_82 Шапка7_83 Шапка7_84 Шапка7_85 Шапка7_86 Шапка7_87 Шапка7_88 Шапка7_89 Шапка7_810
Шапка7_91 Шапка7_92 Шапка7_93 Шапка7_94 Шапка7_95 Шапка7_96 Шапка7_97 Шапка7_98 Шапка7_99 Шапка7_910
.endfields








 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ17
Символ27 СуммаНач7
Символ47
.endfields
 Ш@.{.?NUC9;             │.} Ш
 Ш@.{.?NUC10;@'~@@@@@@@@@@│.} Ш
 Ш@.{.?NUC11;─────────────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
Итого7
'true':'s'
.endfields
 Ш .{.?NUC12;@'~@@@@@@@@@@│.} Ш
 Ш .{.?NUC13;             │.} Ш
 Ш .{.?NUC14;─────────────┴.} Ш
^
.}
.begin
  SumList1 :=0;
  SumList2 :=0;
  List := 1;
end.
.{ LastUdColmsCircle CheckEnter








.{ PeopC8 CheckEnter
.[h
.fields
Шапка8_11 Шапка8_12 Шапка8_13 Шапка8_14 Шапка8_15 Шапка8_16 Шапка8_17 Шапка8_18 Шапка8_19 Шапка8_110
Шапка8_21 Шапка8_22 Шапка8_23 Шапка8_24 Шапка8_25 Шапка8_26 Шапка8_27 Шапка8_28 Шапка8_29 Шапка8_210
Шапка8_31 Шапка8_32 Шапка8_33 Шапка8_34 Шапка8_35 Шапка8_36 Шапка8_37 Шапка8_38 Шапка8_39 Шапка8_310
Шапка8_41 Шапка8_42 Шапка8_43 Шапка8_44 Шапка8_45 Шапка8_46 Шапка8_47 Шапка8_48 Шапка8_49 Шапка8_410
Шапка8_51 Шапка8_52 Шапка8_53 Шапка8_54 Шапка8_55 Шапка8_56 Шапка8_57 Шапка8_58 Шапка8_59 Шапка8_510
Шапка8_61 Шапка8_62 Шапка8_63 Шапка8_64 Шапка8_65 Шапка8_66 Шапка8_67 Шапка8_68 Шапка8_69 Шапка8_610
Шапка8_71 Шапка8_72 Шапка8_73 Шапка8_74 Шапка8_75 Шапка8_76 Шапка8_77 Шапка8_78 Шапка8_79 Шапка8_710
Шапка8_81 Шапка8_82 Шапка8_83 Шапка8_84 Шапка8_85 Шапка8_86 Шапка8_87 Шапка8_88 Шапка8_89 Шапка8_810
Шапка8_91 Шапка8_92 Шапка8_93 Шапка8_94 Шапка8_95 Шапка8_96 Шапка8_97 Шапка8_98 Шапка8_99 Шапка8_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ18
Символ28 СуммаНач8 ВсегоУдер8 СумКвыд8
Символ48
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер8;
!  SumList2 := SumList2 + СумКвыд8;
end.
 Ш@.{.?LUCC9;             │.}             │             │               │ Ш
 Ш@.{.?LUCC10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш@.{.?LUCC11;─────────────┼.}─────────────┤─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@: удержано : &'#&&&&&&&&&&&&&.&&   к выдаче :  &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого8 ИтогоВсегоУдер8 ИтогоСумКвыд8
ИтогоСтр8 ИтогоПоВед8
СтрГлавБух8
ИтогоПоВедПрпись8
ИтогоПоВедПрписьСтрока8
'true':'s'
.endfields
 Ш .{.?LUCC12;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш .{.?LUCC13;             │.}             │             │               │ Ш
 Ш .{.?LUCC14;─────────────┴.}─────────────┴─────────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.begin
  SumList1 :=0;
  List := 1;
end.
.{ LastNachTimeColmsCircle CheckEnter








.{ PeopC9 CheckEnter
.[h
.fields
Шапка9_11 Шапка9_12 Шапка9_13 Шапка9_14 Шапка9_15 Шапка9_16 Шапка9_17 Шапка9_18 Шапка9_19 Шапка9_110
Шапка9_21 Шапка9_22 Шапка9_23 Шапка9_24 Шапка9_25 Шапка9_26 Шапка9_27 Шапка9_28 Шапка9_29 Шапка9_210
Шапка9_31 Шапка9_32 Шапка9_33 Шапка9_34 Шапка9_35 Шапка9_36 Шапка9_37 Шапка9_38 Шапка9_39 Шапка9_310
Шапка9_41 Шапка9_42 Шапка9_43 Шапка9_44 Шапка9_45 Шапка9_46 Шапка9_47 Шапка9_48 Шапка9_49 Шапка9_410
Шапка9_51 Шапка9_52 Шапка9_53 Шапка9_54 Шапка9_55 Шапка9_56 Шапка9_57 Шапка9_58 Шапка9_59 Шапка9_510
Шапка9_61 Шапка9_62 Шапка9_63 Шапка9_64 Шапка9_65 Шапка9_66 Шапка9_67 Шапка9_68 Шапка9_69 Шапка9_610
Шапка9_71 Шапка9_72 Шапка9_73 Шапка9_74 Шапка9_75 Шапка9_76 Шапка9_77 Шапка9_78 Шапка9_79 Шапка9_710
Шапка9_81 Шапка9_82 Шапка9_83 Шапка9_84 Шапка9_85 Шапка9_86 Шапка9_87 Шапка9_88 Шапка9_89 Шапка9_810
Шапка9_91 Шапка9_92 Шапка9_93 Шапка9_94 Шапка9_95 Шапка9_96 Шапка9_97 Шапка9_98 Шапка9_99 Шапка9_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Дней9 Часов9 Дни9 Час9
СуммаНач9 ВсегоНач9
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач9;
end.
 Ш .{.?LNTCC9;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│ Ш
 Ш .{.?LNTCC10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш .{.?LNTCC11;──────┬──────┼.}──────┬──────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!  end
!end.
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней9 ИтогоЧасов9 ИтогоВсегоДни9 ИтогоВсегоЧас9
Итого9 ИтогоВсегоНач9
'true':'s'
.endfields
 Ш .{.?LNTCC12;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│ Ш
 Ш .{.?LNTCC13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш .{.?LNTCC14;─────────────┴.}─────────────┘ Ш
^
.}
.begin
  SumList1 :=0;
  List := 1;
end.
.{ LastNachColmsCircle CheckEnter








.{ PeopC10 CheckEnter
.[h
.fields
Шапка10_11 Шапка10_12 Шапка10_13 Шапка10_14 Шапка10_15 Шапка10_16 Шапка10_17 Шапка10_18 Шапка10_19 Шапка10_110
Шапка10_21 Шапка10_22 Шапка10_23 Шапка10_24 Шапка10_25 Шапка10_26 Шапка10_27 Шапка10_28 Шапка10_29 Шапка10_210
Шапка10_31 Шапка10_32 Шапка10_33 Шапка10_34 Шапка10_35 Шапка10_36 Шапка10_37 Шапка10_38 Шапка10_39 Шапка10_310
Шапка10_41 Шапка10_42 Шапка10_43 Шапка10_44 Шапка10_45 Шапка10_46 Шапка10_47 Шапка10_48 Шапка10_49 Шапка10_410
Шапка10_51 Шапка10_52 Шапка10_53 Шапка10_54 Шапка10_55 Шапка10_56 Шапка10_57 Шапка10_58 Шапка10_59 Шапка10_510
Шапка10_61 Шапка10_62 Шапка10_63 Шапка10_64 Шапка10_65 Шапка10_66 Шапка10_67 Шапка10_68 Шапка10_69 Шапка10_610
Шапка10_71 Шапка10_72 Шапка10_73 Шапка10_74 Шапка10_75 Шапка10_76 Шапка10_77 Шапка10_78 Шапка10_79 Шапка10_710
Шапка10_81 Шапка10_82 Шапка10_83 Шапка10_84 Шапка10_85 Шапка10_86 Шапка10_87 Шапка10_88 Шапка10_89 Шапка10_810
Шапка10_91 Шапка10_92 Шапка10_93 Шапка10_94 Шапка10_95 Шапка10_96 Шапка10_97 Шапка10_98 Шапка10_99 Шапка10_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ110
Символ210 СуммаНач10 ВсегоНач10
Символ410
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач10;
end.
 Ш@.{.?LNCC9;             │.}             │ Ш
 Ш@.{.?LNCC10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш@.{.?LNCC11;─────────────┼.}─────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!  end
!end.
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого10 ИтогоВсегоУдер10
'true':'s'
.endfields
 Ш .{.?LNCC12;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│ Ш
 Ш .{.?LNCC13;             │.}             │ Ш
 Ш .{.?LNCC14;─────────────┴.}─────────────┘ Ш
^
.}
.begin
  SumList1 :=0;
  SumList2 :=0;
  SumList3 :=0;
  List := 1;
end.
.{ LastNeNachCC CheckEnter
.{ PeopC105 CheckEnter
.[h
.fields
Шапка105_11 Шапка105_12 Шапка105_13 Шапка105_14 Шапка105_15 Шапка105_16 Шапка105_17 Шапка105_18 Шапка105_19 Шапка105_110
Шапка105_21 Шапка105_22 Шапка105_23 Шапка105_24 Шапка105_25 Шапка105_26 Шапка105_27 Шапка105_28 Шапка105_29 Шапка105_210
Шапка105_31 Шапка105_32 Шапка105_33 Шапка105_34 Шапка105_35 Шапка105_36 Шапка105_37 Шапка105_38 Шапка105_39 Шапка105_310
Шапка105_41 Шапка105_42 Шапка105_43 Шапка105_44 Шапка105_45 Шапка105_46 Шапка105_47 Шапка105_48 Шапка105_49 Шапка105_410
Шапка105_51 Шапка105_52 Шапка105_53 Шапка105_54 Шапка105_55 Шапка105_56 Шапка105_57 Шапка105_58 Шапка105_59 Шапка105_510
Шапка105_61 Шапка105_62 Шапка105_63 Шапка105_64 Шапка105_65 Шапка105_66 Шапка105_67 Шапка105_68 Шапка105_69 Шапка105_610
Шапка105_71 Шапка105_72 Шапка105_73 Шапка105_74 Шапка105_75 Шапка105_76 Шапка105_77 Шапка105_78 Шапка105_79 Шапка105_710
Шапка105_81 Шапка105_82 Шапка105_83 Шапка105_84 Шапка105_85 Шапка105_86 Шапка105_87 Шапка105_88 Шапка105_89 Шапка105_810
Шапка105_91 Шапка105_92 Шапка105_93 Шапка105_94 Шапка105_95 Шапка105_96 Шапка105_97 Шапка105_98 Шапка105_99 Шапка105_910
.endfields








 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ105_18
Символ105_28 СуммаНач105 ВсегоУдер105 ВсегоНенач105 СумКвыд105
Символ105_48
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер8;
!  SumList2 := SumList2 + СумКвыд8;
end.
 Ш@.{.?LUNC9;             │.}             │             │             │               │ Ш
 Ш@.{.?LUNC10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш@.{.?LUNC11;─────────────┼.}─────────────┼─────────────┼─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@: удержано : &'#&&&&&&&&&&&&&.&&   к выдаче :  &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого105 ИтогоВсегоУдер105 ИтогоНенач105 ИтогоСумКвыд105
ИтогоСтр105 ИтогоПоВед105
СтрГлавБух105
ИтогоПоВедПрпись105
ИтогоПоВедПрписьСтрока105
'true':'s'
.endfields
 Ш .{.?LUNC12;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш .{.?LUNC13;             │.}             │             │             │               │ Ш
 Ш .{.?LUNC14;─────────────┴.}─────────────┴─────────────┴─────────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.begin
  SumList1 :=0;
  List := 1;
end.
.{ NachUdWithTimeCicle CheckEnter
.{ PeopC11 CheckEnter
.[h
.fields
Шапка11_11 Шапка11_12 Шапка11_13 Шапка11_14 Шапка11_15 Шапка11_16 Шапка11_17 Шапка11_18 Шапка11_19 Шапка11_110
Шапка11_21 Шапка11_22 Шапка11_23 Шапка11_24 Шапка11_25 Шапка11_26 Шапка11_27 Шапка11_28 Шапка11_29 Шапка11_210
Шапка11_31 Шапка11_32 Шапка11_33 Шапка11_34 Шапка11_35 Шапка11_36 Шапка11_37 Шапка11_38 Шапка11_39 Шапка11_310
Шапка11_41 Шапка11_42 Шапка11_43 Шапка11_44 Шапка11_45 Шапка11_46 Шапка11_47 Шапка11_48 Шапка11_49 Шапка11_410
Шапка11_51 Шапка11_52 Шапка11_53 Шапка11_54 Шапка11_55 Шапка11_56 Шапка11_57 Шапка11_58 Шапка11_59 Шапка11_510
Шапка11_61 Шапка11_62 Шапка11_63 Шапка11_64 Шапка11_65 Шапка11_66 Шапка11_67 Шапка11_68 Шапка11_69 Шапка11_610
Шапка11_71 Шапка11_72 Шапка11_73 Шапка11_74 Шапка11_75 Шапка11_76 Шапка11_77 Шапка11_78 Шапка11_79 Шапка11_710
Шапка11_81 Шапка11_82 Шапка11_83 Шапка11_84 Шапка11_85 Шапка11_86 Шапка11_87 Шапка11_88 Шапка11_89 Шапка11_810
Шапка11_91 Шапка11_92 Шапка11_93 Шапка11_94 Шапка11_95 Шапка11_96 Шапка11_97 Шапка11_98 Шапка11_99 Шапка11_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп11 ТабНом11 ФИО11:'d:r' Дней11 Часов11 ВсегоДней11 ВсегоЧасов11
Долж11:'d:r' СуммаНач11 ВсегоНач11 СуммаУд11 ВсегоУд11 СумКВыдаче11
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач11;
!  SumList2 := SumList2 + ВсегоУд11;
!  SumList3 := SumList3 + СумКВыдаче11;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNUWT9;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│.{.?NUUWT9;             │.}             │             │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNUWT10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?NUUWT10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NNUWT11;──────┬──────┼.}──────┬──────┼.{.?NUUWT11;─────────────┼.}─────────────┤─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!     SumList3 := Round(SumList3);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш---------------------------------------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней11 ИтогоЧасов11 ВсегоИтогоДней11 ВсегоИтогоЧасов11
ИтогоНач11 ВсегоИтогоНач11 ИтогоУд11 ВсегоИтогоУд11 ИтогоКВыдаче11
ИтогоСтр11 ИтогоПоВед11
СтрГлавБух11
ИтогоПоВедПрпись11
ИтогоПоВедПрписьСтрока11
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NNUWT12;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│.{.?NUUWT12;             │.}             │             │               │ Ш
 Ш│   │          │                  │.{.?NNUWT13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?NUUWT13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NNUWT14;─────────────┴.}─────────────┴.{.?NUUWT14;─────────────┴.}─────────────┴─────────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.begin
  SumList1 :=0;
  SumList2 := 0;
  SumList3 := 0;
  List := 1;
end.
.{ NNachUdWithTimeCicle CheckEnter
.{ PeopC111 CheckEnter
.[h
.fields
Шапка111_11 Шапка111_12 Шапка111_13 Шапка111_14 Шапка111_15 Шапка111_16 Шапка111_17 Шапка111_18 Шапка111_19 Шапка111_110
Шапка111_21 Шапка111_22 Шапка111_23 Шапка111_24 Шапка111_25 Шапка111_26 Шапка111_27 Шапка111_28 Шапка111_29 Шапка111_210
Шапка111_31 Шапка111_32 Шапка111_33 Шапка111_34 Шапка111_35 Шапка111_36 Шапка111_37 Шапка111_38 Шапка111_39 Шапка111_310
Шапка111_41 Шапка111_42 Шапка111_43 Шапка111_44 Шапка111_45 Шапка111_46 Шапка111_47 Шапка111_48 Шапка111_49 Шапка111_410
Шапка111_51 Шапка111_52 Шапка111_53 Шапка111_54 Шапка111_55 Шапка111_56 Шапка111_57 Шапка111_58 Шапка111_59 Шапка111_510
Шапка111_61 Шапка111_62 Шапка111_63 Шапка111_64 Шапка111_65 Шапка111_66 Шапка111_67 Шапка111_68 Шапка111_69 Шапка111_610
Шапка111_71 Шапка111_72 Шапка111_73 Шапка111_74 Шапка111_75 Шапка111_76 Шапка111_77 Шапка111_78 Шапка111_79 Шапка111_710
Шапка111_81 Шапка111_82 Шапка111_83 Шапка111_84 Шапка111_85 Шапка111_86 Шапка111_87 Шапка111_88 Шапка111_89 Шапка111_810
Шапка111_91 Шапка111_92 Шапка111_93 Шапка111_94 Шапка111_95 Шапка111_96 Шапка111_97 Шапка111_98 Шапка111_99 Шапка111_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп111 ТабНом111 ФИО111:'d:r' Дней111 Часов111 ВсегоДней111 ВсегоЧасов111
Долж111:'d:r' СуммаНач111 ВсегоНач111 СуммаУд111 ВсегоУд111 ВсегоНеНач111 СумКВыдаче111
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач111;
!  SumList2 := SumList2 + ВсегоУд111;
!  SumList3 := SumList3 + СумКВыдаче111;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUN9;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│.{.?UUN9;             │.}             │             │             │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUN10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?UUN10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NUN11;──────┬──────┼.}──────┬──────┼.{.?UUN11;─────────────┼.}─────────────┤─────────────┼─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!     SumList3 := Round(SumList3);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш---------------------------------------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней111 ИтогоЧасов111 ВсегоИтогоДней111 ВсегоИтогоЧасов111
ИтогоНач111 ВсегоИтогоНач111 ИтогоУд111 ВсегоИтогоУд111 ИтогоНеНач111 ИтогоКВыдаче111
ИтогоСтр111 ИтогоПоВед111
СтрГлавБух111
ИтогоПоВедПрпись111
ИтогоПоВедПрписьСтрока111
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NUN12;@@@@@@│@@@@@@│.}@@@@@@│@@@@@@│.{.?UUN12;             │.}             │             │             │               │ Ш
 Ш│   │          │                  │.{.?NUN13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?UUN13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NUN14;─────────────┴.}─────────────┴.{.?UUN14;─────────────┴.}─────────────┴─────────────┴─────────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.begin
  SumList1 :=0;
  SumList2 := 0;
  SumList3 := 0;
  List := 1;
end.
.{ NachUdCicle CheckEnter
.{ PeopC12 CheckEnter
.[h
.fields
Шапка12_11 Шапка12_12 Шапка12_13 Шапка12_14 Шапка12_15 Шапка12_16 Шапка12_17 Шапка12_18 Шапка12_19 Шапка12_110
Шапка12_21 Шапка12_22 Шапка12_23 Шапка12_24 Шапка12_25 Шапка12_26 Шапка12_27 Шапка12_28 Шапка12_29 Шапка12_210
Шапка12_31 Шапка12_32 Шапка12_33 Шапка12_34 Шапка12_35 Шапка12_36 Шапка12_37 Шапка12_38 Шапка12_39 Шапка12_310
Шапка12_41 Шапка12_42 Шапка12_43 Шапка12_44 Шапка12_45 Шапка12_46 Шапка12_47 Шапка12_48 Шапка12_49 Шапка12_410
Шапка12_51 Шапка12_52 Шапка12_53 Шапка12_54 Шапка12_55 Шапка12_56 Шапка12_57 Шапка12_58 Шапка12_59 Шапка12_510
Шапка12_61 Шапка12_62 Шапка12_63 Шапка12_64 Шапка12_65 Шапка12_66 Шапка12_67 Шапка12_68 Шапка12_69 Шапка12_610
Шапка12_71 Шапка12_72 Шапка12_73 Шапка12_74 Шапка12_75 Шапка12_76 Шапка12_77 Шапка12_78 Шапка12_79 Шапка12_710
Шапка12_81 Шапка12_82 Шапка12_83 Шапка12_84 Шапка12_85 Шапка12_86 Шапка12_87 Шапка12_88 Шапка12_89 Шапка12_810
Шапка12_91 Шапка12_92 Шапка12_93 Шапка12_94 Шапка12_95 Шапка12_96 Шапка12_97 Шапка12_98 Шапка12_99 Шапка12_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп12 ТабНом12 ФИО12:'d:r'
Долж12:'d:r' СуммаНач12 ВсегоНач12 СуммаУд12 ВсегоУд12 СумКВыдаче12
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач12;
!  SumList2 := SumList2 + ВсегоУд12;
!  SumList3 := SumList3 + СумКВыдаче12;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNU9;             │.}             │.{.?NUU9;             │.}             │             │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNU10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?NUU10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NNU11;─────────────┼.}─────────────┼.{.?NUU11;─────────────┼.}─────────────┤─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!     SumList3 := Round(SumList3);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш---------------------------------------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоНач12 ВсегоИтогоНач12 ИтогоУд12 ВсегоИтогоУд12 ИтогоКВыдаче12
ИтогоСтр12 ИтогоПоВед12
СтрГлавБух12
ИтогоПоВедПрпись12
ИтогоПоВедПрписьСтрока12
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NNU12;             │.}             │.{.?NUU12;             │.}             │             │               │ Ш
 Ш│   │          │                  │.{.?NNU13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?NUU13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NNU14;─────────────┴.}─────────────┴.{.?NUU14;─────────────┴.}─────────────┴─────────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.{ NNachUdCicle CheckEnter
.{ PeopC112 CheckEnter
.[h
.fields
Шапка112_11 Шапка112_12 Шапка112_13 Шапка112_14 Шапка112_15 Шапка112_16 Шапка112_17 Шапка112_18 Шапка112_19 Шапка112_110
Шапка112_21 Шапка112_22 Шапка112_23 Шапка112_24 Шапка112_25 Шапка112_26 Шапка112_27 Шапка112_28 Шапка112_29 Шапка112_210
Шапка112_31 Шапка112_32 Шапка112_33 Шапка112_34 Шапка112_35 Шапка112_36 Шапка112_37 Шапка112_38 Шапка112_39 Шапка112_310
Шапка112_41 Шапка112_42 Шапка112_43 Шапка112_44 Шапка112_45 Шапка112_46 Шапка112_47 Шапка112_48 Шапка112_49 Шапка112_410
Шапка112_51 Шапка112_52 Шапка112_53 Шапка112_54 Шапка112_55 Шапка112_56 Шапка112_57 Шапка112_58 Шапка112_59 Шапка112_510
Шапка112_61 Шапка112_62 Шапка112_63 Шапка112_64 Шапка112_65 Шапка112_66 Шапка112_67 Шапка112_68 Шапка112_69 Шапка112_610
Шапка112_71 Шапка112_72 Шапка112_73 Шапка112_74 Шапка112_75 Шапка112_76 Шапка112_77 Шапка112_78 Шапка112_79 Шапка112_710
Шапка112_81 Шапка112_82 Шапка112_83 Шапка112_84 Шапка112_85 Шапка112_86 Шапка112_87 Шапка112_88 Шапка112_89 Шапка112_810
Шапка112_91 Шапка112_92 Шапка112_93 Шапка112_94 Шапка112_95 Шапка112_96 Шапка112_97 Шапка112_98 Шапка112_99 Шапка112_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп112 ТабНом112 ФИО112:'d:r'
Долж112:'d:r' СуммаНач112 ВсегоНач112 СуммаУд112 ВсегоУд112 ВсегоНеНач112 СумКВыдаче112
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач112;
!  SumList2 := SumList2 + ВсегоУд112;
!  SumList3 := SumList3 + СумКВыдаче112;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNUN9;             │.}             │.{.?UNUN9;             │.}             │             │             │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNUN10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?UNUN10;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NNUN11;─────────────┼.}─────────────┼.{.?UNUN11;─────────────┼.}─────────────┼─────────────┼─────────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!     SumList3 := Round(SumList3);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш---------------------------------------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоНач112 ВсегоИтогоНач112 ИтогоУд112 ВсегоИтогоУд112 ИтогоНеНач112 ИтогоКВыдаче112
ИтогоСтр112 ИтогоПоВед112
СтрГлавБух112
ИтогоПоВедПрпись112
ИтогоПоВедПрписьСтрока112
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NNUN12;             │.}             │.{.?UNUN12;             │.}             │             │             │               │ Ш
 Ш│   │          │                  │.{.?NNUN13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│.{.?UNUN13;@'~@@@@@@@@@@│.}@'~@@@@@@@@@@│@'~@@@@@@@@@@│@'~@@@@@@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NNUN14;─────────────┴.}─────────────┴.{.?UNUN14;─────────────┴.}─────────────┴─────────────┴─────────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.}
.fields
ИтогоВедомость
.endfields
 БИТОГО ВЫПЛАЧЕНО: Б  Р@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Р
( сумма к выдаче прописью)
.endform
!
!
.linkform 'RPVedGor_SMALL_L11' prototype is 'RPVedGor'
.nameinlist 'Расчетно-платежная ведомость для малых сумм'
.Set Filler ='-'
.DEFO LANDSCAPE
.DEFP PA4
.p 72
.var
    InShap    : integer;
    SumList1  : double
    SumList2  : double
    SumList3  : double
    Count     : LongInt
    List      : Longint
.endvar
.begin InShap := 0    end.
.group '2_Первая группа'
.{ CommonForAllCicle CheckEnter
.fields
РукПред_Имя ГлавБух_Имя
НазвОрган
КодПодразделение
ЗаМесяц
Год
.endfields
.{ Shapka CheckEnter
                БРуководитель Б                     БГл.бухгалтер Б
                Борганизации Б                      Борганизации Б
          @~@@@@@@@@@@@@@@@@@@@@@@@      @~@@@@@@@@@@@@@@@@@@@@@@@

           БОрганизация :  Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{?internal;InShap=0

.begin InShap := InShap + 1 end.
.}
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                     БРАСЧЕТНО-ПЛАТЕЖНАЯ ВЕДОМОСТЬ No__ Б
                     Бза Б  @@@@@@@@@@  Бмесяц Б   @@@@   Бг. Б
.}
.begin
  SumList1 :=0;
  List     :=1;
end.
.{ NachBegEndWithTimeCicle CheckEnter
.{ PeopC1 CheckEnter
.[h
.fields
Шапка1_11 Шапка1_12 Шапка1_13 Шапка1_14 Шапка1_15 Шапка1_16 Шапка1_17 Шапка1_18 Шапка1_19 Шапка1_110
Шапка1_21 Шапка1_22 Шапка1_23 Шапка1_24 Шапка1_25 Шапка1_26 Шапка1_27 Шапка1_28 Шапка1_29 Шапка1_210
Шапка1_31 Шапка1_32 Шапка1_33 Шапка1_34 Шапка1_35 Шапка1_36 Шапка1_37 Шапка1_38 Шапка1_39 Шапка1_310
Шапка1_41 Шапка1_42 Шапка1_43 Шапка1_44 Шапка1_45 Шапка1_46 Шапка1_47 Шапка1_48 Шапка1_49 Шапка1_410
Шапка1_51 Шапка1_52 Шапка1_53 Шапка1_54 Шапка1_55 Шапка1_56 Шапка1_57 Шапка1_58 Шапка1_59 Шапка1_510
Шапка1_61 Шапка1_62 Шапка1_63 Шапка1_64 Шапка1_65 Шапка1_66 Шапка1_67 Шапка1_68 Шапка1_69 Шапка1_610
Шапка1_71 Шапка1_72 Шапка1_73 Шапка1_74 Шапка1_75 Шапка1_76 Шапка1_77 Шапка1_78 Шапка1_79 Шапка1_710
Шапка1_81 Шапка1_82 Шапка1_83 Шапка1_84 Шапка1_85 Шапка1_86 Шапка1_87 Шапка1_88 Шапка1_89 Шапка1_810
Шапка1_91 Шапка1_92 Шапка1_93 Шапка1_94 Шапка1_95 Шапка1_96 Шапка1_97 Шапка1_98 Шапка1_99 Шапка1_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп1 ТабНом1 ФИО1:'d:r' Дней1 Часов1 ВсегоДней1 ВсегоЧасов1
Долж1:'d:r' СуммаНач1 ВсегоНач1
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач1;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBET9;@@@│@@@@│.}@@@│@@@@│ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBET10;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBET11;───┬────┼.}───┬────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней1 ИтогоЧасов1 ВсегоИтогоДней1 ВсегоИтогоЧасов1
Итого1 ВсегоИтого1
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NBET12;@@@│@@@@│.}@@@│@@@@│ Ш
 Ш│   │          │                  │.{.?NBET13;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBET14;────────┴.}────────┘ Ш
^
.begin
  SumList1 :=0;
  List := 1;
end.
.}
.{ NachBegEndCicle CheckEnter
.{ PeopC2 CheckEnter
.[h
.fields
Шапка2_11 Шапка2_12 Шапка2_13 Шапка2_14 Шапка2_15 Шапка2_16 Шапка2_17 Шапка2_18 Шапка2_19 Шапка2_110
Шапка2_21 Шапка2_22 Шапка2_23 Шапка2_24 Шапка2_25 Шапка2_26 Шапка2_27 Шапка2_28 Шапка2_29 Шапка2_210
Шапка2_31 Шапка2_32 Шапка2_33 Шапка2_34 Шапка2_35 Шапка2_36 Шапка2_37 Шапка2_38 Шапка2_39 Шапка2_310
Шапка2_41 Шапка2_42 Шапка2_43 Шапка2_44 Шапка2_45 Шапка2_46 Шапка2_47 Шапка2_48 Шапка2_49 Шапка2_410
Шапка2_51 Шапка2_52 Шапка2_53 Шапка2_54 Шапка2_55 Шапка2_56 Шапка2_57 Шапка2_58 Шапка2_59 Шапка2_510
Шапка2_61 Шапка2_62 Шапка2_63 Шапка2_64 Шапка2_65 Шапка2_66 Шапка2_67 Шапка2_68 Шапка2_69 Шапка2_610
Шапка2_71 Шапка2_72 Шапка2_73 Шапка2_74 Шапка2_75 Шапка2_76 Шапка2_77 Шапка2_78 Шапка2_79 Шапка2_710
Шапка2_81 Шапка2_82 Шапка2_83 Шапка2_84 Шапка2_85 Шапка2_86 Шапка2_87 Шапка2_88 Шапка2_89 Шапка2_810
Шапка2_91 Шапка2_92 Шапка2_93 Шапка2_94 Шапка2_95 Шапка2_96 Шапка2_97 Шапка2_98 Шапка2_99 Шапка2_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп2 ТабНом2 ФИО2:'d:r'
Долж2:'d:r' СуммаНач2 ВсегоНач2
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач2;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBEWT9;        │.}        │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBEWT10;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBEWT11;────────┼.}────────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого2 ВсегоИтого2
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NBEWT12;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш│   │          │                  │.{.?NBEWT13;        │.}        │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBEWT14;────────┴.}────────┘ Ш
^
.begin
  SumList1 :=0;
  SumList2 :=0;
  List := 1;
end.
.}
.{ NeNachBegEndCicle CheckEnter








.{ PeopC103 CheckEnter
.[h
.fields
Шапка103_11 Шапка103_12 Шапка103_13 Шапка103_14 Шапка103_15 Шапка103_16 Шапка103_17 Шапка103_18 Шапка103_19 Шапка103_110
Шапка103_21 Шапка103_22 Шапка103_23 Шапка103_24 Шапка103_25 Шапка103_26 Шапка103_27 Шапка103_28 Шапка103_29 Шапка103_210
Шапка103_31 Шапка103_32 Шапка103_33 Шапка103_34 Шапка103_35 Шапка103_36 Шапка103_37 Шапка103_38 Шапка103_39 Шапка103_310
Шапка103_41 Шапка103_42 Шапка103_43 Шапка103_44 Шапка103_45 Шапка103_46 Шапка103_47 Шапка103_48 Шапка103_49 Шапка103_410
Шапка103_51 Шапка103_52 Шапка103_53 Шапка103_54 Шапка103_55 Шапка103_56 Шапка103_57 Шапка103_58 Шапка103_59 Шапка103_510
Шапка103_61 Шапка103_62 Шапка103_63 Шапка103_64 Шапка103_65 Шапка103_66 Шапка103_67 Шапка103_68 Шапка103_69 Шапка103_610
Шапка103_71 Шапка103_72 Шапка103_73 Шапка103_74 Шапка103_75 Шапка103_76 Шапка103_77 Шапка103_78 Шапка103_79 Шапка103_710
Шапка103_81 Шапка103_82 Шапка103_83 Шапка103_84 Шапка103_85 Шапка103_86 Шапка103_87 Шапка103_88 Шапка103_89 Шапка103_810
Шапка103_91 Шапка103_92 Шапка103_93 Шапка103_94 Шапка103_95 Шапка103_96 Шапка103_97 Шапка103_98 Шапка103_99 Шапка103_910
.endfields
 Ш^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^ Ш
.]h
.fields
Нпп103 ТабНом103 ФИО103:'d:r'
Долж103:'d:r' СуммаУдер103 ВсегоУдер103 СуммаНеНач103 СумКвыд103
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер103;
!  SumList2 := SumList2 + СумКвыд103;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUBEN9;        │.}        │        │        │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUBEN10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NUBEN11;────────┼.}────────┼────────┼────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:      удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List + 1;
!end.
!.]f
.}
.fields
Итого103 ВсегоИтого103 ИтогоСуммаНач103 ВсеКВыдаче103
ИтогоСтр103 ИтогоПоВед103
СтрГлавБух103
ИтогоПоВедПрпись103
ИтогоПоВедПрписьСтрока103
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NUBEN12;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш│   │          │                  │.{.?NUBEN13;        │.}        │        │        │               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NUBEN14;────────┴.}────────┴────────┴────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
!.}
.}
.{ NachUdBegEndCicle CheckEnter








.{ PeopC3 CheckEnter
.[h
.fields
Шапка3_11 Шапка3_12 Шапка3_13 Шапка3_14 Шапка3_15 Шапка3_16 Шапка3_17 Шапка3_18 Шапка3_19 Шапка3_110
Шапка3_21 Шапка3_22 Шапка3_23 Шапка3_24 Шапка3_25 Шапка3_26 Шапка3_27 Шапка3_28 Шапка3_29 Шапка3_210
Шапка3_31 Шапка3_32 Шапка3_33 Шапка3_34 Шапка3_35 Шапка3_36 Шапка3_37 Шапка3_38 Шапка3_39 Шапка3_310
Шапка3_41 Шапка3_42 Шапка3_43 Шапка3_44 Шапка3_45 Шапка3_46 Шапка3_47 Шапка3_48 Шапка3_49 Шапка3_410
Шапка3_51 Шапка3_52 Шапка3_53 Шапка3_54 Шапка3_55 Шапка3_56 Шапка3_57 Шапка3_58 Шапка3_59 Шапка3_510
Шапка3_61 Шапка3_62 Шапка3_63 Шапка3_64 Шапка3_65 Шапка3_66 Шапка3_67 Шапка3_68 Шапка3_69 Шапка3_610
Шапка3_71 Шапка3_72 Шапка3_73 Шапка3_74 Шапка3_75 Шапка3_76 Шапка3_77 Шапка3_78 Шапка3_79 Шапка3_710
Шапка3_81 Шапка3_82 Шапка3_83 Шапка3_84 Шапка3_85 Шапка3_86 Шапка3_87 Шапка3_88 Шапка3_89 Шапка3_810
Шапка3_91 Шапка3_92 Шапка3_93 Шапка3_94 Шапка3_95 Шапка3_96 Шапка3_97 Шапка3_98 Шапка3_99 Шапка3_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп3 ТабНом3 ФИО3:'d:r'
Долж3:'d:r' СуммаУдер3 ВсегоУдер3 СумКвыд3
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер3;
!  SumList2 := SumList2 + СумКвыд3;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUBEWT9;        │.}        │        │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUBEWT10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NUBEWT11;────────┼.}────────┤────────┼───────────────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:      удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List + 1;
!end.
!.]f
.}
.fields
Итого3 ВсегоИтого3 ВсеКВыдаче3
ИтогоСтр3 ИтогоПоВед3
СтрГлавБух3
ИтогоПоВедПрпись3
ИтогоПоВедПрписьСтрока3
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NUBEWT12;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш│   │          │                  │.{.?NUBEWT13;        │.}        │        │               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NUBEWT14;────────┴.}────────┴────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.{ NachBgWithTimeCicle CheckEnter
.{  PeopC4 CheckEnter
.[h
.fields
Шапка4_11 Шапка4_12 Шапка4_13 Шапка4_14 Шапка4_15 Шапка4_16 Шапка4_17 Шапка4_18 Шапка4_19 Шапка4_110
Шапка4_21 Шапка4_22 Шапка4_23 Шапка4_24 Шапка4_25 Шапка4_26 Шапка4_27 Шапка4_28 Шапка4_29 Шапка4_210
Шапка4_31 Шапка4_32 Шапка4_33 Шапка4_34 Шапка4_35 Шапка4_36 Шапка4_37 Шапка4_38 Шапка4_39 Шапка4_310
Шапка4_41 Шапка4_42 Шапка4_43 Шапка4_44 Шапка4_45 Шапка4_46 Шапка4_47 Шапка4_48 Шапка4_49 Шапка4_410
Шапка4_51 Шапка4_52 Шапка4_53 Шапка4_54 Шапка4_55 Шапка4_56 Шапка4_57 Шапка4_58 Шапка4_59 Шапка4_510
Шапка4_61 Шапка4_62 Шапка4_63 Шапка4_64 Шапка4_65 Шапка4_66 Шапка4_67 Шапка4_68 Шапка4_69 Шапка4_610
Шапка4_71 Шапка4_72 Шапка4_73 Шапка4_74 Шапка4_75 Шапка4_76 Шапка4_77 Шапка4_78 Шапка4_79 Шапка4_710
Шапка4_81 Шапка4_82 Шапка4_83 Шапка4_84 Шапка4_85 Шапка4_86 Шапка4_87 Шапка4_88 Шапка4_89 Шапка4_810
Шапка4_91 Шапка4_92 Шапка4_93 Шапка4_94 Шапка4_95 Шапка4_96 Шапка4_97 Шапка4_98 Шапка4_99 Шапка4_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп4 ТабНом4 ФИО4:'d:r' Дней4 Часов4
Долж4:'d:r' СуммаНач4
.endfields
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBT9;@@@│@@@@│.} Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBT10;@'~@@@@@│.} Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBT11;───┬────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
ИтогоДней4 ИтогоЧасов4
Итого4
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NBT12;@@@│@@@@│.} Ш
 Ш│   │          │                  │.{.?NBT13;@'~@@@@@│.} Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBT14;────────┴.} Ш
^
.}
.{NachUdBegCicle CheckEnter
.if NeedSpace








.end
.{ PeopC5 CheckEnter
.[h
.fields
Шапка5_11 Шапка5_12 Шапка5_13 Шапка5_14 Шапка5_15 Шапка5_16 Шапка5_17 Шапка5_18 Шапка5_19 Шапка5_110
Шапка5_21 Шапка5_22 Шапка5_23 Шапка5_24 Шапка5_25 Шапка5_26 Шапка5_27 Шапка5_28 Шапка5_29 Шапка5_210
Шапка5_31 Шапка5_32 Шапка5_33 Шапка5_34 Шапка5_35 Шапка5_36 Шапка5_37 Шапка5_38 Шапка5_39 Шапка5_310
Шапка5_41 Шапка5_42 Шапка5_43 Шапка5_44 Шапка5_45 Шапка5_46 Шапка5_47 Шапка5_48 Шапка5_49 Шапка5_410
Шапка5_51 Шапка5_52 Шапка5_53 Шапка5_54 Шапка5_55 Шапка5_56 Шапка5_57 Шапка5_58 Шапка5_59 Шапка5_510
Шапка5_61 Шапка5_62 Шапка5_63 Шапка5_64 Шапка5_65 Шапка5_66 Шапка5_67 Шапка5_68 Шапка5_69 Шапка5_610
Шапка5_71 Шапка5_72 Шапка5_73 Шапка5_74 Шапка5_75 Шапка5_76 Шапка5_77 Шапка5_78 Шапка5_79 Шапка5_710
Шапка5_81 Шапка5_82 Шапка5_83 Шапка5_84 Шапка5_85 Шапка5_86 Шапка5_87 Шапка5_88 Шапка5_89 Шапка5_810
Шапка5_91 Шапка5_92 Шапка5_93 Шапка5_94 Шапка5_95 Шапка5_96 Шапка5_97 Шапка5_98 Шапка5_99 Шапка5_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп5 ТабНом5 ФИО5:'d:r'
Долж5:'d:r' СуммаНач5
.endfields
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBWT9;        │.} Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBWT10;@'~@@@@@│.} Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBWT11;────────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
Итого5
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NBWT12;@'~@@@@@│.} Ш
 Ш│   │          │                  │.{.?NBWT13;        │.} Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBWT14;────────┴.} Ш
^
.}
.{ NachConWithTimeCicle CheckEnter
.{ PeopC6 CheckEnter
.[h
.fields
Шапка6_11 Шапка6_12 Шапка6_13 Шапка6_14 Шапка6_15 Шапка6_16 Шапка6_17 Шапка6_18 Шапка6_19 Шапка6_110
Шапка6_21 Шапка6_22 Шапка6_23 Шапка6_24 Шапка6_25 Шапка6_26 Шапка6_27 Шапка6_28 Шапка6_29 Шапка6_210
Шапка6_31 Шапка6_32 Шапка6_33 Шапка6_34 Шапка6_35 Шапка6_36 Шапка6_37 Шапка6_38 Шапка6_39 Шапка6_310
Шапка6_41 Шапка6_42 Шапка6_43 Шапка6_44 Шапка6_45 Шапка6_46 Шапка6_47 Шапка6_48 Шапка6_49 Шапка6_410
Шапка6_51 Шапка6_52 Шапка6_53 Шапка6_54 Шапка6_55 Шапка6_56 Шапка6_57 Шапка6_58 Шапка6_59 Шапка6_510
Шапка6_61 Шапка6_62 Шапка6_63 Шапка6_64 Шапка6_65 Шапка6_66 Шапка6_67 Шапка6_68 Шапка6_69 Шапка6_610
Шапка6_71 Шапка6_72 Шапка6_73 Шапка6_74 Шапка6_75 Шапка6_76 Шапка6_77 Шапка6_78 Шапка6_79 Шапка6_710
Шапка6_81 Шапка6_82 Шапка6_83 Шапка6_84 Шапка6_85 Шапка6_86 Шапка6_87 Шапка6_88 Шапка6_89 Шапка6_810
Шапка6_91 Шапка6_92 Шапка6_93 Шапка6_94 Шапка6_95 Шапка6_96 Шапка6_97 Шапка6_98 Шапка6_99 Шапка6_910
.endfields








 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Дней6 Часов6
СуммаНач6
.endfields
 Ш .{.?NCT9;@@@│@@@@│.} Ш
 Ш .{.?NCT10;@'~@@@@@│.} Ш
 Ш .{.?NCT11;───┬────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
ИтогоДней6 ИтогоЧасов6
Итого6
'true':'s'
.endfields
 Ш .{.?NCT12;@@@│@@@@│.} Ш
 Ш .{.?NCT13;@'~@@@@@│.} Ш
 Ш .{.?NCT14;────────┴.} Ш
^
.}
.{ NachUdConCicle CheckEnter
.{ PeopC7 CheckEnter
.[h
.fields
Шапка7_11 Шапка7_12 Шапка7_13 Шапка7_14 Шапка7_15 Шапка7_16 Шапка7_17 Шапка7_18 Шапка7_19 Шапка7_110
Шапка7_21 Шапка7_22 Шапка7_23 Шапка7_24 Шапка7_25 Шапка7_26 Шапка7_27 Шапка7_28 Шапка7_29 Шапка7_210
Шапка7_31 Шапка7_32 Шапка7_33 Шапка7_34 Шапка7_35 Шапка7_36 Шапка7_37 Шапка7_38 Шапка7_39 Шапка7_310
Шапка7_41 Шапка7_42 Шапка7_43 Шапка7_44 Шапка7_45 Шапка7_46 Шапка7_47 Шапка7_48 Шапка7_49 Шапка7_410
Шапка7_51 Шапка7_52 Шапка7_53 Шапка7_54 Шапка7_55 Шапка7_56 Шапка7_57 Шапка7_58 Шапка7_59 Шапка7_510
Шапка7_61 Шапка7_62 Шапка7_63 Шапка7_64 Шапка7_65 Шапка7_66 Шапка7_67 Шапка7_68 Шапка7_69 Шапка7_610
Шапка7_71 Шапка7_72 Шапка7_73 Шапка7_74 Шапка7_75 Шапка7_76 Шапка7_77 Шапка7_78 Шапка7_79 Шапка7_710
Шапка7_81 Шапка7_82 Шапка7_83 Шапка7_84 Шапка7_85 Шапка7_86 Шапка7_87 Шапка7_88 Шапка7_89 Шапка7_810
Шапка7_91 Шапка7_92 Шапка7_93 Шапка7_94 Шапка7_95 Шапка7_96 Шапка7_97 Шапка7_98 Шапка7_99 Шапка7_910
.endfields








 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ17
Символ27 СуммаНач7
Символ47
.endfields
 Ш@.{.?NUC9;        │.} Ш
 Ш@.{.?NUC10;@'~@@@@@│.} Ш
 Ш@.{.?NUC11;────────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
Итого7
'true':'s'
.endfields
 Ш .{.?NUC12;@'~@@@@@│.} Ш
 Ш .{.?NUC13;        │.} Ш
 Ш .{.?NUC14;────────┴.} Ш
^
.begin
  SumList1 :=0;
  SumList2 :=0;
  List := 1;
end.
.}
.{ LastUdColmsCircle CheckEnter








.{ PeopC8 CheckEnter
.[h
.fields
Шапка8_11 Шапка8_12 Шапка8_13 Шапка8_14 Шапка8_15 Шапка8_16 Шапка8_17 Шапка8_18 Шапка8_19 Шапка8_110
Шапка8_21 Шапка8_22 Шапка8_23 Шапка8_24 Шапка8_25 Шапка8_26 Шапка8_27 Шапка8_28 Шапка8_29 Шапка8_210
Шапка8_31 Шапка8_32 Шапка8_33 Шапка8_34 Шапка8_35 Шапка8_36 Шапка8_37 Шапка8_38 Шапка8_39 Шапка8_310
Шапка8_41 Шапка8_42 Шапка8_43 Шапка8_44 Шапка8_45 Шапка8_46 Шапка8_47 Шапка8_48 Шапка8_49 Шапка8_410
Шапка8_51 Шапка8_52 Шапка8_53 Шапка8_54 Шапка8_55 Шапка8_56 Шапка8_57 Шапка8_58 Шапка8_59 Шапка8_510
Шапка8_61 Шапка8_62 Шапка8_63 Шапка8_64 Шапка8_65 Шапка8_66 Шапка8_67 Шапка8_68 Шапка8_69 Шапка8_610
Шапка8_71 Шапка8_72 Шапка8_73 Шапка8_74 Шапка8_75 Шапка8_76 Шапка8_77 Шапка8_78 Шапка8_79 Шапка8_710
Шапка8_81 Шапка8_82 Шапка8_83 Шапка8_84 Шапка8_85 Шапка8_86 Шапка8_87 Шапка8_88 Шапка8_89 Шапка8_810
Шапка8_91 Шапка8_92 Шапка8_93 Шапка8_94 Шапка8_95 Шапка8_96 Шапка8_97 Шапка8_98 Шапка8_99 Шапка8_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ18
Символ28 СуммаНач8 ВсегоУдер8 СумКвыд8
Символ48
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер8;
!  SumList2 := SumList2 + СумКвыд8;
end.
 Ш@.{.?LUCC9;        │.}        │        │               │ Ш
 Ш@.{.?LUCC10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш@.{.?LUCC11;────────┼.}────────┤────────┼───────────────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@: удержано : &'#&&&&&&&&&&&&&.&&   к выдаче :  &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого8 ИтогоВсегоУдер8 ИтогоСумКвыд8
ИтогоСтр8 ИтогоПоВед8
СтрГлавБух8
ИтогоПоВедПрпись8
ИтогоПоВедПрписьСтрока8
'true':'s'
.endfields
 Ш .{.?LUCC12;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш .{.?LUCC13;        │.}        │        │               │ Ш
 Ш .{.?LUCC14;────────┴.}────────┴────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.begin
  SumList1 :=0;
  List := 1;
end.
.}
.{ LastNachTimeColmsCircle CheckEnter








.{ PeopC9 CheckEnter
.[h
.fields
Шапка9_11 Шапка9_12 Шапка9_13 Шапка9_14 Шапка9_15 Шапка9_16 Шапка9_17 Шапка9_18 Шапка9_19 Шапка9_110
Шапка9_21 Шапка9_22 Шапка9_23 Шапка9_24 Шапка9_25 Шапка9_26 Шапка9_27 Шапка9_28 Шапка9_29 Шапка9_210
Шапка9_31 Шапка9_32 Шапка9_33 Шапка9_34 Шапка9_35 Шапка9_36 Шапка9_37 Шапка9_38 Шапка9_39 Шапка9_310
Шапка9_41 Шапка9_42 Шапка9_43 Шапка9_44 Шапка9_45 Шапка9_46 Шапка9_47 Шапка9_48 Шапка9_49 Шапка9_410
Шапка9_51 Шапка9_52 Шапка9_53 Шапка9_54 Шапка9_55 Шапка9_56 Шапка9_57 Шапка9_58 Шапка9_59 Шапка9_510
Шапка9_61 Шапка9_62 Шапка9_63 Шапка9_64 Шапка9_65 Шапка9_66 Шапка9_67 Шапка9_68 Шапка9_69 Шапка9_610
Шапка9_71 Шапка9_72 Шапка9_73 Шапка9_74 Шапка9_75 Шапка9_76 Шапка9_77 Шапка9_78 Шапка9_79 Шапка9_710
Шапка9_81 Шапка9_82 Шапка9_83 Шапка9_84 Шапка9_85 Шапка9_86 Шапка9_87 Шапка9_88 Шапка9_89 Шапка9_810
Шапка9_91 Шапка9_92 Шапка9_93 Шапка9_94 Шапка9_95 Шапка9_96 Шапка9_97 Шапка9_98 Шапка9_99 Шапка9_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Дней9 Часов9 Дни9 Час9
СуммаНач9 ВсегоНач9
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач9;
end.
 Ш .{.?LNTCC9;@@@│@@@@│.}@@@│@@@@│ Ш
 Ш .{.?LNTCC10;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш .{.?LNTCC11;───┬────┼.}───┬────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней9 ИтогоЧасов9 ИтогоВсегоДни9 ИтогоВсегоЧас9
Итого9 ИтогоВсегоНач9
'true':'s'
.endfields
 Ш .{.?LNTCC12;@@@│@@@@│.}@@@│@@@@│ Ш
 Ш .{.?LNTCC13;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш .{.?LNTCC14;────────┴.}────────┘ Ш
^
.begin
  SumList1 :=0;
  List := 1;
end.
.}
.{ LastNachColmsCircle CheckEnter








.{ PeopC10 CheckEnter
.[h
.fields
Шапка10_11 Шапка10_12 Шапка10_13 Шапка10_14 Шапка10_15 Шапка10_16 Шапка10_17 Шапка10_18 Шапка10_19 Шапка10_110
Шапка10_21 Шапка10_22 Шапка10_23 Шапка10_24 Шапка10_25 Шапка10_26 Шапка10_27 Шапка10_28 Шапка10_29 Шапка10_210
Шапка10_31 Шапка10_32 Шапка10_33 Шапка10_34 Шапка10_35 Шапка10_36 Шапка10_37 Шапка10_38 Шапка10_39 Шапка10_310
Шапка10_41 Шапка10_42 Шапка10_43 Шапка10_44 Шапка10_45 Шапка10_46 Шапка10_47 Шапка10_48 Шапка10_49 Шапка10_410
Шапка10_51 Шапка10_52 Шапка10_53 Шапка10_54 Шапка10_55 Шапка10_56 Шапка10_57 Шапка10_58 Шапка10_59 Шапка10_510
Шапка10_61 Шапка10_62 Шапка10_63 Шапка10_64 Шапка10_65 Шапка10_66 Шапка10_67 Шапка10_68 Шапка10_69 Шапка10_610
Шапка10_71 Шапка10_72 Шапка10_73 Шапка10_74 Шапка10_75 Шапка10_76 Шапка10_77 Шапка10_78 Шапка10_79 Шапка10_710
Шапка10_81 Шапка10_82 Шапка10_83 Шапка10_84 Шапка10_85 Шапка10_86 Шапка10_87 Шапка10_88 Шапка10_89 Шапка10_810
Шапка10_91 Шапка10_92 Шапка10_93 Шапка10_94 Шапка10_95 Шапка10_96 Шапка10_97 Шапка10_98 Шапка10_99 Шапка10_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ110
Символ210 СуммаНач10 ВсегоНач10
Символ410
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач10;
end.
 Ш@.{.?LNCC9;        │.}        │ Ш
 Ш@.{.?LNCC10;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш@.{.?LNCC11;────────┼.}────────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Щ Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого10 ИтогоВсегоУдер10
'true':'s'
.endfields
 Ш .{.?LNCC12;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш .{.?LNCC13;        │.}        │ Ш
 Ш .{.?LNCC14;────────┴.}────────┘ Ш
^
.begin
  SumList1 :=0;
  SumList2 :=0;
  SumList3 :=0;
  List := 1;
end.
.}
.{ LastNeNachCC CheckEnter
.{ PeopC105 CheckEnter
.[h
.fields
Шапка105_11 Шапка105_12 Шапка105_13 Шапка105_14 Шапка105_15 Шапка105_16 Шапка105_17 Шапка105_18 Шапка105_19 Шапка105_110
Шапка105_21 Шапка105_22 Шапка105_23 Шапка105_24 Шапка105_25 Шапка105_26 Шапка105_27 Шапка105_28 Шапка105_29 Шапка105_210
Шапка105_31 Шапка105_32 Шапка105_33 Шапка105_34 Шапка105_35 Шапка105_36 Шапка105_37 Шапка105_38 Шапка105_39 Шапка105_310
Шапка105_41 Шапка105_42 Шапка105_43 Шапка105_44 Шапка105_45 Шапка105_46 Шапка105_47 Шапка105_48 Шапка105_49 Шапка105_410
Шапка105_51 Шапка105_52 Шапка105_53 Шапка105_54 Шапка105_55 Шапка105_56 Шапка105_57 Шапка105_58 Шапка105_59 Шапка105_510
Шапка105_61 Шапка105_62 Шапка105_63 Шапка105_64 Шапка105_65 Шапка105_66 Шапка105_67 Шапка105_68 Шапка105_69 Шапка105_610
Шапка105_71 Шапка105_72 Шапка105_73 Шапка105_74 Шапка105_75 Шапка105_76 Шапка105_77 Шапка105_78 Шапка105_79 Шапка105_710
Шапка105_81 Шапка105_82 Шапка105_83 Шапка105_84 Шапка105_85 Шапка105_86 Шапка105_87 Шапка105_88 Шапка105_89 Шапка105_810
Шапка105_91 Шапка105_92 Шапка105_93 Шапка105_94 Шапка105_95 Шапка105_96 Шапка105_97 Шапка105_98 Шапка105_99 Шапка105_910
.endfields








 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ105_18
Символ105_28 СуммаНач105 ВсегоУдер105 ВсегоНенач105 СумКвыд105
Символ105_48
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер8;
!  SumList2 := SumList2 + СумКвыд8;
end.
 Ш@.{.?LUNC9;        │.}        │        │        │               │ Ш
 Ш@.{.?LUNC10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш@.{.?LUNC11;────────┼.}────────┤────────┼────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@: удержано : &'#&&&&&&&&&&&&&.&&   к выдаче :  &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого105 ИтогоВсегоУдер105 ИтогоНенач105 ИтогоСумКвыд105
ИтогоСтр105 ИтогоПоВед105
СтрГлавБух105
ИтогоПоВедПрпись105
ИтогоПоВедПрписьСтрока105
'true':'s'
.endfields
 Ш .{.?LUNC12;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш .{.?LUNC13;        │.}        │        │        │               │ Ш
 Ш .{.?LUNC14;────────┴.}────────┴────────┴────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.begin
  SumList1 :=0;
  List := 1;
end.
.{ NachUdWithTimeCicle CheckEnter
.{ PeopC11 CheckEnter
.[h
.fields
Шапка11_11 Шапка11_12 Шапка11_13 Шапка11_14 Шапка11_15 Шапка11_16 Шапка11_17 Шапка11_18 Шапка11_19 Шапка11_110
Шапка11_21 Шапка11_22 Шапка11_23 Шапка11_24 Шапка11_25 Шапка11_26 Шапка11_27 Шапка11_28 Шапка11_29 Шапка11_210
Шапка11_31 Шапка11_32 Шапка11_33 Шапка11_34 Шапка11_35 Шапка11_36 Шапка11_37 Шапка11_38 Шапка11_39 Шапка11_310
Шапка11_41 Шапка11_42 Шапка11_43 Шапка11_44 Шапка11_45 Шапка11_46 Шапка11_47 Шапка11_48 Шапка11_49 Шапка11_410
Шапка11_51 Шапка11_52 Шапка11_53 Шапка11_54 Шапка11_55 Шапка11_56 Шапка11_57 Шапка11_58 Шапка11_59 Шапка11_510
Шапка11_61 Шапка11_62 Шапка11_63 Шапка11_64 Шапка11_65 Шапка11_66 Шапка11_67 Шапка11_68 Шапка11_69 Шапка11_610
Шапка11_71 Шапка11_72 Шапка11_73 Шапка11_74 Шапка11_75 Шапка11_76 Шапка11_77 Шапка11_78 Шапка11_79 Шапка11_710
Шапка11_81 Шапка11_82 Шапка11_83 Шапка11_84 Шапка11_85 Шапка11_86 Шапка11_87 Шапка11_88 Шапка11_89 Шапка11_810
Шапка11_91 Шапка11_92 Шапка11_93 Шапка11_94 Шапка11_95 Шапка11_96 Шапка11_97 Шапка11_98 Шапка11_99 Шапка11_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп11 ТабНом11 ФИО11:'d:r' Дней11 Часов11 ВсегоДней11 ВсегоЧасов11
Долж11:'d:r' СуммаНач11 ВсегоНач11 СуммаУд11 ВсегоУд11 СумКВыдаче11
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач11;
!  SumList2 := SumList2 + ВсегоУд11;
!  SumList3 := SumList3 + СумКВыдаче11;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNUWT9;@@@│@@@@│.}@@@│@@@@│.{.?NUUWT9;        │.}        │        │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNUWT10;@'~@@@@@│.}@'~@@@@@│.{.?NUUWT10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NNUWT11;───┬────┼.}───┬────┼.{.?NUUWT11;────────┼.}────────┤────────┼───────────────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш----------------------------------------------------------------------------------------------------------------
! Щ Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&
! Ш----------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней11 ИтогоЧасов11 ВсегоИтогоДней11 ВсегоИтогоЧасов11
ИтогоНач11 ВсегоИтогоНач11 ИтогоУд11 ВсегоИтогоУд11 ИтогоКВыдаче11
ИтогоСтр11 ИтогоПоВед11
СтрГлавБух11
ИтогоПоВедПрпись11
ИтогоПоВедПрписьСтрока11
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NNUWT12;@@@│@@@@│.}@@@│@@@@│.{.?NUUWT12;        │.}        │        │               │ Ш
 Ш│   │          │                  │.{.?NNUWT13;@'~@@@@@│.}@'~@@@@@│.{.?NUUWT13;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NNUWT14;────────┴.}────────┴.{.?NUUWT14;────────┴.}────────┴────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.begin
  SumList1 :=0;
  SumList2 := 0;
  SumList3 := 0;
  List := 1;
end.
.}
.{ NNachUdWithTimeCicle CheckEnter
.{ PeopC111 CheckEnter
.[h
.fields
Шапка111_11 Шапка111_12 Шапка111_13 Шапка111_14 Шапка111_15 Шапка111_16 Шапка111_17 Шапка111_18 Шапка111_19 Шапка111_110
Шапка111_21 Шапка111_22 Шапка111_23 Шапка111_24 Шапка111_25 Шапка111_26 Шапка111_27 Шапка111_28 Шапка111_29 Шапка111_210
Шапка111_31 Шапка111_32 Шапка111_33 Шапка111_34 Шапка111_35 Шапка111_36 Шапка111_37 Шапка111_38 Шапка111_39 Шапка111_310
Шапка111_41 Шапка111_42 Шапка111_43 Шапка111_44 Шапка111_45 Шапка111_46 Шапка111_47 Шапка111_48 Шапка111_49 Шапка111_410
Шапка111_51 Шапка111_52 Шапка111_53 Шапка111_54 Шапка111_55 Шапка111_56 Шапка111_57 Шапка111_58 Шапка111_59 Шапка111_510
Шапка111_61 Шапка111_62 Шапка111_63 Шапка111_64 Шапка111_65 Шапка111_66 Шапка111_67 Шапка111_68 Шапка111_69 Шапка111_610
Шапка111_71 Шапка111_72 Шапка111_73 Шапка111_74 Шапка111_75 Шапка111_76 Шапка111_77 Шапка111_78 Шапка111_79 Шапка111_710
Шапка111_81 Шапка111_82 Шапка111_83 Шапка111_84 Шапка111_85 Шапка111_86 Шапка111_87 Шапка111_88 Шапка111_89 Шапка111_810
Шапка111_91 Шапка111_92 Шапка111_93 Шапка111_94 Шапка111_95 Шапка111_96 Шапка111_97 Шапка111_98 Шапка111_99 Шапка111_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп111 ТабНом111 ФИО111:'d:r' Дней111 Часов111 ВсегоДней111 ВсегоЧасов111
Долж111:'d:r' СуммаНач111 ВсегоНач111 СуммаУд111 ВсегоУд111 ВсегоНеНач111 СумКВыдаче111
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач111;
!  SumList2 := SumList2 + ВсегоУд111;
!  SumList3 := SumList3 + СумКВыдаче111;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUN9;@@@│@@@@│.}@@@│@@@@│.{.?UUN9;        │.}        │        │        │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUN10;@'~@@@@@│.}@'~@@@@@│.{.?UUN10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NUN11;───┬────┼.}───┬────┼.{.?UUN11;────────┼.}────────┼────────┼────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!     SumList3 := Round(SumList3);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш---------------------------------------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней111 ИтогоЧасов111 ВсегоИтогоДней111 ВсегоИтогоЧасов111
ИтогоНач111 ВсегоИтогоНач111 ИтогоУд111 ВсегоИтогоУд111 ИтогоНеНач111 ИтогоКВыдаче111
ИтогоСтр111 ИтогоПоВед111
СтрГлавБух111
ИтогоПоВедПрпись111
ИтогоПоВедПрписьСтрока111
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NUN12;@@@│@@@@│.}@@@│@@@@│.{.?UUN12;        │.}        │        │        │               │ Ш
 Ш│   │          │                  │.{.?NUN13;@'~@@@@@│.}@'~@@@@@│.{.?UUN13;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NUN14;────────┴.}────────┴.{.?UUN14;────────┴.}────────┴────────┴────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.begin
  SumList1 :=0;
  SumList2 := 0;
  SumList3 := 0;
  List := 1;
end.
.{ NachUdCicle CheckEnter
.{ PeopC12 CheckEnter
.[h
.fields
Шапка12_11 Шапка12_12 Шапка12_13 Шапка12_14 Шапка12_15 Шапка12_16 Шапка12_17 Шапка12_18 Шапка12_19 Шапка12_110
Шапка12_21 Шапка12_22 Шапка12_23 Шапка12_24 Шапка12_25 Шапка12_26 Шапка12_27 Шапка12_28 Шапка12_29 Шапка12_210
Шапка12_31 Шапка12_32 Шапка12_33 Шапка12_34 Шапка12_35 Шапка12_36 Шапка12_37 Шапка12_38 Шапка12_39 Шапка12_310
Шапка12_41 Шапка12_42 Шапка12_43 Шапка12_44 Шапка12_45 Шапка12_46 Шапка12_47 Шапка12_48 Шапка12_49 Шапка12_410
Шапка12_51 Шапка12_52 Шапка12_53 Шапка12_54 Шапка12_55 Шапка12_56 Шапка12_57 Шапка12_58 Шапка12_59 Шапка12_510
Шапка12_61 Шапка12_62 Шапка12_63 Шапка12_64 Шапка12_65 Шапка12_66 Шапка12_67 Шапка12_68 Шапка12_69 Шапка12_610
Шапка12_71 Шапка12_72 Шапка12_73 Шапка12_74 Шапка12_75 Шапка12_76 Шапка12_77 Шапка12_78 Шапка12_79 Шапка12_710
Шапка12_81 Шапка12_82 Шапка12_83 Шапка12_84 Шапка12_85 Шапка12_86 Шапка12_87 Шапка12_88 Шапка12_89 Шапка12_810
Шапка12_91 Шапка12_92 Шапка12_93 Шапка12_94 Шапка12_95 Шапка12_96 Шапка12_97 Шапка12_98 Шапка12_99 Шапка12_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп12 ТабНом12 ФИО12:'d:r'
Долж12:'d:r' СуммаНач12 ВсегоНач12 СуммаУд12 ВсегоУд12 СумКВыдаче12
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач12;
!  SumList2 := SumList2 + ВсегоУд12;
!  SumList3 := SumList3 + СумКВыдаче12;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNU9;        │.}        │.{.?NUU9;        │.}        │        │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNU10;@'~@@@@@│.}@'~@@@@@│.{.?NUU10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NNU11;────────┼.}────────┼.{.?NUU11;────────┼.}────────┤────────┼───────────────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш----------------------------------------------------------------------------------------------------------------
! Щ Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&
! Ш----------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоНач12 ВсегоИтогоНач12 ИтогоУд12 ВсегоИтогоУд12 ИтогоКВыдаче12
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NNU12;        │.}        │.{.?NUU12;        │.}        │        │               │ Ш
 Ш│   │          │                  │.{.?NNU13;@'~@@@@@│.}@'~@@@@@│.{.?NUU13;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NNU14;────────┴.}────────┴.{.?NUU14;────────┴.}────────┴────────┴───────────────┘ Ш
.fields
ИтогоСтр12 ИтогоПоВед12
СтрГлавБух12
ИтогоПоВедПрпись12
ИтогоПоВедПрписьСтрока12
'true':'s'
.endfields
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.{ NNachUdCicle CheckEnter
.{ PeopC112 CheckEnter
.[h
.fields
Шапка112_11 Шапка112_12 Шапка112_13 Шапка112_14 Шапка112_15 Шапка112_16 Шапка112_17 Шапка112_18 Шапка112_19 Шапка112_110
Шапка112_21 Шапка112_22 Шапка112_23 Шапка112_24 Шапка112_25 Шапка112_26 Шапка112_27 Шапка112_28 Шапка112_29 Шапка112_210
Шапка112_31 Шапка112_32 Шапка112_33 Шапка112_34 Шапка112_35 Шапка112_36 Шапка112_37 Шапка112_38 Шапка112_39 Шапка112_310
Шапка112_41 Шапка112_42 Шапка112_43 Шапка112_44 Шапка112_45 Шапка112_46 Шапка112_47 Шапка112_48 Шапка112_49 Шапка112_410
Шапка112_51 Шапка112_52 Шапка112_53 Шапка112_54 Шапка112_55 Шапка112_56 Шапка112_57 Шапка112_58 Шапка112_59 Шапка112_510
Шапка112_61 Шапка112_62 Шапка112_63 Шапка112_64 Шапка112_65 Шапка112_66 Шапка112_67 Шапка112_68 Шапка112_69 Шапка112_610
Шапка112_71 Шапка112_72 Шапка112_73 Шапка112_74 Шапка112_75 Шапка112_76 Шапка112_77 Шапка112_78 Шапка112_79 Шапка112_710
Шапка112_81 Шапка112_82 Шапка112_83 Шапка112_84 Шапка112_85 Шапка112_86 Шапка112_87 Шапка112_88 Шапка112_89 Шапка112_810
Шапка112_91 Шапка112_92 Шапка112_93 Шапка112_94 Шапка112_95 Шапка112_96 Шапка112_97 Шапка112_98 Шапка112_99 Шапка112_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп112 ТабНом112 ФИО112:'d:r'
Долж112:'d:r' СуммаНач112 ВсегоНач112 СуммаУд112 ВсегоУд112 ВсегоНеНач112 СумКВыдаче112
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач112;
!  SumList2 := SumList2 + ВсегоУд112;
!  SumList3 := SumList3 + СумКВыдаче112;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNUN9;        │.}        │.{.?UNUN9;        │.}        │        │        │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNUN10;@'~@@@@@│.}@'~@@@@@│.{.?UNUN10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NNUN11;────────┼.}────────┼.{.?UNUN11;────────┼.}────────┤────────┤────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!     SumList3 := Round(SumList3);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш---------------------------------------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоНач112 ВсегоИтогоНач112 ИтогоУд112 ВсегоИтогоУд112 ИтогоНеНач112 ИтогоКВыдаче112
ИтогоСтр112 ИтогоПоВед112
СтрГлавБух112
ИтогоПоВедПрпись112
ИтогоПоВедПрписьСтрока112
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NNUN12;        │.}        │.{.?UNUN12;        │.}        │        │        │               │ Ш
 Ш│   │          │                  │.{.?NNUN13;@'~@@@@@│.}@'~@@@@@│.{.?UNUN13;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NNUN14;────────┴.}────────┴.{.?UNUN14;────────┴.}────────┴────────┴────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.}
.fields
ИтогоВедомость
.endfields
 СИТОГО ВЫПЛАЧЕНО: Б @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Р
 И( сумма к выдаче прописью) И
.endform
!
!
.linkform 'RPVedGor_SMALL_L12' prototype is 'RPVedGor'
.nameinlist 'Расчетно-платежная ведомость для малых сумм'
.Set Filler ='-'
.DEFO LANDSCAPE
.DEFP PA4
.p 72
.var
     InShap    : integer;
     SumList1  : double
     SumList2  : double
     SumList3  : double
     Count     : LongInt
     List      : Longint
     SSS       : string;
 .endvar
.Set Dot '-'
.group '2_Вторая группа'
.{ CommonForAllCicle CheckEnter
.fields
РукПред_Имя ГлавБух_Имя
НазвОрган
КодПодразделение
ЗаМесяц
Год
.endfields
.{ Shapka CheckEnter
                БРуководитель Б                     БГл.бухгалтер Б
                Борганизации Б                      Борганизации Б
          @~@@@@@@@@@@@@@@@@@@@@@@@      @~@@@@@@@@@@@@@@@@@@@@@@@

           БОрганизация :  Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{?internal;InShap=0

.begin InShap := InShap + 1 end.
.}
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                     БРАСЧЕТНО-ПЛАТЕЖНАЯ ВЕДОМОСТЬ No__ Б
                     Бза Б  @@@@@@@@@@  Бмесяц Б   @@@@   Бг. Б
.}
.begin
  SumList1 :=0;
  List     :=1;
end.
.{ NachBegEndWithTimeCicle CheckEnter
.{ PeopC1 CheckEnter
.[h
.fields
Шапка1_11 Шапка1_12 Шапка1_13 Шапка1_14 Шапка1_15 Шапка1_16 Шапка1_17 Шапка1_18 Шапка1_19 Шапка1_110
Шапка1_21 Шапка1_22 Шапка1_23 Шапка1_24 Шапка1_25 Шапка1_26 Шапка1_27 Шапка1_28 Шапка1_29 Шапка1_210
Шапка1_31 Шапка1_32 Шапка1_33 Шапка1_34 Шапка1_35 Шапка1_36 Шапка1_37 Шапка1_38 Шапка1_39 Шапка1_310
Шапка1_41 Шапка1_42 Шапка1_43 Шапка1_44 Шапка1_45 Шапка1_46 Шапка1_47 Шапка1_48 Шапка1_49 Шапка1_410
Шапка1_51 Шапка1_52 Шапка1_53 Шапка1_54 Шапка1_55 Шапка1_56 Шапка1_57 Шапка1_58 Шапка1_59 Шапка1_510
Шапка1_61 Шапка1_62 Шапка1_63 Шапка1_64 Шапка1_65 Шапка1_66 Шапка1_67 Шапка1_68 Шапка1_69 Шапка1_610
Шапка1_71 Шапка1_72 Шапка1_73 Шапка1_74 Шапка1_75 Шапка1_76 Шапка1_77 Шапка1_78 Шапка1_79 Шапка1_710
Шапка1_81 Шапка1_82 Шапка1_83 Шапка1_84 Шапка1_85 Шапка1_86 Шапка1_87 Шапка1_88 Шапка1_89 Шапка1_810
Шапка1_91 Шапка1_92 Шапка1_93 Шапка1_94 Шапка1_95 Шапка1_96 Шапка1_97 Шапка1_98 Шапка1_99 Шапка1_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп1 ТабНом1 ФИО1:'d:r' Дней1 Часов1 ВсегоДней1 ВсегоЧасов1
Долж1:'d:r' СуммаНач1 ВсегоНач1
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач1;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBET9;@@@│@@@@│.}@@@│@@@@│ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBET10;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBET11;───┬────┼.}───┬────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней1 ИтогоЧасов1 ВсегоИтогоДней1 ВсегоИтогоЧасов1
Итого1 ВсегоИтого1
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NBET12;@@@│@@@@│.}@@@│@@@@│ Ш
 Ш│   │          │                  │.{.?NBET13;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBET14;────────┴.}────────┘ Ш
^
.begin
  SumList1 :=0;
  List := 1;
end.
.}
.{ NachBegEndCicle CheckEnter
.{ PeopC2 CheckEnter
.[h
.fields
Шапка2_11 Шапка2_12 Шапка2_13 Шапка2_14 Шапка2_15 Шапка2_16 Шапка2_17 Шапка2_18 Шапка2_19 Шапка2_110
Шапка2_21 Шапка2_22 Шапка2_23 Шапка2_24 Шапка2_25 Шапка2_26 Шапка2_27 Шапка2_28 Шапка2_29 Шапка2_210
Шапка2_31 Шапка2_32 Шапка2_33 Шапка2_34 Шапка2_35 Шапка2_36 Шапка2_37 Шапка2_38 Шапка2_39 Шапка2_310
Шапка2_41 Шапка2_42 Шапка2_43 Шапка2_44 Шапка2_45 Шапка2_46 Шапка2_47 Шапка2_48 Шапка2_49 Шапка2_410
Шапка2_51 Шапка2_52 Шапка2_53 Шапка2_54 Шапка2_55 Шапка2_56 Шапка2_57 Шапка2_58 Шапка2_59 Шапка2_510
Шапка2_61 Шапка2_62 Шапка2_63 Шапка2_64 Шапка2_65 Шапка2_66 Шапка2_67 Шапка2_68 Шапка2_69 Шапка2_610
Шапка2_71 Шапка2_72 Шапка2_73 Шапка2_74 Шапка2_75 Шапка2_76 Шапка2_77 Шапка2_78 Шапка2_79 Шапка2_710
Шапка2_81 Шапка2_82 Шапка2_83 Шапка2_84 Шапка2_85 Шапка2_86 Шапка2_87 Шапка2_88 Шапка2_89 Шапка2_810
Шапка2_91 Шапка2_92 Шапка2_93 Шапка2_94 Шапка2_95 Шапка2_96 Шапка2_97 Шапка2_98 Шапка2_99 Шапка2_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп2 ТабНом2 ФИО2:'d:r'
Долж2:'d:r' СуммаНач2 ВсегоНач2
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач2;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBEWT9;        │.}        │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBEWT10;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBEWT11;────────┼.}────────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого2 ВсегоИтого2
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NBEWT12;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш│   │          │                  │.{.?NBEWT13;        │.}        │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBEWT14;────────┴.}────────┘ Ш
^
.begin
  SumList1 :=0;
  SumList2 :=0;
  List := 1;
end.
.}
.{ NeNachBegEndCicle CheckEnter








.{ PeopC103 CheckEnter
.[h
.fields
Шапка103_11 Шапка103_12 Шапка103_13 Шапка103_14 Шапка103_15 Шапка103_16 Шапка103_17 Шапка103_18 Шапка103_19 Шапка103_110
Шапка103_21 Шапка103_22 Шапка103_23 Шапка103_24 Шапка103_25 Шапка103_26 Шапка103_27 Шапка103_28 Шапка103_29 Шапка103_210
Шапка103_31 Шапка103_32 Шапка103_33 Шапка103_34 Шапка103_35 Шапка103_36 Шапка103_37 Шапка103_38 Шапка103_39 Шапка103_310
Шапка103_41 Шапка103_42 Шапка103_43 Шапка103_44 Шапка103_45 Шапка103_46 Шапка103_47 Шапка103_48 Шапка103_49 Шапка103_410
Шапка103_51 Шапка103_52 Шапка103_53 Шапка103_54 Шапка103_55 Шапка103_56 Шапка103_57 Шапка103_58 Шапка103_59 Шапка103_510
Шапка103_61 Шапка103_62 Шапка103_63 Шапка103_64 Шапка103_65 Шапка103_66 Шапка103_67 Шапка103_68 Шапка103_69 Шапка103_610
Шапка103_71 Шапка103_72 Шапка103_73 Шапка103_74 Шапка103_75 Шапка103_76 Шапка103_77 Шапка103_78 Шапка103_79 Шапка103_710
Шапка103_81 Шапка103_82 Шапка103_83 Шапка103_84 Шапка103_85 Шапка103_86 Шапка103_87 Шапка103_88 Шапка103_89 Шапка103_810
Шапка103_91 Шапка103_92 Шапка103_93 Шапка103_94 Шапка103_95 Шапка103_96 Шапка103_97 Шапка103_98 Шапка103_99 Шапка103_910
.endfields
 Ш^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^ Ш
.]h
.fields
Нпп103 ТабНом103 ФИО103:'d:r'
Долж103:'d:r' СуммаУдер103 ВсегоУдер103 СуммаНеНач103 СумКвыд103
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер103;
!  SumList2 := SumList2 + СумКвыд103;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUBEN9;        │.}        │        │        │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUBEN10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NUBEN11;────────┼.}────────┼────────┼────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:      удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List + 1;
!end.
!.]f
.}
.fields
Итого103 ВсегоИтого103 ИтогоСуммаНач103 ВсеКВыдаче103
ИтогоСтр103 ИтогоПоВед103
СтрГлавБух103
ИтогоПоВедПрпись103
ИтогоПоВедПрписьСтрока103
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NUBEN12;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш│   │          │                  │.{.?NUBEN13;        │.}        │        │        │               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NUBEN14;────────┴.}────────┴────────┴────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
!.}
.}
.{ NachUdBegEndCicle CheckEnter








.{ PeopC3 CheckEnter
.[h
.fields
Шапка3_11 Шапка3_12 Шапка3_13 Шапка3_14 Шапка3_15 Шапка3_16 Шапка3_17 Шапка3_18 Шапка3_19 Шапка3_110
Шапка3_21 Шапка3_22 Шапка3_23 Шапка3_24 Шапка3_25 Шапка3_26 Шапка3_27 Шапка3_28 Шапка3_29 Шапка3_210
Шапка3_31 Шапка3_32 Шапка3_33 Шапка3_34 Шапка3_35 Шапка3_36 Шапка3_37 Шапка3_38 Шапка3_39 Шапка3_310
Шапка3_41 Шапка3_42 Шапка3_43 Шапка3_44 Шапка3_45 Шапка3_46 Шапка3_47 Шапка3_48 Шапка3_49 Шапка3_410
Шапка3_51 Шапка3_52 Шапка3_53 Шапка3_54 Шапка3_55 Шапка3_56 Шапка3_57 Шапка3_58 Шапка3_59 Шапка3_510
Шапка3_61 Шапка3_62 Шапка3_63 Шапка3_64 Шапка3_65 Шапка3_66 Шапка3_67 Шапка3_68 Шапка3_69 Шапка3_610
Шапка3_71 Шапка3_72 Шапка3_73 Шапка3_74 Шапка3_75 Шапка3_76 Шапка3_77 Шапка3_78 Шапка3_79 Шапка3_710
Шапка3_81 Шапка3_82 Шапка3_83 Шапка3_84 Шапка3_85 Шапка3_86 Шапка3_87 Шапка3_88 Шапка3_89 Шапка3_810
Шапка3_91 Шапка3_92 Шапка3_93 Шапка3_94 Шапка3_95 Шапка3_96 Шапка3_97 Шапка3_98 Шапка3_99 Шапка3_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп3 ТабНом3 ФИО3:'d:r'
Долж3:'d:r' СуммаУдер3 ВсегоУдер3 СумКвыд3
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер3;
!  SumList2 := SumList2 + СумКвыд3;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUBEWT9;        │.}        │        │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUBEWT10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NUBEWT11;────────┼.}────────┤────────┼───────────────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:      удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List + 1;
!end.
!.]f
.}
.fields
Итого3 ВсегоИтого3 ВсеКВыдаче3
ИтогоСтр3 ИтогоПоВед3
СтрГлавБух3
ИтогоПоВедПрпись3
ИтогоПоВедПрписьСтрока3
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NUBEWT12;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш│   │          │                  │.{.?NUBEWT13;        │.}        │        │               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NUBEWT14;────────┴.}────────┴────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.{ NachBgWithTimeCicle CheckEnter
.{  PeopC4 CheckEnter
.[h
.fields
Шапка4_11 Шапка4_12 Шапка4_13 Шапка4_14 Шапка4_15 Шапка4_16 Шапка4_17 Шапка4_18 Шапка4_19 Шапка4_110
Шапка4_21 Шапка4_22 Шапка4_23 Шапка4_24 Шапка4_25 Шапка4_26 Шапка4_27 Шапка4_28 Шапка4_29 Шапка4_210
Шапка4_31 Шапка4_32 Шапка4_33 Шапка4_34 Шапка4_35 Шапка4_36 Шапка4_37 Шапка4_38 Шапка4_39 Шапка4_310
Шапка4_41 Шапка4_42 Шапка4_43 Шапка4_44 Шапка4_45 Шапка4_46 Шапка4_47 Шапка4_48 Шапка4_49 Шапка4_410
Шапка4_51 Шапка4_52 Шапка4_53 Шапка4_54 Шапка4_55 Шапка4_56 Шапка4_57 Шапка4_58 Шапка4_59 Шапка4_510
Шапка4_61 Шапка4_62 Шапка4_63 Шапка4_64 Шапка4_65 Шапка4_66 Шапка4_67 Шапка4_68 Шапка4_69 Шапка4_610
Шапка4_71 Шапка4_72 Шапка4_73 Шапка4_74 Шапка4_75 Шапка4_76 Шапка4_77 Шапка4_78 Шапка4_79 Шапка4_710
Шапка4_81 Шапка4_82 Шапка4_83 Шапка4_84 Шапка4_85 Шапка4_86 Шапка4_87 Шапка4_88 Шапка4_89 Шапка4_810
Шапка4_91 Шапка4_92 Шапка4_93 Шапка4_94 Шапка4_95 Шапка4_96 Шапка4_97 Шапка4_98 Шапка4_99 Шапка4_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп4 ТабНом4 ФИО4:'d:r' Дней4 Часов4
Долж4:'d:r' СуммаНач4
.endfields
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBT9;@@@│@@@@│.} Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBT10;@'~@@@@@│.} Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBT11;───┬────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
ИтогоДней4 ИтогоЧасов4
Итого4
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NBT12;@@@│@@@@│.} Ш
 Ш│   │          │                  │.{.?NBT13;@'~@@@@@│.} Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBT14;────────┴.} Ш
^
.}
.{NachUdBegCicle CheckEnter
.if NeedSpace








.end
.{ PeopC5 CheckEnter
.[h
.fields
Шапка5_11 Шапка5_12 Шапка5_13 Шапка5_14 Шапка5_15 Шапка5_16 Шапка5_17 Шапка5_18 Шапка5_19 Шапка5_110
Шапка5_21 Шапка5_22 Шапка5_23 Шапка5_24 Шапка5_25 Шапка5_26 Шапка5_27 Шапка5_28 Шапка5_29 Шапка5_210
Шапка5_31 Шапка5_32 Шапка5_33 Шапка5_34 Шапка5_35 Шапка5_36 Шапка5_37 Шапка5_38 Шапка5_39 Шапка5_310
Шапка5_41 Шапка5_42 Шапка5_43 Шапка5_44 Шапка5_45 Шапка5_46 Шапка5_47 Шапка5_48 Шапка5_49 Шапка5_410
Шапка5_51 Шапка5_52 Шапка5_53 Шапка5_54 Шапка5_55 Шапка5_56 Шапка5_57 Шапка5_58 Шапка5_59 Шапка5_510
Шапка5_61 Шапка5_62 Шапка5_63 Шапка5_64 Шапка5_65 Шапка5_66 Шапка5_67 Шапка5_68 Шапка5_69 Шапка5_610
Шапка5_71 Шапка5_72 Шапка5_73 Шапка5_74 Шапка5_75 Шапка5_76 Шапка5_77 Шапка5_78 Шапка5_79 Шапка5_710
Шапка5_81 Шапка5_82 Шапка5_83 Шапка5_84 Шапка5_85 Шапка5_86 Шапка5_87 Шапка5_88 Шапка5_89 Шапка5_810
Шапка5_91 Шапка5_92 Шапка5_93 Шапка5_94 Шапка5_95 Шапка5_96 Шапка5_97 Шапка5_98 Шапка5_99 Шапка5_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп5 ТабНом5 ФИО5:'d:r'
Долж5:'d:r' СуммаНач5
.endfields
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBWT9;        │.} Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBWT10;@'~@@@@@│.} Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBWT11;────────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
Итого5
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NBWT12;@'~@@@@@│.} Ш
 Ш│   │          │                  │.{.?NBWT13;        │.} Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBWT14;────────┴.} Ш
^
.}
.{ NachConWithTimeCicle CheckEnter
.{ PeopC6 CheckEnter
.[h
.fields
Шапка6_11 Шапка6_12 Шапка6_13 Шапка6_14 Шапка6_15 Шапка6_16 Шапка6_17 Шапка6_18 Шапка6_19 Шапка6_110
Шапка6_21 Шапка6_22 Шапка6_23 Шапка6_24 Шапка6_25 Шапка6_26 Шапка6_27 Шапка6_28 Шапка6_29 Шапка6_210
Шапка6_31 Шапка6_32 Шапка6_33 Шапка6_34 Шапка6_35 Шапка6_36 Шапка6_37 Шапка6_38 Шапка6_39 Шапка6_310
Шапка6_41 Шапка6_42 Шапка6_43 Шапка6_44 Шапка6_45 Шапка6_46 Шапка6_47 Шапка6_48 Шапка6_49 Шапка6_410
Шапка6_51 Шапка6_52 Шапка6_53 Шапка6_54 Шапка6_55 Шапка6_56 Шапка6_57 Шапка6_58 Шапка6_59 Шапка6_510
Шапка6_61 Шапка6_62 Шапка6_63 Шапка6_64 Шапка6_65 Шапка6_66 Шапка6_67 Шапка6_68 Шапка6_69 Шапка6_610
Шапка6_71 Шапка6_72 Шапка6_73 Шапка6_74 Шапка6_75 Шапка6_76 Шапка6_77 Шапка6_78 Шапка6_79 Шапка6_710
Шапка6_81 Шапка6_82 Шапка6_83 Шапка6_84 Шапка6_85 Шапка6_86 Шапка6_87 Шапка6_88 Шапка6_89 Шапка6_810
Шапка6_91 Шапка6_92 Шапка6_93 Шапка6_94 Шапка6_95 Шапка6_96 Шапка6_97 Шапка6_98 Шапка6_99 Шапка6_910
.endfields








 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Дней6 Часов6
СуммаНач6
.endfields
 Ш .{.?NCT9;@@@│@@@@│.} Ш
 Ш .{.?NCT10;@'~@@@@@│.} Ш
 Ш .{.?NCT11;───┬────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
ИтогоДней6 ИтогоЧасов6
Итого6
'true':'s'
.endfields
 Ш .{.?NCT12;@@@│@@@@│.} Ш
 Ш .{.?NCT13;@'~@@@@@│.} Ш
 Ш .{.?NCT14;────────┴.} Ш
^
.}
.{ NachUdConCicle CheckEnter
.{ PeopC7 CheckEnter
.[h
.fields
Шапка7_11 Шапка7_12 Шапка7_13 Шапка7_14 Шапка7_15 Шапка7_16 Шапка7_17 Шапка7_18 Шапка7_19 Шапка7_110
Шапка7_21 Шапка7_22 Шапка7_23 Шапка7_24 Шапка7_25 Шапка7_26 Шапка7_27 Шапка7_28 Шапка7_29 Шапка7_210
Шапка7_31 Шапка7_32 Шапка7_33 Шапка7_34 Шапка7_35 Шапка7_36 Шапка7_37 Шапка7_38 Шапка7_39 Шапка7_310
Шапка7_41 Шапка7_42 Шапка7_43 Шапка7_44 Шапка7_45 Шапка7_46 Шапка7_47 Шапка7_48 Шапка7_49 Шапка7_410
Шапка7_51 Шапка7_52 Шапка7_53 Шапка7_54 Шапка7_55 Шапка7_56 Шапка7_57 Шапка7_58 Шапка7_59 Шапка7_510
Шапка7_61 Шапка7_62 Шапка7_63 Шапка7_64 Шапка7_65 Шапка7_66 Шапка7_67 Шапка7_68 Шапка7_69 Шапка7_610
Шапка7_71 Шапка7_72 Шапка7_73 Шапка7_74 Шапка7_75 Шапка7_76 Шапка7_77 Шапка7_78 Шапка7_79 Шапка7_710
Шапка7_81 Шапка7_82 Шапка7_83 Шапка7_84 Шапка7_85 Шапка7_86 Шапка7_87 Шапка7_88 Шапка7_89 Шапка7_810
Шапка7_91 Шапка7_92 Шапка7_93 Шапка7_94 Шапка7_95 Шапка7_96 Шапка7_97 Шапка7_98 Шапка7_99 Шапка7_910
.endfields








 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ17
Символ27 СуммаНач7
Символ47
.endfields
 Ш@.{.?NUC9;        │.} Ш
 Ш@.{.?NUC10;@'~@@@@@│.} Ш
 Ш@.{.?NUC11;────────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
Итого7
'true':'s'
.endfields
 Ш .{.?NUC12;@'~@@@@@│.} Ш
 Ш .{.?NUC13;        │.} Ш
 Ш .{.?NUC14;────────┴.} Ш
^
.begin
  SumList1 :=0;
  SumList2 :=0;
  List := 1;
end.
.}
.{ LastUdColmsCircle CheckEnter








.{ PeopC8 CheckEnter
.[h
.fields
Шапка8_11 Шапка8_12 Шапка8_13 Шапка8_14 Шапка8_15 Шапка8_16 Шапка8_17 Шапка8_18 Шапка8_19 Шапка8_110
Шапка8_21 Шапка8_22 Шапка8_23 Шапка8_24 Шапка8_25 Шапка8_26 Шапка8_27 Шапка8_28 Шапка8_29 Шапка8_210
Шапка8_31 Шапка8_32 Шапка8_33 Шапка8_34 Шапка8_35 Шапка8_36 Шапка8_37 Шапка8_38 Шапка8_39 Шапка8_310
Шапка8_41 Шапка8_42 Шапка8_43 Шапка8_44 Шапка8_45 Шапка8_46 Шапка8_47 Шапка8_48 Шапка8_49 Шапка8_410
Шапка8_51 Шапка8_52 Шапка8_53 Шапка8_54 Шапка8_55 Шапка8_56 Шапка8_57 Шапка8_58 Шапка8_59 Шапка8_510
Шапка8_61 Шапка8_62 Шапка8_63 Шапка8_64 Шапка8_65 Шапка8_66 Шапка8_67 Шапка8_68 Шапка8_69 Шапка8_610
Шапка8_71 Шапка8_72 Шапка8_73 Шапка8_74 Шапка8_75 Шапка8_76 Шапка8_77 Шапка8_78 Шапка8_79 Шапка8_710
Шапка8_81 Шапка8_82 Шапка8_83 Шапка8_84 Шапка8_85 Шапка8_86 Шапка8_87 Шапка8_88 Шапка8_89 Шапка8_810
Шапка8_91 Шапка8_92 Шапка8_93 Шапка8_94 Шапка8_95 Шапка8_96 Шапка8_97 Шапка8_98 Шапка8_99 Шапка8_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ18
Символ28 СуммаНач8 ВсегоУдер8 СумКвыд8
Символ48
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер8;
!  SumList2 := SumList2 + СумКвыд8;
end.
 Ш@.{.?LUCC9;        │.}        │        │               │ Ш
 Ш@.{.?LUCC10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш@.{.?LUCC11;────────┼.}────────┤────────┼───────────────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@: удержано : &'#&&&&&&&&&&&&&.&&   к выдаче :  &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого8 ИтогоВсегоУдер8 ИтогоСумКвыд8
ИтогоСтр8 ИтогоПоВед8
СтрГлавБух8
ИтогоПоВедПрпись8
ИтогоПоВедПрписьСтрока8
'true':'s'
.endfields
 Ш .{.?LUCC12;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш .{.?LUCC13;        │.}        │        │               │ Ш
 Ш .{.?LUCC14;────────┴.}────────┴────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.begin
  SumList1 :=0;
  List := 1;
end.
.}
.{ LastNachTimeColmsCircle CheckEnter








.{ PeopC9 CheckEnter
.[h
.fields
Шапка9_11 Шапка9_12 Шапка9_13 Шапка9_14 Шапка9_15 Шапка9_16 Шапка9_17 Шапка9_18 Шапка9_19 Шапка9_110
Шапка9_21 Шапка9_22 Шапка9_23 Шапка9_24 Шапка9_25 Шапка9_26 Шапка9_27 Шапка9_28 Шапка9_29 Шапка9_210
Шапка9_31 Шапка9_32 Шапка9_33 Шапка9_34 Шапка9_35 Шапка9_36 Шапка9_37 Шапка9_38 Шапка9_39 Шапка9_310
Шапка9_41 Шапка9_42 Шапка9_43 Шапка9_44 Шапка9_45 Шапка9_46 Шапка9_47 Шапка9_48 Шапка9_49 Шапка9_410
Шапка9_51 Шапка9_52 Шапка9_53 Шапка9_54 Шапка9_55 Шапка9_56 Шапка9_57 Шапка9_58 Шапка9_59 Шапка9_510
Шапка9_61 Шапка9_62 Шапка9_63 Шапка9_64 Шапка9_65 Шапка9_66 Шапка9_67 Шапка9_68 Шапка9_69 Шапка9_610
Шапка9_71 Шапка9_72 Шапка9_73 Шапка9_74 Шапка9_75 Шапка9_76 Шапка9_77 Шапка9_78 Шапка9_79 Шапка9_710
Шапка9_81 Шапка9_82 Шапка9_83 Шапка9_84 Шапка9_85 Шапка9_86 Шапка9_87 Шапка9_88 Шапка9_89 Шапка9_810
Шапка9_91 Шапка9_92 Шапка9_93 Шапка9_94 Шапка9_95 Шапка9_96 Шапка9_97 Шапка9_98 Шапка9_99 Шапка9_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Дней9 Часов9 Дни9 Час9
СуммаНач9 ВсегоНач9
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач9;
end.
 Ш .{.?LNTCC9;@@@│@@@@│.}@@@│@@@@│ Ш
 Ш .{.?LNTCC10;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш .{.?LNTCC11;───┬────┼.}───┬────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней9 ИтогоЧасов9 ИтогоВсегоДни9 ИтогоВсегоЧас9
Итого9 ИтогоВсегоНач9
'true':'s'
.endfields
 Ш .{.?LNTCC12;@@@│@@@@│.}@@@│@@@@│ Ш
 Ш .{.?LNTCC13;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш .{.?LNTCC14;────────┴.}────────┘ Ш
^
.begin
  SumList1 :=0;
  List := 1;
end.
.}
.{ LastNachColmsCircle CheckEnter








.{ PeopC10 CheckEnter
.[h
.fields
Шапка10_11 Шапка10_12 Шапка10_13 Шапка10_14 Шапка10_15 Шапка10_16 Шапка10_17 Шапка10_18 Шапка10_19 Шапка10_110
Шапка10_21 Шапка10_22 Шапка10_23 Шапка10_24 Шапка10_25 Шапка10_26 Шапка10_27 Шапка10_28 Шапка10_29 Шапка10_210
Шапка10_31 Шапка10_32 Шапка10_33 Шапка10_34 Шапка10_35 Шапка10_36 Шапка10_37 Шапка10_38 Шапка10_39 Шапка10_310
Шапка10_41 Шапка10_42 Шапка10_43 Шапка10_44 Шапка10_45 Шапка10_46 Шапка10_47 Шапка10_48 Шапка10_49 Шапка10_410
Шапка10_51 Шапка10_52 Шапка10_53 Шапка10_54 Шапка10_55 Шапка10_56 Шапка10_57 Шапка10_58 Шапка10_59 Шапка10_510
Шапка10_61 Шапка10_62 Шапка10_63 Шапка10_64 Шапка10_65 Шапка10_66 Шапка10_67 Шапка10_68 Шапка10_69 Шапка10_610
Шапка10_71 Шапка10_72 Шапка10_73 Шапка10_74 Шапка10_75 Шапка10_76 Шапка10_77 Шапка10_78 Шапка10_79 Шапка10_710
Шапка10_81 Шапка10_82 Шапка10_83 Шапка10_84 Шапка10_85 Шапка10_86 Шапка10_87 Шапка10_88 Шапка10_89 Шапка10_810
Шапка10_91 Шапка10_92 Шапка10_93 Шапка10_94 Шапка10_95 Шапка10_96 Шапка10_97 Шапка10_98 Шапка10_99 Шапка10_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ110
Символ210 СуммаНач10 ВсегоНач10
Символ410
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач10;
end.
 Ш@.{.?LNCC9;        │.}        │ Ш
 Ш@.{.?LNCC10;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш@.{.?LNCC11;────────┼.}────────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Щ Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого10 ИтогоВсегоУдер10
'true':'s'
.endfields
 Ш .{.?LNCC12;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш .{.?LNCC13;        │.}        │ Ш
 Ш .{.?LNCC14;────────┴.}────────┘ Ш
^
.begin
  SumList1 :=0;
  SumList2 :=0;
  SumList3 :=0;
  List := 1;
end.
.}
.{ LastNeNachCC CheckEnter
.{ PeopC105 CheckEnter
.[h
.fields
Шапка105_11 Шапка105_12 Шапка105_13 Шапка105_14 Шапка105_15 Шапка105_16 Шапка105_17 Шапка105_18 Шапка105_19 Шапка105_110
Шапка105_21 Шапка105_22 Шапка105_23 Шапка105_24 Шапка105_25 Шапка105_26 Шапка105_27 Шапка105_28 Шапка105_29 Шапка105_210
Шапка105_31 Шапка105_32 Шапка105_33 Шапка105_34 Шапка105_35 Шапка105_36 Шапка105_37 Шапка105_38 Шапка105_39 Шапка105_310
Шапка105_41 Шапка105_42 Шапка105_43 Шапка105_44 Шапка105_45 Шапка105_46 Шапка105_47 Шапка105_48 Шапка105_49 Шапка105_410
Шапка105_51 Шапка105_52 Шапка105_53 Шапка105_54 Шапка105_55 Шапка105_56 Шапка105_57 Шапка105_58 Шапка105_59 Шапка105_510
Шапка105_61 Шапка105_62 Шапка105_63 Шапка105_64 Шапка105_65 Шапка105_66 Шапка105_67 Шапка105_68 Шапка105_69 Шапка105_610
Шапка105_71 Шапка105_72 Шапка105_73 Шапка105_74 Шапка105_75 Шапка105_76 Шапка105_77 Шапка105_78 Шапка105_79 Шапка105_710
Шапка105_81 Шапка105_82 Шапка105_83 Шапка105_84 Шапка105_85 Шапка105_86 Шапка105_87 Шапка105_88 Шапка105_89 Шапка105_810
Шапка105_91 Шапка105_92 Шапка105_93 Шапка105_94 Шапка105_95 Шапка105_96 Шапка105_97 Шапка105_98 Шапка105_99 Шапка105_910
.endfields








 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ105_18
Символ105_28 СуммаНач105 ВсегоУдер105 ВсегоНенач105 СумКвыд105
Символ105_48
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер8;
!  SumList2 := SumList2 + СумКвыд8;
end.
 Ш@.{.?LUNC9;        │.}        │        │        │               │ Ш
 Ш@.{.?LUNC10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш@.{.?LUNC11;────────┼.}────────┤────────┼────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@: удержано : &'#&&&&&&&&&&&&&.&&   к выдаче :  &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого105 ИтогоВсегоУдер105 ИтогоНенач105 ИтогоСумКвыд105
ИтогоСтр105 ИтогоПоВед105
СтрГлавБух105
ИтогоПоВедПрпись105
ИтогоПоВедПрписьСтрока105
'true':'s'
.endfields
 Ш .{.?LUNC12;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш .{.?LUNC13;        │.}        │        │        │               │ Ш
 Ш .{.?LUNC14;────────┴.}────────┴────────┴────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.begin
  SumList1 :=0;
  List := 1;
end.
.{ NachUdWithTimeCicle CheckEnter
.{ PeopC11 CheckEnter
.[h
.fields
Шапка11_11 Шапка11_12 Шапка11_13 Шапка11_14 Шапка11_15 Шапка11_16 Шапка11_17 Шапка11_18 Шапка11_19 Шапка11_110
Шапка11_21 Шапка11_22 Шапка11_23 Шапка11_24 Шапка11_25 Шапка11_26 Шапка11_27 Шапка11_28 Шапка11_29 Шапка11_210
Шапка11_31 Шапка11_32 Шапка11_33 Шапка11_34 Шапка11_35 Шапка11_36 Шапка11_37 Шапка11_38 Шапка11_39 Шапка11_310
Шапка11_41 Шапка11_42 Шапка11_43 Шапка11_44 Шапка11_45 Шапка11_46 Шапка11_47 Шапка11_48 Шапка11_49 Шапка11_410
Шапка11_51 Шапка11_52 Шапка11_53 Шапка11_54 Шапка11_55 Шапка11_56 Шапка11_57 Шапка11_58 Шапка11_59 Шапка11_510
Шапка11_61 Шапка11_62 Шапка11_63 Шапка11_64 Шапка11_65 Шапка11_66 Шапка11_67 Шапка11_68 Шапка11_69 Шапка11_610
Шапка11_71 Шапка11_72 Шапка11_73 Шапка11_74 Шапка11_75 Шапка11_76 Шапка11_77 Шапка11_78 Шапка11_79 Шапка11_710
Шапка11_81 Шапка11_82 Шапка11_83 Шапка11_84 Шапка11_85 Шапка11_86 Шапка11_87 Шапка11_88 Шапка11_89 Шапка11_810
Шапка11_91 Шапка11_92 Шапка11_93 Шапка11_94 Шапка11_95 Шапка11_96 Шапка11_97 Шапка11_98 Шапка11_99 Шапка11_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп11 ТабНом11 ФИО11:'d:r' Дней11 Часов11 ВсегоДней11 ВсегоЧасов11
Долж11:'d:r' СуммаНач11 ВсегоНач11 СуммаУд11 ВсегоУд11 СумКВыдаче11
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач11;
!  SumList2 := SumList2 + ВсегоУд11;
!  SumList3 := SumList3 + СумКВыдаче11;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNUWT9;@@@│@@@@│.}@@@│@@@@│.{.?NUUWT9;        │.}        │        │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNUWT10;@'~@@@@@│.}@'~@@@@@│.{.?NUUWT10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NNUWT11;───┬────┼.}───┬────┼.{.?NUUWT11;────────┼.}────────┤────────┼───────────────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш----------------------------------------------------------------------------------------------------------------
! Щ Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&
! Ш----------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней11 ИтогоЧасов11 ВсегоИтогоДней11 ВсегоИтогоЧасов11
ИтогоНач11 ВсегоИтогоНач11 ИтогоУд11 ВсегоИтогоУд11 ИтогоКВыдаче11
ИтогоСтр11 ИтогоПоВед11
СтрГлавБух11
ИтогоПоВедПрпись11
ИтогоПоВедПрписьСтрока11
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NNUWT12;@@@│@@@@│.}@@@│@@@@│.{.?NUUWT12;        │.}        │        │               │ Ш
 Ш│   │          │                  │.{.?NNUWT13;@'~@@@@@│.}@'~@@@@@│.{.?NUUWT13;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NNUWT14;────────┴.}────────┴.{.?NUUWT14;────────┴.}────────┴────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.begin
  SumList1 :=0;
  SumList2 := 0;
  SumList3 := 0;
  List := 1;
end.
.}
.{ NNachUdWithTimeCicle CheckEnter
.{ PeopC111 CheckEnter
.[h
.fields
Шапка111_11 Шапка111_12 Шапка111_13 Шапка111_14 Шапка111_15 Шапка111_16 Шапка111_17 Шапка111_18 Шапка111_19 Шапка111_110
Шапка111_21 Шапка111_22 Шапка111_23 Шапка111_24 Шапка111_25 Шапка111_26 Шапка111_27 Шапка111_28 Шапка111_29 Шапка111_210
Шапка111_31 Шапка111_32 Шапка111_33 Шапка111_34 Шапка111_35 Шапка111_36 Шапка111_37 Шапка111_38 Шапка111_39 Шапка111_310
Шапка111_41 Шапка111_42 Шапка111_43 Шапка111_44 Шапка111_45 Шапка111_46 Шапка111_47 Шапка111_48 Шапка111_49 Шапка111_410
Шапка111_51 Шапка111_52 Шапка111_53 Шапка111_54 Шапка111_55 Шапка111_56 Шапка111_57 Шапка111_58 Шапка111_59 Шапка111_510
Шапка111_61 Шапка111_62 Шапка111_63 Шапка111_64 Шапка111_65 Шапка111_66 Шапка111_67 Шапка111_68 Шапка111_69 Шапка111_610
Шапка111_71 Шапка111_72 Шапка111_73 Шапка111_74 Шапка111_75 Шапка111_76 Шапка111_77 Шапка111_78 Шапка111_79 Шапка111_710
Шапка111_81 Шапка111_82 Шапка111_83 Шапка111_84 Шапка111_85 Шапка111_86 Шапка111_87 Шапка111_88 Шапка111_89 Шапка111_810
Шапка111_91 Шапка111_92 Шапка111_93 Шапка111_94 Шапка111_95 Шапка111_96 Шапка111_97 Шапка111_98 Шапка111_99 Шапка111_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп111 ТабНом111 ФИО111:'d:r' Дней111 Часов111 ВсегоДней111 ВсегоЧасов111
Долж111:'d:r' СуммаНач111 ВсегоНач111 СуммаУд111 ВсегоУд111 ВсегоНеНач111 СумКВыдаче111
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач111;
!  SumList2 := SumList2 + ВсегоУд111;
!  SumList3 := SumList3 + СумКВыдаче111;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUN9;@@@│@@@@│.}@@@│@@@@│.{.?UUN9;        │.}        │        │        │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUN10;@'~@@@@@│.}@'~@@@@@│.{.?UUN10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NUN11;───┬────┼.}───┬────┼.{.?UUN11;────────┼.}────────┼────────┼────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!     SumList3 := Round(SumList3);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш---------------------------------------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней111 ИтогоЧасов111 ВсегоИтогоДней111 ВсегоИтогоЧасов111
ИтогоНач111 ВсегоИтогоНач111 ИтогоУд111 ВсегоИтогоУд111 ИтогоНеНач111 ИтогоКВыдаче111
ИтогоСтр111 ИтогоПоВед111
СтрГлавБух111
ИтогоПоВедПрпись111
ИтогоПоВедПрписьСтрока111
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NUN12;@@@│@@@@│.}@@@│@@@@│.{.?UUN12;        │.}        │        │        │               │ Ш
 Ш│   │          │                  │.{.?NUN13;@'~@@@@@│.}@'~@@@@@│.{.?UUN13;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NUN14;────────┴.}────────┴.{.?UUN14;────────┴.}────────┴────────┴────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.begin
  SumList1 :=0;
  SumList2 := 0;
  SumList3 := 0;
  List := 1;
end.
.{ NachUdCicle CheckEnter
.{ PeopC12 CheckEnter
.[h
.fields
Шапка12_11 Шапка12_12 Шапка12_13 Шапка12_14 Шапка12_15 Шапка12_16 Шапка12_17 Шапка12_18 Шапка12_19 Шапка12_110
Шапка12_21 Шапка12_22 Шапка12_23 Шапка12_24 Шапка12_25 Шапка12_26 Шапка12_27 Шапка12_28 Шапка12_29 Шапка12_210
Шапка12_31 Шапка12_32 Шапка12_33 Шапка12_34 Шапка12_35 Шапка12_36 Шапка12_37 Шапка12_38 Шапка12_39 Шапка12_310
Шапка12_41 Шапка12_42 Шапка12_43 Шапка12_44 Шапка12_45 Шапка12_46 Шапка12_47 Шапка12_48 Шапка12_49 Шапка12_410
Шапка12_51 Шапка12_52 Шапка12_53 Шапка12_54 Шапка12_55 Шапка12_56 Шапка12_57 Шапка12_58 Шапка12_59 Шапка12_510
Шапка12_61 Шапка12_62 Шапка12_63 Шапка12_64 Шапка12_65 Шапка12_66 Шапка12_67 Шапка12_68 Шапка12_69 Шапка12_610
Шапка12_71 Шапка12_72 Шапка12_73 Шапка12_74 Шапка12_75 Шапка12_76 Шапка12_77 Шапка12_78 Шапка12_79 Шапка12_710
Шапка12_81 Шапка12_82 Шапка12_83 Шапка12_84 Шапка12_85 Шапка12_86 Шапка12_87 Шапка12_88 Шапка12_89 Шапка12_810
Шапка12_91 Шапка12_92 Шапка12_93 Шапка12_94 Шапка12_95 Шапка12_96 Шапка12_97 Шапка12_98 Шапка12_99 Шапка12_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп12 ТабНом12 ФИО12:'d:r'
Долж12:'d:r' СуммаНач12 ВсегоНач12 СуммаУд12 ВсегоУд12 СумКВыдаче12
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач12;
!  SumList2 := SumList2 + ВсегоУд12;
!  SumList3 := SumList3 + СумКВыдаче12;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNU9;        │.}        │.{.?NUU9;        │.}        │        │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNU10;@'~@@@@@│.}@'~@@@@@│.{.?NUU10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NNU11;────────┼.}────────┼.{.?NUU11;────────┼.}────────┤────────┼───────────────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш----------------------------------------------------------------------------------------------------------------
! Щ Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&
! Ш----------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоНач12 ВсегоИтогоНач12 ИтогоУд12 ВсегоИтогоУд12 ИтогоКВыдаче12
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NNU12;        │.}        │.{.?NUU12;        │.}        │        │               │ Ш
 Ш│   │          │                  │.{.?NNU13;@'~@@@@@│.}@'~@@@@@│.{.?NUU13;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NNU14;────────┴.}────────┴.{.?NUU14;────────┴.}────────┴────────┴───────────────┘ Ш
.fields
ИтогоСтр12 ИтогоПоВед12
СтрГлавБух12
ИтогоПоВедПрпись12
ИтогоПоВедПрписьСтрока12
'true':'s'
.endfields
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.{ NNachUdCicle CheckEnter
.{ PeopC112 CheckEnter
.[h
.fields
Шапка112_11 Шапка112_12 Шапка112_13 Шапка112_14 Шапка112_15 Шапка112_16 Шапка112_17 Шапка112_18 Шапка112_19 Шапка112_110
Шапка112_21 Шапка112_22 Шапка112_23 Шапка112_24 Шапка112_25 Шапка112_26 Шапка112_27 Шапка112_28 Шапка112_29 Шапка112_210
Шапка112_31 Шапка112_32 Шапка112_33 Шапка112_34 Шапка112_35 Шапка112_36 Шапка112_37 Шапка112_38 Шапка112_39 Шапка112_310
Шапка112_41 Шапка112_42 Шапка112_43 Шапка112_44 Шапка112_45 Шапка112_46 Шапка112_47 Шапка112_48 Шапка112_49 Шапка112_410
Шапка112_51 Шапка112_52 Шапка112_53 Шапка112_54 Шапка112_55 Шапка112_56 Шапка112_57 Шапка112_58 Шапка112_59 Шапка112_510
Шапка112_61 Шапка112_62 Шапка112_63 Шапка112_64 Шапка112_65 Шапка112_66 Шапка112_67 Шапка112_68 Шапка112_69 Шапка112_610
Шапка112_71 Шапка112_72 Шапка112_73 Шапка112_74 Шапка112_75 Шапка112_76 Шапка112_77 Шапка112_78 Шапка112_79 Шапка112_710
Шапка112_81 Шапка112_82 Шапка112_83 Шапка112_84 Шапка112_85 Шапка112_86 Шапка112_87 Шапка112_88 Шапка112_89 Шапка112_810
Шапка112_91 Шапка112_92 Шапка112_93 Шапка112_94 Шапка112_95 Шапка112_96 Шапка112_97 Шапка112_98 Шапка112_99 Шапка112_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп112 ТабНом112 ФИО112:'d:r'
Долж112:'d:r' СуммаНач112 ВсегоНач112 СуммаУд112 ВсегоУд112 ВсегоНеНач112 СумКВыдаче112
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач112;
!  SumList2 := SumList2 + ВсегоУд112;
!  SumList3 := SumList3 + СумКВыдаче112;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNUN9;        │.}        │.{.?UNUN9;        │.}        │        │        │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNUN10;@'~@@@@@│.}@'~@@@@@│.{.?UNUN10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NNUN11;────────┼.}────────┼.{.?UNUN11;────────┼.}────────┤────────┤────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!     SumList3 := Round(SumList3);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш---------------------------------------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоНач112 ВсегоИтогоНач112 ИтогоУд112 ВсегоИтогоУд112 ИтогоНеНач112 ИтогоКВыдаче112
ИтогоСтр112 ИтогоПоВед112
СтрГлавБух112
ИтогоПоВедПрпись112
ИтогоПоВедПрписьСтрока112
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NNUN12;        │.}        │.{.?UNUN12;        │.}        │        │        │               │ Ш
 Ш│   │          │                  │.{.?NNUN13;@'~@@@@@│.}@'~@@@@@│.{.?UNUN13;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NNUN14;────────┴.}────────┴.{.?UNUN14;────────┴.}────────┴────────┴────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.}
.fields
ИтогоВедомость
.endfields
 СИТОГО ВЫПЛАЧЕНО: Б @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Р
 И( сумма к выдаче прописью) И
.endform
!
!
!
.linkform 'RPVedGor_SMALL_L13' prototype is 'RPVedGor'
.nameinlist 'Расчетно-платежная ведомость для малых сумм'
.Set Filler ='-'
.DEFO LANDSCAPE
.DEFP PA4
.p 72
.var
     InShap    : integer;
     SumList1  : double
     SumList2  : double
     SumList3  : double
     Count     : LongInt
     List      : Longint
     SSS       : string;
 .endvar
.Set Dot '='
.group '2_Третья группа'
.{ CommonForAllCicle CheckEnter
.fields
РукПред_Имя ГлавБух_Имя
НазвОрган
КодПодразделение
ЗаМесяц
Год
.endfields
.{ Shapka CheckEnter
                БРуководитель Б                     БГл.бухгалтер Б
                Борганизации Б                      Борганизации Б
          @~@@@@@@@@@@@@@@@@@@@@@@@      @~@@@@@@@@@@@@@@@@@@@@@@@

           БОрганизация :  Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{?internal;InShap=0

.begin InShap := InShap + 1 end.
.}
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                     БРАСЧЕТНО-ПЛАТЕЖНАЯ ВЕДОМОСТЬ No__ Б
                     Бза Б  @@@@@@@@@@  Бмесяц Б   @@@@   Бг. Б
.}
.begin
  SumList1 :=0;
  List     :=1;
end.
.{ NachBegEndWithTimeCicle CheckEnter
.{ PeopC1 CheckEnter
.[h
.fields
Шапка1_11 Шапка1_12 Шапка1_13 Шапка1_14 Шапка1_15 Шапка1_16 Шапка1_17 Шапка1_18 Шапка1_19 Шапка1_110
Шапка1_21 Шапка1_22 Шапка1_23 Шапка1_24 Шапка1_25 Шапка1_26 Шапка1_27 Шапка1_28 Шапка1_29 Шапка1_210
Шапка1_31 Шапка1_32 Шапка1_33 Шапка1_34 Шапка1_35 Шапка1_36 Шапка1_37 Шапка1_38 Шапка1_39 Шапка1_310
Шапка1_41 Шапка1_42 Шапка1_43 Шапка1_44 Шапка1_45 Шапка1_46 Шапка1_47 Шапка1_48 Шапка1_49 Шапка1_410
Шапка1_51 Шапка1_52 Шапка1_53 Шапка1_54 Шапка1_55 Шапка1_56 Шапка1_57 Шапка1_58 Шапка1_59 Шапка1_510
Шапка1_61 Шапка1_62 Шапка1_63 Шапка1_64 Шапка1_65 Шапка1_66 Шапка1_67 Шапка1_68 Шапка1_69 Шапка1_610
Шапка1_71 Шапка1_72 Шапка1_73 Шапка1_74 Шапка1_75 Шапка1_76 Шапка1_77 Шапка1_78 Шапка1_79 Шапка1_710
Шапка1_81 Шапка1_82 Шапка1_83 Шапка1_84 Шапка1_85 Шапка1_86 Шапка1_87 Шапка1_88 Шапка1_89 Шапка1_810
Шапка1_91 Шапка1_92 Шапка1_93 Шапка1_94 Шапка1_95 Шапка1_96 Шапка1_97 Шапка1_98 Шапка1_99 Шапка1_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп1 ТабНом1 ФИО1:'d:r' Дней1 Часов1 ВсегоДней1 ВсегоЧасов1
Долж1:'d:r' СуммаНач1 ВсегоНач1
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач1;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBET9;@@@│@@@@│.}@@@│@@@@│ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBET10;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBET11;───┬────┼.}───┬────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней1 ИтогоЧасов1 ВсегоИтогоДней1 ВсегоИтогоЧасов1
Итого1 ВсегоИтого1
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NBET12;@@@│@@@@│.}@@@│@@@@│ Ш
 Ш│   │          │                  │.{.?NBET13;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBET14;────────┴.}────────┘ Ш
^
.begin
  SumList1 :=0;
  List := 1;
end.
.}
.{ NachBegEndCicle CheckEnter
.{ PeopC2 CheckEnter
.[h
.fields
Шапка2_11 Шапка2_12 Шапка2_13 Шапка2_14 Шапка2_15 Шапка2_16 Шапка2_17 Шапка2_18 Шапка2_19 Шапка2_110
Шапка2_21 Шапка2_22 Шапка2_23 Шапка2_24 Шапка2_25 Шапка2_26 Шапка2_27 Шапка2_28 Шапка2_29 Шапка2_210
Шапка2_31 Шапка2_32 Шапка2_33 Шапка2_34 Шапка2_35 Шапка2_36 Шапка2_37 Шапка2_38 Шапка2_39 Шапка2_310
Шапка2_41 Шапка2_42 Шапка2_43 Шапка2_44 Шапка2_45 Шапка2_46 Шапка2_47 Шапка2_48 Шапка2_49 Шапка2_410
Шапка2_51 Шапка2_52 Шапка2_53 Шапка2_54 Шапка2_55 Шапка2_56 Шапка2_57 Шапка2_58 Шапка2_59 Шапка2_510
Шапка2_61 Шапка2_62 Шапка2_63 Шапка2_64 Шапка2_65 Шапка2_66 Шапка2_67 Шапка2_68 Шапка2_69 Шапка2_610
Шапка2_71 Шапка2_72 Шапка2_73 Шапка2_74 Шапка2_75 Шапка2_76 Шапка2_77 Шапка2_78 Шапка2_79 Шапка2_710
Шапка2_81 Шапка2_82 Шапка2_83 Шапка2_84 Шапка2_85 Шапка2_86 Шапка2_87 Шапка2_88 Шапка2_89 Шапка2_810
Шапка2_91 Шапка2_92 Шапка2_93 Шапка2_94 Шапка2_95 Шапка2_96 Шапка2_97 Шапка2_98 Шапка2_99 Шапка2_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп2 ТабНом2 ФИО2:'d:r'
Долж2:'d:r' СуммаНач2 ВсегоНач2
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач2;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBEWT9;        │.}        │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBEWT10;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBEWT11;────────┼.}────────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого2 ВсегоИтого2
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NBEWT12;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш│   │          │                  │.{.?NBEWT13;        │.}        │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBEWT14;────────┴.}────────┘ Ш
^
.begin
  SumList1 :=0;
  SumList2 :=0;
  List := 1;
end.
.}
.{ NeNachBegEndCicle CheckEnter








.{ PeopC103 CheckEnter
.[h
.fields
Шапка103_11 Шапка103_12 Шапка103_13 Шапка103_14 Шапка103_15 Шапка103_16 Шапка103_17 Шапка103_18 Шапка103_19 Шапка103_110
Шапка103_21 Шапка103_22 Шапка103_23 Шапка103_24 Шапка103_25 Шапка103_26 Шапка103_27 Шапка103_28 Шапка103_29 Шапка103_210
Шапка103_31 Шапка103_32 Шапка103_33 Шапка103_34 Шапка103_35 Шапка103_36 Шапка103_37 Шапка103_38 Шапка103_39 Шапка103_310
Шапка103_41 Шапка103_42 Шапка103_43 Шапка103_44 Шапка103_45 Шапка103_46 Шапка103_47 Шапка103_48 Шапка103_49 Шапка103_410
Шапка103_51 Шапка103_52 Шапка103_53 Шапка103_54 Шапка103_55 Шапка103_56 Шапка103_57 Шапка103_58 Шапка103_59 Шапка103_510
Шапка103_61 Шапка103_62 Шапка103_63 Шапка103_64 Шапка103_65 Шапка103_66 Шапка103_67 Шапка103_68 Шапка103_69 Шапка103_610
Шапка103_71 Шапка103_72 Шапка103_73 Шапка103_74 Шапка103_75 Шапка103_76 Шапка103_77 Шапка103_78 Шапка103_79 Шапка103_710
Шапка103_81 Шапка103_82 Шапка103_83 Шапка103_84 Шапка103_85 Шапка103_86 Шапка103_87 Шапка103_88 Шапка103_89 Шапка103_810
Шапка103_91 Шапка103_92 Шапка103_93 Шапка103_94 Шапка103_95 Шапка103_96 Шапка103_97 Шапка103_98 Шапка103_99 Шапка103_910
.endfields
 Ш^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^
^^^^^^^^^^ Ш
.]h
.fields
Нпп103 ТабНом103 ФИО103:'d:r'
Долж103:'d:r' СуммаУдер103 ВсегоУдер103 СуммаНеНач103 СумКвыд103
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер103;
!  SumList2 := SumList2 + СумКвыд103;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUBEN9;        │.}        │        │        │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUBEN10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NUBEN11;────────┼.}────────┼────────┼────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:      удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List + 1;
!end.
!.]f
.}
.fields
Итого103 ВсегоИтого103 ИтогоСуммаНач103 ВсеКВыдаче103
ИтогоСтр103 ИтогоПоВед103
СтрГлавБух103
ИтогоПоВедПрпись103
ИтогоПоВедПрписьСтрока103
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NUBEN12;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш│   │          │                  │.{.?NUBEN13;        │.}        │        │        │               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NUBEN14;────────┴.}────────┴────────┴────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
!.}
.}
.{ NachUdBegEndCicle CheckEnter








.{ PeopC3 CheckEnter
.[h
.fields
Шапка3_11 Шапка3_12 Шапка3_13 Шапка3_14 Шапка3_15 Шапка3_16 Шапка3_17 Шапка3_18 Шапка3_19 Шапка3_110
Шапка3_21 Шапка3_22 Шапка3_23 Шапка3_24 Шапка3_25 Шапка3_26 Шапка3_27 Шапка3_28 Шапка3_29 Шапка3_210
Шапка3_31 Шапка3_32 Шапка3_33 Шапка3_34 Шапка3_35 Шапка3_36 Шапка3_37 Шапка3_38 Шапка3_39 Шапка3_310
Шапка3_41 Шапка3_42 Шапка3_43 Шапка3_44 Шапка3_45 Шапка3_46 Шапка3_47 Шапка3_48 Шапка3_49 Шапка3_410
Шапка3_51 Шапка3_52 Шапка3_53 Шапка3_54 Шапка3_55 Шапка3_56 Шапка3_57 Шапка3_58 Шапка3_59 Шапка3_510
Шапка3_61 Шапка3_62 Шапка3_63 Шапка3_64 Шапка3_65 Шапка3_66 Шапка3_67 Шапка3_68 Шапка3_69 Шапка3_610
Шапка3_71 Шапка3_72 Шапка3_73 Шапка3_74 Шапка3_75 Шапка3_76 Шапка3_77 Шапка3_78 Шапка3_79 Шапка3_710
Шапка3_81 Шапка3_82 Шапка3_83 Шапка3_84 Шапка3_85 Шапка3_86 Шапка3_87 Шапка3_88 Шапка3_89 Шапка3_810
Шапка3_91 Шапка3_92 Шапка3_93 Шапка3_94 Шапка3_95 Шапка3_96 Шапка3_97 Шапка3_98 Шапка3_99 Шапка3_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп3 ТабНом3 ФИО3:'d:r'
Долж3:'d:r' СуммаУдер3 ВсегоУдер3 СумКвыд3
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер3;
!  SumList2 := SumList2 + СумКвыд3;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUBEWT9;        │.}        │        │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUBEWT10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NUBEWT11;────────┼.}────────┤────────┼───────────────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:      удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List + 1;
!end.
!.]f
.}
.fields
Итого3 ВсегоИтого3 ВсеКВыдаче3
ИтогоСтр3 ИтогоПоВед3
СтрГлавБух3
ИтогоПоВедПрпись3
ИтогоПоВедПрписьСтрока3
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NUBEWT12;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш│   │          │                  │.{.?NUBEWT13;        │.}        │        │               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NUBEWT14;────────┴.}────────┴────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.{ NachBgWithTimeCicle CheckEnter
.{  PeopC4 CheckEnter
.[h
.fields
Шапка4_11 Шапка4_12 Шапка4_13 Шапка4_14 Шапка4_15 Шапка4_16 Шапка4_17 Шапка4_18 Шапка4_19 Шапка4_110
Шапка4_21 Шапка4_22 Шапка4_23 Шапка4_24 Шапка4_25 Шапка4_26 Шапка4_27 Шапка4_28 Шапка4_29 Шапка4_210
Шапка4_31 Шапка4_32 Шапка4_33 Шапка4_34 Шапка4_35 Шапка4_36 Шапка4_37 Шапка4_38 Шапка4_39 Шапка4_310
Шапка4_41 Шапка4_42 Шапка4_43 Шапка4_44 Шапка4_45 Шапка4_46 Шапка4_47 Шапка4_48 Шапка4_49 Шапка4_410
Шапка4_51 Шапка4_52 Шапка4_53 Шапка4_54 Шапка4_55 Шапка4_56 Шапка4_57 Шапка4_58 Шапка4_59 Шапка4_510
Шапка4_61 Шапка4_62 Шапка4_63 Шапка4_64 Шапка4_65 Шапка4_66 Шапка4_67 Шапка4_68 Шапка4_69 Шапка4_610
Шапка4_71 Шапка4_72 Шапка4_73 Шапка4_74 Шапка4_75 Шапка4_76 Шапка4_77 Шапка4_78 Шапка4_79 Шапка4_710
Шапка4_81 Шапка4_82 Шапка4_83 Шапка4_84 Шапка4_85 Шапка4_86 Шапка4_87 Шапка4_88 Шапка4_89 Шапка4_810
Шапка4_91 Шапка4_92 Шапка4_93 Шапка4_94 Шапка4_95 Шапка4_96 Шапка4_97 Шапка4_98 Шапка4_99 Шапка4_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп4 ТабНом4 ФИО4:'d:r' Дней4 Часов4
Долж4:'d:r' СуммаНач4
.endfields
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBT9;@@@│@@@@│.} Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBT10;@'~@@@@@│.} Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBT11;───┬────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
ИтогоДней4 ИтогоЧасов4
Итого4
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NBT12;@@@│@@@@│.} Ш
 Ш│   │          │                  │.{.?NBT13;@'~@@@@@│.} Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBT14;────────┴.} Ш
^
.}
.{NachUdBegCicle CheckEnter
.if NeedSpace








.end
.{ PeopC5 CheckEnter
.[h
.fields
Шапка5_11 Шапка5_12 Шапка5_13 Шапка5_14 Шапка5_15 Шапка5_16 Шапка5_17 Шапка5_18 Шапка5_19 Шапка5_110
Шапка5_21 Шапка5_22 Шапка5_23 Шапка5_24 Шапка5_25 Шапка5_26 Шапка5_27 Шапка5_28 Шапка5_29 Шапка5_210
Шапка5_31 Шапка5_32 Шапка5_33 Шапка5_34 Шапка5_35 Шапка5_36 Шапка5_37 Шапка5_38 Шапка5_39 Шапка5_310
Шапка5_41 Шапка5_42 Шапка5_43 Шапка5_44 Шапка5_45 Шапка5_46 Шапка5_47 Шапка5_48 Шапка5_49 Шапка5_410
Шапка5_51 Шапка5_52 Шапка5_53 Шапка5_54 Шапка5_55 Шапка5_56 Шапка5_57 Шапка5_58 Шапка5_59 Шапка5_510
Шапка5_61 Шапка5_62 Шапка5_63 Шапка5_64 Шапка5_65 Шапка5_66 Шапка5_67 Шапка5_68 Шапка5_69 Шапка5_610
Шапка5_71 Шапка5_72 Шапка5_73 Шапка5_74 Шапка5_75 Шапка5_76 Шапка5_77 Шапка5_78 Шапка5_79 Шапка5_710
Шапка5_81 Шапка5_82 Шапка5_83 Шапка5_84 Шапка5_85 Шапка5_86 Шапка5_87 Шапка5_88 Шапка5_89 Шапка5_810
Шапка5_91 Шапка5_92 Шапка5_93 Шапка5_94 Шапка5_95 Шапка5_96 Шапка5_97 Шапка5_98 Шапка5_99 Шапка5_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп5 ТабНом5 ФИО5:'d:r'
Долж5:'d:r' СуммаНач5
.endfields
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NBWT9;        │.} Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NBWT10;@'~@@@@@│.} Ш
 Ш├───┼──────────┼──────────────────┼.{.?NBWT11;────────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
Итого5
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NBWT12;@'~@@@@@│.} Ш
 Ш│   │          │                  │.{.?NBWT13;        │.} Ш
 Ш└───┴──────────┴──────────────────┴.{.?NBWT14;────────┴.} Ш
^
.}
.{ NachConWithTimeCicle CheckEnter
.{ PeopC6 CheckEnter
.[h
.fields
Шапка6_11 Шапка6_12 Шапка6_13 Шапка6_14 Шапка6_15 Шапка6_16 Шапка6_17 Шапка6_18 Шапка6_19 Шапка6_110
Шапка6_21 Шапка6_22 Шапка6_23 Шапка6_24 Шапка6_25 Шапка6_26 Шапка6_27 Шапка6_28 Шапка6_29 Шапка6_210
Шапка6_31 Шапка6_32 Шапка6_33 Шапка6_34 Шапка6_35 Шапка6_36 Шапка6_37 Шапка6_38 Шапка6_39 Шапка6_310
Шапка6_41 Шапка6_42 Шапка6_43 Шапка6_44 Шапка6_45 Шапка6_46 Шапка6_47 Шапка6_48 Шапка6_49 Шапка6_410
Шапка6_51 Шапка6_52 Шапка6_53 Шапка6_54 Шапка6_55 Шапка6_56 Шапка6_57 Шапка6_58 Шапка6_59 Шапка6_510
Шапка6_61 Шапка6_62 Шапка6_63 Шапка6_64 Шапка6_65 Шапка6_66 Шапка6_67 Шапка6_68 Шапка6_69 Шапка6_610
Шапка6_71 Шапка6_72 Шапка6_73 Шапка6_74 Шапка6_75 Шапка6_76 Шапка6_77 Шапка6_78 Шапка6_79 Шапка6_710
Шапка6_81 Шапка6_82 Шапка6_83 Шапка6_84 Шапка6_85 Шапка6_86 Шапка6_87 Шапка6_88 Шапка6_89 Шапка6_810
Шапка6_91 Шапка6_92 Шапка6_93 Шапка6_94 Шапка6_95 Шапка6_96 Шапка6_97 Шапка6_98 Шапка6_99 Шапка6_910
.endfields








 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Дней6 Часов6
СуммаНач6
.endfields
 Ш .{.?NCT9;@@@│@@@@│.} Ш
 Ш .{.?NCT10;@'~@@@@@│.} Ш
 Ш .{.?NCT11;───┬────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
ИтогоДней6 ИтогоЧасов6
Итого6
'true':'s'
.endfields
 Ш .{.?NCT12;@@@│@@@@│.} Ш
 Ш .{.?NCT13;@'~@@@@@│.} Ш
 Ш .{.?NCT14;────────┴.} Ш
^
.}
.{ NachUdConCicle CheckEnter
.{ PeopC7 CheckEnter
.[h
.fields
Шапка7_11 Шапка7_12 Шапка7_13 Шапка7_14 Шапка7_15 Шапка7_16 Шапка7_17 Шапка7_18 Шапка7_19 Шапка7_110
Шапка7_21 Шапка7_22 Шапка7_23 Шапка7_24 Шапка7_25 Шапка7_26 Шапка7_27 Шапка7_28 Шапка7_29 Шапка7_210
Шапка7_31 Шапка7_32 Шапка7_33 Шапка7_34 Шапка7_35 Шапка7_36 Шапка7_37 Шапка7_38 Шапка7_39 Шапка7_310
Шапка7_41 Шапка7_42 Шапка7_43 Шапка7_44 Шапка7_45 Шапка7_46 Шапка7_47 Шапка7_48 Шапка7_49 Шапка7_410
Шапка7_51 Шапка7_52 Шапка7_53 Шапка7_54 Шапка7_55 Шапка7_56 Шапка7_57 Шапка7_58 Шапка7_59 Шапка7_510
Шапка7_61 Шапка7_62 Шапка7_63 Шапка7_64 Шапка7_65 Шапка7_66 Шапка7_67 Шапка7_68 Шапка7_69 Шапка7_610
Шапка7_71 Шапка7_72 Шапка7_73 Шапка7_74 Шапка7_75 Шапка7_76 Шапка7_77 Шапка7_78 Шапка7_79 Шапка7_710
Шапка7_81 Шапка7_82 Шапка7_83 Шапка7_84 Шапка7_85 Шапка7_86 Шапка7_87 Шапка7_88 Шапка7_89 Шапка7_810
Шапка7_91 Шапка7_92 Шапка7_93 Шапка7_94 Шапка7_95 Шапка7_96 Шапка7_97 Шапка7_98 Шапка7_99 Шапка7_910
.endfields








 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ17
Символ27 СуммаНач7
Символ47
.endfields
 Ш@.{.?NUC9;        │.} Ш
 Ш@.{.?NUC10;@'~@@@@@│.} Ш
 Ш@.{.?NUC11;────────┼.} Ш
!.[f OverWrite
! Ш------------------------------------------------------------------------------ Ш
!
! Ш------------------------------------------------------------------------------ Ш
!.]f
.}
.fields
Итого7
'true':'s'
.endfields
 Ш .{.?NUC12;@'~@@@@@│.} Ш
 Ш .{.?NUC13;        │.} Ш
 Ш .{.?NUC14;────────┴.} Ш
^
.begin
  SumList1 :=0;
  SumList2 :=0;
  List := 1;
end.
.}
.{ LastUdColmsCircle CheckEnter








.{ PeopC8 CheckEnter
.[h
.fields
Шапка8_11 Шапка8_12 Шапка8_13 Шапка8_14 Шапка8_15 Шапка8_16 Шапка8_17 Шапка8_18 Шапка8_19 Шапка8_110
Шапка8_21 Шапка8_22 Шапка8_23 Шапка8_24 Шапка8_25 Шапка8_26 Шапка8_27 Шапка8_28 Шапка8_29 Шапка8_210
Шапка8_31 Шапка8_32 Шапка8_33 Шапка8_34 Шапка8_35 Шапка8_36 Шапка8_37 Шапка8_38 Шапка8_39 Шапка8_310
Шапка8_41 Шапка8_42 Шапка8_43 Шапка8_44 Шапка8_45 Шапка8_46 Шапка8_47 Шапка8_48 Шапка8_49 Шапка8_410
Шапка8_51 Шапка8_52 Шапка8_53 Шапка8_54 Шапка8_55 Шапка8_56 Шапка8_57 Шапка8_58 Шапка8_59 Шапка8_510
Шапка8_61 Шапка8_62 Шапка8_63 Шапка8_64 Шапка8_65 Шапка8_66 Шапка8_67 Шапка8_68 Шапка8_69 Шапка8_610
Шапка8_71 Шапка8_72 Шапка8_73 Шапка8_74 Шапка8_75 Шапка8_76 Шапка8_77 Шапка8_78 Шапка8_79 Шапка8_710
Шапка8_81 Шапка8_82 Шапка8_83 Шапка8_84 Шапка8_85 Шапка8_86 Шапка8_87 Шапка8_88 Шапка8_89 Шапка8_810
Шапка8_91 Шапка8_92 Шапка8_93 Шапка8_94 Шапка8_95 Шапка8_96 Шапка8_97 Шапка8_98 Шапка8_99 Шапка8_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ18
Символ28 СуммаНач8 ВсегоУдер8 СумКвыд8
Символ48
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер8;
!  SumList2 := SumList2 + СумКвыд8;
end.
 Ш@.{.?LUCC9;        │.}        │        │               │ Ш
 Ш@.{.?LUCC10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш@.{.?LUCC11;────────┼.}────────┤────────┼───────────────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@: удержано : &'#&&&&&&&&&&&&&.&&   к выдаче :  &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого8 ИтогоВсегоУдер8 ИтогоСумКвыд8
ИтогоСтр8 ИтогоПоВед8
СтрГлавБух8
ИтогоПоВедПрпись8
ИтогоПоВедПрписьСтрока8
'true':'s'
.endfields
 Ш .{.?LUCC12;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш .{.?LUCC13;        │.}        │        │               │ Ш
 Ш .{.?LUCC14;────────┴.}────────┴────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.begin
  SumList1 :=0;
  List := 1;
end.
.}
.{ LastNachTimeColmsCircle CheckEnter








.{ PeopC9 CheckEnter
.[h
.fields
Шапка9_11 Шапка9_12 Шапка9_13 Шапка9_14 Шапка9_15 Шапка9_16 Шапка9_17 Шапка9_18 Шапка9_19 Шапка9_110
Шапка9_21 Шапка9_22 Шапка9_23 Шапка9_24 Шапка9_25 Шапка9_26 Шапка9_27 Шапка9_28 Шапка9_29 Шапка9_210
Шапка9_31 Шапка9_32 Шапка9_33 Шапка9_34 Шапка9_35 Шапка9_36 Шапка9_37 Шапка9_38 Шапка9_39 Шапка9_310
Шапка9_41 Шапка9_42 Шапка9_43 Шапка9_44 Шапка9_45 Шапка9_46 Шапка9_47 Шапка9_48 Шапка9_49 Шапка9_410
Шапка9_51 Шапка9_52 Шапка9_53 Шапка9_54 Шапка9_55 Шапка9_56 Шапка9_57 Шапка9_58 Шапка9_59 Шапка9_510
Шапка9_61 Шапка9_62 Шапка9_63 Шапка9_64 Шапка9_65 Шапка9_66 Шапка9_67 Шапка9_68 Шапка9_69 Шапка9_610
Шапка9_71 Шапка9_72 Шапка9_73 Шапка9_74 Шапка9_75 Шапка9_76 Шапка9_77 Шапка9_78 Шапка9_79 Шапка9_710
Шапка9_81 Шапка9_82 Шапка9_83 Шапка9_84 Шапка9_85 Шапка9_86 Шапка9_87 Шапка9_88 Шапка9_89 Шапка9_810
Шапка9_91 Шапка9_92 Шапка9_93 Шапка9_94 Шапка9_95 Шапка9_96 Шапка9_97 Шапка9_98 Шапка9_99 Шапка9_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Дней9 Часов9 Дни9 Час9
СуммаНач9 ВсегоНач9
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач9;
end.
 Ш .{.?LNTCC9;@@@│@@@@│.}@@@│@@@@│ Ш
 Ш .{.?LNTCC10;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш .{.?LNTCC11;───┬────┼.}───┬────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней9 ИтогоЧасов9 ИтогоВсегоДни9 ИтогоВсегоЧас9
Итого9 ИтогоВсегоНач9
'true':'s'
.endfields
 Ш .{.?LNTCC12;@@@│@@@@│.}@@@│@@@@│ Ш
 Ш .{.?LNTCC13;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш .{.?LNTCC14;────────┴.}────────┘ Ш
^
.begin
  SumList1 :=0;
  List := 1;
end.
.}
.{ LastNachColmsCircle CheckEnter








.{ PeopC10 CheckEnter
.[h
.fields
Шапка10_11 Шапка10_12 Шапка10_13 Шапка10_14 Шапка10_15 Шапка10_16 Шапка10_17 Шапка10_18 Шапка10_19 Шапка10_110
Шапка10_21 Шапка10_22 Шапка10_23 Шапка10_24 Шапка10_25 Шапка10_26 Шапка10_27 Шапка10_28 Шапка10_29 Шапка10_210
Шапка10_31 Шапка10_32 Шапка10_33 Шапка10_34 Шапка10_35 Шапка10_36 Шапка10_37 Шапка10_38 Шапка10_39 Шапка10_310
Шапка10_41 Шапка10_42 Шапка10_43 Шапка10_44 Шапка10_45 Шапка10_46 Шапка10_47 Шапка10_48 Шапка10_49 Шапка10_410
Шапка10_51 Шапка10_52 Шапка10_53 Шапка10_54 Шапка10_55 Шапка10_56 Шапка10_57 Шапка10_58 Шапка10_59 Шапка10_510
Шапка10_61 Шапка10_62 Шапка10_63 Шапка10_64 Шапка10_65 Шапка10_66 Шапка10_67 Шапка10_68 Шапка10_69 Шапка10_610
Шапка10_71 Шапка10_72 Шапка10_73 Шапка10_74 Шапка10_75 Шапка10_76 Шапка10_77 Шапка10_78 Шапка10_79 Шапка10_710
Шапка10_81 Шапка10_82 Шапка10_83 Шапка10_84 Шапка10_85 Шапка10_86 Шапка10_87 Шапка10_88 Шапка10_89 Шапка10_810
Шапка10_91 Шапка10_92 Шапка10_93 Шапка10_94 Шапка10_95 Шапка10_96 Шапка10_97 Шапка10_98 Шапка10_99 Шапка10_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ110
Символ210 СуммаНач10 ВсегоНач10
Символ410
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач10;
end.
 Ш@.{.?LNCC9;        │.}        │ Ш
 Ш@.{.?LNCC10;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш@.{.?LNCC11;────────┼.}────────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!.endfields
! Ш------------------------------------------------------------------------------
! Щ Итого по листу  @@@@:                                     &'#&&&&&&&&&&&&&.&&
! Ш------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого10 ИтогоВсегоУдер10
'true':'s'
.endfields
 Ш .{.?LNCC12;@'~@@@@@│.}@'~@@@@@│ Ш
 Ш .{.?LNCC13;        │.}        │ Ш
 Ш .{.?LNCC14;────────┴.}────────┘ Ш
^
.begin
  SumList1 :=0;
  SumList2 :=0;
  SumList3 :=0;
  List := 1;
end.
.}
.{ LastNeNachCC CheckEnter
.{ PeopC105 CheckEnter
.[h
.fields
Шапка105_11 Шапка105_12 Шапка105_13 Шапка105_14 Шапка105_15 Шапка105_16 Шапка105_17 Шапка105_18 Шапка105_19 Шапка105_110
Шапка105_21 Шапка105_22 Шапка105_23 Шапка105_24 Шапка105_25 Шапка105_26 Шапка105_27 Шапка105_28 Шапка105_29 Шапка105_210
Шапка105_31 Шапка105_32 Шапка105_33 Шапка105_34 Шапка105_35 Шапка105_36 Шапка105_37 Шапка105_38 Шапка105_39 Шапка105_310
Шапка105_41 Шапка105_42 Шапка105_43 Шапка105_44 Шапка105_45 Шапка105_46 Шапка105_47 Шапка105_48 Шапка105_49 Шапка105_410
Шапка105_51 Шапка105_52 Шапка105_53 Шапка105_54 Шапка105_55 Шапка105_56 Шапка105_57 Шапка105_58 Шапка105_59 Шапка105_510
Шапка105_61 Шапка105_62 Шапка105_63 Шапка105_64 Шапка105_65 Шапка105_66 Шапка105_67 Шапка105_68 Шапка105_69 Шапка105_610
Шапка105_71 Шапка105_72 Шапка105_73 Шапка105_74 Шапка105_75 Шапка105_76 Шапка105_77 Шапка105_78 Шапка105_79 Шапка105_710
Шапка105_81 Шапка105_82 Шапка105_83 Шапка105_84 Шапка105_85 Шапка105_86 Шапка105_87 Шапка105_88 Шапка105_89 Шапка105_810
Шапка105_91 Шапка105_92 Шапка105_93 Шапка105_94 Шапка105_95 Шапка105_96 Шапка105_97 Шапка105_98 Шапка105_99 Шапка105_910
.endfields








 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Символ105_18
Символ105_28 СуммаНач105 ВсегоУдер105 ВсегоНенач105 СумКвыд105
Символ105_48
.endfields
.begin
!  SumList1 := SumList1 + ВсегоУдер8;
!  SumList2 := SumList2 + СумКвыд8;
end.
 Ш@.{.?LUNC9;        │.}        │        │        │               │ Ш
 Ш@.{.?LUNC10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш@.{.?LUNC11;────────┼.}────────┤────────┼────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!.endfields
! Ш---------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@: удержано : &'#&&&&&&&&&&&&&.&&   к выдаче :  &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
Итого105 ИтогоВсегоУдер105 ИтогоНенач105 ИтогоСумКвыд105
ИтогоСтр105 ИтогоПоВед105
СтрГлавБух105
ИтогоПоВедПрпись105
ИтогоПоВедПрписьСтрока105
'true':'s'
.endfields
 Ш .{.?LUNC12;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш .{.?LUNC13;        │.}        │        │        │               │ Ш
 Ш .{.?LUNC14;────────┴.}────────┴────────┴────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.begin
  SumList1 :=0;
  List := 1;
end.
.{ NachUdWithTimeCicle CheckEnter
.{ PeopC11 CheckEnter
.[h
.fields
Шапка11_11 Шапка11_12 Шапка11_13 Шапка11_14 Шапка11_15 Шапка11_16 Шапка11_17 Шапка11_18 Шапка11_19 Шапка11_110
Шапка11_21 Шапка11_22 Шапка11_23 Шапка11_24 Шапка11_25 Шапка11_26 Шапка11_27 Шапка11_28 Шапка11_29 Шапка11_210
Шапка11_31 Шапка11_32 Шапка11_33 Шапка11_34 Шапка11_35 Шапка11_36 Шапка11_37 Шапка11_38 Шапка11_39 Шапка11_310
Шапка11_41 Шапка11_42 Шапка11_43 Шапка11_44 Шапка11_45 Шапка11_46 Шапка11_47 Шапка11_48 Шапка11_49 Шапка11_410
Шапка11_51 Шапка11_52 Шапка11_53 Шапка11_54 Шапка11_55 Шапка11_56 Шапка11_57 Шапка11_58 Шапка11_59 Шапка11_510
Шапка11_61 Шапка11_62 Шапка11_63 Шапка11_64 Шапка11_65 Шапка11_66 Шапка11_67 Шапка11_68 Шапка11_69 Шапка11_610
Шапка11_71 Шапка11_72 Шапка11_73 Шапка11_74 Шапка11_75 Шапка11_76 Шапка11_77 Шапка11_78 Шапка11_79 Шапка11_710
Шапка11_81 Шапка11_82 Шапка11_83 Шапка11_84 Шапка11_85 Шапка11_86 Шапка11_87 Шапка11_88 Шапка11_89 Шапка11_810
Шапка11_91 Шапка11_92 Шапка11_93 Шапка11_94 Шапка11_95 Шапка11_96 Шапка11_97 Шапка11_98 Шапка11_99 Шапка11_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп11 ТабНом11 ФИО11:'d:r' Дней11 Часов11 ВсегоДней11 ВсегоЧасов11
Долж11:'d:r' СуммаНач11 ВсегоНач11 СуммаУд11 ВсегоУд11 СумКВыдаче11
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач11;
!  SumList2 := SumList2 + ВсегоУд11;
!  SumList3 := SumList3 + СумКВыдаче11;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNUWT9;@@@│@@@@│.}@@@│@@@@│.{.?NUUWT9;        │.}        │        │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNUWT10;@'~@@@@@│.}@'~@@@@@│.{.?NUUWT10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NNUWT11;───┬────┼.}───┬────┼.{.?NUUWT11;────────┼.}────────┤────────┼───────────────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш----------------------------------------------------------------------------------------------------------------
! Щ Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&
! Ш----------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней11 ИтогоЧасов11 ВсегоИтогоДней11 ВсегоИтогоЧасов11
ИтогоНач11 ВсегоИтогоНач11 ИтогоУд11 ВсегоИтогоУд11 ИтогоКВыдаче11
ИтогоСтр11 ИтогоПоВед11
СтрГлавБух11
ИтогоПоВедПрпись11
ИтогоПоВедПрписьСтрока11
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NNUWT12;@@@│@@@@│.}@@@│@@@@│.{.?NUUWT12;        │.}        │        │               │ Ш
 Ш│   │          │                  │.{.?NNUWT13;@'~@@@@@│.}@'~@@@@@│.{.?NUUWT13;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NNUWT14;────────┴.}────────┴.{.?NUUWT14;────────┴.}────────┴────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.begin
  SumList1 :=0;
  SumList2 := 0;
  SumList3 := 0;
  List := 1;
end.
.}
.{ NNachUdWithTimeCicle CheckEnter
.{ PeopC111 CheckEnter
.[h
.fields
Шапка111_11 Шапка111_12 Шапка111_13 Шапка111_14 Шапка111_15 Шапка111_16 Шапка111_17 Шапка111_18 Шапка111_19 Шапка111_110
Шапка111_21 Шапка111_22 Шапка111_23 Шапка111_24 Шапка111_25 Шапка111_26 Шапка111_27 Шапка111_28 Шапка111_29 Шапка111_210
Шапка111_31 Шапка111_32 Шапка111_33 Шапка111_34 Шапка111_35 Шапка111_36 Шапка111_37 Шапка111_38 Шапка111_39 Шапка111_310
Шапка111_41 Шапка111_42 Шапка111_43 Шапка111_44 Шапка111_45 Шапка111_46 Шапка111_47 Шапка111_48 Шапка111_49 Шапка111_410
Шапка111_51 Шапка111_52 Шапка111_53 Шапка111_54 Шапка111_55 Шапка111_56 Шапка111_57 Шапка111_58 Шапка111_59 Шапка111_510
Шапка111_61 Шапка111_62 Шапка111_63 Шапка111_64 Шапка111_65 Шапка111_66 Шапка111_67 Шапка111_68 Шапка111_69 Шапка111_610
Шапка111_71 Шапка111_72 Шапка111_73 Шапка111_74 Шапка111_75 Шапка111_76 Шапка111_77 Шапка111_78 Шапка111_79 Шапка111_710
Шапка111_81 Шапка111_82 Шапка111_83 Шапка111_84 Шапка111_85 Шапка111_86 Шапка111_87 Шапка111_88 Шапка111_89 Шапка111_810
Шапка111_91 Шапка111_92 Шапка111_93 Шапка111_94 Шапка111_95 Шапка111_96 Шапка111_97 Шапка111_98 Шапка111_99 Шапка111_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп111 ТабНом111 ФИО111:'d:r' Дней111 Часов111 ВсегоДней111 ВсегоЧасов111
Долж111:'d:r' СуммаНач111 ВсегоНач111 СуммаУд111 ВсегоУд111 ВсегоНеНач111 СумКВыдаче111
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач111;
!  SumList2 := SumList2 + ВсегоУд111;
!  SumList3 := SumList3 + СумКВыдаче111;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NUN9;@@@│@@@@│.}@@@│@@@@│.{.?UUN9;        │.}        │        │        │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NUN10;@'~@@@@@│.}@'~@@@@@│.{.?UUN10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NUN11;───┬────┼.}───┬────┼.{.?UUN11;────────┼.}────────┼────────┼────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!     SumList3 := Round(SumList3);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш---------------------------------------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоДней111 ИтогоЧасов111 ВсегоИтогоДней111 ВсегоИтогоЧасов111
ИтогоНач111 ВсегоИтогоНач111 ИтогоУд111 ВсегоИтогоУд111 ИтогоНеНач111 ИтогоКВыдаче111
ИтогоСтр111 ИтогоПоВед111
СтрГлавБух111
ИтогоПоВедПрпись111
ИтогоПоВедПрписьСтрока111
'true':'s'
.endfields
 Ш│   │  ИТОГО   │                  │.{.?NUN12;@@@│@@@@│.}@@@│@@@@│.{.?UUN12;        │.}        │        │        │               │ Ш
 Ш│   │          │                  │.{.?NUN13;@'~@@@@@│.}@'~@@@@@│.{.?UUN13;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NUN14;────────┴.}────────┴.{.?UUN14;────────┴.}────────┴────────┴────────┴───────────────┘ Ш
 Ш @@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.begin
  SumList1 :=0;
  SumList2 := 0;
  SumList3 := 0;
  List := 1;
end.
.{ NachUdCicle CheckEnter
.{ PeopC12 CheckEnter
.[h
.fields
Шапка12_11 Шапка12_12 Шапка12_13 Шапка12_14 Шапка12_15 Шапка12_16 Шапка12_17 Шапка12_18 Шапка12_19 Шапка12_110
Шапка12_21 Шапка12_22 Шапка12_23 Шапка12_24 Шапка12_25 Шапка12_26 Шапка12_27 Шапка12_28 Шапка12_29 Шапка12_210
Шапка12_31 Шапка12_32 Шапка12_33 Шапка12_34 Шапка12_35 Шапка12_36 Шапка12_37 Шапка12_38 Шапка12_39 Шапка12_310
Шапка12_41 Шапка12_42 Шапка12_43 Шапка12_44 Шапка12_45 Шапка12_46 Шапка12_47 Шапка12_48 Шапка12_49 Шапка12_410
Шапка12_51 Шапка12_52 Шапка12_53 Шапка12_54 Шапка12_55 Шапка12_56 Шапка12_57 Шапка12_58 Шапка12_59 Шапка12_510
Шапка12_61 Шапка12_62 Шапка12_63 Шапка12_64 Шапка12_65 Шапка12_66 Шапка12_67 Шапка12_68 Шапка12_69 Шапка12_610
Шапка12_71 Шапка12_72 Шапка12_73 Шапка12_74 Шапка12_75 Шапка12_76 Шапка12_77 Шапка12_78 Шапка12_79 Шапка12_710
Шапка12_81 Шапка12_82 Шапка12_83 Шапка12_84 Шапка12_85 Шапка12_86 Шапка12_87 Шапка12_88 Шапка12_89 Шапка12_810
Шапка12_91 Шапка12_92 Шапка12_93 Шапка12_94 Шапка12_95 Шапка12_96 Шапка12_97 Шапка12_98 Шапка12_99 Шапка12_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп12 ТабНом12 ФИО12:'d:r'
Долж12:'d:r' СуммаНач12 ВсегоНач12 СуммаУд12 ВсегоУд12 СумКВыдаче12
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач12;
!  SumList2 := SumList2 + ВсегоУд12;
!  SumList3 := SumList3 + СумКВыдаче12;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNU9;        │.}        │.{.?NUU9;        │.}        │        │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNU10;@'~@@@@@│.}@'~@@@@@│.{.?NUU10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NNU11;────────┼.}────────┼.{.?NUU11;────────┼.}────────┤────────┼───────────────┤ Ш
!.[f OverWrite
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш----------------------------------------------------------------------------------------------------------------
! Щ Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&
! Ш----------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоНач12 ВсегоИтогоНач12 ИтогоУд12 ВсегоИтогоУд12 ИтогоКВыдаче12
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NNU12;        │.}        │.{.?NUU12;        │.}        │        │               │ Ш
 Ш│   │          │                  │.{.?NNU13;@'~@@@@@│.}@'~@@@@@│.{.?NUU13;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NNU14;────────┴.}────────┴.{.?NUU14;────────┴.}────────┴────────┴───────────────┘ Ш
.fields
ИтогоСтр12 ИтогоПоВед12
СтрГлавБух12
ИтогоПоВедПрпись12
ИтогоПоВедПрписьСтрока12
'true':'s'
.endfields
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.{ NNachUdCicle CheckEnter
.{ PeopC112 CheckEnter
.[h
.fields
Шапка112_11 Шапка112_12 Шапка112_13 Шапка112_14 Шапка112_15 Шапка112_16 Шапка112_17 Шапка112_18 Шапка112_19 Шапка112_110
Шапка112_21 Шапка112_22 Шапка112_23 Шапка112_24 Шапка112_25 Шапка112_26 Шапка112_27 Шапка112_28 Шапка112_29 Шапка112_210
Шапка112_31 Шапка112_32 Шапка112_33 Шапка112_34 Шапка112_35 Шапка112_36 Шапка112_37 Шапка112_38 Шапка112_39 Шапка112_310
Шапка112_41 Шапка112_42 Шапка112_43 Шапка112_44 Шапка112_45 Шапка112_46 Шапка112_47 Шапка112_48 Шапка112_49 Шапка112_410
Шапка112_51 Шапка112_52 Шапка112_53 Шапка112_54 Шапка112_55 Шапка112_56 Шапка112_57 Шапка112_58 Шапка112_59 Шапка112_510
Шапка112_61 Шапка112_62 Шапка112_63 Шапка112_64 Шапка112_65 Шапка112_66 Шапка112_67 Шапка112_68 Шапка112_69 Шапка112_610
Шапка112_71 Шапка112_72 Шапка112_73 Шапка112_74 Шапка112_75 Шапка112_76 Шапка112_77 Шапка112_78 Шапка112_79 Шапка112_710
Шапка112_81 Шапка112_82 Шапка112_83 Шапка112_84 Шапка112_85 Шапка112_86 Шапка112_87 Шапка112_88 Шапка112_89 Шапка112_810
Шапка112_91 Шапка112_92 Шапка112_93 Шапка112_94 Шапка112_95 Шапка112_96 Шапка112_97 Шапка112_98 Шапка112_99 Шапка112_910
.endfields
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
 Ш^^^^^^^^^^ Ш
.]h
.fields
Нпп112 ТабНом112 ФИО112:'d:r'
Долж112:'d:r' СуммаНач112 ВсегоНач112 СуммаУд112 ВсегоУд112 ВсегоНеНач112 СумКВыдаче112
.endfields
.begin
!  SumList1 := SumList1 + ВсегоНач112;
!  SumList2 := SumList2 + ВсегоУд112;
!  SumList3 := SumList3 + СумКВыдаче112;
end.
 Ш│@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│.{.?NNUN9;        │.}        │.{.?UNUN9;        │.}        │        │        │               │ Ш
 Ш│   │          │@@@@@@@@@@@@@@@@@@│.{.?NNUN10;@'~@@@@@│.}@'~@@@@@│.{.?UNUN10;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш├───┼──────────┼──────────────────┼.{.?NNUN11;────────┼.}────────┼.{.?UNUN11;────────┼.}────────┤────────┤────────┼───────────────┤ Ш
!.[f OverWrite
!.begin
!if (FlagRo = 0)
!  begin
!     SumList1 := Round(SumList1);
!     SumList2 := Round(SumList2);
!     SumList3 := Round(SumList3);
!  end
!end.
!.fields
!  List
!  SumList1
!  SumList2
!  SumList3
!.endfields
! Ш---------------------------------------------------------------------------------------------------------------------
! Ш Итого по листу  @@@@:  начислено :&'#&&&&&&&&&&&&&.&&    удержано:&'#&&&&&&&&&&&&&.&&  к выдаче: &'#&&&&&&&&&&&&&.&&
! Ш---------------------------------------------------------------------------------------------------------------------
!.begin
!  SumList1 := 0;
!  SumList2 := 0;
!  SumList3 := 0;
!  List := List +1;
!end.
!.]f
.}
.fields
ИтогоНач112 ВсегоИтогоНач112 ИтогоУд112 ВсегоИтогоУд112 ИтогоНеНач112 ИтогоКВыдаче112
ИтогоСтр112 ИтогоПоВед112
СтрГлавБух112
ИтогоПоВедПрпись112
ИтогоПоВедПрписьСтрока112
'true':'s'
.endfields
 Ш│   │   БИТОГО Б   │                  │.{.?NNUN12;        │.}        │.{.?UNUN12;        │.}        │        │        │               │ Ш
 Ш│   │          │                  │.{.?NNUN13;@'~@@@@@│.}@'~@@@@@│.{.?UNUN13;@'~@@@@@│.}@'~@@@@@│@'~@@@@@│@'~@@@@@│               │ Ш
 Ш└───┴──────────┴──────────────────┴.{.?NNUN14;────────┴.}────────┴.{.?UNUN14;────────┴.}────────┴────────┴────────┴───────────────┘ Ш
 Ш@@@@@@@@@@@@@@@@@@@@   @'@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш

 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
^
.}
.}
.fields
ИтогоВедомость
.endfields
 СИТОГО ВЫПЛАЧЕНО: Б @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Р
 И( сумма к выдаче прописью) И
.endform