/*
 иммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм╩
 ╨                     (c) 1994,2002 ╙╝Ю╞╝Ю═Ф╗О ┐─▀─┼▓┬┼─                    ╨
 ╨ ▐Ю╝╔╙Б        : ┐─▀─┼▓┬┼─                                                 ╨
 ╨ ▒╗АБ╔╛═       : ┤═Ю═║╝Б╜═О ╞╚═Б═                                          ╨
 ╨ ┌╔ЮА╗О        : 5.83                                                      ╨
 ╨ █═╖╜═Г╔╜╗╔    : ░╔ё╗АБЮ ЦГ╔Б═ Ю═АЕ╝╓╝╒ ╞╝ ╝╞╚═Б╔ БЮЦ╓═                    ╨
 ╨ ▌Б╒╔БАБ╒╔╜╜К╘ : ▐╝ё╝АА╙╗╘ ┼╝╜АБ═╜Б╗╜ ┌╚═╓╗╛╗Ю╝╒╗Г                         ╨
 хммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм╪
*/
#doc
░╔ё╗АБЮ ЦГ╔Б═ Ю═АЕ╝╓╝╒ ╞╝ ╝╞╚═Б╔ БЮЦ╓═
#end
.set name='UchRasx'
.hide
Ъ≤Ъ≤.fields
 Pred
 newINN
 Podr
 NameVed
 NamGrup
 Mes1 God1 Mes2 God2
 InOut
 NameKolonki
 Viplati
 Podrkosty
 GGrup
 KAU2
 KAU3
 KAU4
 KAU5
 KAU6
 TabN Fio Mes Dop
 VidOpMy NameOpMy SummaMesMy SummaMesRoundMy SummaMy  SummaRoundMy
 DnMesMy DnMy ChasMesMy ChasMy
 VidOp NameOp SummaMes SummaMesRound Summa  SummaRound
 DnMes Dn ChasMes Chas KolRab
 KAU6GGrup KAU6SummaMes KAU6Summa
 KAU6DnMes KAU6Dn KAU6ChasMes KAU6Chas KAU6Rab
 KAU5GGrup KAU5SummaMes KAU5Summa
 KAU5DnMes KAU5Dn KAU5ChasMes KAU5Chas KAU5Rab
 KAU4GGrup KAU4SummaMes KAU4Summa
 KAU4DnMes KAU4Dn KAU4ChasMes KAU4Chas KAU4Rab
 KAU3GGrup KAU3SummaMes KAU3Summa
 KAU3DnMes KAU3Dn KAU3ChasMes KAU3Chas KAU3Rab
 KAU2GGrup KAU2SummaMes KAU2Summa
 KAU2DnMes KAU2Dn KAU2ChasMes KAU2Chas KAU2Rab
 ItogGGrup ItogSummaMes ItogSumma
 ItogDnMes ItogDn ItogChasMes ItogChas ItogRab
 ItogoPo PodrGGrup PodrSummaMes PodrSumma
 PodrDnMes PodrDn PodrChasMes PodrChas PodrRab
 Rasxod
 ItogSumSummaMes ItogSumSumma
 ItogSumDnMes ItogSumDn ItogSumChasMes ItogSumChas ItogSumRab
.endfields
Ъ≤
▌░┐─█┬┤─√┬÷ : ^ ┬██ ^
▒▓░⌠┼▓⌠░█▌┘ ▐▌└░─┤└┘▀┘█┬┘ :Ъ≤
.{ CheckEnter Podr1
^
.}Ъ≤

         ░┘┐┬▒▓░ ⌠≈┘▓─ ░─▒∙▌└▌┌ ▐▌ ^
         ▐▌ ^
         ┤─ ▐┘░┬▌└ ▒  ^  ^ ё. ▐▌ ^  ^ ё.
         ^

Ъ≤.{
.[h OverWrite skip
                                                                      АБЮ. @NP@
.]h
 .{.?DInfo1; .}
 .{.?DInfo2;^.}
 .{.?DInfo3; .}
Ъ≤здддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддбддддддддддддддддддддддбдддддддддддд©
Ё┌╗╓  Ё                                                 Ё                      ▒Ц╛╛═                       Ё   ▌БЮ═║╝Б═╜╝ ╓╜╔╘    Ё   ▌БЮ═║╝Б═╜╝ Г═А╝╒   Ё            Ё
Ё╝╞╔Ю.Ё         █═╗╛╔╜╝╒═╜╗╔ ╒╗╓═ ╝╞╔Ю═Ф╗╗              цддддддддддддддддддддддддбдддддддддддддддддддддддддеддддддддбдддддддддддддеддддддддбддддддддддддд╢   ┼╝╚-╒╝   Ё
Ё     Ё                                                 Ё         ╖═ ╛╔АОФ       Ё      А ╜═Г═╚═ ╞╔Ю╗╝╓═   Ё╖═ ╛╔АОФЁ  ╖═ ╞╔Ю╗╝╓  Ё╖═ ╛╔АОФЁ  ╖═ ╞╔Ю╗╝╓  Ё Ю═║╝Б╜╗╙╝╒ Ё
юдддддадддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддддадддддддддддддддддддддддддаддддддддадддддддддддддаддддддддадддддддддддддадддддддддддды
Ъ≤.{ CheckEnter Kosty
Ъ≤^
Ъ≤.{ CheckEnter Kosty1
Ъ≤^
Ъ≤.{ CheckEnter Nulevoi
 .{.?DInfo4; .}
Ъ≤иммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм╩
╨ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                     ╨
гдддддбддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддбддддддддбдддддддддддддбддддддддбдддддддддддддбдддддддддддд╤
Ъ≤ .{.?DInfo5; .}
 .{.?DInfo6; .}
.{ CheckEnter Kosty2
.if Proverka1
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддадддддддддда.{.?DInfo61;дддддддддддддддддддда.}дддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?DInfo62;                     .}╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддб.{.?DInfo63;ддддддддддддддддддддб.}дддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤.end
Ъ≤Ъ≤.{ CheckEnter Kosty3
Ъ≤Ъ≤.if Proverka2
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддадддддддддда.{.?DInfo64;дддддддддддддддддддда.}дддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?DInfo65;                     .}╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддб.{.?DInfo66;ддддддддддддддддддддб.}дддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤.end
Ъ≤Ъ≤.{ CheckEnter Kosty4
.if Proverka3
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддадддддддддда.{.?DInfo67;дддддддддддддддддддда.}дддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?DInfo68;                     .}╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддб.{.?DInfo69;ддддддддддддддддддддб.}дддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤.end
Ъ≤Ъ≤.{ CheckEnter Kosty5
.if Proverka4
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддадддддддддда.{.?DInfo610;дддддддддддддддддддда.}дддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?DInfo611;                     .}╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддб.{.?DInfo612;ддддддддддддддддддддб.}дддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤.end
Ъ≤Ъ≤.{ CheckEnter Kosty6
.if Proverka5
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддадддддддддда.{.?DInfo613;дддддддддддддддддддда.}дддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?DInfo614;                      .}╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддб.{.?DInfo615;ддддддддддддддддддддб.}дддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤.end
Ъ≤Ъ≤.{ CheckEnter Pervii
.{ CheckEnter Vtoroi
Ъ≤╨&&&& Ё^Ё&&&&&&&&&& Ъ≤.{.?DInfo7;^.}Ъ≤Ё&&&& Ё@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Ё&'&&&&&&&&&&&&&&.&&  ^  Ё&'&&&&&&&&&&&&&&.&&   ^  Ё&'#&&&.&Ё&'#&&&&&&&&.&Ё&'#&&&.&Ё&'#&&&&&&&&.&Ё ╨
Ъ≤.}
Ъ≤╨&&&& Ё@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Ё&'&&&&&&&&&&&&&&.&&  ^  Ё&'&&&&&&&&&&&&&&.&&   ^  Ё&'#&&&.&Ё&'#&&&&&&&&.&Ё&'#&&&.&Ё&'#&&&&&&&&.&Ё&'#&&&&&&&& ╨
Ъ≤.}
.if Proverka7
Ъ≤Ъ≤ .{.?DInfo71; .}
 .{.?DInfo72; .}
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддаддддддддддддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨        Ъ│ ┬▓▌┐▌ ▐▌  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ъ│Ъ│Ъ│Ъ│       &'&&&&&&&&&&&&&&&&&&&.&&Ё&'&&&&&&&&&&&&&&&&&&&&.&&Ё&'#&&&.&Ё&'#&&&&&&&&.&Ё&'#&&&.&Ё&'#&&&&&&&&.&Ё&'#&&&&&&&&&Ъ│╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддбддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤ .{.?DInfo73; .}
.end
Ъ≤Ъ≤.}
.if Proverka8
Ъ≤Ъ≤ .{.?DInfo74; .}
 .{.?DInfo75; .}
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддаддддддддддддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨        Ъ│ ┬▓▌┐▌ ▐▌  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ъ│Ъ│Ъ│Ъ│       &'&&&&&&&&&&&&&&&&&&&.&&Ё&'&&&&&&&&&&&&&&&&&&&&.&&Ё&'#&&&.&Ё&'#&&&&&&&&.&Ё&'#&&&.&Ё&'#&&&&&&&&.&Ё&'#&&&&&&&&&Ъ│╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддбддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤ .{.?DInfo76; .}
.end
Ъ≤Ъ≤.}
.if Proverka9
Ъ≤Ъ≤ .{.?DInfo77; .}
 .{.?DInfo78; .}
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддаддддддддддддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨        Ъ│ ┬▓▌┐▌ ▐▌  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ъ│Ъ│Ъ│Ъ│       &'&&&&&&&&&&&&&&&&&&&.&&Ё&'&&&&&&&&&&&&&&&&&&&&.&&Ё&'#&&&.&Ё&'#&&&&&&&&.&Ё&'#&&&.&Ё&'#&&&&&&&&.&Ё&'#&&&&&&&&&Ъ│╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддбддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤ .{.?DInfo79; .}
.end
Ъ≤Ъ≤.}
.if Proverka10
Ъ≤Ъ≤ .{.?DInfo710; .}
 .{.?DInfo711; .}
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддаддддддддддддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨        Ъ│ ┬▓▌┐▌ ▐▌  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ъ│Ъ│Ъ│Ъ│       &'&&&&&&&&&&&&&&&&&&&.&&Ё&'&&&&&&&&&&&&&&&&&&&&.&&Ё&'#&&&.&Ё&'#&&&&&&&&.&Ё&'#&&&.&Ё&'#&&&&&&&&.&Ё&'#&&&&&&&&&Ъ│╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддбддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤ .{.?DInfo712; .}
.end
Ъ≤Ъ≤.}
.if Proverka11
Ъ≤Ъ≤ .{.?DInfo713; .}
 .{.?DInfo714; .}
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддаддддддддддддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨        Ъ│ ┬▓▌┐▌ ▐▌  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ъ│Ъ│Ъ│Ъ│       &'&&&&&&&&&&&&&&&&&&&.&&Ё&'&&&&&&&&&&&&&&&&&&&&.&&Ё&'#&&&.&Ё&'#&&&&&&&&.&Ё&'#&&&.&Ё&'#&&&&&&&&.&Ё&'#&&&&&&&&&Ъ│╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддбддддддддддддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤ .{.?DInfo715; .}
.end
Ъ≤Ъ≤.}
 .{.?DInfo8; .}
 .{.?DInfo9; .}
Ъ≤гдддддадддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддддедддддддддддддддддддддддддеддддддддедддддддддддддеддддддддедддддддддддддедддддддддддд╤
╨        Ъ│ ┬▓▌┐▌ ▐▌  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@       &'&&&&&&&&&&&&&&&&&&&.&&Ё&'&&&&&&&&&&&&&&&&&&&&.&&Ё&'#&&&.&Ё&'#&&&&&&&&.&Ё&'#&&&.&Ё&'#&&&&&&&&.&Ё&'#&&&&&&&&&Ъ│╨
хммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммомммммммммммммммммммммммммоммммммммомммммммммммммоммммммммомммммммммммммомммммммммммм╪
Ъ≤ .{.?DInfo10; .}
.}
Ъ≤╨        Ъ│ ^  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@       &'&&&&&&&&&&&&&&&&&&&.&&Ё&'&&&&&&&&&&&&&&&&&&&&.&&Ё&'#&&&.&Ё&'#&&&&&&&&.&Ё&'#&&&.&Ё&'#&&&&&&&&.&Ё&'#&&&&&&&&&Ъ│╨
 Ъ≤.{.?DInfo11; .}
.}
 .{.?DInfo12; .}
 .{.?DInfo13; .}
Ъ≤иммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммямммммммммммммммммммммммммяммммммммямммммммммммммяммммммммямммммммммммммямммммммммммм╩
╨                                  Ъ│ ┬▓▌┐▌ ▐▌ ┌┘└▌▄▌▒▓┬ ^ : &'&&&&&&&&&&&&&&&&&&&.&&Ё&'&&&&&&&&&&&&&&&&&&&&.&&Ё&'#&&&.&Ё&'#&&&&&&&&.&Ё&'#&&&.&Ё&'#&&&&&&&&.&Ё&'#&&&&&&&&&Ъ│╨
хммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммомммммммммммммммммммммммммоммммммммомммммммммммммоммммммммомммммммммммммомммммммммммм╪
Ъ≤ .{.?DInfo14; .}
.}
.}
.EndForm

.linkform 'UchRasx_01' prototype is 'UchRasx'
.nameinlist'░╔ё╗АБЮ ЦГ╔Б═ Ю═АЕ╝╓╝╒ ╞╝ ╝╞╚═Б╔ БЮЦ╓═'
.group '1'
.p 60
.fields
CommonFormHeader
.endfields
^
.fields
 Pred
 newINN
 Podr
 NameVed
 NamGrup
 Mes1 God1 Mes2 God2
 InOut
 Viplati
 Podrkosty
 GGrup
 KAU2
 KAU3
 KAU4
 KAU5
 KAU6
 NameOp Summa
 KAU6GGrup KAU6Summa
 KAU5GGrup KAU5Summa
 KAU4GGrup KAU4Summa
 KAU3GGrup KAU3Summa
 KAU2GGrup KAU2Summa
 GGrup ItogSumma
 ItogoPo PodrGGrup PodrSumma
 Rasxod
 ItogSumSumma
.endfields
Ъ≤
▌░┐─█┬┤─√┬÷ : ^ ┬██ ^
▒▓░⌠┼▓⌠░█▌┘ ▐▌└░─┤└┘▀┘█┬┘:
Ъ≤.{ CheckEnter Podr1
Ъ≤                          ^
.}Ъ≤
Ъ≤
         ░┘┐┬▒▓░ ⌠≈┘▓─ ░─▒∙▌└▌┌ ▐▌ ^
         ▐▌ ^
         ┤─ ▐┘░┬▌└ ▒  ^  ^ ё. ▐▌ ^  ^ ё.
         ^Ъ≤

.{
.[h OverWrite skip
                                                                АБЮ. @NP@
.]h
здддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддд©.{.?DInfo1; .}
Ё            █═╗╛╔╜╝╒═╜╗╔ Ю═АЕ╝╓═                 Ё ▒Ц╛╛═ Ю═АЕ╝╓═        Ё.{.?DInfo2; .}
юдддддддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддддды.{.?DInfo3; .}
.{ CheckEnter Kosty
^
.{ CheckEnter Kosty1
^
.{ CheckEnter Nulevoi
имммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм╩.{.?DInfo4; .}
╨ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@╨.{.?DInfo5; .}
гдддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддд╤.{.?DInfo6; .}
.{ CheckEnter Kosty2
.if Proverka1
гдддддддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддддд╤.{.?DInfo61; .}
╨ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@╨.{.?DInfo62; .}
гдддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддд╤.{.?DInfo63; .}
.end
.{ CheckEnter Kosty3
.if Proverka2
гдддддддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддддд╤.{.?DInfo64; .}
╨ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@╨.{.?DInfo65; .}
гдддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддд╤.{.?DInfo66; .}
.end
.{ CheckEnter Kosty4
.if Proverka3
гдддддддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддддд╤.{.?DInfo67; .}
╨ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@╨.{.?DInfo68; .}
гдддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддд╤.{.?DInfo69; .}
.end
.{ CheckEnter Kosty5
.if Proverka4
гдддддддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддддд╤.{.?DInfo610; .}
╨ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@╨.{.?DInfo611; .}
гдддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддд╤.{.?DInfo612; .}
.end
.{ CheckEnter Kosty6
.if Proverka5
гдддддддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддддд╤.{.?DInfo613; .}
╨ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@╨.{.?DInfo614; .}
гдддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддд╤.{.?DInfo615; .}
.end
.{ CheckEnter Pervii
.{ CheckEnter Vtoroi
 .{.?DInfo7; .}
.}
╨@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Ё&'&&&&&&&&&&&&&&&&&.&&╨
.}
.if Proverka7
гдддддддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддддд╤.{.?DInfo71; .}.{.?DInfo72; .}
╨┬▓▌┐▌ ▐▌ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&&&.&&╨.{.?DInfo73; .}
гдддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддд╤
.end
.}
.if Proverka8
гдддддддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддддд╤.{.?DInfo74; .}.{.?DInfo75; .}
╨┬▓▌┐▌ ▐▌ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&&&.&&╨.{.?DInfo76; .}
гдддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддд╤
.end
.}
.if Proverka9
гдддддддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддддд╤.{.?DInfo77; .}.{.?DInfo78; .}
╨┬▓▌┐▌ ▐▌ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&&&.&&╨.{.?DInfo79; .}
гдддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддд╤
.end
.}
.if Proverka10
гдддддддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддддд╤.{.?DInfo710; .}.{.?DInfo711; .}
╨┬▓▌┐▌ ▐▌ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&&&.&&╨.{.?DInfo712; .}
гдддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддд╤
.end
.}
.if Proverka11
гдддддддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддддд╤.{.?DInfo713; .}.{.?DInfo714; .}
╨┬▓▌┐▌ ▐▌ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&&&.&&╨.{.?DInfo715; .}
гдддддддддддддддддддддддддддддддддддддддддддддддддбдддддддддддддддддддддд╤
.end
.}
гдддддддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддддд╤.{.?DInfo8; .}.{.?DInfo9; .}
╨┬▓▌┐▌ ▐▌ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&&&.&&╨.{.?DInfo10; .}
хмммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм╪
.}
          @@@@@@@@  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&&&.&&.{.?DInfo11; .}
.}
имммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм╩.{.?DInfo12; .}.{.?DInfo13; .}
╨┬▓▌┐▌ ▐▌ ┌┘└▌▄▌▒▓┬ @@@@@@@@@@@@@@@@@@@@@@@@@@@: &'&&&&&&&&&&&&&&&&&&&.&&╨.{.?DInfo14; .}
хмммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм╪
.}
.}
.EndForm

.linkform 'UchRasx_02' prototype is 'UchRasx'
.nameinlist'░╔ё╗АБЮ ЦГ╔Б═ Ю═АЕ╝╓╝╒ ╞╝ ╝╞╚═Б╔ БЮЦ╓═ ╞╝ Ю═║╝Б╜╗╙═╛'
.group '2'
.p 60
.DEFO LANDSCAPE
.fields
CommonFormHeader
.endfields
^
.fields
 Pred
 newINN
 Podr
 NameVed
 NamGrup
 Mes1 God1 Mes2 God2
 InOut
.endfields
Ъ≤
▌░┐─█┬┤─√┬÷ : ^ ┬██ ^
▒▓░⌠┼▓⌠░█▌┘ ▐▌└░─┤└┘▀┘█┬┘:
Ъ≤.{ CheckEnter Podr1
Ъ≤                          ^
.}Ъ≤
Ъ≤
         ░┘┐┬▒▓░ ⌠≈┘▓─ ░─▒∙▌└▌┌ ▐▌ ^
         ▐▌ ^
         ┤─ ▐┘░┬▌└ ▒  ^  ^ ё. ▐▌ ^  ^ ё.
         ^

Ъ≤.{
.[h OverWrite skip
Ъ≤                                                                                                                                        АБЮ. @NP@Ъ≤
.]h
.fields
 NameKolonki
.endfields
Ъ≤зддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддб.{.?DInfo1;ддддддддддддддддддддб.}дддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд©
Ё  ▓═║.Э   Ё     ■═╛╗╚╗О, ┬╛О, ▌БГ╔АБ╒╝                      Ё  ▄╔АОФ   Ё.{.?DInfo2;@@@@@@@@@@@@@@@@@@@@Ё.} █═╗╛╔╜╝╒═╜╗╔ Ю═АЕ╝╓═                            Ё▒Ц╛╛═ Ю═АЕ╝╓═          Ё
юддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддадддддддддда.{.?DInfo3;дддддддддддддддддддда.}дддддддддддддддддддддддддддддддддддддддддддддддддадддддддддддддддддддддддыЪ≤
Ъ≤Ъ≤.fields
 Viplati
 Podrkosty
 GGrup
 KAU2
 KAU3
 KAU4
 KAU5
 KAU6
 TabN  Fio  Mes Dop
 NameOpMy SummaMy
 KAU6GGrup KAU6Summa
 KAU5GGrup KAU5Summa
 KAU4GGrup KAU4Summa
 KAU3GGrup KAU3Summa
 KAU2GGrup KAU2Summa
 GGrup ItogSumma
 ItogoPo PodrGGrup PodrSumma
 Rasxod
 ItogSumSumma
.endfields
.{ CheckEnter Kosty
Ъ≤^
Ъ≤.{ CheckEnter Kosty1
Ъ≤^
Ъ≤.{ CheckEnter Nulevoi
Ъ≤имммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм.{.?DInfo4;ммммммммммммммммммммм.}ммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм╩
╨ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?DInfo5;                     .}╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддб.{.?DInfo6;ддддддддддддддддддддб.}дддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤.{ CheckEnter Kosty2
.if Proverka1
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддадддддддддда.{.?DInfo61;дддддддддддддддддддда.}дддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?DInfo62;                     .}╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддб.{.?DInfo63;ддддддддддддддддддддб.}дддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤.end
.{ CheckEnter Kosty3
Ъ≤Ъ≤.if Proverka2
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддадддддддддда.{.?DInfo64;дддддддддддддддддддда.}дддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?DInfo65;                     .}╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддб.{.?DInfo66;ддддддддддддддддддддб.}дддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤.end
.{ CheckEnter Kosty4
.if Proverka3
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддадддддддддда.{.?DInfo67;дддддддддддддддддддда.}дддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?DInfo68;                     .}╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддб.{.?DInfo69;ддддддддддддддддддддб.}дддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤.end
.{ CheckEnter Kosty5
.if Proverka4
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддадддддддддда.{.?DInfo610;дддддддддддддддддддда.}дддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?DInfo611;                     .}╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддб.{.?DInfo612;ддддддддддддддддддддб.}дддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤.end
.{ CheckEnter Kosty6
.if Proverka5
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддадддддддддда.{.?DInfo613;дддддддддддддддддддда.}дддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@.{.?DInfo614;                     .}╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддб.{.?DInfo615;ддддддддддддддддддддб.}дддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤.end
.{ CheckEnter Pervii
.{ CheckEnter Vtoroi
Ъ≤╨&&&&&&&&&&Ё@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Ё&&&&&&&&&&Ё.{.?DInfo7;@@@@@@@@@@@@@@@@@@@@Ё.}@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Ё&'&&&&&&&&&&&&&&&&&&.&&╨
Ъ≤.}
Ъ≤Ъ≤.}
.if Proverka7
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддадддддддддда.{.?DInfo71;дддддддддддддддддддда.}дддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨Ъ│Ъ│.{.?DInfo72;                     .}Ъ│┬▓▌┐▌ ▐▌  @@@@@Ъ│@@@@@@@@@@Ъ│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ъ│       Ъ│                                          Ъ│Ъ│&'&&&&&&&&&&&&&&&&&&&.&&Ъ≥Ъ≥Ъ│╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддб.{.?DInfo73;ддддддддддддддддддддб.}дддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤.end
.}
.if Proverka8
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддадддддддддда.{.?DInfo74;дддддддддддддддддддда.}дддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨Ъ│Ъ│.{.?DInfo75;                     .}Ъ│┬▓▌┐▌ ▐▌  @@@@@Ъ│@@@@@@@@@@Ъ│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ъ│       Ъ│                                          Ъ│Ъ│&'&&&&&&&&&&&&&&&&&&&.&&Ъ≥Ъ≥Ъ│╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддб.{.?DInfo76;ддддддддддддддддддддб.}дддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤.end
.}
.if Proverka9
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддадддддддддда.{.?DInfo77;дддддддддддддддддддда.}дддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨Ъ│Ъ│.{.?DInfo78;                     .}Ъ│┬▓▌┐▌ ▐▌  @@@@@Ъ│@@@@@@@@@@Ъ│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ъ│       Ъ│                                          Ъ│Ъ│&'&&&&&&&&&&&&&&&&&&&.&&Ъ≥Ъ≥Ъ│╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддб.{.?DInfo79;ддддддддддддддддддддб.}дддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤.end
.}
.if Proverka10
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддадддддддддда.{.?DInfo710;дддддддддддддддддддда.}дддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨Ъ│Ъ│.{.?DInfo711;                     .}Ъ│┬▓▌┐▌ ▐▌  @@@@@Ъ│@@@@@@@@@@Ъ│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ъ│       Ъ│                                          Ъ│Ъ│&'&&&&&&&&&&&&&&&&&&&.&&Ъ≥Ъ≥Ъ│╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддб.{.?DInfo712;ддддддддддддддддддддб.}дддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤.end
.}
.if Proverka11
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддадддддддддда.{.?DInfo713;дддддддддддддддддддда.}дддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨Ъ│Ъ│.{.?DInfo714;                     .}Ъ│┬▓▌┐▌ ▐▌  @@@@@Ъ│@@@@@@@@@@Ъ│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ъ│       Ъ│                                          Ъ│Ъ│&'&&&&&&&&&&&&&&&&&&&.&&Ъ≥Ъ≥Ъ│╨
гддддддддддбдддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддб.{.?DInfo715;ддддддддддддддддддддб.}дддддддддддддддддддддддддддддддддддддддддддддддддбддддддддддддддддддддддд╤
Ъ≤.end
.}
Ъ≤гддддддддддадддддддддддддддддддддддддддддддддддддддддддддддддадддддддддда.{.?DInfo8;дддддддддддддддддддда.}дддддддддддддддддддддддддддддддддддддддддддддддддаддддддддддддддддддддддд╤
╨       Ъ│                                          Ъ│.{.?DInfo9;                     .}Ъ│┬▓▌┐▌ ▐▌  @@@@@Ъ│@@@@@@@@@@Ъ│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&&&&&&&&&&.&&Ъ≥Ъ≥Ъ│╨
хмммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм.{.?DInfo10;ммммммммммммммммммммм.}ммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм╪
Ъ≤.}
Ъ≤        Ъ│                                                 Ъ│.{.?DInfo11;                     .}Ъ│@@@@@@@@  @@@@@@@Ъ│@@@@@@@@@@Ъ│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    &'&&&&&&&&&&&&&&&&&&&.&&Ъ│
Ъ≤.}
Ъ≤имммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм.{.?DInfo12;ммммммммммммммммммммм.}ммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм╩
╨                                                                        .{.?DInfo13;                     .} Ъ│ ┬▓▌┐▌ ▐▌ ┌┘└▌▄▌▒▓┬ @@@@@@@@Ъ│@@@@@@@@@@Ъ│@@@@@@@@: &'&&&&&&&&&&&&&&&&&&&.&&Ъ│╨
хмммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм.{.?DInfo14;ммммммммммммммммммммм.}ммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм╪
Ъ≤.}
.}
.EndForm