/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,97 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Заработная плата                                          ║
 ║ Версия        : 5.8                                                       ║
 ║ Назначение    : Расчет по авансовым платежам                              ║
 ║ Ответственный : Погосский Константин Владимирович                         ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
.LinkForm 'Socotch_03' prototype is 'Socotch1'
.nameinlist' Расчет по авансовым платежам по ЕСН на МН'
.F 'esnMN.out'
.group 'Socotch3'
.var
 rrr,rrr_2,rrr_3: String;
 CCount         : word;
.endvar
.fields
! СЛУЖЕБНАЯ ЧАСТЬ
 ИНН
 КПП
 Cur_Date
 Cur_Time
 ИНН
 Cur_Date
 Cur_Time
 InsNomer
 UpCase(Полное_наименование_организации)
 тел
 TuneEMail
 UpCase(Должность)
 UpCase(Ответственное_лицо_ФИО)
 UpCase(Ответственное_лицо_ФИО)
 тел
 TuneEMail
 Значки
 ИНН
 КПП
 год
 ИНН
 год
 дата_представления_с_точками
 UpCase(Полное_наименование_организации)
 ИНН
 КПП
 КПП
 TuneOGRN
//ruk
 UpCase(ФИОРук_ФИО)
! Руководитель_организации_ИНН
! ТелРук
! ТелРукDom
! ДатаРождРук
! МестоРождРук
! ПолРук
! ГраждРук
! КодГраждРук
! UpCase(УдЛичнРук)
! ВыдУдЛичнРук
! ДатаУдЛичнРук
! АдрМЖРукРФ
! АдрМЖРукРез
//buh
 UpCase(ФИОБух_ФИО)
! Главный_бухгалтер_ИНН
! ТелБух
! ТелБухDom
! ДатаРождБух
! МестоРождБух
! ПолБух
! ГраждБух
! КодГраждБух
! UpCase(УдЛичнБух)
! ВыдУдЛичнБух
! ДатаУдЛичн
! АдрМЖБухРФ
! АдрМЖБухРез
//isp
! UpCase(Ответственное_лицо_ФИО)
! Ответственное_лицо_ИНН
! тел
! телИспDom
! ДатаРождУпПред
! МестоРождУпПред
! ПолУпПред
! ГраждУпПред
! КодГраждУпПред
! UpCase(УдЛичнУпПред)
! ВыдУдЛичнУпПред
! ДатаУдЛичнУпПред
! АдрМЖУпПредРФ
! АдрМЖУпПредРез
//ИП
 UpCase(Ответственное_лицо_ФИО)
 Ответственное_лицо_ИНН
 TuneOGRN
 тел
 телИспDom
 ДатаРождУпПред
 МестоРождУпПред
 ПолУпПред
 ГраждУпПред
 КодГраждУпПред
 UpCase(УдЛичнУпПред)
 ВыдУдЛичнУпПред
 ДатаУдЛичнУпПред
 АдрМЖУпПредРФ
 АдрМЖУпПредРез
! ИНФОРМАЦИОННАЯ ЧАСТЬ
! Описание формы
 ПризФОтч
 КНД
 НаимФОтч
 ВерФОтч
 ПериодВерОтч
 PrizVidDok
 NomerKor
 ПризПериодОтч
 kvart
 Year
 TuneDocPerdst
 ОКЕИ
 КолПокФОтч
! Содержание формы
! итоги по налогам
 TuneOKATO
 if (поле_620_1 >= 0,DoubleToStr(поле_620_1,rrr),DoubleToStr(поле_620_1,rrr_2))
 if (поле_630_1 >= 0,DoubleToStr(поле_630_1,rrr),DoubleToStr(поле_630_1,rrr_2))
 if (поле_640_1 >= 0,DoubleToStr(поле_640_1,rrr),DoubleToStr(поле_640_1,rrr_2))
 if (поле_920_2 >= 0,DoubleToStr(поле_920_2,rrr),DoubleToStr(поле_920_2,rrr_2))
 if (поле_930_2 >= 0,DoubleToStr(поле_930_2,rrr),DoubleToStr(поле_930_2,rrr_2))
 if (поле_940_2 >= 0,DoubleToStr(поле_940_2,rrr),DoubleToStr(поле_940_2,rrr_2))
 if (поле_620_3 >= 0,DoubleToStr(поле_620_3,rrr),DoubleToStr(поле_620_3,rrr_2))
 if (поле_630_3 >= 0,DoubleToStr(поле_630_3,rrr),DoubleToStr(поле_630_3,rrr_2))
 if (поле_640_3 >= 0,DoubleToStr(поле_640_3,rrr),DoubleToStr(поле_640_3,rrr_2))
 if (поле_620_4 >= 0,DoubleToStr(поле_620_4,rrr),DoubleToStr(поле_620_4,rrr_2))
 if (поле_630_4 >= 0,DoubleToStr(поле_630_4,rrr),DoubleToStr(поле_630_4,rrr_2))
 if (поле_640_4 >= 0,DoubleToStr(поле_640_4,rrr),DoubleToStr(поле_640_4,rrr_2))
! расчет
 if (поле_100_1 >= 0,DoubleToStr(поле_100_1,rrr),DoubleToStr(поле_100_1,rrr_2))
 if (поле_100_2 >= 0,DoubleToStr(поле_100_2,rrr),DoubleToStr(поле_100_2,rrr_2))
 if (поле_100_3 >= 0,DoubleToStr(поле_100_3,rrr),DoubleToStr(поле_100_3,rrr_2))
 if (поле_100_4 >= 0,DoubleToStr(поле_100_4,rrr),DoubleToStr(поле_100_4,rrr_2))
 if (поле_110_1 >= 0,DoubleToStr(поле_110_1,rrr),DoubleToStr(поле_110_1,rrr_2))
 if (поле_110_2 >= 0,DoubleToStr(поле_110_2,rrr),DoubleToStr(поле_110_2,rrr_2))
 if (поле_110_3 >= 0,DoubleToStr(поле_110_3,rrr),DoubleToStr(поле_110_3,rrr_2))
 if (поле_110_4 >= 0,DoubleToStr(поле_110_4,rrr),DoubleToStr(поле_110_4,rrr_2))
 if (поле_120_1 >= 0,DoubleToStr(поле_120_1,rrr),DoubleToStr(поле_120_1,rrr_2))
 if (поле_120_2 >= 0,DoubleToStr(поле_120_2,rrr),DoubleToStr(поле_120_2,rrr_2))
 if (поле_120_3 >= 0,DoubleToStr(поле_120_3,rrr),DoubleToStr(поле_120_3,rrr_2))
 if (поле_120_4 >= 0,DoubleToStr(поле_120_4,rrr),DoubleToStr(поле_120_4,rrr_2))
 if (поле_130_1 >= 0,DoubleToStr(поле_130_1,rrr),DoubleToStr(поле_130_1,rrr_2))
 if (поле_130_2 >= 0,DoubleToStr(поле_130_2,rrr),DoubleToStr(поле_130_2,rrr_2))
 if (поле_130_3 >= 0,DoubleToStr(поле_130_3,rrr),DoubleToStr(поле_130_3,rrr_2))
 if (поле_130_4 >= 0,DoubleToStr(поле_130_4,rrr),DoubleToStr(поле_130_4,rrr_2))
 if (поле_140_1 >= 0,DoubleToStr(поле_140_1,rrr),DoubleToStr(поле_140_1,rrr_2))
 if (поле_140_2 >= 0,DoubleToStr(поле_140_2,rrr),DoubleToStr(поле_140_2,rrr_2))
 if (поле_140_3 >= 0,DoubleToStr(поле_140_3,rrr),DoubleToStr(поле_140_3,rrr_2))
 if (поле_140_4 >= 0,DoubleToStr(поле_140_4,rrr),DoubleToStr(поле_140_4,rrr_2))

 if (поле_200_1 >= 0,DoubleToStr(поле_200_1,rrr),DoubleToStr(поле_200_1,rrr_2))
 if (поле_200_2 >= 0,DoubleToStr(поле_200_2,rrr),DoubleToStr(поле_200_2,rrr_2))
 if (поле_200_3 >= 0,DoubleToStr(поле_200_3,rrr),DoubleToStr(поле_200_3,rrr_2))
 if (поле_200_4 >= 0,DoubleToStr(поле_200_4,rrr),DoubleToStr(поле_200_4,rrr_2))
 if (поле_210_1 >= 0,DoubleToStr(поле_210_1,rrr),DoubleToStr(поле_210_1,rrr_2))
 if (поле_210_2 >= 0,DoubleToStr(поле_210_2,rrr),DoubleToStr(поле_210_2,rrr_2))
 if (поле_210_3 >= 0,DoubleToStr(поле_210_3,rrr),DoubleToStr(поле_210_3,rrr_2))
 if (поле_210_4 >= 0,DoubleToStr(поле_210_4,rrr),DoubleToStr(поле_210_4,rrr_2))
 if (поле_220_1 >= 0,DoubleToStr(поле_220_1,rrr),DoubleToStr(поле_220_1,rrr_2))
 if (поле_220_2 >= 0,DoubleToStr(поле_220_2,rrr),DoubleToStr(поле_220_2,rrr_2))
 if (поле_220_3 >= 0,DoubleToStr(поле_220_3,rrr),DoubleToStr(поле_220_3,rrr_2))
 if (поле_220_4 >= 0,DoubleToStr(поле_220_4,rrr),DoubleToStr(поле_220_4,rrr_2))
 if (поле_230_1 >= 0,DoubleToStr(поле_230_1,rrr),DoubleToStr(поле_230_1,rrr_2))
 if (поле_230_2 >= 0,DoubleToStr(поле_230_2,rrr),DoubleToStr(поле_230_2,rrr_2))
 if (поле_230_3 >= 0,DoubleToStr(поле_230_3,rrr),DoubleToStr(поле_230_3,rrr_2))
 if (поле_230_4 >= 0,DoubleToStr(поле_230_4,rrr),DoubleToStr(поле_230_4,rrr_2))
 if (поле_240_1 >= 0,DoubleToStr(поле_240_1,rrr),DoubleToStr(поле_240_1,rrr_2))
 if (поле_240_2 >= 0,DoubleToStr(поле_240_2,rrr),DoubleToStr(поле_240_2,rrr_2))
 if (поле_240_3 >= 0,DoubleToStr(поле_240_3,rrr),DoubleToStr(поле_240_3,rrr_2))
 if (поле_240_4 >= 0,DoubleToStr(поле_240_4,rrr),DoubleToStr(поле_240_4,rrr_2))

 if (поле_300_1 >= 0,DoubleToStr(поле_300_1,rrr),DoubleToStr(поле_300_1,rrr_2))
 if (поле_310_1 >= 0,DoubleToStr(поле_310_1,rrr),DoubleToStr(поле_310_1,rrr_2))
 if (поле_320_1 >= 0,DoubleToStr(поле_320_1,rrr),DoubleToStr(поле_320_1,rrr_2))
 if (поле_330_1 >= 0,DoubleToStr(поле_330_1,rrr),DoubleToStr(поле_330_1,rrr_2))
 if (поле_340_1 >= 0,DoubleToStr(поле_340_1,rrr),DoubleToStr(поле_340_1,rrr_2))

 if (поле_400_1 >= 0,DoubleToStr(поле_400_1,rrr),DoubleToStr(поле_400_1,rrr_2))
 if (поле_400_2 >= 0,DoubleToStr(поле_400_2,rrr),DoubleToStr(поле_400_2,rrr_2))
 if (поле_400_3 >= 0,DoubleToStr(поле_400_3,rrr),DoubleToStr(поле_400_3,rrr_2))
 if (поле_400_4 >= 0,DoubleToStr(поле_400_4,rrr),DoubleToStr(поле_400_4,rrr_2))
 if (поле_410_1 >= 0,DoubleToStr(поле_410_1,rrr),DoubleToStr(поле_410_1,rrr_2))
 if (поле_410_2 >= 0,DoubleToStr(поле_410_2,rrr),DoubleToStr(поле_410_2,rrr_2))
 if (поле_410_3 >= 0,DoubleToStr(поле_410_3,rrr),DoubleToStr(поле_410_3,rrr_2))
 if (поле_410_4 >= 0,DoubleToStr(поле_410_4,rrr),DoubleToStr(поле_410_4,rrr_2))
 if (поле_420_1 >= 0,DoubleToStr(поле_420_1,rrr),DoubleToStr(поле_420_1,rrr_2))
 if (поле_420_2 >= 0,DoubleToStr(поле_420_2,rrr),DoubleToStr(поле_420_2,rrr_2))
 if (поле_420_3 >= 0,DoubleToStr(поле_420_3,rrr),DoubleToStr(поле_420_3,rrr_2))
 if (поле_420_4 >= 0,DoubleToStr(поле_420_4,rrr),DoubleToStr(поле_420_4,rrr_2))
 if (поле_430_1 >= 0,DoubleToStr(поле_430_1,rrr),DoubleToStr(поле_430_1,rrr_2))
 if (поле_430_2 >= 0,DoubleToStr(поле_430_2,rrr),DoubleToStr(поле_430_2,rrr_2))
 if (поле_430_3 >= 0,DoubleToStr(поле_430_3,rrr),DoubleToStr(поле_430_3,rrr_2))
 if (поле_430_4 >= 0,DoubleToStr(поле_430_4,rrr),DoubleToStr(поле_430_4,rrr_2))
 if (поле_440_1 >= 0,DoubleToStr(поле_440_1,rrr),DoubleToStr(поле_440_1,rrr_2))
 if (поле_440_2 >= 0,DoubleToStr(поле_440_2,rrr),DoubleToStr(поле_440_2,rrr_2))
 if (поле_440_3 >= 0,DoubleToStr(поле_440_3,rrr),DoubleToStr(поле_440_3,rrr_2))
 if (поле_440_4 >= 0,DoubleToStr(поле_440_4,rrr),DoubleToStr(поле_440_4,rrr_2))

 if (поле_500_1 >= 0,DoubleToStr(поле_500_1,rrr),DoubleToStr(поле_500_1,rrr_2))
 if (поле_500_2 >= 0,DoubleToStr(поле_500_2,rrr),DoubleToStr(поле_500_2,rrr_2))
 if (поле_500_3 >= 0,DoubleToStr(поле_500_3,rrr),DoubleToStr(поле_500_3,rrr_2))
 if (поле_500_4 >= 0,DoubleToStr(поле_500_4,rrr),DoubleToStr(поле_500_4,rrr_2))
 if (поле_510_1 >= 0,DoubleToStr(поле_510_1,rrr),DoubleToStr(поле_510_1,rrr_2))
 if (поле_510_2 >= 0,DoubleToStr(поле_510_2,rrr),DoubleToStr(поле_510_2,rrr_2))
 if (поле_510_3 >= 0,DoubleToStr(поле_510_3,rrr),DoubleToStr(поле_510_3,rrr_2))
 if (поле_510_4 >= 0,DoubleToStr(поле_510_4,rrr),DoubleToStr(поле_510_4,rrr_2))
 if (поле_520_1 >= 0,DoubleToStr(поле_520_1,rrr),DoubleToStr(поле_520_1,rrr_2))
 if (поле_520_2 >= 0,DoubleToStr(поле_520_2,rrr),DoubleToStr(поле_520_2,rrr_2))
 if (поле_520_3 >= 0,DoubleToStr(поле_520_3,rrr),DoubleToStr(поле_520_3,rrr_2))
 if (поле_520_4 >= 0,DoubleToStr(поле_520_4,rrr),DoubleToStr(поле_520_4,rrr_2))
 if (поле_530_1 >= 0,DoubleToStr(поле_530_1,rrr),DoubleToStr(поле_530_1,rrr_2))
 if (поле_530_2 >= 0,DoubleToStr(поле_530_2,rrr),DoubleToStr(поле_530_2,rrr_2))
 if (поле_530_3 >= 0,DoubleToStr(поле_530_3,rrr),DoubleToStr(поле_530_3,rrr_2))
 if (поле_530_4 >= 0,DoubleToStr(поле_530_4,rrr),DoubleToStr(поле_530_4,rrr_2))
 if (поле_540_1 >= 0,DoubleToStr(поле_540_1,rrr),DoubleToStr(поле_540_1,rrr_2))
 if (поле_540_2 >= 0,DoubleToStr(поле_540_2,rrr),DoubleToStr(поле_540_2,rrr_2))
 if (поле_540_3 >= 0,DoubleToStr(поле_540_3,rrr),DoubleToStr(поле_540_3,rrr_2))
 if (поле_540_4 >= 0,DoubleToStr(поле_540_4,rrr),DoubleToStr(поле_540_4,rrr_2))

 if (поле_600_1 >= 0,DoubleToStr(поле_600_1,rrr),DoubleToStr(поле_600_1,rrr_2))
 if (поле_600_2 >= 0,DoubleToStr(поле_600_2,rrr),DoubleToStr(поле_600_2,rrr_2))
 if (поле_600_3 >= 0,DoubleToStr(поле_600_3,rrr),DoubleToStr(поле_600_3,rrr_2))
 if (поле_600_4 >= 0,DoubleToStr(поле_600_4,rrr),DoubleToStr(поле_600_4,rrr_2))
 if (поле_610_1 >= 0,DoubleToStr(поле_610_1,rrr),DoubleToStr(поле_610_1,rrr_2))
 if (поле_610_2 >= 0,DoubleToStr(поле_610_2,rrr),DoubleToStr(поле_610_2,rrr_2))
 if (поле_610_3 >= 0,DoubleToStr(поле_610_3,rrr),DoubleToStr(поле_610_3,rrr_2))
 if (поле_610_4 >= 0,DoubleToStr(поле_610_4,rrr),DoubleToStr(поле_610_4,rrr_2))
 if (поле_620_1 >= 0,DoubleToStr(поле_620_1,rrr),DoubleToStr(поле_620_1,rrr_2))
 if (поле_620_2 >= 0,DoubleToStr(поле_620_2,rrr),DoubleToStr(поле_620_2,rrr_2))
 if (поле_620_3 >= 0,DoubleToStr(поле_620_3,rrr),DoubleToStr(поле_620_3,rrr_2))
 if (поле_620_4 >= 0,DoubleToStr(поле_620_4,rrr),DoubleToStr(поле_620_4,rrr_2))
 if (поле_630_1 >= 0,DoubleToStr(поле_630_1,rrr),DoubleToStr(поле_630_1,rrr_2))
 if (поле_630_2 >= 0,DoubleToStr(поле_630_2,rrr),DoubleToStr(поле_630_2,rrr_2))
 if (поле_630_3 >= 0,DoubleToStr(поле_630_3,rrr),DoubleToStr(поле_630_3,rrr_2))
 if (поле_630_4 >= 0,DoubleToStr(поле_630_4,rrr),DoubleToStr(поле_630_4,rrr_2))
 if (поле_640_1 >= 0,DoubleToStr(поле_640_1,rrr),DoubleToStr(поле_640_1,rrr_2))
 if (поле_640_2 >= 0,DoubleToStr(поле_640_2,rrr),DoubleToStr(поле_640_2,rrr_2))
 if (поле_640_3 >= 0,DoubleToStr(поле_640_3,rrr),DoubleToStr(поле_640_3,rrr_2))
 if (поле_640_4 >= 0,DoubleToStr(поле_640_4,rrr),DoubleToStr(поле_640_4,rrr_2))

 if (поле_700_2 >= 0,DoubleToStr(поле_700_2,rrr),DoubleToStr(поле_700_2,rrr_2))
 if (поле_710_2 >= 0,DoubleToStr(поле_710_2,rrr),DoubleToStr(поле_710_2,rrr_2))
 if (поле_720_2 >= 0,DoubleToStr(поле_720_2,rrr),DoubleToStr(поле_720_2,rrr_2))
 if (поле_730_2 >= 0,DoubleToStr(поле_730_2,rrr),DoubleToStr(поле_730_2,rrr_2))
 if (поле_740_2 >= 0,DoubleToStr(поле_740_2,rrr),DoubleToStr(поле_740_2,rrr_2))
 if (поле_800_2 >= 0,DoubleToStr(поле_800_2,rrr),DoubleToStr(поле_800_2,rrr_2))
 if (поле_810_2 >= 0,DoubleToStr(поле_810_2,rrr),DoubleToStr(поле_810_2,rrr_2))
 if (поле_820_2 >= 0,DoubleToStr(поле_820_2,rrr),DoubleToStr(поле_820_2,rrr_2))
 if (поле_830_2 >= 0,DoubleToStr(поле_830_2,rrr),DoubleToStr(поле_830_2,rrr_2))
 if (поле_840_2 >= 0,DoubleToStr(поле_840_2,rrr),DoubleToStr(поле_840_2,rrr_2))
 if (поле_900_2 >= 0,DoubleToStr(поле_900_2,rrr),DoubleToStr(поле_900_2,rrr_2))
 if (поле_910_2 >= 0,DoubleToStr(поле_910_2,rrr),DoubleToStr(поле_910_2,rrr_2))
 if (поле_920_2 >= 0,DoubleToStr(поле_920_2,rrr),DoubleToStr(поле_920_2,rrr_2))
 if (поле_930_2 >= 0,DoubleToStr(поле_930_2,rrr),DoubleToStr(поле_930_2,rrr_2))
 if (поле_940_2 >= 0,DoubleToStr(поле_940_2,rrr),DoubleToStr(поле_940_2,rrr_2))
 if (поле_1000_1 >= 0,DoubleToStr(поле_1000_1,rrr),DoubleToStr(поле_1000_1,rrr_2))
 if (поле_1000_2 >= 0,DoubleToStr(поле_1000_2,rrr),DoubleToStr(поле_1000_2,rrr_2))
 if (поле_1000_3 >= 0,DoubleToStr(поле_1000_3,rrr),DoubleToStr(поле_1000_3,rrr_2))
 if (поле_1000_4 >= 0,DoubleToStr(поле_1000_4,rrr),DoubleToStr(поле_1000_4,rrr_2))
 if (поле_1100_1 >= 0,DoubleToStr(поле_1100_1,rrr),DoubleToStr(поле_1100_1,rrr_2))
 if (поле_1100_2 >= 0,DoubleToStr(поле_1100_2,rrr),DoubleToStr(поле_1100_2,rrr_2))
 if (поле_1100_3 >= 0,DoubleToStr(поле_1100_3,rrr),DoubleToStr(поле_1100_3,rrr_2))
 if (поле_1100_4 >= 0,DoubleToStr(поле_1100_4,rrr),DoubleToStr(поле_1100_4,rrr_2))
 if (поле_1200_1 >= 0,DoubleToStr(поле_1200_1,rrr),DoubleToStr(поле_1200_1,rrr_2))
 if (поле_1200_2 >= 0,DoubleToStr(поле_1200_2,rrr),DoubleToStr(поле_1200_2,rrr_2))
 if (поле_1200_3 >= 0,DoubleToStr(поле_1200_3,rrr),DoubleToStr(поле_1200_3,rrr_2))
 if (поле_1200_4 >= 0,DoubleToStr(поле_1200_4,rrr),DoubleToStr(поле_1200_4,rrr_2))
 if (поле_1300_1 >= 0,DoubleToStr(поле_1300_1,rrr),DoubleToStr(поле_1300_1,rrr_2))
! распределение по диапазонам
 if (До_100_21 >= 0,DoubleToStr(До_100_21,rrr),DoubleToStr(До_100_21,rrr_2))
 if (До_100_22 >= 0,DoubleToStr(До_100_22,rrr),DoubleToStr(До_100_22,rrr_2))
 if (До_100_3 >= 0,DoubleToStr(До_100_3,rrr),DoubleToStr(До_100_3,rrr_2))
 DoubleToStr(До_100_121,rrr_3)
 DoubleToStr(До_100_122,rrr_3)
 DoubleToStr(До_100_123,rrr_3)

 if (От100до300_21 >= 0,DoubleToStr(От100до300_21,rrr),DoubleToStr(От100до300_21,rrr_2))
 if (От100до300_22 >= 0,DoubleToStr(От100до300_22,rrr),DoubleToStr(От100до300_22,rrr_2))
 if (От100до300_3 >= 0,DoubleToStr(От100до300_3,rrr),DoubleToStr(От100до300_3,rrr_2))
 DoubleToStr(От100до300_121,rrr_3)
 DoubleToStr(От100до300_122,rrr_3)
 DoubleToStr(От100до300_123,rrr_3)

 if (Сум_100_21 >= 0,DoubleToStr(Сум_100_21,rrr),DoubleToStr(Сум_100_21,rrr_2))
 if (Сум_100_22 >= 0,DoubleToStr(Сум_100_22,rrr),DoubleToStr(Сум_100_22,rrr_2))
 if (Сум_100_3 >= 0,DoubleToStr(Сум_100_3,rrr),DoubleToStr(Сум_100_3,rrr_2))
 DoubleToStr(Сум_100_121,rrr_3)
 DoubleToStr(Сум_100_122,rrr_3)
 DoubleToStr(Сум_100_123,rrr_3)

 if (Превыш_100_21 >= 0,DoubleToStr(Превыш_100_21,rrr),DoubleToStr(Превыш_100_21,rrr_2))
 if (Превыш_100_22 >= 0,DoubleToStr(Превыш_100_22,rrr),DoubleToStr(Превыш_100_22,rrr_2))
 if (Превыш_100_3 >= 0,DoubleToStr(Превыш_100_3,rrr),DoubleToStr(Превыш_100_3,rrr_2))

 if (От300до600_21 >= 0,DoubleToStr(От300до600_21,rrr),DoubleToStr(От300до600_21,rrr_2))
 if (От300до600_22 >= 0,DoubleToStr(От300до600_22,rrr),DoubleToStr(От300до600_22,rrr_2))
 if (От300до600_3 >= 0,DoubleToStr(От300до600_3,rrr),DoubleToStr(От300до600_3,rrr_2))
 DoubleToStr(От300до600_121,rrr_3)
 DoubleToStr(От300до600_122,rrr_3)
 DoubleToStr(От300до600_123,rrr_3)

 if (Сум_300_21 >= 0,DoubleToStr(Сум_300_21,rrr),DoubleToStr(Сум_300_21,rrr_2))
 if (Сум_300_22 >= 0,DoubleToStr(Сум_300_22,rrr),DoubleToStr(Сум_300_22,rrr_2))
 if (Сум_300_3 >= 0,DoubleToStr(Сум_300_3,rrr),DoubleToStr(Сум_300_3,rrr_2))
 DoubleToStr(Сум_300_121,rrr_3)
 DoubleToStr(Сум_300_12,rrr_3)
 DoubleToStr(Сум_300_123,rrr_3)

 if (Превыш_300_21 >= 0,DoubleToStr(Превыш_300_21,rrr),DoubleToStr(Превыш_300_21,rrr_2))
 if (Превыш_300_22 >= 0,DoubleToStr(Превыш_300_22,rrr),DoubleToStr(Превыш_300_22,rrr_2))
 if (Превыш_300_3 >= 0,DoubleToStr(Превыш_300_3,rrr),DoubleToStr(Превыш_300_3,rrr_2))

 if (Свыше_600_21 >= 0,DoubleToStr(Свыше_600_21,rrr),DoubleToStr(Свыше_600_21,rrr_2))
 if (Свыше_600_22 >= 0,DoubleToStr(Свыше_600_22,rrr),DoubleToStr(Свыше_600_22,rrr_2))
 if (Свыше_600_3 >= 0,DoubleToStr(Свыше_600_3,rrr),DoubleToStr(Свыше_600_3,rrr_2))
 DoubleToStr(Свыше_600_121,rrr_3)
 DoubleToStr(Свыше_600_122,rrr_3)
 DoubleToStr(Свыше_600_123,rrr_3)

 if (Сум_600_21 >= 0,DoubleToStr(Сум_600_21,rrr),DoubleToStr(Сум_600_21,rrr_2))
 if (Сум_600_22 >= 0,DoubleToStr(Сум_600_22,rrr),DoubleToStr(Сум_600_22,rrr_2))
 if (Сум_600_3 >= 0,DoubleToStr(Сум_600_3,rrr),DoubleToStr(Сум_600_3,rrr_2))
 DoubleToStr(Сум_600_121,rrr_3)
 DoubleToStr(Сум_600_122,rrr_3)
 DoubleToStr(Сум_600_123,rrr_3)

 if (Превыш_600_21 >= 0,DoubleToStr(Превыш_600_21,rrr),DoubleToStr(Превыш_600_21,rrr_2))
 if (Превыш_600_22 >= 0,DoubleToStr(Превыш_600_22,rrr),DoubleToStr(Превыш_600_22,rrr_2))
 if (Превыш_600_3 >= 0,DoubleToStr(Превыш_600_3,rrr),DoubleToStr(Превыш_600_3,rrr_2))

 if (Итого_21 >= 0,DoubleToStr(Итого_21,rrr),DoubleToStr(Итого_21,rrr_2))
 if (Итого_22 >= 0,DoubleToStr(Итого_22,rrr),DoubleToStr(Итого_22,rrr_2))
 if (Итого_3 >= 0,DoubleToStr(Итого_3,rrr),DoubleToStr(Итого_3,rrr_2))
 DoubleToStr(Итого_121,rrr_3)
 DoubleToStr(Итого_122,rrr_3)
 DoubleToStr(Итого_123,rrr_3)
! условия на право применения регрессии
 Средняя_численность_1
 Средняя_численность_2
 Средняя_численность_3
 if (Всего_выплат_1 >= 0,DoubleToStr(Всего_выплат_1,rrr),DoubleToStr(Всего_выплат_1,rrr_2))
 if (Всего_выплат_2 >= 0,DoubleToStr(Всего_выплат_2,rrr),DoubleToStr(Всего_выплат_2,rrr_2))
 if (Всего_выплат_3 >= 0,DoubleToStr(Всего_выплат_3,rrr),DoubleToStr(Всего_выплат_3,rrr_2))
 Численность_исключенных_1
 Численность_исключенных_2
 Численность_исключенных_3
 if (Выплаты_исключенным_1 >= 0,DoubleToStr(Выплаты_исключенным_1,rrr),DoubleToStr(Выплаты_исключенным_1,rrr_2))
 if (Выплаты_исключенным_2 >= 0,DoubleToStr(Выплаты_исключенным_2,rrr),DoubleToStr(Выплаты_исключенным_2,rrr_2))
 if (Выплаты_исключенным_3 >= 0,DoubleToStr(Выплаты_исключенным_3,rrr),DoubleToStr(Выплаты_исключенным_3,rrr_2))
 if (Выплаты_остальным_1 >= 0,DoubleToStr(Выплаты_остальным_1,rrr),DoubleToStr(Выплаты_остальным_1,rrr_2))
 if (Выплаты_остальным_2 >= 0,DoubleToStr(Выплаты_остальным_2,rrr),DoubleToStr(Выплаты_остальным_2,rrr_2))
 if (Выплаты_остальным_3 >= 0,DoubleToStr(Выплаты_остальным_3,rrr),DoubleToStr(Выплаты_остальным_3,rrr_2))
 if (Налоговая_база_на_работника_1 >= 0,DoubleToStr(Налоговая_база_на_работника_1,rrr),DoubleToStr(Налоговая_база_на_работника_1,rrr_2))
 if (Налоговая_база_на_работника_2 >= 0,DoubleToStr(Налоговая_база_на_работника_2,rrr),DoubleToStr(Налоговая_база_на_работника_2,rrr_2))
 if (Налоговая_база_на_работника_3 >= 0,DoubleToStr(Налоговая_база_на_работника_3,rrr),DoubleToStr(Налоговая_база_на_работника_3,rrr_2))
 Кол_Месяцев_1
 Кол_Месяцев_2
 Кол_Месяцев_3
 if (Налоговая_база_в_среднем_1 >= 0,DoubleToStr(Налоговая_база_в_среднем_1,rrr),DoubleToStr(Налоговая_база_в_среднем_1,rrr_2))
 if (Налоговая_база_в_среднем_2 >= 0,DoubleToStr(Налоговая_база_в_среднем_2,rrr),DoubleToStr(Налоговая_база_в_среднем_2,rrr_2))
 if (Налоговая_база_в_среднем_3 >= 0,DoubleToStr(Налоговая_база_в_среднем_3,rrr),DoubleToStr(Налоговая_база_в_среднем_3,rrr_2))
! данные по инвалидам
 ФИО_инв_ФИО
 Справка_номер
 Дата_выдачи
 Груп_инв
 Дата_выдачи + ',' + На_срок
 if (Всего_инв >= 0,DoubleToStr(Всего_инв,rrr),DoubleToStr(Всего_инв,rrr_2))
 if (Квартал_инв >= 0,DoubleToStr(Квартал_инв,rrr),DoubleToStr(Квартал_инв,rrr_2))
 if (месяц1_инв >= 0,DoubleToStr(месяц1_инв,rrr),DoubleToStr(месяц1_инв,rrr_2))
 if (месяц2_инв >= 0,DoubleToStr(месяц2_инв,rrr),DoubleToStr(месяц2_инв,rrr_2))
 if (месяц3_инв >= 0,DoubleToStr(месяц3_инв,rrr),DoubleToStr(месяц3_инв,rrr_2))
! суммарно данные по инвалидам
 if (Итого_Всего_инв >= 0,DoubleToStr(Итого_Всего_инв,rrr),DoubleToStr(Итого_Всего_инв,rrr_2))
 if (Итого_Квартал_инв >= 0,DoubleToStr(Итого_Квартал_инв,rrr),DoubleToStr(Итого_Квартал_инв,rrr_2))
 if (Итого_месяц1_инв >= 0,DoubleToStr(Итого_месяц1_инв,rrr),DoubleToStr(Итого_месяц1_инв,rrr_2))
 if (Итого_месяц2_инв >= 0,DoubleToStr(Итого_месяц2_инв,rrr),DoubleToStr(Итого_месяц2_инв,rrr_2))
 if (Итого_месяц3_инв >= 0,DoubleToStr(Итого_месяц3_инв,rrr),DoubleToStr(Итого_месяц3_инв,rrr_2))
//======================
 Значки
.endfields
.begin
  rrr   := '666666666666667'
  rrr_2 := '-66666666666667'
  rrr_3 := '666666666667'
end.
! СЛУЖЕБНАЯ ЧАСТЬ
.{?internal; (Length(Trim(ИНН))<11)
ИдФайл:^**^^^
.}
.{?internal; (Length(Trim(ИНН))>11)
ИдФайл:^*********^^
.}
ТипИнф:ОТЧЕТНОСТЬНП
ВерсФорм:3.00
ИдПол:^
ВерсПрог:ГАЛАКТИКА
КолДок:1
.{?internal; (trim(TuneDocPerdst) <> '112')
НаимОтпрЮл:^
ТелОтпр:^
EmailОтпр:^
ДолжнОтпр:^
ФИООтпр:^
.}
.{?internal; (trim(TuneDocPerdst) = '112')
ФИООтпрФЛ:^
ТелОтпр:^
EmailОтпр:^
.}
^
.{?internal; (Length(Trim(ИНН))<11)
ИдДок:^**^^00000001
.}
.{?internal; (Length(Trim(ИНН))>11)
ИдДок:^*********^00000001
.}
ДатаДок:^
###
.{?internal; (trim(TuneDocPerdst) <> '112')
НаимЮЛПол:^
ИННЮЛ:^
.{?internal; (trim(TuneDocPerdst) <> '220')
КППЮЛ:^
.}
.{?internal; (trim(TuneDocPerdst) = '220')
КППОП:^
.}
ОГРН:^
###
ФИОРук:^
!.{?internal; (trim(VKakoiOtch) = '1')
!.{?internal; (ФИОРук_ФИО <> ',,')
!ИННРук:^
!.{?internal; (Trim(Руководитель_организации_ИНН) = '')
!ТелСлужРук:^
!.{?internal; (Trim(ТелРук) = '')
!ТелДомРук:^
!.}
!ДатаРождРук:^
!МестоРождРук:^
!ПолРук:^
!Гражд:^
!КодГражд:^
!УдЛичнРук:^
!ВыдУдЛичнРук:^
!ДатаУдЛичнРук:^
!АдрМЖРукРФ:^
!.{?internal; (trim(ГраждРук) <> '643')
!АдрМЖРукРез:^
!.}
!.}
!.}
!.}
ФИОБух:^
!.{?internal; (trim(VKakoiOtch) = '1')
!ИННБух:^
!.{?internal; (Trim(Главный_бухгалтер_ИНН) = '')
!ТелСлужБух:^
!.{?internal; (Trim(ТелБух) = '')or(Trim(ТелБух) = ' ')
!ТелДомБух:^
!.}
!ДатаРождБух:^
!МестоРождБух:^
!ПолБух:^
!ГраждБух:^
!КодГраждБух:^
!УдЛичнБух:^
!ВыдУдЛичнБух:^
!ДатаУдЛичнБух:^
!АдрМЖБухРФ:^
!.{?internal; (trim(ГраждБух) <> '643')
!АдрМЖБухРез:^
!.}
!.}
!.}
!.{?internal; (trim(VKakoiOtch) = '1')
!ФИОУпПред:^
!.{?internal; (Ответственное_лицо_ФИО <> ',,')
!ИННУпПред:^
!.{?internal; (trim(Ответственное_лицо_ИНН) = '')or(trim(Ответственное_лицо_ИНН) = ' ')
!ТелСлужУпПред:^
!.{?internal; (Trim(тел) = '')or(Trim(тел) = ' ')
!ТелДомУпПред:^
!.}
!ДатаРождУпПред:^
!МестоРождУпПред:^
!ПолУпПред:^
!ГраждУпПред:^
!КодГраждУпПред:^
!УдЛичнУпПред:^
!ВыдУдЛичнУпПред:^
!ДатаУдЛичнУпПред:^
!АдрМЖУпПредРФ:^
!.{?internal; (trim(ГраждУпПред) <> '643')
!АдрМЖУпПредРез:^
!.}
!.}
!.}
!.}
.}
.{?internal; (trim(TuneDocPerdst) = '112')
ФИО:^
ИННФЛ:^
.{?internal; (trim(TuneDocPerdst) = '120')
ОГРНИП:^
.}
.{?internal; ((trim(Ответственное_лицо_ИНН) = '')or(trim(Ответственное_лицо_ИНН) = ' '))and(trim(TuneDocPerdst) = '112')
ТелСлуж:^
ТелДом:^
ДатаРожд:^
МестоРожд:^
.{?internal; (trim(VKakoiOtch) = '0')
Пол:^
.}
Гражд:^
КодГражд:^
УдЛичн:^
ВыдУдЛичн:^
ДатаУдЛичн:^
АдрМЖ:^
.{?internal; (trim(ГраждУпПред) <> '643')
АдрМЖРез:^
.}
.}
.}
###
! ИНФОРМАЦИОННАЯ ЧАСТЬ
! Описание формы
ПризФОтч:^
КНД:^
НаимФОтч:^
!пустой
!.{?internal; (trim(VKakoiOtch) = '1')
!ПризАдОбъед:
!.}
ВерФОтч:^
ПериодВерОтч:^
ПризВидДок:^
.{?internal; (trim(PrizVidDok) = '3')
НомерКорр:^
.}
ПризПериодОтч:^
.{?internal; (trim(ПризПериодОтч) <> '0')and(trim(VKakoiOtch) <> '1')
НомерПериодОтч:^
.}
ГодПериодОтч:^
ДокПредст:^
ОКЕИ:^
КолПокФОтч:^
###
! Содержание формы
! итоги по налогам
.{?internal; (trim(TuneDocPerdst) = '220') or (trim(TuneDocPerdst) = '210')
П000010000100:01
.}
.{?internal; (trim(TuneDocPerdst) = '112')
П000010000100:04
.}
.{?internal; (trim(TuneDocPerdst) = '120')
П000010000100:03
.}
.{?internal; (trim(TuneDocPerdst) = '331') or (trim(TuneDocPerdst) = '332') or (trim(TuneDocPerdst) = '333')
П000010000100:
.}
П000010001000:^
###
.{?internal; (trim(VKakoiOtch) = '0')
П000010002000:18210201010010000110
.}
.{?internal; (trim(VKakoiOtch) = '1')
П000010002000:18210201010011000110
.}
П000010003000:^
П000010004000:^
П000010005000:^
###
.{?internal; (trim(VKakoiOtch) = '0')
П000010002000:18210201020070000110
.}
.{?internal; (trim(VKakoiOtch) = '1')
П000010002000:18210201020071000110
.}
П000010003000:^
П000010004000:^
П000010005000:^
###
.{?internal; (trim(VKakoiOtch) = '0')
П000010002000:18210201030080000110
.}
.{?internal; (trim(VKakoiOtch) = '1')
П000010002000:18210201030081000110
.}
П000010003000:^
П000010004000:^
П000010005000:^
###
.{?internal; (trim(VKakoiOtch) = '0')
П000010002000:18210201040090000110
.}
.{?internal; (trim(VKakoiOtch) = '1')
П000010002000:18210201040091000110
.}
П000010003000:^
П000010004000:^
П000010005000:^
###
! расчет
П000020010003:^
П000020010004:^
П000020010005:^
П000020010006:^
П000020011003:^
П000020011004:^
П000020011005:^
П000020011006:^
П000020012003:^
П000020012004:^
П000020012005:^
П000020012006:^
П000020013003:^
П000020013004:^
П000020013005:^
П000020013006:^
П000020014003:^
П000020014004:^
П000020014005:^
П000020014006:^
П000020020003:^
П000020020004:^
П000020020005:^
П000020020006:^
П000020021003:^
П000020021004:^
П000020021005:^
П000020021006:^
П000020022003:^
П000020022004:^
П000020022005:^
П000020022006:^
П000020023003:^
П000020023004:^
П000020023005:^
П000020023006:^
П000020024003:^
П000020024004:^
П000020024005:^
П000020024006:^
П000020030003:^
П000020031003:^
П000020032003:^
П000020033003:^
П000020034003:^
П000020040003:^
П000020040004:^
П000020040005:^
П000020040006:^
П000020041003:^
П000020041004:^
П000020041005:^
П000020041006:^
П000020042003:^
П000020042004:^
П000020042005:^
П000020042006:^
П000020043003:^
П000020043004:^
П000020043005:^
П000020043006:^
П000020044003:^
П000020044004:^
П000020044005:^
П000020044006:^
П000020050003:^
П000020050004:^
П000020050005:^
П000020050006:^
П000020051003:^
П000020051004:^
П000020051005:^
П000020051006:^
П000020052003:^
П000020052004:^
П000020052005:^
П000020052006:^
П000020053003:^
П000020053004:^
П000020053005:^
П000020053006:^
П000020054003:^
П000020054004:^
П000020054005:^
П000020054006:^
П000020060003:^
П000020060004:^
П000020060005:^
П000020060006:^
П000020061003:^
П000020061004:^
П000020061005:^
П000020061006:^
П000020062003:^
П000020062004:^
П000020062005:^
П000020062006:^
П000020063003:^
П000020063004:^
П000020063005:^
П000020063006:^
П000020064003:^
П000020064004:^
П000020064005:^
П000020064006:^
П000020070004:^
П000020071004:^
П000020072004:^
П000020073004:^
П000020074004:^
П000020080004:^
П000020081004:^
П000020082004:^
П000020083004:^
П000020084004:^
П000020090004:^
П000020091004:^
П000020092004:^
П000020093004:^
П000020094004:^
П000020100003:^
П000020100004:^
П000020100005:^
П000020100006:^
П000020110003:^
П000020110004:^
П000020110005:^
П000020110006:^
П000020120003:^
П000020120004:^
П000020120005:^
П000020120006:^
П000020130003:^
###
! распределение по диапазонам
П000210001003:^
П000210001004:^
П000210001005:^
П000210001006:^
П000210001007:^
П000210001008:^
П000210002003:^
П000210002004:^
П000210002005:^
П000210002006:^
П000210002007:^
П000210002008:^
П000210002103:^
П000210002104:^
П000210002105:^
П000210002106:^
П000210002107:^
П000210002108:^
П000210002203:^
П000210002204:^
П000210002205:^
П000210003003:^
П000210003004:^
П000210003005:^
П000210003006:^
П000210003007:^
П000210003008:^
П000210003103:^
П000210003104:^
П000210003105:^
П000210003106:^
П000210003107:^
П000210003108:^
П000210003203:^
П000210003204:^
П000210003205:^
П000210004003:^
П000210004004:^
П000210004005:^
П000210004006:^
П000210004007:^
П000210004008:^
.{?internal; (trim(VKakoiOtch) <> '1')
П000210004103:^
П000210004104:^
П000210004105:^
П000210004106:^
П000210004107:^
П000210004108:^
П000210004203:^
П000210004204:^
П000210004205:^
П000210005003:^
П000210005004:^
П000210005005:^
П000210005006:^
П000210005007:^
П000210005008:^
.}
###
! свод с учетом обособленных
П000220001003:
П000220001004:
П000220001005:
П000220001006:
П000220001103:
П000220001104:
П000220001105:
П000220001106:
П000220002003:
П000220002004:
П000220002005:
П000220002006:
П000220002103:
П000220002104:
П000220002105:
П000220002106:
П000220003003:
П000220003103:
П000220004003:
П000220004004:
П000220004005:
П000220004006:
П000220004103:
П000220004104:
П000220004105:
П000220004106:
П000220005003:
П000220005004:
П000220005005:
П000220005006:
П000220005103:
П000220005104:
П000220005105:
П000220005106:
П000220006003:
П000220006004:
П000220006005:
П000220006006:
П000220006103:
П000220006104:
П000220006105:
П000220006106:
П000220007004:
П000220007104:
П000220008004:
П000220008104:
П000220009004:
П000220009104:
П000220010003:
П000220010004:
П000220010005:
П000220010006:
П000220010103:
П000220010104:
П000220010105:
П000220010106:
П000220011003:
П000220011004:
П000220011005:
П000220011006:
П000220011103:
П000220011104:
П000220011105:
П000220011106:
П000220012003:
П000220012004:
П000220012005:
П000220012006:
П000220012103:
П000220012104:
П000220012105:
П000220012106:
П000220013003:
!.{?internal; (trim(VKakoiOtch) = '1')
!П000220013004:
!.}
П000220013103:
!.{?internal; (trim(VKakoiOtch) = '1')
!П000220013104:
!.}
###
! условия на право применения регрессии
.{?internal; (trim(VKakoiOtch) <> '1')
П000230001003:^
П000230001004:^
П000230001005:^
П000230002003:^
П000230002004:^
П000230002005:^
П000230003003:^
П000230003004:^
П000230003005:^
П000230004003:^
П000230004004:^
П000230004005:^
П000230005003:^
П000230005004:^
П000230005005:^
П000230006003:^
П000230006004:^
П000230006005:^
П000230007003:^
П000230007004:^
П000230007005:^
П000230008003:^
П000230008004:^
П000230008005:^
###
.}
! данные по инвалидам
.{ SocInvalid CheckEnter
.begin
  CCount := 0
  CCount := CCount + 1
end.
П000030001003:^
П000030002003:^
П000030003003:^
П000030004003:^
П000030005003:^
П000030006003:^
П000030007003:^
П000030008003:^
П000030009003:^
П000030010003:^
###
.}
.{WHILE CCount < 1
.begin CCount := CCount + 1 end.
П000030001003:,,
П000030002003:
П000030003003:
П000030004003:
П000030005003:
П000030006003:0
П000030007003:0
П000030008003:0
П000030009003:0
П000030010003:0
###
.}
! суммарно данные по инвалидам
П000310011003:^
П000310012003:^
П000310013003:^
П000310014003:^
П000310015003:^
###
! условия льгот
П000320011003:
П000320011004:
П000320011005:
П000320012003:
П000320012004:
П000320012005:
П000320013003:
П000320013004:
П000320013005:
П000320014003:
П000320014004:
П000320014005:
П000320015003:
П000320015004:
П000320015005:
П000320016003:
П000320016004:
П000320016005:
П000320017003:
П000320017004:
П000320017005:
П000320018003:
П000320018004:
П000320018005:
П000320019003:
П000320019004:
П000320019005:
###
! вкладчики
П000330001002:
П000330001003:
П000330001004:
###
^
===

.endForm

