/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,97 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Заработная плата                                          ║
 ║ Версия        : 5.8                                                       ║
 ║ Назначение    : Налоговая декларация по ЕСН                               ║
 ║ Ответственный : Погосский Константин Владимирович                         ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
.linkform 'Str_MN' PROTOTYPE IS 'Socotch1'
.nameinlist' Налоговая декларация по ЕСН (от 12.02.2003 БГ-3-13/59)'
.F 'DeklESNMN.out'
.group 'Socotch2'
.var
 rrr,rrr_2,rrr_3: String;
 CCount         : word;
.endvar
.fields
! СЛУЖЕБНАЯ ЧАСТЬ
 ИНН
 КПП
 Cur_Date
 Cur_Time
 InsNomer
 UpCase(Полное_наименование_организации)
 тел
 UpCase(Должность)
 UpCase(Ответственное_лицо_ФИО)
 Значки
 ИНН
 КПП
 год
 дата_представления_с_точками
 UpCase(Ser_Nom)
 DatKodUchet
 InsNomer
 UpCase(Полное_наименование_организации)
 ИНН
 КПП
 MagnitAddrPred
//ruk
 UpCase(ФИОРук_ФИО)
 Руководитель_организации_ИНН
 ТелРук
 ДатаРождРук
 МестоРождРук
 ПолРук
 ГраждРук
 UpCase(УдЛичнРук)
 ДатаУдЛичнРук
 АдрМЖРукРФ
 АдрМЖРукРез
//buh
 UpCase(ФИОБух_ФИО)
 Главный_бухгалтер_ИНН
 ТелБух
 ДатаРождБух
 МестоРождБух
 ПолБух
 ГраждБух
 UpCase(УдЛичнБух)
 ДатаУдЛичн
 АдрМЖБухРФ
 АдрМЖБухРез
//isp
 UpCase(Ответственное_лицо_ФИО)
 Ответственное_лицо_ИНН
 тел
 ДатаРождУпПред
 МестоРождУпПред
 ПолУпПред
 ГраждУпПред
 UpCase(УдЛичнУпПред)
 ДатаУдЛичнУпПред
 АдрМЖУпПредРФ
 АдрМЖУпПредРез
! ИНФОРМАЦИОННАЯ ЧАСТЬ
! Описание формы
 ПризФОтч
 КНД
 НаимФОтч
 ВерФОтч
 ПериодВерОтч
 ПризПериодОтч
 НачПериодОтч
 КонПериодОтч
 ОКЕИ
 ВарФОтч
 КолПокФОтч
! Содержание формы
!Таблица 2
 год
 if (поле_100_1 >= 0,DoubleToStr(поле_100_1,rrr),DoubleToStr(поле_100_1,rrr_2))
 if (поле_100_2 >= 0,DoubleToStr(поле_100_2,rrr),DoubleToStr(поле_100_2,rrr_2))
 if (поле_100_3 >= 0,DoubleToStr(поле_100_3,rrr),DoubleToStr(поле_100_3,rrr_2))
 if (поле_100_4 >= 0,DoubleToStr(поле_100_4,rrr),DoubleToStr(поле_100_4,rrr_2))
 if (поле_110_1 >= 0,DoubleToStr(поле_110_1,rrr),DoubleToStr(поле_110_1,rrr_2))
 if (поле_110_2 >= 0,DoubleToStr(поле_110_2,rrr),DoubleToStr(поле_110_2,rrr_2))
 if (поле_110_3 >= 0,DoubleToStr(поле_110_3,rrr),DoubleToStr(поле_110_3,rrr_2))
 if (поле_110_4 >= 0,DoubleToStr(поле_110_4,rrr),DoubleToStr(поле_110_4,rrr_2))
 if (поле_120_1 >= 0,DoubleToStr(поле_120_1,rrr),DoubleToStr(поле_120_1,rrr_2))
 if (поле_120_2 >= 0,DoubleToStr(поле_120_2,rrr),DoubleToStr(поле_120_2,rrr_2))
 if (поле_120_3 >= 0,DoubleToStr(поле_120_3,rrr),DoubleToStr(поле_120_3,rrr_2))
 if (поле_120_4 >= 0,DoubleToStr(поле_120_4,rrr),DoubleToStr(поле_120_4,rrr_2))
 if (поле_130_1 >= 0,DoubleToStr(поле_130_1,rrr),DoubleToStr(поле_130_1,rrr_2))
 if (поле_130_2 >= 0,DoubleToStr(поле_130_2,rrr),DoubleToStr(поле_130_2,rrr_2))
 if (поле_130_3 >= 0,DoubleToStr(поле_130_3,rrr),DoubleToStr(поле_130_3,rrr_2))
 if (поле_130_4 >= 0,DoubleToStr(поле_130_4,rrr),DoubleToStr(поле_130_4,rrr_2))
 if (поле_140_1 >= 0,DoubleToStr(поле_140_1,rrr),DoubleToStr(поле_140_1,rrr_2))
 if (поле_140_2 >= 0,DoubleToStr(поле_140_2,rrr),DoubleToStr(поле_140_2,rrr_2))
 if (поле_140_3 >= 0,DoubleToStr(поле_140_3,rrr),DoubleToStr(поле_140_3,rrr_2))
 if (поле_140_4 >= 0,DoubleToStr(поле_140_4,rrr),DoubleToStr(поле_140_4,rrr_2))

 if (поле_200_1 >= 0,DoubleToStr(поле_200_1,rrr),DoubleToStr(поле_200_1,rrr_2))
 if (поле_200_2 >= 0,DoubleToStr(поле_200_2,rrr),DoubleToStr(поле_200_2,rrr_2))
 if (поле_200_3 >= 0,DoubleToStr(поле_200_3,rrr),DoubleToStr(поле_200_3,rrr_2))
 if (поле_200_4 >= 0,DoubleToStr(поле_200_4,rrr),DoubleToStr(поле_200_4,rrr_2))
 if (поле_210_1 >= 0,DoubleToStr(поле_210_1,rrr),DoubleToStr(поле_210_1,rrr_2))
 if (поле_210_2 >= 0,DoubleToStr(поле_210_2,rrr),DoubleToStr(поле_210_2,rrr_2))
 if (поле_210_3 >= 0,DoubleToStr(поле_210_3,rrr),DoubleToStr(поле_210_3,rrr_2))
 if (поле_210_4 >= 0,DoubleToStr(поле_210_4,rrr),DoubleToStr(поле_210_4,rrr_2))
 if (поле_220_1 >= 0,DoubleToStr(поле_220_1,rrr),DoubleToStr(поле_220_1,rrr_2))
 if (поле_220_2 >= 0,DoubleToStr(поле_220_2,rrr),DoubleToStr(поле_220_2,rrr_2))
 if (поле_220_3 >= 0,DoubleToStr(поле_220_3,rrr),DoubleToStr(поле_220_3,rrr_2))
 if (поле_220_4 >= 0,DoubleToStr(поле_220_4,rrr),DoubleToStr(поле_220_4,rrr_2))
 if (поле_230_1 >= 0,DoubleToStr(поле_230_1,rrr),DoubleToStr(поле_230_1,rrr_2))
 if (поле_230_2 >= 0,DoubleToStr(поле_230_2,rrr),DoubleToStr(поле_230_2,rrr_2))
 if (поле_230_3 >= 0,DoubleToStr(поле_230_3,rrr),DoubleToStr(поле_230_3,rrr_2))
 if (поле_230_4 >= 0,DoubleToStr(поле_230_4,rrr),DoubleToStr(поле_230_4,rrr_2))
 if (поле_240_1 >= 0,DoubleToStr(поле_240_1,rrr),DoubleToStr(поле_240_1,rrr_2))
 if (поле_240_2 >= 0,DoubleToStr(поле_240_2,rrr),DoubleToStr(поле_240_2,rrr_2))
 if (поле_240_3 >= 0,DoubleToStr(поле_240_3,rrr),DoubleToStr(поле_240_3,rrr_2))
 if (поле_240_4 >= 0,DoubleToStr(поле_240_4,rrr),DoubleToStr(поле_240_4,rrr_2))

 if (поле_300_1 >= 0,DoubleToStr(поле_300_1,rrr),DoubleToStr(поле_300_1,rrr_2))
 if (поле_300_2 >= 0,DoubleToStr(поле_300_2,rrr),DoubleToStr(поле_300_2,rrr_2))
 if (поле_300_3 >= 0,DoubleToStr(поле_300_3,rrr),DoubleToStr(поле_300_3,rrr_2))
 if (поле_300_4 >= 0,DoubleToStr(поле_300_4,rrr),DoubleToStr(поле_300_4,rrr_2))
 if (поле_310_1 >= 0,DoubleToStr(поле_310_1,rrr),DoubleToStr(поле_310_1,rrr_2))
 if (поле_310_2 >= 0,DoubleToStr(поле_310_2,rrr),DoubleToStr(поле_310_2,rrr_2))
 if (поле_310_3 >= 0,DoubleToStr(поле_310_3,rrr),DoubleToStr(поле_310_3,rrr_2))
 if (поле_310_4 >= 0,DoubleToStr(поле_310_4,rrr),DoubleToStr(поле_310_4,rrr_2))
 if (поле_320_1 >= 0,DoubleToStr(поле_320_1,rrr),DoubleToStr(поле_320_1,rrr_2))
 if (поле_320_2 >= 0,DoubleToStr(поле_320_2,rrr),DoubleToStr(поле_320_2,rrr_2))
 if (поле_320_3 >= 0,DoubleToStr(поле_320_3,rrr),DoubleToStr(поле_320_3,rrr_2))
 if (поле_320_4 >= 0,DoubleToStr(поле_320_4,rrr),DoubleToStr(поле_320_4,rrr_2))
 if (поле_330_1 >= 0,DoubleToStr(поле_330_1,rrr),DoubleToStr(поле_330_1,rrr_2))
 if (поле_330_2 >= 0,DoubleToStr(поле_330_2,rrr),DoubleToStr(поле_330_2,rrr_2))
 if (поле_330_3 >= 0,DoubleToStr(поле_330_3,rrr),DoubleToStr(поле_330_3,rrr_2))
 if (поле_330_4 >= 0,DoubleToStr(поле_330_4,rrr),DoubleToStr(поле_330_4,rrr_2))
 if (поле_340_1 >= 0,DoubleToStr(поле_340_1,rrr),DoubleToStr(поле_340_1,rrr_2))
 if (поле_340_2 >= 0,DoubleToStr(поле_340_2,rrr),DoubleToStr(поле_340_2,rrr_2))
 if (поле_340_3 >= 0,DoubleToStr(поле_340_3,rrr),DoubleToStr(поле_340_3,rrr_2))
 if (поле_340_4 >= 0,DoubleToStr(поле_340_4,rrr),DoubleToStr(поле_340_4,rrr_2))

 if (поле_400_1 >= 0,DoubleToStr(поле_400_1,rrr),DoubleToStr(поле_400_1,rrr_2))
 if (поле_400_2 >= 0,DoubleToStr(поле_400_2,rrr),DoubleToStr(поле_400_2,rrr_2))
 if (поле_400_3 >= 0,DoubleToStr(поле_400_3,rrr),DoubleToStr(поле_400_3,rrr_2))
 if (поле_400_4 >= 0,DoubleToStr(поле_400_4,rrr),DoubleToStr(поле_400_4,rrr_2))
 if (поле_410_1 >= 0,DoubleToStr(поле_410_1,rrr),DoubleToStr(поле_410_1,rrr_2))
 if (поле_410_2 >= 0,DoubleToStr(поле_410_2,rrr),DoubleToStr(поле_410_2,rrr_2))
 if (поле_410_3 >= 0,DoubleToStr(поле_410_3,rrr),DoubleToStr(поле_410_3,rrr_2))
 if (поле_410_4 >= 0,DoubleToStr(поле_410_4,rrr),DoubleToStr(поле_410_4,rrr_2))
 if (поле_420_1 >= 0,DoubleToStr(поле_420_1,rrr),DoubleToStr(поле_420_1,rrr_2))
 if (поле_420_2 >= 0,DoubleToStr(поле_420_2,rrr),DoubleToStr(поле_420_2,rrr_2))
 if (поле_420_3 >= 0,DoubleToStr(поле_420_3,rrr),DoubleToStr(поле_420_3,rrr_2))
 if (поле_420_4 >= 0,DoubleToStr(поле_420_4,rrr),DoubleToStr(поле_420_4,rrr_2))
 if (поле_430_1 >= 0,DoubleToStr(поле_430_1,rrr),DoubleToStr(поле_430_1,rrr_2))
 if (поле_430_2 >= 0,DoubleToStr(поле_430_2,rrr),DoubleToStr(поле_430_2,rrr_2))
 if (поле_430_3 >= 0,DoubleToStr(поле_430_3,rrr),DoubleToStr(поле_430_3,rrr_2))
 if (поле_430_4 >= 0,DoubleToStr(поле_430_4,rrr),DoubleToStr(поле_430_4,rrr_2))
 if (поле_440_1 >= 0,DoubleToStr(поле_440_1,rrr),DoubleToStr(поле_440_1,rrr_2))
 if (поле_440_2 >= 0,DoubleToStr(поле_440_2,rrr),DoubleToStr(поле_440_2,rrr_2))
 if (поле_440_3 >= 0,DoubleToStr(поле_440_3,rrr),DoubleToStr(поле_440_3,rrr_2))
 if (поле_440_4 >= 0,DoubleToStr(поле_440_4,rrr),DoubleToStr(поле_440_4,rrr_2))

 if (поле_500_1 >= 0,DoubleToStr(поле_500_1,rrr),DoubleToStr(поле_500_1,rrr_2))
 if (поле_510_1 >= 0,DoubleToStr(поле_510_1,rrr),DoubleToStr(поле_510_1,rrr_2))
 if (поле_520_1 >= 0,DoubleToStr(поле_520_1,rrr),DoubleToStr(поле_520_1,rrr_2))
 if (поле_530_1 >= 0,DoubleToStr(поле_530_1,rrr),DoubleToStr(поле_530_1,rrr_2))
 if (поле_540_1 >= 0,DoubleToStr(поле_540_1,rrr),DoubleToStr(поле_540_1,rrr_2))
 if (поле_600_1 >= 0,DoubleToStr(поле_600_1,rrr),DoubleToStr(поле_600_1,rrr_2))
 if (поле_610_1 >= 0,DoubleToStr(поле_610_1,rrr),DoubleToStr(поле_610_1,rrr_2))
 if (поле_620_1 >= 0,DoubleToStr(поле_620_1,rrr),DoubleToStr(поле_620_1,rrr_2))
 if (поле_630_1 >= 0,DoubleToStr(поле_630_1,rrr),DoubleToStr(поле_630_1,rrr_2))
 if (поле_640_1 >= 0,DoubleToStr(поле_640_1,rrr),DoubleToStr(поле_640_1,rrr_2))
 if (поле_700_2 >= 0,DoubleToStr(поле_700_2,rrr),DoubleToStr(поле_700_2,rrr_2))
 if (поле_710_2 >= 0,DoubleToStr(поле_710_2,rrr),DoubleToStr(поле_710_2,rrr_2))
 if (поле_720_2 >= 0,DoubleToStr(поле_720_2,rrr),DoubleToStr(поле_720_2,rrr_2))
 if (поле_730_2 >= 0,DoubleToStr(поле_730_2,rrr),DoubleToStr(поле_730_2,rrr_2))
 if (поле_740_2 >= 0,DoubleToStr(поле_740_2,rrr),DoubleToStr(поле_740_2,rrr_2))
 if (поле_800_2 >= 0,DoubleToStr(поле_800_2,rrr),DoubleToStr(поле_800_2,rrr_2))
 if (поле_810_2 >= 0,DoubleToStr(поле_810_2,rrr),DoubleToStr(поле_810_2,rrr_2))
 if (поле_820_2 >= 0,DoubleToStr(поле_820_2,rrr),DoubleToStr(поле_820_2,rrr_2))
 if (поле_830_2 >= 0,DoubleToStr(поле_830_2,rrr),DoubleToStr(поле_830_2,rrr_2))
 if (поле_840_2 >= 0,DoubleToStr(поле_840_2,rrr),DoubleToStr(поле_840_2,rrr_2))
 if (поле_900_2 >= 0,DoubleToStr(поле_900_2,rrr),DoubleToStr(поле_900_2,rrr_2))
 if (поле_910_2 >= 0,DoubleToStr(поле_910_2,rrr),DoubleToStr(поле_910_2,rrr_2))
 if (поле_920_2 >= 0,DoubleToStr(поле_920_2,rrr),DoubleToStr(поле_920_2,rrr_2))
 if (поле_930_2 >= 0,DoubleToStr(поле_930_2,rrr),DoubleToStr(поле_930_2,rrr_2))
 if (поле_940_2 >= 0,DoubleToStr(поле_940_2,rrr),DoubleToStr(поле_940_2,rrr_2))

 if (поле_1000_1 >= 0,DoubleToStr(поле_1000_1,rrr),DoubleToStr(поле_1000_1,rrr_2))
 if (поле_1000_2 >= 0,DoubleToStr(поле_1000_2,rrr),DoubleToStr(поле_1000_2,rrr_2))
 if (поле_1000_3 >= 0,DoubleToStr(поле_1000_3,rrr),DoubleToStr(поле_1000_3,rrr_2))
 if (поле_1000_4 >= 0,DoubleToStr(поле_1000_4,rrr),DoubleToStr(поле_1000_4,rrr_2))
 if (поле_1100_1 >= 0,DoubleToStr(поле_1100_1,rrr),DoubleToStr(поле_1100_1,rrr_2))
 if (поле_1100_2 >= 0,DoubleToStr(поле_1100_2,rrr),DoubleToStr(поле_1100_2,rrr_2))
 if (поле_1100_3 >= 0,DoubleToStr(поле_1100_3,rrr),DoubleToStr(поле_1100_3,rrr_2))
 if (поле_1100_4 >= 0,DoubleToStr(поле_1100_4,rrr),DoubleToStr(поле_1100_4,rrr_2))
!Таблица 3
 if (До_100_21 >= 0,DoubleToStr(До_100_21,rrr),DoubleToStr(До_100_21,rrr_2))
 if (До_100_22 >= 0,DoubleToStr(До_100_22,rrr),DoubleToStr(До_100_22,rrr_2))
 if (До_100_3 >= 0,DoubleToStr(До_100_3,rrr),DoubleToStr(До_100_3,rrr_2))
 DoubleToStr(До_100_121,rrr_3)
 DoubleToStr(До_100_122,rrr_3)
 DoubleToStr(До_100_123,rrr_3)

 if (От100до300_21 >= 0,DoubleToStr(От100до300_21,rrr),DoubleToStr(От100до300_21,rrr_2))
 if (От100до300_22 >= 0,DoubleToStr(От100до300_22,rrr),DoubleToStr(От100до300_22,rrr_2))
 if (От100до300_3 >= 0,DoubleToStr(От100до300_3,rrr),DoubleToStr(От100до300_3,rrr_2))
 DoubleToStr(От100до300_121,rrr_3)
 DoubleToStr(От100до300_122,rrr_3)
 DoubleToStr(От100до300_123,rrr_3)

 if (Сум_100_21 >= 0,DoubleToStr(Сум_100_21,rrr),DoubleToStr(Сум_100_21,rrr_2))
 if (Сум_100_22 >= 0,DoubleToStr(Сум_100_22,rrr),DoubleToStr(Сум_100_22,rrr_2))
 if (Сум_100_3 >= 0,DoubleToStr(Сум_100_3,rrr),DoubleToStr(Сум_100_3,rrr_2))
 DoubleToStr(Сум_100_121,rrr_3)
 DoubleToStr(Сум_100_122,rrr_3)
 DoubleToStr(Сум_100_123,rrr_3)

 if (Превыш_100_21 >= 0,DoubleToStr(Превыш_100_21,rrr),DoubleToStr(Превыш_100_21,rrr_2))
 if (Превыш_100_22 >= 0,DoubleToStr(Превыш_100_22,rrr),DoubleToStr(Превыш_100_22,rrr_2))
 if (Превыш_100_3 >= 0,DoubleToStr(Превыш_100_3,rrr),DoubleToStr(Превыш_100_3,rrr_2))

 if (От300до600_21 >= 0,DoubleToStr(От300до600_21,rrr),DoubleToStr(От300до600_21,rrr_2))
 if (От300до600_22 >= 0,DoubleToStr(От300до600_22,rrr),DoubleToStr(От300до600_22,rrr_2))
 if (От300до600_3 >= 0,DoubleToStr(От300до600_3,rrr),DoubleToStr(От300до600_3,rrr_2))
 DoubleToStr(От300до600_121,rrr_3)
 DoubleToStr(От300до600_122,rrr_3)
 DoubleToStr(От300до600_123,rrr_3)

 if (Сум_300_21 >= 0,DoubleToStr(Сум_300_21,rrr),DoubleToStr(Сум_300_21,rrr_2))
 if (Сум_300_22 >= 0,DoubleToStr(Сум_300_22,rrr),DoubleToStr(Сум_300_22,rrr_2))
 if (Сум_300_3 >= 0,DoubleToStr(Сум_300_3,rrr),DoubleToStr(Сум_300_3,rrr_2))
 DoubleToStr(Сум_300_121,rrr_3)
 DoubleToStr(Сум_300_12,rrr_3)
 DoubleToStr(Сум_300_123,rrr_3)

 if (Превыш_300_21 >= 0,DoubleToStr(Превыш_300_21,rrr),DoubleToStr(Превыш_300_21,rrr_2))
 if (Превыш_300_22 >= 0,DoubleToStr(Превыш_300_22,rrr),DoubleToStr(Превыш_300_22,rrr_2))
 if (Превыш_300_3 >= 0,DoubleToStr(Превыш_300_3,rrr),DoubleToStr(Превыш_300_3,rrr_2))

 if (Свыше_600_21 >= 0,DoubleToStr(Свыше_600_21,rrr),DoubleToStr(Свыше_600_21,rrr_2))
 if (Свыше_600_22 >= 0,DoubleToStr(Свыше_600_22,rrr),DoubleToStr(Свыше_600_22,rrr_2))
 if (Свыше_600_3 >= 0,DoubleToStr(Свыше_600_3,rrr),DoubleToStr(Свыше_600_3,rrr_2))
 DoubleToStr(Свыше_600_121,rrr_3)
 DoubleToStr(Свыше_600_122,rrr_3)
 DoubleToStr(Свыше_600_123,rrr_3)

 if (Сум_600_21 >= 0,DoubleToStr(Сум_600_21,rrr),DoubleToStr(Сум_600_21,rrr_2))
 if (Сум_600_22 >= 0,DoubleToStr(Сум_600_22,rrr),DoubleToStr(Сум_600_22,rrr_2))
 if (Сум_600_3 >= 0,DoubleToStr(Сум_600_3,rrr),DoubleToStr(Сум_600_3,rrr_2))
 DoubleToStr(Сум_600_121,rrr_3)
 DoubleToStr(Сум_600_122,rrr_3)
 DoubleToStr(Сум_600_123,rrr_3)

 if (Превыш_600_21 >= 0,DoubleToStr(Превыш_600_21,rrr),DoubleToStr(Превыш_600_21,rrr_2))
 if (Превыш_600_22 >= 0,DoubleToStr(Превыш_600_22,rrr),DoubleToStr(Превыш_600_22,rrr_2))
 if (Превыш_600_3 >= 0,DoubleToStr(Превыш_600_3,rrr),DoubleToStr(Превыш_600_3,rrr_2))

 if (Итого_21 >= 0,DoubleToStr(Итого_21,rrr),DoubleToStr(Итого_21,rrr_2))
 if (Итого_22 >= 0,DoubleToStr(Итого_22,rrr),DoubleToStr(Итого_22,rrr_2))
 if (Итого_3 >= 0,DoubleToStr(Итого_3,rrr),DoubleToStr(Итого_3,rrr_2))
 DoubleToStr(Итого_121,rrr_3)
 DoubleToStr(Итого_122,rrr_3)
 DoubleToStr(Итого_123,rrr_3)
!Таблица 4
 Средняя_численность_1
 Средняя_численность_2
 Средняя_численность_3
 if (Всего_выплат_1 >= 0,DoubleToStr(Всего_выплат_1,rrr),DoubleToStr(Всего_выплат_1,rrr_2))
 if (Всего_выплат_2 >= 0,DoubleToStr(Всего_выплат_2,rrr),DoubleToStr(Всего_выплат_2,rrr_2))
 if (Всего_выплат_3 >= 0,DoubleToStr(Всего_выплат_3,rrr),DoubleToStr(Всего_выплат_3,rrr_2))
 Численность_исключенных_1
 Численность_исключенных_2
 Численность_исключенных_3
 if (Выплаты_исключенным_1 >= 0,DoubleToStr(Выплаты_исключенным_1,rrr),DoubleToStr(Выплаты_исключенным_1,rrr_2))
 if (Выплаты_исключенным_2 >= 0,DoubleToStr(Выплаты_исключенным_2,rrr),DoubleToStr(Выплаты_исключенным_2,rrr_2))
 if (Выплаты_исключенным_3 >= 0,DoubleToStr(Выплаты_исключенным_3,rrr),DoubleToStr(Выплаты_исключенным_3,rrr_2))
 if (Выплаты_остальным_1 >= 0,DoubleToStr(Выплаты_остальным_1,rrr),DoubleToStr(Выплаты_остальным_1,rrr_2))
 if (Выплаты_остальным_2 >= 0,DoubleToStr(Выплаты_остальным_2,rrr),DoubleToStr(Выплаты_остальным_2,rrr_2))
 if (Выплаты_остальным_3 >= 0,DoubleToStr(Выплаты_остальным_3,rrr),DoubleToStr(Выплаты_остальным_3,rrr_2))
 if (Налоговая_база_на_работника_1 >= 0,DoubleToStr(Налоговая_база_на_работника_1,rrr),DoubleToStr(Налоговая_база_на_работника_1,rrr_2))
 if (Налоговая_база_на_работника_2 >= 0,DoubleToStr(Налоговая_база_на_работника_2,rrr),DoubleToStr(Налоговая_база_на_работника_2,rrr_2))
 if (Налоговая_база_на_работника_3 >= 0,DoubleToStr(Налоговая_база_на_работника_3,rrr),DoubleToStr(Налоговая_база_на_работника_3,rrr_2))
 Кол_Месяцев_1
 Кол_Месяцев_2
 Кол_Месяцев_3
 if (Налоговая_база_в_среднем_1 >= 0,DoubleToStr(Налоговая_база_в_среднем_1,rrr),DoubleToStr(Налоговая_база_в_среднем_1,rrr_2))
 if (Налоговая_база_в_среднем_2 >= 0,DoubleToStr(Налоговая_база_в_среднем_2,rrr),DoubleToStr(Налоговая_база_в_среднем_2,rrr_2))
 if (Налоговая_база_в_среднем_3 >= 0,DoubleToStr(Налоговая_база_в_среднем_3,rrr),DoubleToStr(Налоговая_база_в_среднем_3,rrr_2))
!Таблица 5А
 ФИО_инв Справка_номер Дата_выдачи Груп_инв На_срок
 if (Всего_инв >= 0,DoubleToStr(Всего_инв,rrr),DoubleToStr(Всего_инв,rrr_2))
 if (Квартал_инв >= 0,DoubleToStr(Квартал_инв,rrr),DoubleToStr(Квартал_инв,rrr_2))
 if (месяц1_инв >= 0,DoubleToStr(месяц1_инв,rrr),DoubleToStr(месяц1_инв,rrr_2))
 if (месяц2_инв >= 0,DoubleToStr(месяц2_инв,rrr),DoubleToStr(месяц2_инв,rrr_2))
 if (месяц3_инв >= 0,DoubleToStr(месяц3_инв,rrr),DoubleToStr(месяц3_инв,rrr_2))
!Таблица 5Б
 if (Итого_Всего_инв >= 0,DoubleToStr(Итого_Всего_инв,rrr),DoubleToStr(Итого_Всего_инв,rrr_2))
 if (Итого_Квартал_инв >= 0,DoubleToStr(Итого_Квартал_инв,rrr),DoubleToStr(Итого_Квартал_инв,rrr_2))
 if (Итого_месяц1_инв >= 0,DoubleToStr(Итого_месяц1_инв,rrr),DoubleToStr(Итого_месяц1_инв,rrr_2))
 if (Итого_месяц2_инв >= 0,DoubleToStr(Итого_месяц2_инв,rrr),DoubleToStr(Итого_месяц2_инв,rrr_2))
 if (Итого_месяц3_инв >= 0,DoubleToStr(Итого_месяц3_инв,rrr),DoubleToStr(Итого_месяц3_инв,rrr_2))

!Таблица 7
 UpCase(Полное_наименование_организации)
 ИНН
 КПП
//======================
 Значки

.endfields
.begin
  rrr   := '666666666667.88'
  rrr_2 := '-66666666667.88'
  rrr_3 := '666666666667'
end.
! СЛУЖЕБНАЯ ЧАСТЬ
ИдФайл:^**^^^
ТипИнф:ОТЧЕТНОСТЬНП
ВерсФорм:2.01
ИдПол:^
ВерсПрог:ГАЛАКТИКА
КолДок:1
НаимОтпрЮл:^
ТелОтпр:^
ДолжнОтпр:^
ФИООтпр:^
^
ИдДок:^**^^00000001
ДатаДок:^
ДокПредст:1
КатНП:1
Свидетельство:^,^,^
КолФОтч:1
###
НаимЮЛПол:^
ИННЮЛ:^
КППЮЛ:^
ПризАдр:1
АдрЮр:^
###
.{?internal; (ФИОРук_ФИО <> ',,')
ФИОРук:^
.}
ИННРук:^
ТелРук:^
.{?internal; (Руководитель_организации_ИНН = '')or(Руководитель_организации_ИНН = ' ')
ДатаРождРук:^
МестоРождРук:^
ПолРук:^
ГраждРук:^
УдЛичнРук:^
ДатаУдЛичнРук:^
АдрМЖРукРФ:^
.{?internal; (trim(ГраждРук) <> '643')
АдрМЖРукРез:^
.}
.}
ФИОБух:^
.{?internal; (ФИОБух_ФИО <> ',,')
ИННБух:^
ТелБух:^
.{?internal; (Главный_бухгалтер_ИНН = '')or(Главный_бухгалтер_ИНН = ' ')
ДатаРождБух:^
МестоРождБух:^
ПолБух:^
ГраждБух:^
УдЛичнБух:^
ДатаУдЛичнБух:^
АдрМЖБухРФ:^
.{?internal; (trim(ГраждБух) <> '643')
АдрМЖБухРез:^
.}
.}
.}
ФИОУпПред:^
.{?internal; (Ответственное_лицо_ФИО <> ',,')
ИННУпПред:^
ТелУпПред:^
.{?internal; (Ответственное_лицо_ИНН = '')or(Ответственное_лицо_ИНН = ' ')
ДатаРождУпПред:^
МестоРождУпПред:^
ПолУпПред:^
ГраждУпПред:^
УдЛичнУпПред:^
ДатаУдЛичнУпПред:^
АдрМЖУпПредРФ:^
.{?internal; (trim(ГраждУпПред) <> '643')
АдрМЖУпПредРeз:^
.}
.}
.}
###
! ИНФОРМАЦИОННАЯ ЧАСТЬ
! Описание формы
ПризФОтч:^
КНД:^
НаимФОтч:^
ВерФОтч:^
ПериодВерОтч:^
ПризПериодОтч:^
НачПериодОтч:^
КонПериодОтч:^
ОКЕИ:^
ВарФОтч:^
КолПокФОтч:^
###
! Содержание формы
П000110001000:^
!Таблица 2
П000110010003:^
П000110010005:^
П000110010007:^
П000110010009:^
П000110011003:^
П000110011005:^
П000110011007:^
П000110011009:^
П000110012003:^
П000110012005:^
П000110012007:^
П000110012009:^
П000110013003:^
П000110013005:^
П000110013007:^
П000110013009:^
П000110014003:^
П000110014005:^
П000110014007:^
П000110014009:^
!
П000110020003:^
П000110020005:^
П000110020007:^
П000110020009:^
П000110021003:^
П000110021005:^
П000110021007:^
П000110021009:^
П000110022003:^
П000110022005:^
П000110022007:^
П000110022009:^
П000110023003:^
П000110023005:^
П000110023007:^
П000110023009:^
П000110024003:^
П000110024005:^
П000110024007:^
П000110024009:^
!
П000110030003:^
П000110030005:^
П000110030007:^
П000110030009:^
П000110031003:^
П000110031005:^
П000110031007:^
П000110031009:^
П000110032003:^
П000110032005:^
П000110032007:^
П000110032009:^
П000110033003:^
П000110033005:^
П000110033007:^
П000110033009:^
П000110034003:^
П000110034005:^
П000110034007:^
П000110034009:^
!
П000110040003:^
П000110040005:^
П000110040007:^
П000110040009:^
П000110041003:^
П000110041005:^
П000110041007:^
П000110041009:^
П000110042003:^
П000110042005:^
П000110042007:^
П000110042009:^
П000110043003:^
П000110043005:^
П000110043007:^
П000110043009:^
П000110044003:^
П000110044005:^
П000110044007:^
П000110044009:^
!
П000110050003:^
П000110051003:^
П000110052003:^
П000110053003:^
П000110054003:^
!
П000110060003:^
П000110061003:^
П000110062003:^
П000110063003:^
П000110064003:^
!
П000110070005:^
П000110071005:^
П000110072005:^
П000110073005:^
П000110074005:^
!
П000110080005:^
П000110081005:^
П000110082005:^
П000110083005:^
П000110084005:^
!
П000110090005:^
П000110091005:^
П000110092005:^
П000110093005:^
П000110094005:^
!
П000110100003:^
П000110100005:^
П000110100007:^
П000110100009:^
!
П000110110003:^
П000110110005:^
П000110110007:^
П000110110009:^
###
!Таблица 3
П000130001003:^
П000130001004:^
П000130001005:^
П000130001006:^
П000130001007:^
П000130001008:^
П000130002003:^
П000130002004:^
П000130002005:^
П000130002006:^
П000130002007:^
П000130002008:^
П000130002103:^
П000130002104:^
П000130002105:^
П000130002106:^
П000130002107:^
П000130002108:^
П000130002203:^
П000130002204:^
П000130002205:^
!
П000130003003:^
П000130003004:^
П000130003005:^
П000130003006:^
П000130003007:^
П000130003008:^
П000130003103:^
П000130003104:^
П000130003105:^
П000130003106:^
П000130003107:^
П000130003108:^
П000130003203:^
П000130003204:^
П000130003205:^
!
П000130004003:^
П000130004004:^
П000130004005:^
П000130004006:^
П000130004007:^
П000130004008:^
П000130004103:^
П000130004104:^
П000130004105:^
П000130004106:^
П000130004107:^
П000130004108:^
П000130004203:^
П000130004204:^
П000130004205:^
!
П000130005003:^
П000130005004:^
П000130005005:^
П000130005006:^
П000130005007:^
П000130005008:^
###
!Таблица 4
П000210001004:^
П000210001006:^
П000210001008:^
П000210002004:^
П000210002006:^
П000210002008:^
П000210003004:^
П000210003006:^
П000210003008:^
П000210004004:^
П000210004006:^
П000210004008:^
П000210005004:^
П000210005006:^
П000210005008:^
П000210006004:^
П000210006006:^
П000210006008:^
П000210007004:^
П000210007006:^
П000210007008:^
П000210008004:^
П000210008006:^
П000210008008:^
###
!Таблица 5А
.{ SocInvalid CheckEnter
.begin
  CCount := 0
  CCount := CCount + 1
end.
П000220009002:^
П000220009003:^
П000220009004:^
П000220009005:^
П000220009006:^
П000220009007:^
П000220009008:^
П000220009009:^
П000220009010:^
П000220009011:^
.}
.{WHILE CCount < 1
.begin CCount := CCount + 1 end.
П000220009002:0
П000220009003:0
П000220009004:0
П000220009005:0
П000220009006:0
П000220009007:0.00
П000220009008:0.00
П000220009009:0.00
П000220009010:0.00
П000220009011:0.00
.}
!Таблица 5Б
П000220009107:^
П000220009108:^
П000220009109:^
П000220009110:^
П000220009111:^
###
!Таблица 6
П000310011003:0
П000310011004:0
П000310011005:0
П000310012003:0
П000310012004:0
П000310012005:0
П000310013003:0.00
П000310013004:0.00
П000310013005:0.00
П000310014003:0
П000310014004:0
П000310014005:0
П000310015003:0
П000310015004:0
П000310015005:0
П000310016003:0.00
П000310016004:0.00
П000310016005:0.00
П000310017003:0.00
П000310017004:0.00
П000310017005:0.00
П000310018003:0.00
П000310018004:0.00
П000310018005:0.00
П000310019003:0.00
П000310019004:0.00
П000310019005:0.00
###
!Таблица 7
П000320020002:^
П000320020003:^
П000320020004:^
!
###
^
===

.endForm