//---------------------------------------------------------------------------
//                                           (c) корпорация ГАЛАКТИКА
// Версия        : 5.8
// Назначение    : Анализ просроченной задолженности
//--------------------------------------------------------------------------- 
// Внимание! Существует slk-отчет в формате Excel

#include Responsible.frn

#doc
  Форма анализа просроченной задолженности
#end

.set name = 'ProsDolg'
.hide
.nameinlist 'Анализ просроченной задолженности'
.fields
  DateOtch
#ResponsibleFields
  sNameOrg
  fSch fSub fOrg fGrOrg
  nHead1 nHead2
  nSch nSub nOrg INN nDog nStepDog AllDolg ProsrDolg dProsr:date DetalDolg
  WhatTotal:string SubTotal SubTotalProsr TotaldProsr:date TotalGrid
.endfields
! Подкачка Excel форматов
! Эта строчка нужна пока не будет решена 102.31867
#include ExcelFormat.frn
^
#ResponsibleBody(ProsDolg)
^
.if ProsDolgFilt
.{
   ^ ^ ^ ^
.}
.end

                                .{.?ProsDolgHLine01; .}
                                .{.?ProsDolgHLine02; .}
                                .{.?ProsDolgHead01; ^ .}
                                .{.?ProsDolgHead02; ^ .}
                                .{.?ProsDolgHLine03; .}
                                .{.?ProsDolgHLine04; .}

.{
.{ CheckEnter ProsDolgByDetail
   ^ ^ ^ ^ ^ ^ ^ ^ ^ .{.?ProsDolgDetail01; ^ .}
.}
.{ CheckEnter ProsDolgByTotal
   ^ ^ ^ ^           .{.?ProsDolgTotal01; ^ .}

.if ProsDolgEndItog
                     .{.?ProsDolgHLine05; .}
.else
                     .{.?ProsDolgHLine06; .}
.end
.}
.}
.endform

!=================================================
.linkform 'ProsDolg_01' prototype is 'ProsDolg'
!=================================================
.nameinlist 'Анализ просроченной задолженности'
.defo landscape
#ResponsibleLinkVar
.fields
  CommonFormHeader
  DateOtch
  sNameOrg
  fSch fSub fOrg fGrOrg
  nHead1 nHead2
  nSch nSub nOrg INN nDog nStepDog AllDolg ProsrDolg if(longint(dProsr)=0,'',DateToStr(dProsr,'DD/MM/YYYY')) DetalDolg
  WhatTotal:'T:-' SubTotal SubTotalProsr if(longint(TotaldProsr)=0,'',DateToStr(TotaldProsr,'DD/MM/YYYY')) TotalGrid
.endfields
 Ш^

  Отчет на дату: "@@@@@@@@@@"

  Штамп предприятия
  (организации)                                                                                               Штамп или отметка
  В Инспекцию Министерства РФ по налогам и сборам по                                                          налогового органа

_______________________________________________________
    В(наименование налогового органа и его код) В
#ResponsibleLinkInit(ProsDolg)
 Д @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д                                                       Получено
    В(полное наименование предприятия, организации) В                                          "________" ___________________________200_ г.

_______________________________________________________
    В(адрес) В

ИНН/КПП____________________________/___________________

Фамилия ответственного лица

Телефон________________________________________________

       ГПЕРЕЧЕНЬ
      организаций дебиторов (кредиторов)
      по состоянию на _______________ 200_ г. Г

.if ProsDolgFilt
Применен фильтр
.{
  ^
  ^
  ^
  ^
.}
.end

 Б──────┬─────────┬────────────────────────────────┬──────────┬────────┬─────────────────────┬────────────────┬──────────┬.{.?ProsDolgHLine01;──────────────┐.}
      │         │                                │          │        │                     │                │  Дата    │.{.?ProsDolgHLine02;              │.}
 Счет │ Субсчет │  Внешние дебиторы/кредиторы    │ Договор  │  Этап  │        Итого        │  в том числе   │возникнов.│.{.?ProsDolgHead01;@~@@@@@@@@@@@@│.}
      │         ├─────────────────────┬──────────┤          │        │                     │  просроченная  │ просроч. │.{.?ProsDolgHead02;@~@@@@@@@@@@@@│.}
      │         │     Наименование    │    ИНН   │          │        │                     │                │  задолж. │.{.?ProsDolgHLine03;              │.}
──────┼─────────┼─────────────────────┼──────────┼──────────┼────────┼─────────────────────┼────────────────┼──────────┼.{.?ProsDolgHLine04;──────────────┤.} Щ
.{
 Ш.{ CheckEnter ProsDolgByDetail
@@@@@@│@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@│&'&&&&&&&&&&&&&&&&.&&│&'#&&&&&&&&&&.&&│@@@@@@@@@@│.{.?ProsDolgDetail01;&'#&&&&&&&&.&&│.}
.}
.{ CheckEnter ProsDolgByTotal
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&'&&&&&&&&&&&&&&&&.&&│&'#&&&&&&&&&&.&&│@@@@@@@@@@│.{.?ProsDolgTotal01;&'#&&&&&&&&.&&│.} Б
.if ProsDolgEndItog
─────────────────────────────────────────────────────────────────────┴─────────────────────┴────────────────┴──────────┘.{.?ProsDolgHLine05;──────────────┘.}
.else
─────────────────────────────────────────────────────────────────────┼─────────────────────┼────────────────┼──────────┤.{.?ProsDolgHLine06;──────────────┤.}
.end
.} Ш
.{While (Номер_ответственного_лица < Количество_ответственных_лиц)
.begin
 Номер_ответственного_лица := Номер_ответственного_лица + 1;
end.
.fields
  Массив_Ответственное_лицо_Должность [Номер_ответственного_лица]
  Массив_Ответственное_лицо_ФИО       [Номер_ответственного_лица]
.endfields

 С@@@@@@@@@@@@@@@@@@@@@@@@@ Б  ____________________     Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                (подпись)                            (И.О.Фамилия) Р
.}
.}
.endform
