//---------------------------------------------------------------------------
//                                           (c) корпорация ГАЛАКТИКА
// Версия        : 5.8
// Назначение    : Анализ просроченной задолженности
//--------------------------------------------------------------------------- 
// Внимание! Существует slk-отчет в формате Excel

#doc
  Форма анализа просроченной задолженности
#end
.set name = 'ProsDolg2'
.hide
.nameinlist 'Анализ просроченной задолженности'
.fields
  DateOtch
  nPos nOrg INN adr nRasch AllDolg ProsrDolg dProsr:date nBank BIK KorSch
.endfields
! Подкачка Excel форматов
! Эта строчка нужна пока не будет решена 102.31867
#include ExcelFormat.frn
^
.{
  ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.endform

.linkform 'ProsDolg2_01' prototype is 'ProsDolg2'
.nameinlist 'Анализ просроченной задолженности'
.defo landscape
.fields
  DateOtch
  nPos nOrg INN adr nRasch AllDolg ProsrDolg if(longint(dProsr)=0,'',DateToStr(dProsr,'DD/MM/YYYY')) nBank BIK KorSch
.endfields

 Ш Отчет на дату: "@@@@@@@@@@"
  
  Штамп предприятия
  (организации)                                                                                               Штамп или отметка
  В Инспекцию Министерства РФ по налогам и сборам по                                                          налогового органа

_______________________________________________________
    В(наименование налогового органа и его код) В

_______________________________________________________                                                       Получено
    В(полное наименование предприятия, организации) В                                          "________" ___________________________200_ г.

_______________________________________________________
    В(адрес) В

ИНН/КПП____________________________/___________________

Фамилия ответственного лица

Телефон________________________________________________

       ГПЕРЕЧЕНЬ
      организаций дебиторов (кредиторов)
      по состоянию на _______________ 200_ г. Г

───┬────────────────────────────────────┬───────────────────┬──────────────────────┬─────────────────────┬────────────────────────────────────────────────┬──────────┬──────────────────────────────┬──────────────────┬────────────────────
 № │     Наименование организации       │        ИНН        │        Адрес         │  Номер расчетного   │                  Сумма задолженности           │ Дата     │        Наименование          │        БИК       │     Корр. счет
п/п│       дебитора (кредитора)         │                   │                      │       счета         ├───────────────────────┬────────────────────────┤возникнов.│           банка              │                  │
   │                                    │                   │                      │                     │         Всего         │в том числе просроченная│просроч.  │                              │                  │
   │                                    │                   │                      │                     │                       │                        │ задолж.  │                              │                  │
───┼────────────────────────────────────┼───────────────────┼──────────────────────┼─────────────────────┼───────────────────────┼────────────────────────┼──────────┼──────────────────────────────┼──────────────────┼────────────────────
.{
@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@│&'#&&&&&&&&&&&&&&&&&.&&│&'#&&&&&&&&&&&&&&&&&&.&&│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@
.}
───┴────────────────────────────────────┴───────────────────┴──────────────────────┴─────────────────────┴───────────────────────┴────────────────────────┴──────────┴──────────────────────────────┴──────────────────┴──────────────────── Ш
 Ш.endform
