//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
//------------------------------------------------------------------------------
// Галактика 8.1 - Финансовый контур
// Печать реестра алгоритмов
//------------------------------------------------------------------------------

#doc
  Базовая форма реестра алгоритмов
#end
.set name='ReeAlg'
.nameinlist 'Базовая форма'
.hide
.fields
  Npp NameAlg Alg
  Num Key SubAlg NameSubAlg
.endfields

.{
^ ^ ^
.{
^ ^ ^ ^
.}
.}

.endform

.linkform 'ReeAlg01' prototype is 'ReeAlg'
.fields
  CommonFormHeader
  String(Npp)+'.' NameAlg Alg
  Num Key SubAlg NameSubAlg
.endfields
^
                          Б  Реестр алгоритмов Б
 И───┬────────────────────────────────────────┬─────────────────────────────────────────────
 NN│        Наименование алгоритма          │                 Алгоритм
───┴────────────────────────────────────────┴─────────────────────────────────────────────
.{
&&& @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{
     &&  @@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.}
 И

.endform