//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
//------------------------------------------------------------------------------
// Галактика 8.5
// Статусы для компоненты F_Alg
//------------------------------------------------------------------------------

#ifdef Atl51

(scAlgEditor .. scAlgEditor)
{
  #include MemoEdit.rc1
  '~F3~ Выбор', cmValue10,       kbF3;
  '~Ctrl+F9~ Проверка', cmValue11,       kbCtrlF9;
}

#end
