//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
//------------------------------------------------------------------------------
// Галактика 8.5
// Статусы для компоненты F_PAT
//------------------------------------------------------------------------------

#ifdef Atl51

(scPatEditor .. scPatEditor)
{
  #include MemoEdit.rc1
  '~F3~ Мастер', cmValue10,       kbF3;
  '~Ctrl+F9~ Проверка формул', cmValue11,       kbCtrlF9;
  '~Shift+F3~ Бухгалтерский калькулятор', cmBuhCalculator, kbShiftF3;
  '~Shift+F4~ Параметры формы' , cmValue12, kbShiftF4; 
}

#end
