!╔═════════════════════════════════════════════════════════════════════╗
!║      Проект ГАЛАКТИКА (c) 1994,95 TOP SOFT Ltd., АО НОВЫЙ АТЛАНТ    ║
!║  Версия :     5.80                                                  ║
!║  Разработал:  Шелепов А.Ф.                                          ║
!║  Назначение: АКТ пакетирования /распакетирования                    ║
!║  Изменения:                                                         ║
!╚═════════════════════════════════════════════════════════════════════╝
#doc
АКТ пакетирования /распакетирования
#end
!.set name = 'actpaket'
.Form 'ActPaket'
.hide
.var
 nPP : longint;
.endvar
.fields
 Тип_акта
 Номер_с_дескриптором
 Дата_накладной
 Основание
 Подразделение
 Мол
 Код_МЦ_П
 МЦ_П
 Партия_МЦ_П
 Кол:double
 Единица
 Цена_нац:double Цена_вал:double Сим1
 Стоим_нац:double Стоим_вал:double Сим2
.endfields
 ^^^^^^^^^^^^^^^^^
.begin
  nPP:=0;
end.
.{CheckEnter SpecifPaket
.begin
 nPP:=nPP+1;
end.
.fields
 Код_МЦ
 МЦ
 Партия_МЦ
 КолМЦ:double
 ЕдиницаМЦ
 Цена_нацМЦ:double Цена_валМЦ:double Сим1МЦ
 Стоим_нацМЦ:double Стоим_валМЦ:double Сим2МЦ
.endfields
 ^^^^^^^^^^^
.}
.fields
 Операцию_провел
.endfields
 ^
.endform

!---------------------------------------------------------
#doc
АКТ ПАКЕТИРОВАНИЯ
#end
.linkform 'actpaket_01' prototype is 'actpaket'
.NameInList 'АКТ ПАКЕТИРОВАНИЯ'
.fields
 CommonFormHeader
 Тип_акта
 Номер_с_дескриптором
 Дата_накладной
 Основание
 Подразделение
 Мол
 Код_МЦ_П
 МЦ_П
 Партия_МЦ_П
 Кол
 Единица
 Цена_нац Цена_вал Сим1
 Стоим_нац Стоим_вал Сим2
.endfields
 ^

                Б&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&° ^ от ^ Б

 Основание:  Г@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Г
 Подразделение:  Г@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Г
 Материально ответственное лицо:  Г@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Г

 Номенклатурный номер     Б^ Б
 Наименование МЦ-пакета  Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
 Партия  Г@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Г
 Количество  Б&&&&&&&&.&&& Б Единица измерения  Б@@@@@@@@ Б
 Цена  в НДЕ      Б&&&&&&&&&&&&.&& Б  Цена  в валюте       Б&&&&&&&&&&&&.&& ^ Б
 Сумма в НДЕ  Б&&&&&&&&&&&&&&&&.&& Б  Сумма в валюте  Б&&&&&&&&&&&&&&&&&.&& ^ Б

В состав МЦ-пакета входит:
 Р──────────────┬──────────────────────────┬────────────────┬───────┬────────────┬──────────────┬───────────────
Номенклатурный│    Наименование МЦ       │      Партия    │ ЕдИзм │ Количество │  Цена в НДЕ  │    Цена в
   номер      │                          │                │       │            │              │    валюте
──────────────┴──────────────────────────┴────────────────┴───────┴────────────┴──────────────┴─────────────── Р
.{CheckEnter SpecifPaket
.fields
 Код_МЦ
 МЦ
 Партия_МЦ
 ЕдиницаМЦ
 КолМЦ
 Цена_нацМЦ Цена_валМЦ Сим1МЦ
.endfields
 Р@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@ &&&&&&&&&.&& &&&&&&&&&&&.&& &&&&&&.&& @@@@ Р
.}

.fields
 Операцию_провел
.endfields
Операцию провел: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.endform
