/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,97 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Управление договорами                                     ║
 ║ Версия        : 5.70                                                      ║
 ║ Назначение    : Приходный ордер (Штерн-Цемент)                            ║
 ║ Ответственный : Глушаков Дмитрий Сергеевич                                ║
 ║ Параметры     : есть                                                      ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/

#doc
Приходный ордер (Штерн-Цемент)
#end
.AutoForm 'SC_Order'(var pSklOrderRec:comp)
!.NameInList 'Штерн Цемент. Приходный ордер'
!.group 'Штерн Цемент'
!.list ''
.Create view PrintSC_Order
from
   KatSopr                    (ReadOnly)
  ,SpSopr                     (ReadOnly)
  ,KatOrg                     (ReadOnly)
  ,KatPodr                    (ReadOnly)
  ,KatMC                      (ReadOnly)
  ,KatOtpEd                   (ReadOnly)
  ,SklOrder                   (ReadOnly)
  ,SpOrder                    (ReadOnly)
  ,MarPunkt                   (ReadOnly)
  ,synonym KatOrg OrgTo       (ReadOnly)
  ,synonym KatOrg OrgFrom     (ReadOnly)
where
  ((
      pSklOrderRec         ==  SklOrder.nRec     and
      pSklOrderRec         ==  SpOrder.cSklOrder and
      SklOrder.cSopr       ==  KatSopr.NRec      and
      SpOrder.cSpSopr      ==  SpSopr.NRec       and
      KatSopr.cGruzTo      ==  OrgTo.NRec        and
      KatSopr.cGruzFrom    ==  OrgFrom.NRec      and
      KatSopr.cPodrTo      ==  KatPodr.NRec      and
      SpSopr.cMCUSL        ==  KatMC.NRec        and
      SpSopr.cOtpEd        ==  KatOtpEd.NRec     and
/////////////////////////////////////////////////////
      SpSopr.cCellVal      ==  MoveCell.NRec     and
      SpSopr.cMCUSL        ==  CellVal.cMC       and
      word(0)              ==  CellVal.PrMC      and
      MoveCell.NRec        ==  CellVal.cMoveCell and
/////////////////////////////////////////////////////
      coKatSopr            ==  TTNDoc.wTable     and
      KatSopr.nRec         ==  TTNDoc.cDoc       and
      TTNDoc.cPunktR       ==  MarPunkt.NRec          //пункт разгрузки
  ))
;
.fields
  CommonFormHeader
  if (OrgTo.TipOrg<>'',OrgTo.TipOrg+' ','')+OrgTo.Name // Получатель
  SklOrder.nOrder                                         // Номер ордера
  DateToStr(if ((PrintSC_Order.GetFirst SklOrder <> 0) or (SklOrder.dOrd=date(0,0,0)),
              Cur_Date,
              SklOrder.dOrd),
           '"DD" Mon YYYY г.')                            // Ордер от (дата)
  DateToStr(if ((PrintSC_Order.GetFirst SklOrder <> 0) or (SklOrder.dOrd=date(0,0,0)),
              Cur_Date,
              SklOrder.dOrd),
           'YYYY')
  MarPunkt.Name                                           // Со станции (наименование)
  KatSopr.NSopr                                           // Номер ж/д накладной
  DateToStr(KatSopr.dSopr,'от "DD" Mon YYYY г.')          // Дата ж/д накладной
  SpSopr.nVagon                                           // Номер вагона
  if (OrgFrom.TipOrg<>'',OrgFrom.TipOrg+' ','')+OrgFrom.Name // Поставщик
!.{
  KatMC.Name                                              // Товар (наименование)
  MoveCell.Name                                           // Наименование ед подвижного состава
  SpSopr.Kol
  SpSopr.KolFact
!.}
.endfields //                                                                                             норм.!              элита!
.p 40
.defo landscape
.{table 'PrintSC_Order.SklOrder'
!.begin
!  if (PrintSC_Order.GetFirst SklOrder <> 0) {} ;
!end.
^
 Ш                                                                                                                       Форма № 20
                                                                                                          Утверждена Госснабом СССР
                                                                                                                  22 апреля 1990 г.
───────────────────────────────────────────┬─────┬────────┬──────┬───────┬────────────┬─────────────┬────────┬──────────┬──────────┐
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │     │        │      │       │№ платежного│Дата платеж- │        │          │          │
───────────────────────────────────────────┤     │ Склада │Наряд-│Постав-│ требования │ного требова-│  Вид   │ Целевого │          │
       (наименование организации,          │Шифры│        │заказа│ щика  │ или счета- │   ния или   │операции│назначения│          │
                                           │     │        │      │       │  фактуры   │счета-фактуры│        │          │          │
───────────────────────────────────────────┤     ├────────┼──────┼───────┼────────────┼─────────────┼────────┼──────────┼──────────┤
               предприятия)                │     │        │      │       │            │             │        │          │          │
                                           └─────┴────────┴──────┴───────┴────────────┴─────────────┴────────┴──────────┴──────────┘
Склад № ________________
                                           БП Р И Х О Д Н Ы Й   О Р Д Е Р  №  Б@@@@@@@@@@@@@@@@@ ^


Принят и осмотрен груз, прибывший на склад "   "_______________ @@@@ г.
.begin
  if (PrintSC_Order.GetFirst SpOrder <> 0) {};
end.

Со станции @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ по ж/д накладной № @@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  в вагоне № @@@@@@@@@@@@@
                                                                                                           контейнере
Поставщик @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Отправитель__________________________________________________________

Число мест______________ Род упаковки_______________________ Вес груза_______ Груз доставлен через__________________________________
───────────────────────────────────────────────────┬───────────────────────┬─────────┬──────────────────────────────────────────────
                   Товары и тара                   │       Количество      │         │                 Таксировка
─────────────────────────────┬─────────────┬───────┼───────────┬───────────┤ Цена по ├────────────┬──────────────┬──────────────────
 наименование, сорт, размер, │   единица   │       │    по     │           │документу│            │              │
       марка, артикул        │  измерения  │ шифры │ документу │  принято  │         │ количество │     цена     │      сумма
                             │             │       │           │           │         │            │              │
─────────────────────────────┼─────────────┼───────┼───────────┼───────────┼─────────┼────────────┼──────────────┼──────────────────
              1              │      2      │   3   │     4     │     5     │    6    │     7      │      8       │        9
─────────────────────────────┴─────────────┴───────┴───────────┴───────────┴─────────┴────────────┴──────────────┴──────────────────
.{table 'PrintSC_Order.SpOrder'
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@         &&&&&&&.&&& &&&&&&&.&&&
.}
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

                 Принял зав. складом ______________________________    Товаровед ________________________________

                                                     Сдал ____________________________ Ш
.fields
  'true' : 's'
.endfields
^
.}
.endform
