/*                                            `
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                       (c) 2002 корпорация ГАЛАКТИКА                       ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Оперативный контур                                        ║
 ║ Версия        : 5.84                                                      ║
 ║ Назначение    : Отчет об удалении операций по ячейкам                     ║
 ║ Ответственный : Двинский Сергей Леонидович                                ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/

#doc
Отчет об удалении операций по ячейкам
#end
.form 'CleanSpBox_prot'
.hide
.fields
  DDate  : date
.endfields
^
.fields
  Sklad : string
  MOL   : string
  MC    : string
  Party : string
  Box   : string
  Docum : string
  Kol   : string
.endfields
.{
^^^^^^^
.}
.endform

#doc
Отчет об удалении операций по ячейкам
#end
.linkform 'CleanSpBox' prototype is 'CleanSpBox_prot'
.NameInList 'Отчет об удалении операций по ячейкам'
.PAPER PA4
.ORIENT PORTRAIT
.LL 80
.LM 15
.TM 10
.BM 10
.RM 1
.fields
  Ddate
.endfields
 Б                    Б    БСписок удаленных операций по ячейкам хранения
                                       от @@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Б
.fields
  Sklad MOL MC Party Box Docum Kol
.endfields
 Р┌─────────────────────┬───────────────────┬─────────────────────┬──────────────────┬──────────────────┬──────────────────────────────────────────┬──────────┐
│        Склад        │        МОЛ        │     Матценность     │      Партия      │      Ячейка      │                 Документ                 │  Кол-во  │
├─────────────────────┼───────────────────┼─────────────────────┼──────────────────┼──────────────────┼──────────────────────────────────────────┼──────────┤
.{
│@~@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&'&&&&&&&&│
.}
└─────────────────────┴───────────────────┴─────────────────────┴──────────────────┴──────────────────┴──────────────────────────────────────────┴──────────┘
 Р
.endform
