//********************************************************************************
//                                                        (c) корпорация Галактика
// Галактика 5.85 - модуль Клиент
// Форма иерархического отчета по гарантийному и абонентскому обслуживанию
//********************************************************************************

// Основная форма
#doc
Форма иерархического отчета по гарантийному и абонентскому обслуживанию
#end
.form AbonentRep
.hide
.fields
  // Фильтры
  Дата_начала_С
  Дата_начала_По
  Дата_окончания_С
  Дата_окончания_По
  // Группировки
  Группировка_Наименование
  Группировка_Количество
  Группировка_Сумма_в_НДЕ
  Группировка_Сумма_в_валюте
  Группировка_валюта
  // Договор на ГО или АО
  Тип_обслуживания // 1 - ГО, 2 - АО
  ServTret_NRec // АО
  STSubj_NRec   // АО
  Sales_NRec    // ГО
  Subject_NRec  // ГО
  Номер
  Дата
  Начало_периода
  Окончание_периода
  Период
  Единица_измерения

  Количество
  Цена_в_НДЕ
  Сумма_в_НДЕ
  Цена_в_валюте
  Сумма_в_валюте
  Валюта

  Client_NRec
  Клиент

  Chanel_NRec
  Diler_NRec
  Канал_сбыта

  Man_NRec
  Менеджер

  Goods_NRec
  Товар
.endfields
.if Abonent_IF1
 ^ ^
.end
.if Abonent_IF2
 ^ ^
.end
.{
.{ Abonent_Header CheckEnter
 ^ ^ ^ ^ ^
.}
.{ Abonent_Oborot CheckEnter
 ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.}
.endform

// Отчет с суммами в валюте и НДЕ
#doc
Отчет по гарантийному и абонентскому обслуживанию (в валюте и НДЕ)
#end
.linkform 'AbonentRep_Val_NDE' prototype is 'AbonentRep'
.nameinlist 'Отчет по гарантийному и абонентскому обслуживанию (в валюте и НДЕ)'
.defo landscape
.fields
  // Фильтры
  Дата_начала_С
  Дата_начала_По
  Дата_окончания_С
  Дата_окончания_По
  // Группировки
  Группировка_Наименование
  Группировка_Количество
  Группировка_Сумма_в_НДЕ
  Группировка_Сумма_в_валюте
  Группировка_валюта
  // Договор на ГО или АО
  Номер
  Дата
  Окончание_периода
  Клиент
  Товар
  Менеджер

  Количество
  Единица_измерения
  Цена_в_НДЕ
  Сумма_в_НДЕ
  Цена_в_валюте
  Сумма_в_валюте
  Валюта
.endfields
 Ш                                                                                        БОтчет по гарантийному и абонентскому обслуживанию Б
.if Abonent_IF1
                                                                                        Дата начала периода с @@@@@@@@@@ по @@@@@@@@@@
.end
.if Abonent_IF2
                                                                                        Дата окончания периода с @@@@@@@@@@ по @@@@@@@@@@
.end

─────────────┬──────────┬──────────┬──────────────────────┬────────────────────────────┬────────────────────────┬────────────────┬───────┬───────────────┬───────────────────────┬───────────────┬───────────────────────┬───────
    Номер    │   Дата   │Окончание │        Клиент        │        Товар/услуга        │        Менеджер        │   Количество   │Ед.изм.│   Цена в НДЕ  │      Сумма в НДЕ      │ Цена в валюте │     Сумма в валюте    │Валюта
─────────────┴──────────┴──────────┴──────────────────────┴────────────────────────────┴────────────────────────┴────────────────┴───────┴───────────────┴───────────────────────┴───────────────┴───────────────────────┴───────
.{
.{ Abonent_Header CheckEnter
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&.&&&                         &'&&&&&&&&&&&&&&&&&&.&&                 &'&&&&&&&&&&&&&&&&&&.&& @~@@@@@ Б
.}
.{ Abonent_Oborot CheckEnter
@@@@@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&.&&& @@@@@@@ &'&&&&&&&&&&.&& &'&&&&&&&&&&&&&&&&&&.&& &'&&&&&&&&&&.&& &'&&&&&&&&&&&&&&&&&&.&& @~@@@@@
.}
.} Ш
.endform

// Отчет с суммами в валюте
#doc
Отчет по гарантийному и абонентскому обслуживанию (в валюте)
#end
.linkform 'AbonentRep_Val' prototype is 'AbonentRep'
.nameinlist 'Отчет по гарантийному и абонентскому обслуживанию (в валюте)'
.defo landscape
.fields
  // Фильтры
  Дата_начала_С
  Дата_начала_По
  Дата_окончания_С
  Дата_окончания_По
  // Группировки
  Группировка_Наименование
  Группировка_Количество
  Группировка_Сумма_в_валюте
  Группировка_валюта
  // Договор на ГО или АО
  Номер
  Дата
  Окончание_периода
  Клиент
  Товар
  Менеджер

  Количество
  Единица_измерения
  Цена_в_валюте
  Сумма_в_валюте
  Валюта
.endfields
 Ш                                                                    БОтчет по гарантийному и абонентскому обслуживанию Б
.if Abonent_IF1
                                                                    Дата начала периода с @@@@@@@@@@ по @@@@@@@@@@
.end
.if Abonent_IF2
                                                                    Дата окончания периода с @@@@@@@@@@ по @@@@@@@@@@
.end

─────────────┬──────────┬──────────┬──────────────────────┬────────────────────────────┬────────────────────────┬────────────────┬───────┬───────────────┬───────────────────────┬───────
    Номер    │   Дата   │Окончание │        Клиент        │        Товар/услуга        │        Менеджер        │   Количество   │Ед.изм.│ Цена в валюте │     Сумма в валюте    │Валюта
─────────────┴──────────┴──────────┴──────────────────────┴────────────────────────────┴────────────────────────┴────────────────┴───────┴───────────────┴───────────────────────┴───────
.{
.{ Abonent_Header CheckEnter
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&.&&&                         &'&&&&&&&&&&&&&&&&&&.&& @~@@@@@ Б
.}
.{ Abonent_Oborot CheckEnter
@@@@@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&.&&& @@@@@@@ &'&&&&&&&&&&.&& &'&&&&&&&&&&&&&&&&&&.&& @~@@@@@
.}
.} Ш
.endform

// Отчет с суммами в НДЕ
#doc
Отчет по гарантийному и абонентскому обслуживанию (в НДЕ)
#end
.linkform 'AbonentRep_NDE' prototype is 'AbonentRep'
.nameinlist 'Отчет по гарантийному и абонентскому обслуживанию (в НДЕ)'
.defo landscape
.fields
  // Фильтры
  Дата_начала_С
  Дата_начала_По
  Дата_окончания_С
  Дата_окончания_По
  // Группировки
  Группировка_Наименование
  Группировка_Количество
  Группировка_Сумма_в_НДЕ
  // Договор на ГО или АО
  Номер
  Дата
  Окончание_периода
  Клиент
  Товар
  Менеджер

  Количество
  Единица_измерения
  Цена_в_НДЕ
  Сумма_в_НДЕ
.endfields
 Ш                                                               БОтчет по гарантийному и абонентскому обслуживанию Б
.if Abonent_IF1
                                                               Дата начала периода с @@@@@@@@@@ по @@@@@@@@@@
.end
.if Abonent_IF2
                                                               Дата окончания периода с @@@@@@@@@@ по @@@@@@@@@@
.end

─────────────┬──────────┬──────────┬──────────────────────┬────────────────────────────┬────────────────────────┬────────────────┬───────┬───────────────┬───────────────────────
    Номер    │   Дата   │Окончание │        Клиент        │        Товар/услуга        │        Менеджер        │   Количество   │Ед.изм.│   Цена в НДЕ  │      Сумма в НДЕ
─────────────┴──────────┴──────────┴──────────────────────┴────────────────────────────┴────────────────────────┴────────────────┴───────┴───────────────┴───────────────────────
.{
.{ Abonent_Header CheckEnter
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&.&&&                         &'&&&&&&&&&&&&&&&&&&.&& Б
.}
.{ Abonent_Oborot CheckEnter
@@@@@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&.&&& @@@@@@@ &'&&&&&&&&&&.&& &'&&&&&&&&&&&&&&&&&&.&&
.}
.} Ш
.endform
