/*
 ╔════════════════════════════════════════════════════════════════════════════╗
 ║                     (c) Корпорация ГАЛАКТИКА, 1996,97                      ║
 ║ Проект        : ГАЛАКТИКА                                                  ║
 ║ Система       : Оперативный контур                                         ║
 ║ Версия        : 5.00                                                       ║
 ║ Назначение    : Отчет по курсам валют                                      ║
 ║ Ответственный : Володько Вадим Геннадьевич (VVG)                           ║
 ╚════════════════════════════════════════════════════════════════════════════╝
*/

#doc
Форма для отчетов по каталогам дилеров, рекламопроизводиетлей и т.д.
#end
.FORM CatalRep
.fields
.endfields
 Щ                                                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Щ

.{
.{ Catal_Header CheckEnter
 Щ^^ Щ
.}
 Ш───────────────────┬──────────┬───────────────┬───────────────┬────────────────┬───────────┬───────────────────────────────┬────────────────┬───────────────
   Наименование    │  Страна  │    Область    │     Район     │Населенный пункт│Почт.индекс│             Адрес             │     Телефон    │      ИНН
───────────────────┴──────────┴───────────────┴───────────────┴────────────────┴───────────┴───────────────────────────────┴────────────────┴─────────────── Ш
.{ Catal_Info CheckEnter
 Ш@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ Ш
.}
 Ш──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Ш
.}
.ENDFORM


#doc
Форма для отчета по товарам
#end
.FORM GoodsRep
.fields
.endfields
 Щ               Отчет по товарам и услугам Щ

.{
.{ Goods_Header CheckEnter
 Щ^^ Щ
.}
 Ш─────────────────────────────────────┬─────────────────────────┬────────
            Наименование             │         Бар-код         │  Тип
─────────────────────────────────────┴─────────────────────────┴──────── Ш
.{ Goods_Info CheckEnter
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@ Ш
.}
 Ш──────────────────────────────────────────────────────────────────────── Ш
.}
.ENDFORM

#doc
Форма для отчета по менеджерам
#end
.FORM ManagersRep
.fields
.endfields
 Щ                                              Отчет по менеджерам Щ

.{
.{ Managers_Header CheckEnter
 Щ^^ Щ
.}
 Ш─────────────────────────────────────┬───────┬───────────────┬─────────────────────────┬──────────┬─────────────
                ФИО                  │Комната│    Телефон    │         E-mail          │ ICQ UIN  │День рождения
─────────────────────────────────────┴───────┴───────────────┴─────────────────────────┴──────────┴───────────── Ш
.{ Managers_Info CheckEnter
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ Ш
.}
 Ш──────────────────────────────────────────────────────────────────────────────────────────────────────────────── Ш
.}
.ENDFORM

#doc
Формы для отчетов по клиентов
#end
.set name 'ClientTotalRep'
.defo landscape
.hide
.fields
  HeaderGrouping  // Уровень группировки
  Org_NRec        // Ссылка на организацию
  Client_NRec     // Ссылка на клиента
  NameClient      // Наименование клиента
  State           // Страна
  Province        // Область
  Region          // Район
  City            // Город
  PstIndex        // Почтовый индекс
  Addr            // Адрес
  Tel             // Телефоны
  Kat             // Категория клиента
  StateCl         // Состояние клиента
  Rel             // Отношение к клиенту
  Branch          // Отрасль
  ActCateg        // Вид деятельности
  Priority        // Приоритет
  Comments        // Комментарий по клиенту
  ContPers        // Несколько контактных лиц клиента и телефоны
  Manager_NRec    // Ссылка на менеджера-куратора клиента
  ManagerCl       // ФИО менеджера-куратора клиента
.endfields
.{
.{ ClientTotal_Header CheckEnter
^
.}
.{ ClientTotal_Info CheckEnter
 ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.}
.EndForm

#doc
Отчет по клиентам (формат текстовый)
#end
.LinkForm 'Clients02' prototype is 'ClientTotalRep'
.nameinlist 'Отчет по клиентам (формат текстовый)'
.defo landscape
.fields
  HeaderGrouping  // Уровень группировки
  NameClient      // Наименование клиента
  State           // Страна
  Province        // Область
  Region          // Район
  City            // Город
  PstIndex        // Почтовый индекс
  Addr            // Адрес
  Tel             // Телефоны
  Kat             // Категория клиента
  StateCl         // Состояние клиента
  Rel             // Отношение к клиенту
  Branch          // Отрасль
  ActCateg        // Вид деятельности
  Priority        // Приоритет
.endfields

 ЩОтчет по клиентам Щ

 Ш────────────────────┬──────────┬─────────────────┬─────────────────┬────────────────┬──────┬─────────────────┬─────────────┬────────────────┬────────────────┬────────────────┬────────────────┬────────────────┬────────────────
    Наименование    │  Страна  │     Область     │      Район      │Населенный пункт│Индекс│      Адрес      │   Телефоны  │   Категория    │   Состояние    │   Отношение    │     Отрасль    │Вид деятельности│   Приоритет
────────────────────┴──────────┴─────────────────┴─────────────────┴────────────────┴──────┴─────────────────┴─────────────┴────────────────┴────────────────┴────────────────┴────────────────┴────────────────┴──────────────── Ш
.{
.{ ClientTotal_Header CheckEnter
 Щ^ Щ
.}
.{ ClientTotal_Info CheckEnter
 Ш@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@ @@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ Ш
.}
.}
.ENDFORM

#doc
Отчет по клиентам с комментариями (формат текстовый)
#end
.LinkForm 'Clients03' prototype is 'ClientTotalRep'
.nameinlist 'Отчет по клиентам с комментариями (формат текстовый)'
.defo landscape
.fields
  HeaderGrouping  // Уровень группировки
  NameClient      // Наименование клиента
  State           // Страна
  City            // Город
  PstIndex        // Почтовый индекс
  Addr            // Адрес
  Tel             // Телефоны
  Branch          // Отрасль
  Comments        // Комментарий по клиенту
.endfields

 ЩОтчет по клиентам Щ

 Ш──────────────────────────┬────────────────┬────────────────────────┬──────────────┬─────────────────────────────┬──────────────────────────┬─────────────────────┬──────────────────────────────────────────────────────────────
       Наименование       │     Страна     │    Населенный пункт    │    Индекс    │            Адрес            │         Телефоны         │       Отрасль       │     Комментарий
──────────────────────────┴────────────────┴────────────────────────┴──────────────┴─────────────────────────────┴──────────────────────────┴─────────────────────┴────────────────────────────────────────────────────────────── Ш
.{
.{ ClientTotal_Header CheckEnter
 Щ^ Щ
.}
.{ ClientTotal_Info CheckEnter
 Ш@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
.}
.}
.endform
