//********************************************************************************
//                                                        (c) корпорация Галактика
// Галактика 5.85 - модуль Клиент
// Форма иерархического отчета по контактам
//********************************************************************************

// Основная форма
#doc
Форма иерархического отчета по контактам
#end
.form ContRep
.hide
.fields
  // Фильтры
  Дата_контакта_С
  Дата_контакта_По
  План_дата_С
  План_дата_По
  // Группировки
  Групп_Наименование
  Групп_Кол_контактов
  // Данные по проявленному интересу
  ПрИнтерес_Сумма_НДЕ
  ПрИнтерес_Сумма_вал
  ПрИнтерес_Валюта
  ПрИнтерес_Кол
  // Контакты
  Contact_NRec
  Номер
  Статус
  Дата_регистрации
  План_дата
  План_время
  Дата
  Время
  Дата_закрытия
  Время_закрытия

  Категория
  Результат
  Метод

  Client_NRec
  Клиент

  Chanel_NRec
  Diler_NRec
  Канал_сбыта

  Man_NRec
  Менеджер

  Контактное_лицо
  Телефон
  Краткое_описание
  Комментарий
.endfields

.if Cont_Filter_Data
 ^ ^
.end

.if Cont_Filter_Plan_Data
 ^ ^
.end

.{ Cont_Info CheckEnter
 ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.endform

#doc
Отчет по контактам
#end
.linkform 'ContRep_1' prototype is 'ContRep'
.nameinlist 'Отчет по контактам'
.defo Landscape
.fields
  // Фильтры
  Дата_контакта_С
  Дата_контакта_По
  План_дата_С
  План_дата_По
  // Группировки
  Групп_Наименование
  // Данные по проявленному интересу
  ПрИнтерес_Сумма_НДЕ
  ПрИнтерес_Сумма_вал
  ПрИнтерес_Валюта
  // Контакты
  Номер
  План_дата
  Дата
  Категория
  Результат
  Клиент
  Менеджер
  Контактное_лицо
  Телефон
  Комментарий
.endfields
 Ш                                                                                                     БОтчет по контактам Б
.if Cont_Filter_Data
   Дата контакта с @@@@@@@@@@ по @@@@@@@@@@
.end
.if Cont_Filter_Plan_Data
   Планируемая дата контакта с @@@@@@@@@@ по @@@@@@@@@@
.end

──────────────────┬─────────────────────────────────────┬─────────┬──────────┬──────────┬───────────────┬───────────────┬─────────────────┬─────────────────┬─────────────────┬───────────┬──────────────────────────────────────
                  │         Проявленный интерес         │         │          │          │               │               │                 │                 │                 │           │
   Группировка    ├───────────────┬──────────────┬──────┤  Номер  │План.дата │   Дата   │   Категория   │   Результат   │      Клиент     │     Менеджер    │ Контактное лицо │  Телефон  │ Комментарий
                  │  Сумма в НДЕ  │Сумма в валюте│Валюта│         │          │          │               │               │                 │                 │                 │           │
──────────────────┴───────────────┴──────────────┴──────┴─────────┴──────────┴──────────┴───────────────┴───────────────┴─────────────────┴─────────────────┴─────────────────┴───────────┴──────────────────────────────────────
.{ Cont_Info CheckEnter
@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&&.&& &'&&&&&&&&&.&& @@@@@@ @@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.} Ш
.endform
