//******************************************************************************
//                                                      (c) корпорация Галактика
// Галактика 7.12 - Печать справочника городов, государств
//******************************************************************************
#doc
Печать справочника городов
#end
.set name='GetCity'
.hide
.fields
   Country NameCity Kod TelKod
.endfields
 ^
.{
  ^^^
.}
.endform

#doc
Справочник городов
#end
.linkform 'Getcity_01' prototype is 'GetCity'
.NameInList 'Справочник городов'
.fields
  Country NameCity Kod TelKod
.endfields
                         БСПРАВОЧНИК ГОРОДОВ Б

 Государство:  Б^ Б
┌──────────────────────────────┬────────────────┬──────────────────┐
│  Б    Наименование города      │   Код города   │  Телефонный код Б  Б │
├──────────────────────────────┼────────────────┼──────────────────┤
 Б.{
│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&&&&│
.} Б
└──────────────────────────────┴────────────────┴──────────────────┘
 Б.endform

#doc
Печать справочника государств
#end
.set name='GetState'
.hide
.fields
   Country Kod IsNal
.endfields
.{
  ^^^
.}
.endform

#doc
Справочник государств
#end
.linkform 'GeState_01' prototype is 'GetState'
.NameInList 'Справочник государств'
.fields
  Country Kod IsNal
.endfields Б
                        СПРАВОЧНИК ГОСУДАРСТВ

┌──────────────────────────────┬────────────────┬──────────────────┐
│         Государство          │   Код страны   │      Налоги    Б   Б │
├──────────────────────────────┼────────────────┼──────────────────┤
 Б.{
│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&&&&&&&&&│@@@@@@@@@@@@@@@@@@│
.} Б
└──────────────────────────────┴────────────────┴──────────────────┘
 Б.endform