#doc
 ■╝Ю╛═ Ю═А╞Ю╔╓╔╚╔╜╜╝АБ╗ ╗ Ю═А╞Ю╔╓╔╚О╔╛╝АБ╗ ╞╚═Б╔╕╔╘
#end

.form 'RASPRED'
!.hide
!.set name='Raspred'
.fields
tipname : string
NameIn : string
NameOut : string
KontrName : string
NoPlat : string
Outer : string
.endfields
дддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд
                              Ъ│  ^     Ъ│
дддддддддддддддддддддддддддддддддбддддддддддддддддддддддддбддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд
 Ъ═    ┼╝╜БЮ═ё╔╜БЪ═                  Ё@@@@@@@@@@@@@@@@@@@@    Ё@@@@@@@@@@@@@@@@@@@@@@
дддддддддддддддддддддддддддддддддеддддддддддддддддддддддддеддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд
.{
  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@@@@@@@@@@Ё@@@@@@@@@@@@@@@@@@@@@@@@
.}
.[f
дддддддддддддддддддддддддддддддддаддддддддддддддддддддддддаддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд
.]f
.endform
