!╔═══════════════════════════════════════════════════════════════════════════╗
!║                     (c) 1994-2002 корпорация ГАЛАКТИКА                    ║
!║ Проект        : ГАЛАКТИКА                                                 ║
!║ Система       : Оперативный контур [КапСтрой]                             ║
!║ Версия        : 5.84                                                      ║
!║ Назначение    : Справка о перечисленных средствах и фактическом использо- ║
!║                 вании договоров, связанных с кап. строительством.         ║
!║ Разработал    : Макс Голдин                                               ║
!╚═══════════════════════════════════════════════════════════════════════════╝


#doc
Справка о перечисленных средствах и фактическом использовании договоров,
связанных с кап. строительством.
#end
.form  'DogStroy'
.hide
.fields
  дата_начала_периода    : Date
  дата_окончания_периода : Date

  Организация
  Организация_УНН
  Организация_ОКПО
  Организация_ОКДП
  Организация_Банк

!.{
  Предприятие
  Программа_работ

  Дата_договора :Date
  Номер_договора
  Перечислено :Double
  //Принято_отчетов_об_исполнении_договора
  //Авансы_по_которым_не_получены_отчеты_об_исполнении
!.}
.endfields
! --- Описание структуры формы
  дата_начала_периода:    ^
  дата_окончания_периода: ^

  Организация:            ^
  Организация_УНН:        ^
  Организация_ОКПО:       ^
  Организация_ОКДП:       ^
  Организация_Банк:       ^

.{
  ---------------------------------------------------------------------------
  Предприятие:     ^
  Программа_работ: ^

  Дата_договора:   ^
  Номер_договора:  ^
  Перечислено:     &#'&&&&&&&&&&.&&
!  Принято_отчетов_об_исполнении_договора:             ^
!  Авансы_по_которым_не_получены_отчеты_об_исполнении: ^
.}
.endform



!******************************************************************************
!******************************************************************************
!******************************************************************************
#doc
Справка о перечисленных средствах и фактическом использовании договоров
#end
.LinkForm 'DogStroy1' prototype is 'DogStroy'
.NameInList 'Справка о перечисленных средствах и фактическом использовании договоров'
.DEFO LANDSCAPE
.p 55
.var
  S0, S1, P0, P1 : String;
  Itog5, Itog50  : Double;
.endvar
.fields
  CommonFormHeader

  String('Справка о перечисленных средствах и фактическом использовании договоров,')
  String('связанных с капитальным строительством и реконструкцией производства,')
  String('заключенных '+Организация+' с предприятиями.')

  дата_начала_периода
  дата_окончания_периода
.endfields
^
 Б@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
 Б@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
 Б@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
                                  за период с  Б@@@@@@@@@@ Б по  Б@@@@@@@@@@ Б

.begin
  S0     := '';
  S1     := '';
  P0     := '';
  P1     := '';
  Itog5  := 0.0;
  Itog50 := 0.0;
end.
.{
.[h
.begin
end.
 Ш┌─────────────────────────────────────────┬────────────────────────────────────────────────────────────────────────────┬────────────────────────┬─────────────────┬───────────────┬──────────────────────────────┐ Ш
 Ш│                                         │                                                                            │         Договор        │                 │Принято отчетов│      Авансы, по которым      │ Ш
 Ш│               Предприятие               │                                 Программа                                  ├──────────┬─────────────┤   Перечислено   │ об исполнении │      не получены отчеты      │ Ш
 Ш│                                         │                                                                            │   дата   │    номер    │                 │               │    об исполнении договора    │ Ш
 Ш├─────────────────────────────────────────┼────────────────────────────────────────────────────────────────────────────┼──────────┼─────────────┼─────────────────┼───────────────┼──────────────────────────────┤ Ш
 Ш│                   1                     │                                     2                                      │    3     │      4      │        5        │       6       │              7               │ Ш
 Ш├─────────────────────────────────────────┼────────────────────────────────────────────────────────────────────────────┼──────────┼─────────────┼─────────────────┼───────────────┼──────────────────────────────┤ Ш
.]h
.{?Internal;(S0 = '')
.begin
  S0 := Предприятие;
end.
.}
.{?Internal;(P0 = '')
.begin
  P0 := Программа_работ;
end.
.}
.{?Internal;(S0 <> Предприятие)
.fields
  S0
  Itog5
.endfields
 Ш├─────────────────────────────────────────┴────────────────────────────────────────────────────────────────────────────┴──────────┴─────────────┼─────────────────┼───────────────┼──────────────────────────────┤ Ш
 Ш│ Итого по инвестиционным программам:  Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б│ Б&#'&&&&&&&&&&&.&& Б│               │                              │ Ш
 Ш├─────────────────────────────────────────┬────────────────────────────────────────────────────────────────────────────┬──────────┬─────────────┼─────────────────┼───────────────┼──────────────────────────────┤ Ш
.begin
  S0     := Предприятие;
  P0     := Программа_работ;
  Itog5  := 0.0;
end.
.}
.{?Internal;(P0 <> Программа_работ)
 Ш├─────────────────────────────────────────┼────────────────────────────────────────────────────────────────────────────┼──────────┼─────────────┼─────────────────┼───────────────┼──────────────────────────────┤ Ш
.begin
  P0     := Программа_работ;
end.
.}
.fields
  if(S1 <> '', if(S1 = Предприятие    , '', Предприятие    ), Предприятие)
  if(P1 <> '', if(P1 = Программа_работ, '', Программа_работ), Программа_работ)
!  Программа_работ

  Дата_договора
  Номер_договора
  Перечислено
.endfields
 Ш│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@│&#'&&&&&&&&&&&.&&│               │                              │ Ш
.begin
  S1     := Предприятие;
  P1     := Программа_работ;
  Itog5  += Перечислено;
  Itog50 += Перечислено;
end.
.[f
 Ш└─────────────────────────────────────────┴────────────────────────────────────────────────────────────────────────────┴──────────┴─────────────┴─────────────────┴───────────────┴──────────────────────────────┘ Ш
.]f
.}
.fields
  S0
  Itog5
.endfields
 Ш┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┬─────────────────┬───────────────┬──────────────────────────────┐ Ш
 Ш│ Итого по инвестиционным программам:  Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б│ Б&#'&&&&&&&&&&&.&& Б│               │                              │ Ш
 Ш└───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┴─────────────────┴───────────────┴──────────────────────────────┘ Ш
.begin
  Itog5  := 0.0;
end.
.fields
  Itog50
.endfields
 Ш┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┬─────────────────┬───────────────┬──────────────────────────────┐ Ш
 Ш│ Б Всего по инвестиционным договорам Б                                                                                                             │ Б&#'&&&&&&&&&&&.&& Б│               │                              │ Ш
 Ш└───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┴─────────────────┴───────────────┴──────────────────────────────┘ Ш
.endform
!******************************************************************************