//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.8 - Управление капитальным вложениями и строительством
// Перечень оборудования по объекту строительства
//------------------------------------------------------------------------------

#doc
Перечень оборудования по объекту строительства
#end
.Set Name = 'Equip4Obj'
.Hide
.Fields
  dStart sClass sObj sCode sFilter sVal
  Part sMC sBarKod sEd fKolT fSumT
                  fKolS fSumS
                  fKolM fSumM
                  fKol29 fSum29
                  fKolO fSumO
  fTotT fTotS fTotM fTot29 fTotO
.EndFields
  ^^^^^^
.{
  ^^^^^^^^^^^^^^
.}
  ^^^^^
.EndForm

!▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
#doc
Перечень оборудования по объекту строительства
#end
.LinkForm 'Equip4Obj_01' prototype is 'Equip4Obj'
.NameInList 'Перечень оборудования по объекту строительства'
.Group '1'
.p 60
.Fields
  sClass sObj sCode dStart
.EndFields
                         БПЕРЕЧЕНЬ ОБОРУДОВАНИЯ Б
                 ^:  Б^ Б. Код:  Б^ Б
                            БНА ^ г. Б

.{?Internal;sFilter <> ''
.Fields
  sFilter
.EndFields
 ВФильтр по группам МЦ: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ В
.}// Internal
.Fields
  'Стоимость, ' + sVal : 'P:C'
  'Стоимость, ' + sVal : 'P:C'
  'Стоимость, ' + sVal : 'P:C'
  'Стоимость, ' + sVal : 'P:C'
.EndFields
 Ш───────────────────────────┬────────────┬───────────┬────────────────────────────────┬────────────────────────────────┬────────────────────────────────┬────────────────────────────────
                           │            │           │          На складах            │        Передано в монтаж       │        Учтено по М-29          │        Переведено в ОС
  Наименование матценности │ Номенклат. │  Единица  ├────────────┬───────────────────┼────────────┬───────────────────┼────────────┬───────────────────┼────────────┬───────────────────
    (партии)               │   номер    │ измерения │ Количество │@@@@@@@@@@@@@@@@@@@│ Количество │@@@@@@@@@@@@@@@@@@@│ Количество │@@@@@@@@@@@@@@@@@@@│ Количество │@@@@@@@@@@@@@@@@@@@
───────────────────────────┴────────────┴───────────┴────────────┴───────────────────┴────────────┴───────────────────┴────────────┴───────────────────┴────────────┴─────────────────── Ш
.{
.{?Internal;Part = ''
.Fields
  sMC sBarKod sEd fKolS fSumS
                  fKolM fSumM
                  fKol29 fSum29
                  fKolO fSumO
.EndFields
 Ш @@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@ @@@@@@@@@@@ &&&&&&&&.&&& &'&&&&&&&&&&&&&&.&& &&&&&&&&.&&& &'&&&&&&&&&&&&&&.&& &&&&&&&&.&&& &'&&&&&&&&&&&&&&.&& &&&&&&&&.&&& &'&&&&&&&&&&&&&&.&& Ш
.}
.{?Internal;Part <> ''
.Fields
  sMC sBarKod sEd fKolS fSumS
                  fKolM fSumM
                  fKol29 fSum29
                  fKolO fSumO
.EndFields
 Ш   @@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@ @@@@@@@@@@@ &&&&&&&&.&&& &'&&&&&&&&&&&&&&.&& &&&&&&&&.&&& &'&&&&&&&&&&&&&&.&& &&&&&&&&.&&& &'&&&&&&&&&&&&&&.&& &&&&&&&&.&&& &'&&&&&&&&&&&&&&.&& Ш
.}
.}
.Fields
  fTotS fTotM fTot29 fTotO
.EndFields

 Ш ИТОГО ПО ОБЪЕКТУ     :                                         &'&&&&&&&&&&&&&&&&.&&            &'&&&&&&&&&&&&&&&&.&&            &'&&&&&&&&&&&&&&&&.&&            &'&&&&&&&&&&&&&&&&.&& Ш
.EndForm
