/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994, 2002 корпорация ГАЛАКТИКА                   ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : УКС (Управление кап. строительством) - Оперативный Контур ║
 ║ Версия        : 5.80                                                      ║
 ║ Назначение    : Форма С-2                                                 ║
 ║                 "Сведения о ходе строительства важнейших объектов"        ║
 ║ Ответственный : Шишов Виктор Васильевич (ShV)                             ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
#doc
Форма С-2 "Сведения о ходе строительства важнейших объектов"
#end
.Form 'UKS_S2'
.Hide
.Fields

Месяц                      : String
Год                        : String

Орг_Name                   : String
Орг_Adres                  : String

Орг_Kod_2                  : String
Орг_Kod_3                  : String
Орг_Kod_4                  : String
Орг_Kod_5                  : String
Орг_Kod_6                  : String
Орг_Kod_7                  : String
Орг_Kod_8                  : String
Орг_Kod_9                  : String

.EndFields
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.EndForm