#doc
Выполнение плана капитальных вложений и ввода производственных мощностей
#end
.Form 'VypPlan'
.group 'Выполнение плана капитальных вложений и ввода производственных мощностей'
.nameinlist 'Базовая форма'
.Hide
.Fields
Орг ЦО
Год
ГодПред
ВсегоФактПред : double
ВсегоПлан : double
ВсегоФакт : double
ПроцГод
ПроцГодПред

ВсегоФактПредСМР : double
ВсегоПланСМР : double
ВсегоФактСМР : double
ПроцГодСМР
ПроцГодПредСМР

ИмяОтрасли
НРекОтрасли
ВсегоФактПредОт : double
ВсегоПланОт : double
ВсегоФактОт : double
ПроцГодОт
ПроцГодПредОт

ВсегоФактПредСМРОт : double
ВсегоПланСМРОт : double
ВсегоФактСМРОт : double
ПроцГодСМРОт
ПроцГодПредСМРОт
.EndFields
^ ^ ^ ^
^ ^ ^ ^ ^
^ ^ ^ ^ ^

.{
^ ^
^ ^ ^ ^ ^
^ ^ ^ ^ ^
.}
.EndForm
