//------------------------------------------------------------------------------
//                                                      (с) корпорация Галактика
// Галактика 7.11 - Заработная плата
// Отчет "1-я страница типовой формы П-12" (Украина)
//------------------------------------------------------------------------------

.LinkForm 'P12_1' prototype is 'UnifiedFormT12_FirstPage'
.NameInList 'Типовая форма N П-12 (1-я страница)'
.group 'П12'
.p 80
.function RepPeriodName(BegOPDate: Date; EndOPDate: Date): String;
var
  NonStdPeriod: Boolean;
begin
  NonStdPeriod := False;
  if Year(BegOPDate) = Year(EndOPDate) then
  begin
    if Month(BegOPDate) = Month(EndOPDate) then
    begin
      if (Day(BegOPDate) = 1) and (Day(EndOPDate) = Last_Day(EndOPDate)) then
        RepPeriodName := 'за ' + DateToStr(BegOPDate, 'month YYYY') + ' року';
      else
        NonStdPeriod := True;
    end else
    begin
      if (Day(BegOPDate) = 1) and (Day(EndOPDate) = Last_Day(EndOPDate)) then
      begin
        if (Month(BegOPDate) = 1) and (Month(EndOPDate) = 3) then
          RepPeriodName := 'за I квартал ' + String(Year(BegOPDate)) + ' року';
        else
          if (Month(BegOPDate) = 1) and (Month(EndOPDate) = 3) then
            RepPeriodName := 'за II квартал ' + String(Year(BegOPDate)) + ' року';
          else
            if (Month(BegOPDate) = 1) and (Month(EndOPDate) = 3) then
              RepPeriodName := 'за III квартал ' + String(Year(BegOPDate)) + ' року';
            else
              if (Month(BegOPDate) = 1) and (Month(EndOPDate) = 3) then
                RepPeriodName := 'за IV квартал ' + String(Year(BegOPDate)) + ' року';
              else
                if (Month(BegOPDate) = 1) and (Month(EndOPDate) = 6) then
                  RepPeriodName := 'за I пiврiччя ' + String(Year(BegOPDate)) + ' року';
                else
                  if (Month(BegOPDate) = 1) and (Month(EndOPDate) = 9) then
                    RepPeriodName := 'за 9 мiсяцiв ' + String(Year(BegOPDate)) + ' року';
                  else
                    if (Month(BegOPDate) = 1) and (Month(EndOPDate) = 12) then
                      RepPeriodName := 'за ' + String(Year(BegOPDate)) + ' рiк';
                    else
                    NonStdPeriod := True;
      end else
        NonStdPeriod := True;
    end;
  end else
    NonStdPeriod := True;
  if NonStdPeriod then
    RepPeriodName := 'за перiод з ' + DateToStr(BegOPDate, 'DD.MM.YYYY') + ' по ' +
     DateToStr(EndOPDate, 'DD.MM.YYYY');
end.
.create view vDataform
  select
    KatOrg.OKPO
  from
    KatOrg
  where ((
    coGetTune('MyOrg')     == KatOrg.NRec
   ));
.fields
  Организация
  KatOrg.OKPO
  Replace(Структурное_подразделение, 'по всем подразделениям', 'по всiм пiдроздiлам')
  RepPeriodName(StrToDate(Начало_отчетного_периода, 'DD/MM/YYYY'), StrToDate(Окончание_отчетного_периода, 'DD/MM/YYYY'))
.endfields
 М@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д                      Типова форма N П-12
            пiдприємство, органiзацiя                                    ЗАТВЕРДЖЕНА
                                                                         наказом Мiнстату України
                                                                         вiд 9 жовтня 1995 р. N 253

.{table 'vDataform: main' by vDataform.KatOrg.NRec
                           ┌───────────┐                                             ┌───────────┐
Iдентифiкацiйнийкод ЄДРПОУ │@~@@@@@@@@@│                                 Код за УКУД │           │
                           └───────────┘                                             └───────────┘ И
.}
 ИЦех, вiддiл, дiльниця  Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д

Змiна Майстер
      ──────────────────
      начальник

 Б                                           ТАБЕЛЬ ОБЛIКУ
                     використання робочого часу та розрахунку заробiтної плати
@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Й
 И┌────────────────────────────────────────────────────────────────────────┬────────────────────────┐
│                           Умовнi позначення                            │          Код           │
│                                                                        ├────────────┬───────────┤
│                                                                        │  буквений  │ цифровий  │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Години (днi) роботи                                                     │     р      │    01     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│години роботи:                                                          │            │           │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│ а) нiчнi                                                               │     н      │    02     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│ б) надурочнi вiдрядникiв                                               │    нув     │    03     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│ в) надурочнi почасовикiв                                               │    нуп     │    04     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│почасова робота:                                                        │            │           │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│ а) вiдрядникiв цiлозмiнна                                              │    рвц     │    05     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│ б) вiдрядникiв внутрiшньозмiнна                                        │    рвв     │    06     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Вiдрядна робота почасових працiвникiв                                   │            │    07     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Вiдрядження:                                                            │            │           │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│ а) службовi                                                            │     к      │    08     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│ б) на сiльськогосподарськi роботи осiб, якi залишаються у              │     вс     │    09     │
│    середньосписковiй чисельностi                                       │            │           │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│ в) на сiльськогосподарськi роботи осiб, за якими зберiгається 75 %     │     зс     │    10     │
│    середньомiсячного заробiтку                                         │            │           │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Вiдпустка:                                                              │            │           │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│ а) основна щорiчна                                                     │     в      │    11     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│ б) додаткова вiдпустка без збереження заробiтної плати, яка надається  │     вж     │    12     │
│    жiнкам до досягнення певного вiку дитини                            │            │           │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│ в) у зв'язку з навчанням i повним збереженням заробiтку, пiдвищення    │     ву     │    13     │
│    квалiфiкацiї або навчання новим професiям з вiдривом вiд виробництва│            │           │
│    та iншi                                                             │            │           │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│ г) у зв'язку з навчанням з частковим збереженням заробiтку у вiльнi вiд│     л      │    14     │
│    роботи учбовi днi                                                   │            │           │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│ д) вiдпустка без збереження заробiтної плати, яка надається працiвникам│     лс     │    15     │
│    для здачi вступних iспитiв, а також якi навчаються на останнiх      │            │           │
│    курсах вищих та середнiх спецiальних учбових закладiв               │            │           │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Тимчасова непрацездатнiсть та вiдпустки по догляду за хворим та по      │     х      │    16     │
│карантину, оформленi листками непрацездатностi, крiм випадкiв, що       │            │           │
│передбаченi кодом "т"                                                   │            │           │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Вiдпустка з вагiтностi та пологiв                                       │     вв     │    17     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Цiлоденнi невиходи з повним збереженням заробiтної плати у випадках,    │     цн     │    18     │
│передбачених законодавством (виконання державних та громадських         │            │           │
│обов'язкiв)                                                             │            │           │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Цiлозмiннi простої не з вини працюючого                                 │     пц     │    19     │
└────────────────────────────────────────────────────────────────────────┴────────────┴───────────┘ И
 И┌────────────────────────────────────────────────────────────────────────┬────────────────────────┐
│                           Умовнi позначення                            │          Код           │
│                                                                        ├────────────┬───────────┤
│                                                                        │  буквений  │ цифровий  │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Внутрiшньозмiннi простої не з вини працюючого                           │     пв     │    20     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Допризовна пiдготовка                                                   │     д      │    21     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Вiйськово-учбовi збори                                                  │     ч      │    22     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Години скорочення роботи робiтникам та службовцям молодшим за 18 рокiв  │     лч     │    23     │
│проти встановленої тривалостi робочого дня                              │            │           │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Внутрiшньозмiннi перерви (жiнкам на годування дитини, у зв'язку з       │     м      │    24     │
│виконанням державних та громадських обов'язкiв, для обiгрiву працюючих, │            │           │
│якi роблять у холодний перiод року на вiдкритому повiтрi тощо)          │            │           │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Цiлоденнi неявки без збереження заробiтку по догляду за хворим та по    │     ж      │    25     │
│карантину, оформленi довiдками лiкувальних установ та iншi              │            │           │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Вiльнi вiд роботи учбовi днi без збереження заробiтної плати у          │     щ      │    26     │
│випадках, передбачених законодавством                                   │            │           │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Неоплачена непрацездатнiсть у випадках, передбачених законодавством     │     т      │    27     │
│(у зв'язку з побутовою травмою та iншi)                                 │            │           │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Короткочасова вiдпустка без збереження заробiтної плати, яка надається  │            │           │
│адмiнiстрацiєю за iнiцiативою:                                          │            │           │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│ а) працюючого                                                          │     а      │    28     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│ б) адмiнiстрацiї                                                       │     аа     │    29     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Цiлозмiннi простої з вини працюючих                                     │     цп     │    30     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Внутрiшньозмiннi простої з вини працюючих                               │     вп     │    31     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Прогули та iншi неявки з поважних причин                                │     пр     │    32     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Запiзнення                                                              │     зп     │    33     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Передчасне залишення роботи                                             │     пз     │    34     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Вихiднi (днi щотижневого вiдпочинку) святковi та неробочi днi           │     вщ     │    35     │
├────────────────────────────────────────────────────────────────────────┼────────────┼───────────┤
│Масовi невиходи на роботу (страйки)                                     │     мн     │    36     │
└────────────────────────────────────────────────────────────────────────┴────────────┴───────────┘ И
.EndForm