.LinkForm 'TABT13_P13_01' Prototype is 'TabT13'
.NameInList ' ’ กฅซ์ ฎกซiชใ ขจชฎเจแโ ญญ๏ เฎกฎ็ฎฃฎ ็ แใ (”ฎเฌ  -13)'
.group '-13'
.DEFP PA4
.DEFO LANDSCAPE
.PAPER PA4
.ORIENT LANDSCAPE
.p 56
.var
  FirstLine:Boolean
  AnFirstLine: boolean;
  LineCount:Integer
  LinesPerPage:Integer
  lShow_Analitik: boolean;
.endvar
.create view vTable
  select
    KatOrg.OKPO
  from
    KatOrg
  where ((
    coGetTune('MyOrg')     == KatOrg.NRec
   ));
.fields
  Pred
  KatOrg.OKPO
  Replace(Podr, 'กฅง ใ็ฅโ  ฏฎคเ งคฅซฅญจ๏', 'ฏฎ ขแiฌ ฏiคเฎงคiซ ฌ')
  '’ กฅซ์ ฎกซiชใ ขจชฎเจแโ ญญ๏ เฎกฎ็ฎฃฎ ็ แใ ง  ฏฅเiฎค ง ' + PeriodBeginning + ' ฏฎ ' + PeriodEnding

  Day_1 Day_2 Day_3 Day_4 Day_5 Day_6 Day_7 Day_8 Day_9 Day_10 Day_11 Day_12 Day_13 Day_14 Day_15
  Day_16 Day_17 Day_18 Day_19 Day_20 Day_21 Day_22 Day_23 Day_24 Day_25 Day_26 Day_27 Day_28 Day_29 Day_30 Day_31

  AnalitikName

  D1  D2  D3  D4  D5  D6  D7  D8  D9  D10 D11 D12 D13 D14 D15
  ฏฅเข_ฏฎซ_คญจ
  VidOpl1
  ฎเเแ็ฅโ1
  Day1
  Chas1
  VidOpl2
  ฎเเแ็ฅโ2
  Day2
  Chas2
  KodNejavki1
  DayNejavok1
  ChasNejavok1
  KodNejavki2
  DayNejavok2
  ChasNejavok2
  Npp
  TabN
  LogicSubStr(GetSurnameWithInitials(FIO), 22, false, false)
  ฌฅแ๏ๆ_คญจ
  Ch1
  Ch2
  Ch3
  Ch4
  Ch5
  Ch6
  Ch7
  Ch8
  Ch9
  Ch10
  Ch11
  Ch12
  Ch13
  Ch14
  Ch15
  ฏฅเข_ฏฎซ_็ แ๋
  VidOpl3
  ฎเเแ็ฅโ3
  Day3
  Chas3
  VidOpl4
  ฎเเแ็ฅโ4
  Day4
  Chas4
  KodNejavki3
  DayNejavok3
  ChasNejavok3
  KodNejavki4
  DayNejavok4
  ChasNejavok4
  LogicSubStr(Dolg, 22, true, true)
  LogicSubStr(Dolg, 22, true, true)
  D16  D17  D18  D19  D20  D21  D22  D23  D24  D25  D26  D27  D28  D29  D30  D31
  ขโฎเ_ฏฎซ_คญจ
  VidOpl5
  ฎเเแ็ฅโ5
  Day5
  Chas5
  VidOpl6
  ฎเเแ็ฅโ6
  Day6
  Chas6
  KodNejavki5
  DayNejavok5
  ChasNejavok5
  KodNejavki6
  DayNejavok6
  ChasNejavok5
  LogicSubStr(Dolg, 22, true, true)
  ฌฅแ๏ๆ_็ แ๋
  Ch16
  Ch17
  Ch18
  Ch19
  Ch20
  Ch21
  Ch22
  Ch23
  Ch24
  Ch25
  Ch26
  Ch27
  Ch28
  Ch29
  Ch30
  Ch31
  ขโฎเ_ฏฎซ_็ แ๋
  VidOpl7
  ฎเเแ็ฅโ7
  Day7
  Chas7
  VidOpl8
  ฎเเแ็ฅโ8
  Day8
  Chas8
  KodNejavki7
  DayNejavok7
  ChasNejavok7
  KodNejavki8
  DayNejavok8
  ChasNejavok8
.endfields
.if Show_Analitik
.begin
  lShow_Analitik := true;
end.
.else
.begin
  lShow_Analitik := false;
end.
.end
.{ checkenter
.{table 'vTable: main' by vTable.KatOrg.NRec
ÿ@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ÿ                                                                                                           ÿ’จฏฎข  ไฎเฌ  N -13ÿ
                   ฏiคฏเจ๓ฌแโขฎ, ฎเฃ ญiง ๆจ๏                                                                                                                               €’……€
                               ฺฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ                                                                                                           ญ ช งฎฌ iญแโ โใ “ชเ ๕ญจ
Iคฅญโจไiช ๆiฉญจฉ ชฎค “    ณ@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ณ                                                                                                           ขiค 9 ฆฎขโญ๏ 1995 เ. N 253
                               ภฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤู

–ฅๅ, ขiคคiซ ÿ@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ÿ                                                                                                                                         ฺฤฤฤฤฤฤฤฟ
                                                                                                                                                                                             ฎค ง  ““ ณ       ณ
เจฃ ค      ÿ                                                    ÿ                                                                                                                                         ภฤฤฤฤฤฤฤูÿ
.}

ÿ                                                                                                                                                                 ฺฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฟ
                                                                                                                                                                 ณ     ฎค      ณ   –ฅๅ,   ณ          ณ เจฃ ค   ณ
                                                                                                                                                                 ณเฎงเ ๅใญชฎขฎฃฎณ  ขiคคiซ  ณ          ณ          ณ
                                                                                                                                                                 ณ    ฌiแ๏ๆ๏    ณ          ณ          ณ          ณ
                                                                                                                                                                 รฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤด
 ÿ@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ÿ ณ              ณ          ณ          ณ          ณ
                                                                                                                                                                 ภฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤู
ษอออออหอออออออออหออออออออออออออออออออออหอออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออหอออออออออออออหอออออออออออออออออออออออออออออออออออออออออออออออออออออออออหอออหอออออออออออออออออออออออออออออป
บฎฌฅเบ’ กฅซ์ญจฉบ   เiงขจ้ฅ, iฌ'๏,    บ    iคฌiโชจ ฏเฎ ๏ขชจ โ  ญฅ๏ขชจ ญ  เฎกฎโใ ฏฎ ็จแซ ๅ ฌiแ๏ๆ๏     บiคฏเ ๆ์ฎข ญฎบ           ญi คซ๏ ญ เ ๅใข ญญ๏ ง เฎกiโญฎ๕ ฏซ โจ          บ   บ       ฅ๏ขช  ง ฏเจ็จญ       บ
บง    บญฎฌฅเ    บ     ฏฎ ก โ์ชฎขi      บ                                                               บ             บ            ง  ขจค ฌจ โ  ญ ฏเ ขซฅญญ๏ฌจ ง โเ โ            บ   บ                             บ
บฏฎ-  บ         บ                      วฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤืฤฤฤฤฤฤยฤฤฤฤฤฤืฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤถ   วฤฤฤยฤฤฤยฤฤฤฤฤฤาฤฤฤยฤฤฤยฤฤฤฤฤฤถ
บเ๏ค- บ         บ                      บ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   บI-่ใ  ณฌiแ๏ๆ์บ                     ฎค ขจคใ ฎฏซ โจ                     บ   บชฎคณคญiณฃฎคจญจบชฎคณคญiณฃฎคจญจบ
บชฎฌ  บ         บ                      บ &&ณ &&ณ &&ณ &&ณ &&ณ &&ณ &&ณ &&ณ &&ณ &&ณ &&ณ &&ณ &&ณ &&ณ &&ณ • บฏฎซฎข.ณ      วฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤถ   บ   ณ   ณ      บ   ณ   ณ      บ
บ     บ         บ   เฎไฅแi๏, ฏฎแ ค    บ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   บฌiแ๏ๆ๏ณ      วฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤถ   บ   ณ   ณ      บ   ณ   ณ      บ
บ     บ         บ                      บ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   บ      ณ      บ            ฎเฅแฏฎญคใ๎็จฉ เ ๅใญฎช, ง ฌฎขซฅญญ๏           บ   บ   ณ   ณ      บ   ณ   ณ      บ
บ     บ         บ                      วฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤืฤฤฤฤฤฤมฤฤฤฤฤฤืฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤถ   บ   ณ   ณ      บ   ณ   ณ      บ
บ     บ         บ                      บ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   บ     คญi     วฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤถ   บ   ณ   ณ      บ   ณ   ณ      บ
บ     บ         บ                      บ &&ณ &&ณ &&ณ &&ณ &&ณ &&ณ &&ณ &&ณ &&ณ &&ณ &&ณ &&ณ &&ณ &&ณ &&ณ &&วฤฤฤฤฤฤฤฤฤฤฤฤฤถชฎค   ณชฎเฅแ-   ณคญi, ฃฎคจญจณชฎค   ณชฎเฅแ-   ณคญi, ฃฎคจญจบ   บ   ณ   ณ      บ   ณ   ณ      บ
บ     บ         บ                      บ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   บ    ฃฎคจญจ   บขจคใ  ณฏฎญคใ๎็จฉณ           ณขจคใ  ณฏฎญคใ๎็จฉณ           บ   บ   ณ   ณ      บ   ณ   ณ      บ
บ     บ         บ                      บ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   บ             บฎฏซ โจณเ ๅใญฎช  ณ           ณฎฏซ โจณเ ๅใญฎช  ณ           บ   บ   ณ   ณ      บ   ณ   ณ      บ
วฤฤฤฤฤืฤฤฤฤฤฤฤฤฤืฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤืฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤืฤฤฤฤฤฤยฤฤฤฤฤฤืฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤืฤฤฤืฤฤฤลฤฤฤลฤฤฤฤฤฤืฤฤฤลฤฤฤลฤฤฤฤฤฤถ
บ  1  บ    2    บ           3          บ                              4                                บ   5  ณ   6  บ  7   ณ     8   ณ     9     ณ  10  ณ    11   ณ   12      บ13 บ14 ณ15 ณ  16  บ17 ณ18 ณ  19  บ
ÿ.{?internal; lShow_Analitik;
ÿฬอออออสอออออออออสออออออออออออออออออออออสอออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออสออออออฯออออออสออออออฯอออออออออฯอออออออออออฯออออออฯอออออออออฯอออออออออออสอออสอออฯอออฯออออออสอออฯอออฯออออออนÿ
.}
.{?internal; not lShow_Analitik;
ÿฬอออออฮอออออออออฮออออออออออออออออออออออฮอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออฮออออออุออออออฮออออออุอออออออออุอออออออออออุออออออุอออออออออุอออออออออออฮอออฮอออุอออุออออออฮอออุอออุออออออน
ÿ.}ÿ
ÿ.begin
  FirstLine := true;
  LineCount := 33;
  LinesPerPage := 56;
end.
.{
.{?internal; lShow_Analitik;
.begin
  //คฎซฆญ๋ ใฌฅแโจโแ๏ จฌ๏  ญ ซจโจชจ จ ๅฎโ๏ ก๋ ฎคจญ โ กฅซ์ญ๋ฉ ญฎฌฅเ
  LineCount := LineCount + if (FirstLine, 9, 10);
end.
.{?internal;(LineCount > LinesPerPage - 1);
ÿศอออออสอออออออออสออออออออออออออออออออออสอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออสออออออฯออออออสออออออฯอออออออออฯอออออออออออฯออออออฯอออออออออฯอออออออออออสอออสอออฯอออฯออออออสอออฯอออฯออออออผÿ
.begin
  LineCount := LineCount - if (FirstLine, 9, 10) + 1;
end.
.{ while (LineCount < LinesPerPage)
!ง กจข ฅฌ ฏใแโ๋ฌจ แโเฎช ฌจ คฎ ชฎญๆ  แโเ ญจๆ๋

.begin
  LineCount := LineCount + 1;
end.
.}
ÿษอออออหอออออออออหออออออออออออออออออออออหอออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออหออออออัออออออหออออออัอออออออออัอออออออออออัออออออัอออออออออัอออออออออออหอออหอออัอออัออออออหอออัอออัออออออป
บ  1  บ    2    บ           3          บ                              4                                บ   5  ณ   6  บ  7   ณ     8   ณ     9     ณ  10  ณ    11   ณ   12      บ13 บ14 ณ15 ณ  16  บ17 ณ18 ณ  19  บ
ฬอออออสอออออออออสออออออออออออออออออออออสอออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออสออออออฯออออออสออออออฯอออออออออฯอออออออออออฯออออออฯอออออออออฯอออออออออออสอออสอออฯอออฯออออออสอออฯอออฯออออออนÿ
.begin
  FirstLine := true;
  LineCount := 10;
end.
.}
.{?internal;not FirstLine;
ÿฬอออออสอออออออออสออออออออออออออออออออออสอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออสออออออฯออออออสออออออฯอออออออออฯอออออออออออฯออออออฯอออออออออฯอออออออออออสอออสอออฯอออฯออออออสอออฯอออฯออออออน
ÿ.}
ÿบ €ญ ซiโจช : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ บÿ
ÿฬอออออหอออออออออหออออออออออออออออออออออหอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออหออออออัออออออหออออออัอออออออออัอออออออออออัออออออัอออออออออัอออออออออออหอออหอออัอออัออออออหอออัอออัออออออนÿ
.begin
  AnFirstLine := True;
  //ขฎแแโ ญฎขจฌ แ็ฅโ็จช ง  ข๋็ฅโฎฌ  ญ ซจโจชจ
  LineCount := LineCount - if (FirstLine, 7, 8);
end.
.}ÿ
.{ÿ
.begin
  //แ ใ็ฅโฎฌ เ งคฅซจโฅซ์ญฎฉ ซจญจจ ฌฅฆคใ ค ญญ๋ฌจ ฏฎ คขใฌ โ กฅซ์ญ๋ฌ ญฎฌฅเ ฌ (FirstLine = false), จซจ กฅง
  LineCount := LineCount + if (FirstLine, 7, 8);
end.
.{?internal;(LineCount > LinesPerPage - 1)
ÿศอออออสอออออออออสออออออออออออออออออออออสอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออสออออออฯออออออสออออออฯอออออออออฯอออออออออออฯออออออฯอออออออออฯอออออออออออสอออสอออฯอออฯออออออสอออฯอออฯออออออผÿ
.begin
  LineCount := LineCount - if (FirstLine, 7, 8) + 1;
end.
.{ while (LineCount < LinesPerPage)

.begin
  LineCount := LineCount + 1;
end.
.}
ÿษอออออหอออออออออหออออออออออออออออออออออหอออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออหออออออัออออออหออออออัอออออออออัอออออออออออัออออออัอออออออออัอออออออออออหอออหอออัอออัออออออหอออัอออัออออออป
บ  1  บ    2    บ           3          บ                              4                                บ   5  ณ   6  บ  7   ณ     8   ณ     9     ณ  10  ณ    11   ณ   12      บ13 บ14 ณ15 ณ  16  บ17 ณ18 ณ  19  บ
ฬอออออฮอออออออออฮออออออออออออออออออออออฮอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออฮออออออุออออออฮออออออุอออออออออุอออออออออออุออออออุอออออออออุอออออออออออฮอออฮอออุอออุออออออฮอออุอออุออออออนÿ
.begin
  FirstLine := true;
  LineCount := 10;
end.
.}
.{?internal;ÿ(not FirstLine) ÿand (not AnFirstLine);ÿ
ฬอออออฮอออออออออฮออออออออออออออออออออออฮอออุอออุอออุอออุอออุอออุอออุอออุอออุอออุอออุอออุอออุอออุอออุอออฮออออออุออออออฮออออออุอออออออออุอออออออออออุออออออุอออออออออุอออออออออออฮอออฮอออุอออุออออออฮอออุอออุออออออนÿ
.}
ÿบ     บ         บ                      บ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ • บ&&&.&&ณ      บ@@@@@@ณ@@@@@@@@@ณ&&.& &&&.&&ณ@@@@@@ณ@@@@@@@@@ณ&&.& &&&.&&บ   บ@~@ณ&&&ณ&#&.&&บ@~@ณ&&&ณ&#&.&&บ
บ&&&&&บ@@@@@@@@@บ@@@@@@@@@@@@@@@@@@@@@@วฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤืฤฤฤฤฤฤด&&&.&&วฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤด           รฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤด           บ   วฤฤฤลฤฤฤลฤฤฤฤฤฤืฤฤฤลฤฤฤลฤฤฤฤฤฤถ
บ     บ         บ                      บ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ • บ&&&.&&ณ      บ@@@@@@ณ@@@@@@@@@ณ&&.& &&&.&&ณ@@@@@@ณ@@@@@@@@@ณ&&.& &&&.&&บ   บ@~@ณ&&&ณ&#&.&&บ@~@ณ&&&ณ&#&.&&บ
บ     บ         บ@@@@@@@@@@@@@@@@@@@@@@วฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤืฤฤฤฤฤฤลฤฤฤฤฤฤืฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤถ   วฤฤฤลฤฤฤลฤฤฤฤฤฤืฤฤฤลฤฤฤลฤฤฤฤฤฤถ
บ     บ         บ@@@@@@@@@@@@@@@@@@@@@@บ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@ณ@~@บ&&&.&&ณ      บ@@@@@@ณ@@@@@@@@@ณ&&.& &&&.&&ณ@@@@@@ณ@@@@@@@@@ณ&&.& &&&.&&บ   บ@~@ณ&&&ณ&#&.&&บ@~@ณ&&&ณ&#&.&&บ
บ     บ         บ@@@@@@@@@@@@@@@@@@@@@@วฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤืฤฤฤฤฤฤด&&&.&&วฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤด           รฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤด           บ   วฤฤฤลฤฤฤลฤฤฤฤฤฤืฤฤฤลฤฤฤลฤฤฤฤฤฤถ
บ     บ         บ                      บ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&บ&&&.&&ณ      บ@@@@@@ณ@@@@@@@@@ณ&&.& &&&.&&ณ@@@@@@ณ@@@@@@@@@ณ&&.& &&&.&&บ   บ@~@ณ&&&ณ&#&.&&บ@~@ณ&&&ณ&#&.&&บÿ
.begin
  FirstLine := false;
  AnFirstLine := false;
end.
.}
ÿ.}ÿ
ÿศอออออสอออออออออสออออออออออออออออออออออสอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออสออออออฯออออออสออออออฯอออออออออฯอออออออออออฯออออออฯอออออออออฯอออออออออออสอออสอออฯอออฯออออออสอออฯอออฯออออออผ

’ กฅซ์ญจช (ฌ ฉแโฅเ) _________________________________________________                              ็ ซ์ญจช ๆฅๅใ (ขiคคiซใ), คiซ์ญจๆiÿ ÿ_________________________________________________ÿ
.begin
  LineCount := if((LineCount + 3) > LinesPerPage, LineCount + 3 - LinesPerPage, LineCount + 3);
end.
.{ while (LineCount < LinesPerPage)
!ง กจข ฅฌ ฏใแโ๋ฌจ แโเฎช ฌจ คฎ ชฎญๆ  แโเ ญจๆ๋

.begin
  LineCount := LineCount + 1;
end.
.}
.{ checkenter FirstPage
.}
.}
.endform
