! ╔═════════════════════════════════════════════════════════════════════╗
! ║      Проект ГАЛАКТИКА (c) 1994,2005                                 ║
! ║  Версия :     5.80                                                  ║
! ║  Разработал: Банкевич Д.И. (DimaB)                                  ║
! ║  Назначение: Отчет о рассогласовании настроек                       ║
! ║  Изменения:                                                         ║
! ╚═════════════════════════════════════════════════════════════════════╝
#doc
Базовая форма отчета о рассогласовании настроек.
#end
.FORM 'TuneDiff'
.hide
.Fields
 ИмяКого
 ИмяСКем
 Настройка
 ЗначКого
 ЗначСКем
.EndFields
 ^ ^
.{
 ^ ^ ^
.}
.ENDFORM
!
!
!
#doc
Отчет о рассогласовании настроек.
#end
.linkform 'TuneDiff01' prototype is 'TuneDiff'
.NAMEINLIST 'Отчёт о рассогласовании настроек'
.defp PA4
.defo portrait
.p 55
.lm 20
.tm 20
.fields
 CommonFormHeader
 ИмяКого
 ИмяСКем
 Настройка
 ЗначКого
 ЗначСКем
.endfields
  Р^ Р
                            СОТЧЁТ О РАССОГЛАСОВАНИИ НАСТРОЕК С

 Р ┌───────────────────────────────────────────────────────────────────┬──────────────────────────┬──────────────────────────┐
 │   Наименование настройки, номер                                   │ @@@@@@@@@@@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@@ │
 ├───────────────────────────────────────────────────────────────────┴──────────────────────────┴──────────────────────────┤
.{
 │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@@ │
.}
 └───────────────────────────────────────────────────────────────────┴──────────────────────────┴──────────────────────────┘ Р
.endform
