//******************************************************************************
//                                                      (c) корпорация Галактика
// Галактика 8.1 - Логистика
// Временные таблицы для документов по спецификации ПЗС
//******************************************************************************

// Временная таблица для договоров по спецификации ПЗС
table struct local tmpDocs
(
  cDoc     : Comp       "Ссылка на документ",
  SortName : String[50] "Для сортировки"
)
with index
(
  tmpDocs01 = cDoc,
  tmpDocs02 = SortName
);

// Временная таблица для договоров по спецификации ПЗС
table struct local tmpSp
(
  cSp : Comp "Ссылка на спецификацию документа"
)
with index
(
  tmpSp01 = cSp
);
