#doc
Справка о подтверждающих документах
#end
.Form 'DogSpravka'
.Hide
.Fields
Дата_справки
Период_С
Период_По

NRec_договора
Контрагент1
Контрагент1_Банк
Номер_паспорта_сделки

NRec_документа
Дата_документа
Kод_вида_документа
Номер_таможенной_декларации
Код_валюты_документа
Сумма_документа
Код_валюты_договора
Сумма_вал_договора
Признак_корректировки

Руководитель
Главный_бухгалтер
.EndFields

^ ^ ^ ^ ^ ^ ^
.{ CheckEnter DogSpravkaLoop
^ ^ ^ ^ ^ ^ ^ ^ ^
.}
^ ^

.EndForm

#doc
Справка о подтверждающих документах
#end
.LinkForm 'DogSpravka_Main' Prototype is 'DogSpravka'
.Fields
Контрагент1_Банк
Дата_справки
Контрагент1
Номер_паспорта_сделки

Дата_документа
Kод_вида_документа
Номер_таможенной_декларации
Код_валюты_документа
Сумма_документа
Код_валюты_договора
Сумма_вал_договора
Признак_корректировки

Руководитель
Главный_бухгалтер
.EndFields
                                                                                   от 1 июня 2004 года № 258-П
                                                                         "О порядке предоставления резидентами
                                                  уполномоченным банком подтверждающих документов и информации
                                                     связанных с проведением валютных операций с нерезидентами
                                            по внешнеторговым сделкам, и осуществления уполномоченными банками
                                                                    контроля за проведением валютных операций"

     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

                                      Cправка о подтверждающих документах
                                         ┌───┬───┐   ┌───┬───┐   ┌───┬───┬───┬───┐
                                      от @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │
                                         └───┴───┘   └───┴───┘   └───┴───┴───┴───┘
                                         ┌────────────────────────────────────────────────────────────────────┐
              Наименование резидента     │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
                                         └────────────────────────────────────────────────────────────────────┘
                                                                  ┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┐
              Номер паспорта сделки                               @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                                                                  └─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┴─┘
┌──────────┬─────────┬──────────┬───────────────────────────────────────────────────────────────┬─────────────┐
│          │         │          │     Сумма по подтверждающим документам в единицах валюты      │             │
│          │Код вида │  Номер   ├───────────────────────────────┬───────────────────────────────┤   Признак   │
│   Дата   │документа│таможенной│      в валюте документов      │    в валюте цены контракта    │корректировки│
│          │         │декларации├──────────┬────────────────────┼──────────┬────────────────────┤   записи    │
│          │         │          │Код валюты│       Сумма        │Код валюты│       Сумма        │             │
├──────────┼─────────┼──────────┼──────────┼────────────────────┼──────────┼────────────────────┼─────────────┤
│    1     │    2    │    3     │     4    │         5          │    6     │         7          │      8      │
├──────────┼─────────┼──────────┼──────────┼────────────────────┼──────────┼────────────────────┼─────────────┤
.{ CheckEnter DogSpravkaLoop
│@@@@@@@@@@│@~@@@@@@@│@@@@@@@@@@│@~@@@@@@@@│&'&&&&&&&&&&&&&&&.&&│@~@@@@@@@@│&'&&&&&&&&&&&&&&&.&&│@@@@@@@@@@@@@│
.}
└──────────┴─────────┴──────────┴──────────┴────────────────────┴──────────┴────────────────────┴─────────────┘



  Руководитель                                                   ^


  Главный бухгалтер                                              ^


      М.П.

.EndForm
