//------------------------------------------------------------------------------
//                                                      (c) ชฎเฏฎเ ๆจ๏  ซ ชโจช 
//  ซ ชโจช  ERP 7.11 -  เ กฎโญ ๏ ฏซ โ 
// โ็ฅโ "3-๏ แโเ ญจๆ  โจฏฎขฎฉ ไฎเฌ๋ -12" (“ชเ จญ )
//------------------------------------------------------------------------------

.LinkForm 'P12_3' prototype is 'UnifiedFormT12_ThirdPage'
.NameInList '’จฏฎข ๏ ไฎเฌ  N -12 (3-๏ แโเ ญจๆ )'
.group '12'
.var
  FirstLine:        boolean;
  LineCount:        integer;
  LastTabN:         string;
  Beginning:        boolean;
  DelimiterNeeded:  boolean;
.endvar
.fields
  ChargeCode1
  ChargeCode2
  ChargeCode3
  ChargeCode4
  ChargeCode5
  LogicSubStr(ChargeName1, 42, true, true)
  LogicSubStr(ChargeName2, 18, true, true)
  LogicSubStr(ChargeName3, 18, true, true)
  LogicSubStr(ChargeName4, 18, true, true)
  LogicSubStr(ChargeName5, 18, true, true)
  LogicSubStr(ChargeName1, 42, true, true)
  LogicSubStr(ChargeName2, 18, true, true)
  LogicSubStr(ChargeName3, 18, true, true)
  LogicSubStr(ChargeName4, 18, true, true)
  LogicSubStr(ChargeName5, 18, true, true)
.endfields
ÿ                                                                                                                                                                                                                            3-โ๏ แโฎเiญช  ไฎเฌจ N -12
ษออออออออออหออออออออออออออออออหอออออออออออหออออออหอออออออออหอออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออหออออออออออออออออออออออออออออออออออออออออออป
บ โฅฃฎเi๏ บเฎไฅแi๏, ฏฎแ ค   บ“ฌฎขจ ฏเ ๆiบ’ เจไ-บ’ กฅซ์ญจฉบ                                                            จค ฎฏซ โ๋                                                                         บ                    Iญ่i                  บ
บฏฅเแฎญ ซใ วฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤถ           บญจฉ   บญฎฌฅเ    วฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤืฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤถ
บ          บ ฉฌฅญใข ญญ๏ณ ฎค บ           บเฎงเ๏คบ         บ                                       ชฎคณ@@@@ณ               ชฎคณ@@@@ณ               ชฎคณ@@@@ณ               ชฎคณ@@@@ณ               ชฎคณ@@@@บชฎค   ณฎเฅแฏฎญคใ๎็จฉ ณ  แใฌ    ณ ฃฎคจญจ, บ
บ          บ            ณ     บ           บ      บ         บ@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ภฤฤฤฤด@@@@@@@@@@@@@@@@@@ภฤฤฤฤด@@@@@@@@@@@@@@@@@@ภฤฤฤฤด@@@@@@@@@@@@@@@@@@ภฤฤฤฤด@@@@@@@@@@@@@@@@@@ภฤฤฤฤถขจคใ  ณเ ๅใญฎช        ณ         ณ   คญi   บ
บ          บ            ณ     บ           บ      บ         บ@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@     ณ@@@@@@@@@@@@@@@@@@     ณ@@@@@@@@@@@@@@@@@@     ณ@@@@@@@@@@@@@@@@@@     ณ@@@@@@@@@@@@@@@@@@     บฎฏซ โจณ               ณ         ณ         บ
บ          บ            ณ     บ           บ      บ         วฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤถ      ณ               ณ         ณ         บ
บ          บ            ณ     บ           บ      บ         บ                                                        ฎเฅแฏฎญคใ๎็จฉ เ ๅใญฎช                                                                 บ      ณ               ณ         ณ         บ
บ          บ            ณ     บ           บ      บ         วฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤถ      ณ               ณ         ณ         บ
บ          บ            ณ     บ           บ      บ         บ                                               ณ                       ณ                       ณ                       ณ                       บ      ณ               ณ         ณ         บ
บ          บ            ณ     บ           บ      บ         วฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤถ      ณ               ณ         ณ         บ
บ          บ            ณ     บ           บ      บ         บฎเฅแฏฎญคใ๎็จฉ เ ๅใญฎช ณ     แใฌ     ณ ฃฎคจญจ, ณ    แใฌ      ณ ฃฎคจญจ, ณ    แใฌ      ณ ฃฎคจญจ, ณ    แใฌ      ณ ฃฎคจญจ, ณ    แใฌ      ณขiคแฎโฎช บ      ณ               ณ         ณ         บ
บ          บ            ณ     บ           บ      บ         บ                       ณ             ณ   คญi   ณ             ณ   คญi   ณ             ณ   คญi   ณ             ณ   คญi   ณ             ณ         บ      ณ               ณ         ณ         บ
วฤฤฤฤฤฤฤฤฤฤืฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤืฤฤฤฤฤฤฤฤฤฤฤืฤฤฤฤฤฤืฤฤฤฤฤฤฤฤฤืฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤืฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤถ
บ   18     บ     19     ณ 20  บ    21     บ  22  บ   23    บ          24           ณ      25     ณ   26    ณ     27      ณ   28    ณ     29      ณ    30   ณ     31      ณ   32    ณ     33      ณ   34    บ  35  ณ      36       ณ    37   ณ    38   บ
ฬออออออออออฮออออออออออออุอออออฮอออออออออออฮออออออฮอออออออออฮอออออออออออออออออออออออุอออออออออออออุอออออออออุอออออออออออออุอออออออออุอออออออออออออุอออออออออุอออออออออออออุอออออออออุอออออออออออออุอออออออออฮออออออุอออออออออออออออุอออออออออุอออออออออนÿ
.begin
  FirstLine := true;
  LineCount := 17;
end.
.{ tabt12_3 checkenter
.begin
  Beginning := true;
end.
.{ while (length(Account1) > 0) or (length(HD1) > 0) or (length(HD2) > 0) or (length(HD3) > 0) or (length(HD4) > 0) or (length(Account6) > 0) or (length(HD6) > 0)
.begin
  // ญใฆญฎ ซจ เ แฏฅ็ โ โ์ เ งคฅซจโฅซ์ ฌฅฆคใ ค ญญ๋ฌจ ฏฎ คขใฌ โ กฅซ์ญ๋ฌ ญฎฌฅเ ฌ
  DelimiterNeeded := not FirstLine and (TabN <> LastTabN)
end.
! ญใฆญฎ เ แฏฅ็ โ โ์ เ งคฅซจโฅซ์ จ ฅแโ์ ฌฅแโฎ ญ  แโเ ญจๆฅ คซ๏ คซ๏ ญฅฃฎ จ ฎคญฎฉ
! แโเฎชจ แ ค ญญ๋ฌจ (ฏฎแซฅคญ๎๎ แโเฎชใ ง ญจฌ ฅโ ฏฎคญฎฆจฅ)
.{?internal; DelimiterNeeded and (LineCount < LinesPerPage - 2)
ÿวฤฤฤฤฤฤฤฤฤฤืฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤืฤฤฤฤฤฤฤฤฤฤฤืฤฤฤฤฤฤืฤฤฤฤฤฤฤฤฤืฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤืฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤถÿ
.begin
  LineCount := LineCount + 1;
  // ญ ฏฅ็ โ ซจ จ ง ก๋ซจ
  DelimiterNeeded := false;
end.
.}
.begin
  LineCount := LineCount + 1;
end.
! ญฅโ ฌฅแโ  คซ๏ ฏฅ็ โจ ค ฆฅ ฎคญฎฉ แโเฎชจ ค ญญ๋ๅ, ซจกฎ ญฅ ๅข โ ฅโ ฌฅแโ  คซ๏
! เ งคฅซจโฅซ๏ จ แโเฎชจ แ ค ญญ๋ฌจ
.{?internal;(LineCount >= LinesPerPage) or DelimiterNeeded and (LineCount >= LinesPerPage - 1)
ÿศออออออออออสออออออออออออฯอออออสอออออออออออสออออออสอออออออออสอออออออออออออออออออออออฯอออออออออออออฯอออออออออฯอออออออออออออฯอออออออออฯอออออออออออออฯอออออออออฯอออออออออออออฯอออออออออฯอออออออออออออฯอออออออออสออออออฯอออออออออออออออฯอออออออออฯอออออออออผÿ
.{ while (LineCount < LinesPerPage)

.begin
  LineCount := LineCount + 1;
end.
.}
ÿษออออออออออหออออออออออออัอออออหอออออออออออหออออออหอออออออออหอออออออออออออออออออออออัอออออออออออออัอออออออออัอออออออออออออัอออออออออัอออออออออออออัอออออออออัอออออออออออออัอออออออออัอออออออออออออัอออออออออหออออออัอออออออออออออออัอออออออออัอออออออออป
บ   18     บ     19     ณ 20  บ    21     บ  22  บ   23    บ          24           ณ      25     ณ   26    ณ     27      ณ   28    ณ     29      ณ    30   ณ     31      ณ   32    ณ     33      ณ   34    บ  35  ณ      36       ณ    37   ณ    38   บ
ฬออออออออออฮออออออออออออุอออออฮอออออออออออฮออออออฮอออออออออฮอออออออออออออออออออออออุอออออออออออออุอออออออออุอออออออออออออุอออออออออุอออออออออออออุอออออออออุอออออออออออออุอออออออออุอออออออออออออุอออออออออฮออออออุอออออออออออออออุอออออออออุอออออออออนÿ
.begin
  FirstLine := true;
  LineCount := 4;
end.
.}
.{?internal;Beginning
.fields
  if (TabN = LastTabN, '', LogicSubStr(Category, 10, true, true))
  if (TabN = LastTabN, '', LogicSubStr(PostName, 11, true, true))
  if (TabN = LastTabN, '', LogicSubStr(PostCode, 5, true, true))
  if (TabN = LastTabN, '', LogicSubStr(WorkCond, 11, true, true))
  if (TabN = LastTabN or Razr = 0, '', String(Razr))
  if(TabN = LastTabN, '', string(TabN))
  LogicSubStr(Account1, 23, true, true)
  Sum1
  LogicSubStr(HD1, 9, true, true)
  Sum2
  LogicSubStr(HD2, 9, true, true)
  Sum3
  LogicSubStr(HD3, 9, true, true)
  Sum4
  LogicSubStr(HD4, 9, true, true)
  Sum5
  Percent
  ChargeCode6
  LogicSubStr(Account6, 23, true, true)
  Sum6
  LogicSubStr(HD6, 9, true, true)
.endfields
ÿบ@@@@@@@@@@บ@@@@@@@@@@@@ณ@~@@@บ@@@@@@@@@@@บ@@@@@@บ&&&&&&&&&บ@@@@@@@@@@@@@@@@@@@@@@@ณ&#&&&&&&&&.&&ณ@@@@@@@@@ณ&#&&&&&&&&.&&ณ@@@@@@@@@ณ&#&&&&&&&&.&&ณ@@@@@@@@@ณ&#&&&&&&&&.&&ณ@@@@@@@@@ณ&#&&&&&&&&.&&ณ&#&&&&.&&บ@~@@@@ณ@@@@@@@@@@@@@@@ณ&#&&&&.&&ณ@@@@@@@@@บÿ
.}
.{?internal;not Beginning
.fields
  LogicSubStr(Account1, 23, true, true)
  LogicSubStr(HD1, 9, true, true)
  LogicSubStr(HD2, 9, true, true)
  LogicSubStr(HD3, 9, true, true)
  LogicSubStr(HD4, 9, true, true)
  LogicSubStr(Account6, 23, true, true)
  LogicSubStr(HD6, 9, true, true)
.endfields
ÿบ          บ            ณ     บ           บ      บ         บ@@@@@@@@@@@@@@@@@@@@@@@ณ             ณ@@@@@@@@@ณ             ณ@@@@@@@@@ณ             ณ@@@@@@@@@ณ             ณ@@@@@@@@@ณ             ณ         บ      ณ@@@@@@@@@@@@@@@ณ         ณ@@@@@@@@@บÿ
.}
.begin
  LastTabN := TabN;
  FirstLine := false;
  Beginning := false;
end.
.}
.} //tabt12_3
ÿศออออออออออสออออออออออออฯอออออสอออออออออออสออออออสอออออออออสอออออออออออออออออออออออฯอออออออออออออฯอออออออออฯอออออออออออออฯอออออออออฯอออออออออออออฯอออออออออฯอออออออออออออฯอออออออออฯอออออออออออออฯอออออออออสออออออฯอออออออออออออออฯอออออออออฯอออออออออผÿ
.endform
