//------------------------------------------------------------------------------
//                                                      (แ) ชฎเฏฎเ ๆจ๏  ซ ชโจช 
//  ซ ชโจช  7.11 -  เ กฎโญ ๏ ฏซ โ 
// โ็ฅโ "2-๏ แโเ ญจๆ  โจฏฎขฎฉ ไฎเฌ๋ -12" (“ชเ จญ )
//------------------------------------------------------------------------------

.LinkForm 'P12_2' prototype is 'UnifiedFormT12_SecondPage'
.NameInList '’จฏฎข ๏ ไฎเฌ  N -12 (2-๏ แโเ ญจๆ )'
.group '12'
.var
  FirstLine: boolean
  LineCount: integer
.endvar
.fields
  Npp
  Tabn
  LogicSubStr(FIO, 19, true, true)
  AbsenceDays1 AbsenceHours1

  LogicSubStr(FIO, 19, true, true)
  D01 D02 D03 D04 D05 D06 D07 D08 D09 D10 D11 D12 D13 D14 D15 Days1
  D16 D17 D18 D19 D20 D21 D22 D23 D24 D25 D26 D27 D28 D29 D30 D31 Days2

  LogicSubStr(FIO, 19, true, true)
  AbsenceDays2 AbsenceHours2

  LogicSubStr(FIO, 19, true, true)
  WorkingDays
  WorkingHours
  OverworkHours
  NihgtHours
  EveningHours   // ฎซ-ขฎ ขฅ็ฅเญจๅ ็ แฎข
  AbsenceDays
  Weekends
  Tarif

  LogicSubStr(FIO, 19, true, true)
  AbsenceDays3 AbsenceHours3

  LogicSubStr(FIO, 19, true, true)
  H01 H02 H03 H04 H05 H06 H07 H08 H09 H10 H11 H12 H13 H14 H15 Hours1
  H16 H17 H18 H19 H20 H21 H22 H23 H24 H25 H26 H27 H28 H29 H30 H31 Hours2

  AbsenceDays4 AbsenceHours4
.endfields
ÿ                                                                                                                                                                                                                         3-โ๏ แโฎเiญช  ไฎเฌจ N -12
ษออออหออออออออออหอออออออออออออออออออหอออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออหอออออออออออออออออออออออออออออออหอออออออหอออออออออออหอออออหออออออออออป
บฎ- บ’ กฅซ์-   บเiงขจ้ฅ, iฌ'๏     บ                                 iคฌiโชจ ฏเฎ ๏ขชจ โ  ญฅ๏ขชจ ญ  เฎกฎโใ ฏฎ ็จแซ ๅ ฌiแ๏ๆ๏                                                  บ  งฎฌ ขiคฏเ ๆ์ฎข ญฎ ง  ฌiแ๏ๆ์ บiซ์-  บ  ญจๅ ง   บiซ์-บ ฎ็ แฎข  บ
บฌฅเ บญจฉ ญฎฌฅเ บฏฎ ก โ์ชฎขi        วฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤยฤฤฤฤฤฤืฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤถชiแโ์  บ ฏเจ็จญ ฌจ บชiแโ์บ  (คฅญญ ) บ
บง   บ          บ                   บ 1 ณ 2 ณ 3 ณ 4 ณ 5 ณ 6 ณ 7 ณ 8 ณ 9 ณ 10ณ 11ณ 12ณ 13ณ 14ณ 15ณ งฎฌ ณ 16ณ 17ณ 18ณ 19ณ 20ณ 21ณ 22ณ23 ณ 24ณ 25ณ 26ณ 27ณ 28ณ 29ณ 30ณ 31ณ งฎฌ บคญiขณ           ฃฎคจญ          บคญiข   บ           บขจๅiคบ  โ เจไญ  บ
บฏฎ- บ          บ                   บ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณขiค-  ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณขiค-  บ    รฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤถญฅ๏ขฎช วฤฤฤยฤฤฤฤฤฤฤถญจๅ โถ  แโ ขช   บ
บเ๏ค-บ          บ                   บ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณฏเ ๆ์ฎณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณฏเ ๆ์ฎบ    ณเ งฎฌณ       ง ญจๅ        บ       บชฎคณชiซ์-  บแข๏โ-บ  (ฎชซ ค) บ
บชฎฌ บ          บ                   บ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณข ญฎ  ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณข ญฎ  บ    ณ     รฤฤฤฤฤฤยฤฤฤฤฤฤยฤฤฤฤฤฤถ       บ   ณชiแโ์  บชฎขจๅบ          บ
บ    บ          บ                   บ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณง     ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณง     บ    ณ     ณญ ค-  ณญi็ญi ณขฅ็iเ-บ       บ   ณคญiข   บคญiข บ          บ
บ    บ          บ                   บ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณI-่ใ  ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณII-ฃใ บ    ณ     ณใเฎ็- ณ      ณญi    บ       บ   ณ       บ     บ          บ
บ    บ          บ                   บ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณฏฎซฎข.ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณฏฎซฎข.บ    ณ     ณญi    ณ      ณ      บ       บ   ณ       บ     บ          บ
บ    บ          บ                   บ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณฌiแ๏ๆ๏ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณฌiแ๏ๆ๏บ    ณ     ณ      ณ      ณ      บ       บ   ณ       บ     บ          บ
บ    บ          บ                   บ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ      ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ      บ    ณ     ณ      ณ      ณ      บ       บ   ณ       บ     บ          บ
บ    บ          บ                   บ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ      ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ      บ    ณ     ณ      ณ      ณ      บ       บ   ณ       บ     บ          บ
วฤฤฤฤืฤฤฤฤฤฤฤฤฤฤืฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤืฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤลฤฤฤฤฤฤลฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤมฤฤฤลฤฤฤฤฤฤืฤฤฤฤลฤฤฤฤฤลฤฤฤฤฤฤลฤฤฤฤฤฤลฤฤฤฤฤฤืฤฤฤฤฤฤฤืฤฤฤลฤฤฤฤฤฤฤืฤฤฤฤฤืฤฤฤฤฤฤฤฤฤฤถ
บ  1 บ    3     บ         2         บ                              4                            ณ   5  ณ                                  6                            ณ  7   บ  8 ณ  9  ณ  10  ณ 11   ณ  12  บ  13   บ 14ณ   15  บ  16 บ    17    บÿ
.begin
  FirstLine := true;
  LineCount := 16;
end.
.{ ved12_2_page
.begin
  LineCount := LineCount + 8;
end.
.{?internal;(LineCount > LinesPerPage - 1);
ÿศออออสออออออออออสอออออออออออออออออออสอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯออออออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯออออออสออออฯอออออฯออออออฯออออออฯออออออสอออออออสอออฯอออออออสอออออสออออออออออผÿ
.begin
  LineCount := LineCount - 8 + 1;
end.
.{ while (LineCount < LinesPerPage)

.begin
  LineCount := LineCount + 1;
end.
.}
ÿษออออหออออออออออหอออออออออออออออออออหอออออออออออออออออออออออออออออออออออออออออออออออออออออออออออัออออออัอออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออัออออออหออออัอออออัออออออัออออออัออออออหอออออออหอออัอออออออหอออออหออออออออออป
บ  1 บ    3     บ         2         บ                              4                            ณ   5  ณ                                  6                            ณ  7   บ  8 ณ  9  ณ  10  ณ 11   ณ  12  บ  13   บ 14ณ   15  บ  16 บ    17    บÿ
.begin
  FirstLine := true;
  LineCount := 10;
end.
.}
.{?internal;(FirstLine);
ÿฬออออฮออออออออออฮอออออออออออออออออออฮอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออุออออออุอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออัอออุออออออฮออออุอออออุออออออุออออออุออออออฮอออออออฮอออุอออออออฮอออออฮออออออออออนÿ
.}
.{?internal;(not FirstLine);
ÿฬออออฮออออออออออฮอออออออออออออออออออฮอออุอออุอออุอออุอออุอออุอออุอออุอออุอออุอออุอออุอออุอออุอออุออออออุอออุอออุอออุอออุอออุอออุอออุอออุอออุอออุอออุอออุอออุอออุอออุอออุออออออฮออออุอออออุออออออุออออออุออออออฮอออออออฮอออุอออออออฮอออออฮออออออออออนÿ
.}
ÿบ&&&&บ&&&&&&&&&&บ@@@@@@@@@@@@@@@@@@@บ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ      ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ      บ    ณ     ณ      ณ      ณ      บ       บ@~@ณ&#~&&&&บ     บ          บ
บ    บ          บ@@@@@@@@@@@@@@@@@@@บ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ&#~&&&ณ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ @@ณ&#~&&&บ    ณ     ณ      ณ      ณ      บ       วฤฤฤลฤฤฤฤฤฤฤถ     บ          บ
บ    บ          บ@@@@@@@@@@@@@@@@@@@บ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ      ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ      บ    ณ     ณ      ณ      ณ      บ       บ@~@ณ&#~&&&&บ     บ          บ
บ    บ          บ@@@@@@@@@@@@@@@@@@@วฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤลฤฤฤฤฤฤถ&#&&ณ&#&.&ณ&#&&.&ณ&#&&.&ณ&#&&.&บ&#&&&&&วฤฤฤลฤฤฤฤฤฤฤถ&#~&&บ&#~&&&&.&&บ
บ    บ          บ@@@@@@@@@@@@@@@@@@@บ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ      ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ      บ    ณ     ณ      ณ      ณ      บ       บ@~@ณ&#~&&&&บ     บ          บ
บ    บ          บ@@@@@@@@@@@@@@@@@@@บ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&#&&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&.&ณ&#&&.&บ    ณ     ณ      ณ      ณ      บ       วฤฤฤลฤฤฤฤฤฤฤถ     บ          บ
บ    บ          บ                   บ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ      ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ   ณ      บ    ณ     ณ      ณ      ณ      บ       บ@~@ณ&#~&&&&บ     บ          บÿ
.begin
  FirstLine := false;
end.
.} //ved12_2_page
ÿศออออสออออออออออสอออออออออออออออออออสอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯออออออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯอออฯออออออสออออฯอออออฯออออออฯออออออฯออออออสอออออออสอออฯอออออออสอออออสออออออออออผÿ
.EndForm
