/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,2004 корпорация ГАЛАКТИКА                    ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Оперативный контур                                        ║
 ║ Версия        : 7.11                                                      ║
 ║ Назначение    : Отчеты затрат по объектам (шахматка)                      ║
 ║ Ответственный : Шишов Виктор Васильевич (ShV)                             ║
 ║ Параметры     : Нет                                                       ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/

#doc
Отчеты затрат по объектам (шахматка)
#end
.set name='RepZatrObj2'
.Hide
.Fields

//---------------------------------------------
Filter_Name                : String //наименование фильтра
Filter_ZnNRec              : comp   //NRec значения фильтра
Filter_ZnName              : String //наименование значения фильтра

ТекГод                     : String
Период_Name                : String
Валюта                     : String
СобствОрг_Name             : String

Hd10                       : String
Hd20                       : String
Hd30                       : String
Hd40                       : String

SpTip                      : word         //10-Всего(11..15-показатели)
                                          //20-Корневые подразделения(21..25-показатели)
                                          //30-Объекты(31..35-показатели)

Sp1                        : String       //Npp
Sp2                        : String       //Name
Sp3                        : String       //шифр
Sp4                        : String       //генподрядчик
Sp5                        : Double       //сумма всего
Hd100                      : Double       //значения показателей

SpTip_2                      : word
Sp1_2                        : String
Sp2_2                        : String
Sp3_2                        : String
Sp4_2                        : String
Sp5_2                        : Double
Hd100_2                      : Double

.EndFields
//---Фильтры---
.{
^
.{
^^
.}
.}
//--End-Фильтры
^^^^
  //Шапка
 .{.?RzoHC_hd10;^.}
 .{.?RzoHC_hd20;^.}
 .{.?RzoHC_hd30;^.}
 .{.?RzoHC_hd40;^.}
.{
.{ CheckEnter RzoHC_Sp100
 ^^^^^^ .{.?RzoHC_hd100;^.}
.}
.{ CheckEnter RzoHC_Sp100_2
 ^^^^^^ .{.?RzoHC_hd100_2;^.}
.}
.}
.EndForm
