//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
//------------------------------------------------------------------------------
// Галактика 7.12 - Бухгалтерский контур
// Функция свертки сальдо
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//
// !!! Внимание !!!
//
// Данный исходник собирается и на Vip и на Pascal !!!
//
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Свертка к бОльшему значению
procedure RollToPositive(var SumD,SumK : double);
begin
  SumD := SumD - SumK;
  SumK := 0;
  if SumD < 0 then
    begin
      SumK := -SumD;
      SumD := 0;
    end;
end; // RollToPositive
//------------------------------------------------------------------------------
// Новая функция свертки сальдо
procedure NewSvertkaSaldo(TipSch : word; RollAP : boolean; var SumD,SumK : double);
begin
  if (TipSch = cgAPSchet) then begin
    if (RollAP) then
      RollToPositive(SumD, SumK);
    // Активно-пассивные больше ни при каких условиях не свернутся
    Exit;
  end;
  // Проверка сверток в одну сторону
  // Проверка типа в начале условия - на паскале есть неполное вычисление !!!
  if ((TipSch = cgASchet) and boGetTune('Fin.Reports.RollSaldo')) then
  begin
    SumD := SumD - SumK;
    SumK := 0;
    Exit;
  end;
  if ((TipSch = cgPSchet) and boGetTune('Fin.Reports.RollSaldo')) then
  begin
    SumK := SumK - SumD;
    SumD := 0;
    Exit;
  end;
  // Остались только односторонние счета, которые надо свернуть к плюсу
  RollToPositive(SumD, SumK);
end; // NewSvertkaSaldo
//------------------------------------------------------------------------------
