/*
  ╔═════════════════════════════════════════════════════════════════════╗
  ║      Н Т О  "T O P   S O F T"                                       ║
  ║      Проект "КАДРЫ"                                                 ║
  ║      Версия : 5.7, 5.8, 7.1                                         ║
  ║      Разработал:  Мохова Ж.И.                                       ║
  ║      Назначение:  Форма Т-6  Приказ о предоставлении отпуска        ║
  ║      Параметры:                                                     ║
  ║      Изменения: май 2001 - новая форма!!!                           ║
  ╚═════════════════════════════════════════════════════════════════════╝
*/
#doc
Форма Т-6  Приказ о предоставлении отпуска
#end
.form Nformt6
.Hide
.Fields
Организация  ОКПО
TitleDocNrec : comp
PersNrec : comp
AppointNrec : comp
номер_документа  дата_составления
FIO
FIO_VP
TabN
должность
подразделение

NOtpusk
dPeriod1
dPeriod2
number
priznak1
priznak2
dBegin
dEnd

J2NOtpusk
J2dPeriod1
J2dPeriod2
J2number
J2priznak1
J2priznak2
J2dBegin
J2dEnd

количество_дней_дополнительного_отпуска
priznak21
priznak22

вид_дополнительного_отпуска1
код_дополнительного_отпуска1
количество_дней_дополнительного_отпуска11
дата_начала_отпуска1
дата_началаконца_отпуска1
основание_для_дополнительного_отпуска1

вид_дополнительного_отпуска2
код_дополнительного_отпуска2
количество_дней_дополнительного_отпуска12
дата_начала_отпуска2
дата_началаконца_отпуска2
основание_для_дополнительного_отпуска2

вид_дополнительного_отпуска3
код_дополнительного_отпуска3
количество_дней_дополнительного_отпуска13
дата_начала_отпуска3
дата_началаконца_отпуска3
основание_для_дополнительного_отпуска3

вид_дополнительного_отпуска4
код_дополнительного_отпуска4
количество_дней_дополнительного_отпуска14
дата_начала_отпуска4
дата_началаконца_отпуска4
основание_для_дополнительного_отпуска4

вид_дополнительного_отпуска5
код_дополнительного_отпуска5
количество_дней_дополнительного_отпуска15
дата_начала_отпуска5
дата_началаконца_отпуска5
основание_для_дополнительного_отпуска5

sFoundation

ДолжнРук
ФиоРук

.EndFields


 Р                                                                                                    Унифицированная форма N Т-6
                                                                                                        Утверждена Постановлением
                                                                                                               Госкомстата России
                                                                                                               от 06.04.2001 N 26

                                                                                                                       ┌────────┐
                                                                                                                       │  Код   │
                                                                                                                       ├────────┤
                                                                                                        Форма по ОКУД  │ 0301005│
                                                                                                                       ├────────┤
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ по ОКПО  │@@@@@@@@│ ^ ^ ^
                           наименование организации                                                                    └────────┘

                                                                                                  ┌─────────┬──────────┐
                                                                                                  │  Номер  │   Дата   │
                                                                                                  │документа│          │
                                                                                                  ├─────────┼──────────┤
                                                      БПРИКАЗ   Б                                     │@@@@@@@@@│@@@@@@@@@@│
                                                 Б (распоряжение)  Б                                  └─────────┴──────────┘
                                      Б о предоставлении отпуска работнику Б


                                               БПредоставить отпуск Б



                                                                                                                ┌───────────────┐
                                                                                                                │Табельный номер│
                                                                                                                ├───────────────┤
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                               │@@@@@@@@@@@@@@@│
          ──────────────────────────────────────────────────────────────────────────────────────────────────────└───────────────┘
                              фамилия, имя, отчество
FIO_VP ^

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                         наименование профессии (должности)

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                       наименование структурного подразделения

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                   вид отпуска (ежегодный оплачиваемый, учебный, без сохранения заработной платы и другие)


          за период работы с ^ года    по ^ года

             ┌───────┐@ календарных        @
          на │ @@@@  │ ─────────── дней    @@@@
             └───────┘ @ рабочих           @

          с ^ года    по ^ года            ^ ^

                                                      ┌───────┐@ календарных      @
          и (или) дополнительный (другой) отпуск на   │ @@@@  │ ─────────── дней  @@@@
                                                      └───────┘ @ рабочих         @
          ┌────────────────────────────────────────┬───────────────┬─────────────────────┬──────────────────────────────────────┐
          │       Дополнительный или               │Количество дней│        Дата         │Основание предоставления              │
          │          другой отпуск                 │(календарных,  ├──────────┬──────────┤дополнительного отпуска               │
          ├──────────────────────────────┬─────────┤рабочих)       │начала    │окончания │                                      │
          │      вид                     │   код   │               │отпуска   │отпуска   │                                      │
          ├──────────────────────────────┼─────────┼───────────────┼──────────┼──────────┼──────────────────────────────────────┤
          │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│&&&&&&&&&&&&&&&│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
          ├──────────────────────────────┼─────────┼───────────────┼──────────┼──────────┼──────────────────────────────────────┤
          │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│&&&&&&&&&&&&&&&│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
          ├──────────────────────────────┼─────────┼───────────────┼──────────┼──────────┼──────────────────────────────────────┤
          │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│&&&&&&&&&&&&&&&│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
          ├──────────────────────────────┼─────────┼───────────────┼──────────┼──────────┼──────────────────────────────────────┤
          │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│&&&&&&&&&&&&&&&│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
          ├──────────────────────────────┼─────────┼───────────────┼──────────┼──────────┼──────────────────────────────────────┤
          │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│&&&&&&&&&&&&&&&│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
          └──────────────────────────────┴─────────┴───────────────┴──────────┴──────────┴──────────────────────────────────────┘


sFoundation  ^

          Руководитель организации @@@@@@@@@@@@@@@@@@@@@@@@@@@                        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                                   ───────────────────────────   ───────────────────  ──────────────────────────────────────────
                                            должность                  подпись                 расшифровка подписи


          С приказом (распоряжением) ознакомлен                                    "___"__________ 20  г.
                                                 ───────────────────────
                                                    подпись работника

 Р
.endform

.LinkForm 'Nformt6_01_1' Prototype is 'Nformt6'
.NameInList 'Приказ о предоставлении отпуска'
.P 85
.Fields
Организация
ОКПО
номер_документа
дата_составления
FIO
TabN
должность
подразделение
NOtpusk
dPeriod1
dPeriod2

priznak1
number
priznak2

dBegin
dEnd

ДолжнРук
ФиоРук

.EndFields

 Р
                                                                                                      Унифицированная форма N Т-6
                                                                                                        Утверждена Постановлением
                                                                                                               Госкомстата России
                                                                                                               от 06.04.2001 N 26

                                                                                                                       ┌────────┐
                                                                                                                       │  Код   │
                                                                                                                       ├────────┤
                                                                                                        Форма по ОКУД  │ 0301005│
                                                                                                                       ├────────┤
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ по ОКПО  │@@@@@@@@│
                           наименование организации                                                                    └────────┘

                                                                                                  ┌─────────┬──────────┐
                                                                                                  │  Номер  │   Дата   │
                                                                                                  │документа│          │
                                                                                                  ├─────────┼──────────┤
                                                      БПРИКАЗ   Б                                     │@@@@@@@@@│@@@@@@@@@@│
                                                 Б (распоряжение)  Б                                  └─────────┴──────────┘
                                      Б о предоставлении отпуска работнику Б


                                               БПредоставить отпуск Б



                                                                                                                ┌───────────────┐
                                                                                                                │Табельный номер│
                                                                                                                ├───────────────┤
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                               │@@@@@@@@@@@@@@@│
          ──────────────────────────────────────────────────────────────────────────────────────────────────────└───────────────┘
                              фамилия, имя, отчество

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                         наименование профессии (должности)

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                       наименование структурного подразделения

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                   вид отпуска (ежегодный оплачиваемый, учебный, без сохранения заработной платы и другие)


          за период работы с ^ года    по ^ года

             ┌───────┐@ календарных
          на │ @@@@  │ ─────────── дней
             └───────┘ @ рабочих

          с ^ года    по ^ года





          Руководитель организации @@@@@@@@@@@@@@@@@@@@@@@@@@@                        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                                   ───────────────────────────   ───────────────────  ──────────────────────────────────────────
                                            должность                  подпись                 расшифровка подписи


          С приказом (распоряжением) ознакомлен                                    "___"__________ 20  г.
                                                 ───────────────────────
                                                    подпись работника

 Р
.endform

.LinkForm 'Nformt6_01_2' Prototype is 'Nformt6'
.NameInList 'Приказ о предоставлении отпуска со склонением ФИО'
.P 85
.Fields
Организация
ОКПО
номер_документа
дата_составления
FIO_VP
TabN
должность
подразделение
NOtpusk
dPeriod1
dPeriod2

priznak1
number
priznak2

dBegin
dEnd

ДолжнРук
ФиоРук

.EndFields

 Р
                                                                                                      Унифицированная форма N Т-6
                                                                                                        Утверждена Постановлением
                                                                                                               Госкомстата России
                                                                                                               от 06.04.2001 N 26

                                                                                                                       ┌────────┐
                                                                                                                       │  Код   │
                                                                                                                       ├────────┤
                                                                                                        Форма по ОКУД  │ 0301005│
                                                                                                                       ├────────┤
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ по ОКПО  │@@@@@@@@│
                           наименование организации                                                                    └────────┘

                                                                                                  ┌─────────┬──────────┐
                                                                                                  │  Номер  │   Дата   │
                                                                                                  │документа│          │
                                                                                                  ├─────────┼──────────┤
                                                      БПРИКАЗ   Б                                     │@@@@@@@@@│@@@@@@@@@@│
                                                 Б (распоряжение)  Б                                  └─────────┴──────────┘
                                      Б о предоставлении отпуска работнику Б


                                               БПредоставить отпуск Б



                                                                                                                ┌───────────────┐
                                                                                                                │Табельный номер│
                                                                                                                ├───────────────┤
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                               │@@@@@@@@@@@@@@@│
          ──────────────────────────────────────────────────────────────────────────────────────────────────────└───────────────┘
                              фамилия, имя, отчество

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                         наименование профессии (должности)

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                       наименование структурного подразделения

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                   вид отпуска (ежегодный оплачиваемый, учебный, без сохранения заработной платы и другие)


          за период работы с ^ года    по ^ года

             ┌───────┐@ календарных
          на │ @@@@  │ ─────────── дней
             └───────┘ @ рабочих

          с ^ года    по ^ года





          Руководитель организации @@@@@@@@@@@@@@@@@@@@@@@@@@@                        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                                   ───────────────────────────   ───────────────────  ──────────────────────────────────────────
                                            должность                  подпись                 расшифровка подписи


          С приказом (распоряжением) ознакомлен                                    "___"__________ 20  г.
                                                 ───────────────────────
                                                    подпись работника

 Р
.endform


.LinkForm 'Nformt6_60_1' Prototype is 'Nformt6'
.NameInList 'Записка-расчет о предоставлении отпуска (лицевая сторона)'
.P 85
.Fields
Организация  ОКПО
номер_документа  дата_составления
FIO
TabN
должность
подразделение
!NOtpusk
J2dPeriod1
J2dPeriod2

J2priznak1
J2number
J2priznak2

J2dBegin
J2dEnd

priznak21
количество_дней_дополнительного_отпуска
priznak22

вид_дополнительного_отпуска1
код_дополнительного_отпуска1
количество_дней_дополнительного_отпуска11
дата_начала_отпуска1
дата_началаконца_отпуска1
основание_для_дополнительного_отпуска1

вид_дополнительного_отпуска2
код_дополнительного_отпуска2
количество_дней_дополнительного_отпуска12
дата_начала_отпуска2
дата_началаконца_отпуска2
основание_для_дополнительного_отпуска2

вид_дополнительного_отпуска3
код_дополнительного_отпуска3
количество_дней_дополнительного_отпуска13
дата_начала_отпуска3
дата_началаконца_отпуска3
основание_для_дополнительного_отпуска3

вид_дополнительного_отпуска4
код_дополнительного_отпуска4
количество_дней_дополнительного_отпуска14
дата_начала_отпуска4
дата_началаконца_отпуска4
основание_для_дополнительного_отпуска4

вид_дополнительного_отпуска5
код_дополнительного_отпуска5
количество_дней_дополнительного_отпуска15
дата_начала_отпуска5
дата_началаконца_отпуска5
основание_для_дополнительного_отпуска5

.EndFields

 Р
                                                                                                     Унифицированная форма N Т-60
                                                                                                        Утверждена Постановлением
                                                                                                               Госкомстата России
                                                                                                               от 06.04.2001 N 26

                                                                                                                       ┌────────┐
                                                                                                                       │  Код   │
                                                                                                                       ├────────┤
                                                                                                        Форма по ОКУД  │ 0301051│
                                                                                                                       ├────────┤
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ по ОКПО  │@@@@@@@@│
                           наименование организации                                                                    └────────┘

                                                                                                  ┌─────────┬──────────┐
                                                                                                  │  Номер  │   Дата   │
                                                                                                  │документа│          │
                                                                                                  ├─────────┼──────────┤
                                                                                                  │@@@@@@@@@│@@@@@@@@@@│
                                                БЗАПИСКА - РАСЧЕТ Б                                   └─────────┴──────────┘
                                      Б о предоставлении отпуска работнику Б
                                                                                                                ┌───────────────┐
                                                                                                                │Табельный номер│
                                                                                                                ├───────────────┤
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                               │@@@@@@@@@@@@@@@│
          ──────────────────────────────────────────────────────────────────────────────────────────────────────└───────────────┘
                              фамилия, имя, отчество работника

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                         наименование профессии (должности), разряд, класс (категория) квалификация

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                       наименование структурного подразделения

         Предоставляется ежегодный оплачиваемый отпуск

         за период работы с ^ года    по ^ года

             ┌───────┐@ календарных
          на │ @@@@  │ ─────────── дней
             └───────┘ @ рабочих

          с ^ года    по ^ года
                                                      ┌───────┐@ календарных
          и (или) дополнительный (другой) отпуск на   │ @@@@  │ ─────────── дней
                                                      └───────┘ @ рабочих

          ┌────────────────────────────────────────┬───────────────┬─────────────────────┬──────────────────────────────────────┐
          │    Дополнительный или другой отпуск    │Количество дней│        Дата         │           Основание                  │
          │                                        │(календарных,  ├──────────┬──────────┤         предоставления               │
          ├──────────────────────────────┬─────────┤  рабочих)     │начала    │окончания │        дополнительного               │
          │            вид               │   код   │               │отпуска   │отпуска   │            отпуска                   │
          ├──────────────────────────────┼─────────┼───────────────┼──────────┼──────────┼──────────────────────────────────────┤
          │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│&&&&&&&&&&&&&&&│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
          ├──────────────────────────────┼─────────┼───────────────┼──────────┼──────────┼──────────────────────────────────────┤
          │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│&&&&&&&&&&&&&&&│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
          ├──────────────────────────────┼─────────┼───────────────┼──────────┼──────────┼──────────────────────────────────────┤
          │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│&&&&&&&&&&&&&&&│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
          ├──────────────────────────────┼─────────┼───────────────┼──────────┼──────────┼──────────────────────────────────────┤
          │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│&&&&&&&&&&&&&&&│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
          ├──────────────────────────────┼─────────┼───────────────┼──────────┼──────────┼──────────────────────────────────────┤
          │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│&&&&&&&&&&&&&&&│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
          └──────────────────────────────┴─────────┴───────────────┴──────────┴──────────┴──────────────────────────────────────┘


          Работник кадровой службы
                                    ───────────────────────────   ───────────────────  ──────────────────────────────────────────
                                            должность                  подпись                 расшифровка подписи
.endform Р

.LinkForm 'Nformt6_60_2' Prototype is 'Nformt6'
.NameInList 'Записка-расчет о предоставлении отпуска (лицевая сторона) со склонением ФИО'
.P 85
.Fields
Организация  ОКПО
номер_документа  дата_составления
FIO_VP
TabN
должность
подразделение
!NOtpusk
J2dPeriod1
J2dPeriod2

J2priznak1
J2number
J2priznak2

J2dBegin
J2dEnd

priznak21
количество_дней_дополнительного_отпуска
priznak22

вид_дополнительного_отпуска1
код_дополнительного_отпуска1
количество_дней_дополнительного_отпуска11
дата_начала_отпуска1
дата_началаконца_отпуска1
основание_для_дополнительного_отпуска1

вид_дополнительного_отпуска2
код_дополнительного_отпуска2
количество_дней_дополнительного_отпуска12
дата_начала_отпуска2
дата_началаконца_отпуска2
основание_для_дополнительного_отпуска2

вид_дополнительного_отпуска3
код_дополнительного_отпуска3
количество_дней_дополнительного_отпуска13
дата_начала_отпуска3
дата_началаконца_отпуска3
основание_для_дополнительного_отпуска3

вид_дополнительного_отпуска4
код_дополнительного_отпуска4
количество_дней_дополнительного_отпуска14
дата_начала_отпуска4
дата_началаконца_отпуска4
основание_для_дополнительного_отпуска4

вид_дополнительного_отпуска5
код_дополнительного_отпуска5
количество_дней_дополнительного_отпуска15
дата_начала_отпуска5
дата_началаконца_отпуска5
основание_для_дополнительного_отпуска5

.EndFields

 Р
                                                                                                     Унифицированная форма N Т-60
                                                                                                        Утверждена Постановлением
                                                                                                               Госкомстата России
                                                                                                               от 06.04.2001 N 26

                                                                                                                       ┌────────┐
                                                                                                                       │  Код   │
                                                                                                                       ├────────┤
                                                                                                        Форма по ОКУД  │ 0301051│
                                                                                                                       ├────────┤
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ по ОКПО  │@@@@@@@@│
                           наименование организации                                                                    └────────┘

                                                                                                  ┌─────────┬──────────┐
                                                                                                  │  Номер  │   Дата   │
                                                                                                  │документа│          │
                                                                                                  ├─────────┼──────────┤
                                                                                                  │@@@@@@@@@│@@@@@@@@@@│
                                                БЗАПИСКА - РАСЧЕТ Б                                   └─────────┴──────────┘
                                      Б о предоставлении отпуска работнику Б
                                                                                                                ┌───────────────┐
                                                                                                                │Табельный номер│
                                                                                                                ├───────────────┤
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                               │@@@@@@@@@@@@@@@│
          ──────────────────────────────────────────────────────────────────────────────────────────────────────└───────────────┘
                              фамилия, имя, отчество работника

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                         наименование профессии (должности), разряд, класс (категория) квалификация

          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
          ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
                       наименование структурного подразделения

         Предоставляется ежегодный оплачиваемый отпуск

         за период работы с ^ года    по ^ года

             ┌───────┐@ календарных
          на │ @@@@  │ ─────────── дней
             └───────┘ @ рабочих

          с ^ года    по ^ года
                                                      ┌───────┐@ календарных
          и (или) дополнительный (другой) отпуск на   │ @@@@  │ ─────────── дней
                                                      └───────┘ @ рабочих

          ┌────────────────────────────────────────┬───────────────┬─────────────────────┬──────────────────────────────────────┐
          │    Дополнительный или другой отпуск    │Количество дней│        Дата         │           Основание                  │
          │                                        │(календарных,  ├──────────┬──────────┤         предоставления               │
          ├──────────────────────────────┬─────────┤  рабочих)     │начала    │окончания │        дополнительного               │
          │            вид               │   код   │               │отпуска   │отпуска   │            отпуска                   │
          ├──────────────────────────────┼─────────┼───────────────┼──────────┼──────────┼──────────────────────────────────────┤
          │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│&&&&&&&&&&&&&&&│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
          ├──────────────────────────────┼─────────┼───────────────┼──────────┼──────────┼──────────────────────────────────────┤
          │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│&&&&&&&&&&&&&&&│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
          ├──────────────────────────────┼─────────┼───────────────┼──────────┼──────────┼──────────────────────────────────────┤
          │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│&&&&&&&&&&&&&&&│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
          ├──────────────────────────────┼─────────┼───────────────┼──────────┼──────────┼──────────────────────────────────────┤
          │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│&&&&&&&&&&&&&&&│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
          ├──────────────────────────────┼─────────┼───────────────┼──────────┼──────────┼──────────────────────────────────────┤
          │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@│&&&&&&&&&&&&&&&│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
          └──────────────────────────────┴─────────┴───────────────┴──────────┴──────────┴──────────────────────────────────────┘


          Работник кадровой службы
                                    ───────────────────────────   ───────────────────  ──────────────────────────────────────────
                                            должность                  подпись                 расшифровка подписи
.endform Р