/*
  ╔═════════════════════════════════════════════════════════════════════╗
  ║      Н Т О  "T O P   S O F T"                                       ║
  ║      Проект "КАДРЫ"                                                 ║
  ║      Версия : 5.8                                                   ║
  ║      Разработал:  Мохова Ж.И.                                       ║
  ║      Назначение:  Форма Т-1a  Сводный приказ о приеме на работу     ║
  ║      Параметры:                                                     ║
  ║      Изменения: май 2001 - новая форма!!!                           ║
  ╚═════════════════════════════════════════════════════════════════════╝
*/
#doc
Форма Т-1a  Сводный приказ о приеме на работу
#end
.form Nfrmt1A
.Hide
.Fields
Организация  ОКПО
TitleDocNrec : comp
номер_документа  дата_составления
ContDocNrec : comp
PersNrec : comp
AppointNrec : comp
FIO
FIO_VP
TabN
подразделение
должность
tarif

topKoef

contract_date
contract_nmb
дата_с
дата_по
test

ДолжнРук
ФиоРук

.EndFields

^ ^ ^ ^ ^
.{ myPsnCycle CheckEnter
^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^
.}
^ ^

.endform

.LinkForm 'Nfrmt1A_01_1' Prototype is 'Nfrmt1A'
.NameInList 'Форма N Т-1a'
.DEFO LANDSCAPE
.P 40
.Fields
Организация  ОКПО
номер_документа  дата_составления
FIO
TabN
подразделение
должность
tarif
contract_date
contract_nmb
дата_с
дата_по
test

ДолжнРук
ФиоРук

.EndFields



 Р                                                                                                                                            Унифицированная форма N Т-1a
                                                                                                                                              Утверждена Постановлением Госкомстата
                                                                                                                                              России от 06.04.2001 N 26
                                                                                                                                                                         ┌────────┐
                                                                                                                                                                         │  Код   │
                                                                                                                                                                         ├────────┤
                                                                                                                                                          Форма по ОКУД  │ 0301015│
                                                                                                                                                                         ├────────┤
            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                  по ОКПО │@@@@@@@@│
            ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────         └────────┘
                                                наименование организации
                                                                                               ┌─────────┬──────────┐
                                                                                               │  Номер  │   Дата   │
                                                                                               │документа│          │
                                                                                               ├─────────┼──────────┤
                                                                               БПРИКАЗ Б           │@@@@@@@@@│@@@@@@@@@@│
                                                                           Б(распоряжение) Б       └─────────┴──────────┘
                                                                   Бо приеме работников на работу Б
                  БПринять на работу: Б
            ┌─────────────────────────────┬──────────┬─────────────────────────┬────────────────────┬──────────────┬─────────────────────┬─────────────────────┬────────┬───────────┐
            │    Фамилия,имя,отчество     │Табельный │      Структурное        │     Профессия      │    Оклад     │    Основание:       │    Период работы    │Испыта- │С приказом │
            │                             │  номер   │     подразделение       │    (должность),    │  (тарифная   │ трудовой договор    │                     │тельный │(распоряже-│
            │                             │          │                         │   разряд, класс    │   ставка),   │    (контракт)       │                     │срок,   │нием) оз-  │
            │                             │          │                         │    (категория)     │   надбавка,  ├──────────┬──────────┼──────────┬──────────┤месяцев │накомлен.  │
            │                             │          │                         │   квалификации     │     руб.     │ номер    │  дата    │    с     │   по     │        │Подпись    │
            │                             │          │                         │                    │              │          │          │          │          │        │работника. │
            │                             │          │                         │                    │              │          │          │          │          │        │Дата.      │
            ├─────────────────────────────┼──────────┼─────────────────────────┼────────────────────┼──────────────┼──────────┼──────────┼──────────┼──────────┼────────┼───────────┤
            │              1              │    2     │           3             │         4          │      5       │    6     │    7     │     8    │    9     │   11   │    12     │
            ├─────────────────────────────┼──────────┼─────────────────────────┼────────────────────┼──────────────┼──────────┼──────────┼──────────┼──────────┼────────┼───────────┤
.{ myPsnCycle CheckEnter
.[H skip
            ┌─────────────────────────────┬──────────┬─────────────────────────┬────────────────────┬──────────────┬──────────┬──────────┬──────────┬──────────┬────────┬───────────┐
            │              1              │    2     │           3             │         4          │      5       │    6     │    7     │     8    │    9     │   11   │    12     │
            ├─────────────────────────────┼──────────┼─────────────────────────┼────────────────────┼──────────────┼──────────┼──────────┼──────────┼──────────┼────────┼───────────┤
.]H
            │@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │@@@@@@@@@ │@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@│&&&&&&&&&&&&&&│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@│           │
.}
            └─────────────────────────────┴──────────┴─────────────────────────┴────────────────────┴──────────────┴──────────┴──────────┴──────────┴──────────┴────────┴───────────┘
             Руководитель организации @@@@@@@@@@@@@@@@@@@@@@@@@@@                        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                                      ───────────────────────────   ───────────────────  ──────────────────────────────────────────
                                             должность                  подпись                 расшифровка подписи Р
.endform

.LinkForm 'Nfrmt1A_01_2' Prototype is 'Nfrmt1A'
.NameInList 'Форма N Т-1a со склонением ФИО'
.DEFO LANDSCAPE
.P 40
.Fields
Организация  ОКПО
номер_документа  дата_составления
FIO_VP
TabN
подразделение
должность
tarif
contract_date
contract_nmb
дата_с
дата_по
test

ДолжнРук
ФиоРук

.EndFields



 Р                                                                                                                                            Унифицированная форма N Т-1a
                                                                                                                                              Утверждена Постановлением Госкомстата
                                                                                                                                              России от 06.04.2001 N 26
                                                                                                                                                                         ┌────────┐
                                                                                                                                                                         │  Код   │
                                                                                                                                                                         ├────────┤
                                                                                                                                                          Форма по ОКУД  │ 0301015│
                                                                                                                                                                         ├────────┤
            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                  по ОКПО │@@@@@@@@│
            ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────         └────────┘
                                                наименование организации
                                                                                               ┌─────────┬──────────┐
                                                                                               │  Номер  │   Дата   │
                                                                                               │документа│          │
                                                                                               ├─────────┼──────────┤
                                                                               БПРИКАЗ Б           │@@@@@@@@@│@@@@@@@@@@│
                                                                           Б(распоряжение) Б       └─────────┴──────────┘
                                                                   Бо приеме работников на работу Б
                  БПринять на работу: Б
            ┌─────────────────────────────┬──────────┬─────────────────────────┬────────────────────┬──────────────┬─────────────────────┬─────────────────────┬────────┬───────────┐
            │    Фамилия,имя,отчество     │Табельный │      Структурное        │     Профессия      │    Оклад     │    Основание:       │    Период работы    │Испыта- │С приказом │
            │                             │  номер   │     подразделение       │    (должность),    │  (тарифная   │ трудовой договор    │                     │тельный │(распоряже-│
            │                             │          │                         │   разряд, класс    │   ставка),   │    (контракт)       │                     │срок,   │нием) оз-  │
            │                             │          │                         │    (категория)     │   надбавка,  ├──────────┬──────────┼──────────┬──────────┤месяцев │накомлен.  │
            │                             │          │                         │   квалификации     │     руб.     │ номер    │  дата    │    с     │   по     │        │Подпись    │
            │                             │          │                         │                    │              │          │          │          │          │        │работника. │
            │                             │          │                         │                    │              │          │          │          │          │        │Дата.      │
            ├─────────────────────────────┼──────────┼─────────────────────────┼────────────────────┼──────────────┼──────────┼──────────┼──────────┼──────────┼────────┼───────────┤
            │              1              │    2     │           3             │         4          │      5       │    6     │    7     │     8    │    9     │   11   │    12     │
            ├─────────────────────────────┼──────────┼─────────────────────────┼────────────────────┼──────────────┼──────────┼──────────┼──────────┼──────────┼────────┼───────────┤
.{ myPsnCycle CheckEnter
.[H skip
            ┌─────────────────────────────┬──────────┬─────────────────────────┬────────────────────┬──────────────┬──────────┬──────────┬──────────┬──────────┬────────┬───────────┐
            │              1              │    2     │           3             │         4          │      5       │    6     │    7     │     8    │    9     │   11   │    12     │
            ├─────────────────────────────┼──────────┼─────────────────────────┼────────────────────┼──────────────┼──────────┼──────────┼──────────┼──────────┼────────┼───────────┤
.]H
            │@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │@@@@@@@@@ │@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@│&&&&&&&&&&&&&&│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@│           │
.}
            └─────────────────────────────┴──────────┴─────────────────────────┴────────────────────┴──────────────┴──────────┴──────────┴──────────┴──────────┴────────┴───────────┘
             Руководитель организации @@@@@@@@@@@@@@@@@@@@@@@@@@@                        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                                      ───────────────────────────   ───────────────────  ──────────────────────────────────────────
                                             должность                  подпись                 расшифровка подписи Р
.endform