
/*
  ╔═════════════════════════════════════════════════════════════════════╗
  ║      Н Т О  "T O P   S O F T"                                       ║
  ║      Проект "КАДРЫ"                                                 ║
  ║      Версия : 5.8                                                   ║
  ║      Разработал:  Мохова Ж.И.                                       ║
  ║      Назначение:  Форма Т-8a  Сводный приказ об увольнении          ║
  ║      Параметры:                                                     ║
  ║      Изменения: май 2001 - новая форма!!!                           ║
  ╚═════════════════════════════════════════════════════════════════════╝
*/
#doc
Форма Т-8a  Сводный приказ об увольнении
#end
.form Nfrmt8A
.Hide
.Fields
Организация  ОКПО
TitleDocNrec : comp
номер_документа  дата_составления
ContDocNrec : comp
PersNrec : comp
AppointNrec : comp
FIO
FIO_VP
TabN
подразделение
должность
ContractNmb
ContractDate
DisDate
Reason
ProfNmb
ДолжнРук
ФиоРук

.EndFields

^ ^ ^ ^ ^
.{ myPsnCycle8 CheckEnter
^ ^ ^ ^ ^ ^ ^ ^
^ ^ ^ ^ ^
.}
^ ^
.endform

.LinkForm 'Nfrmt8A_01_1' Prototype is 'Nfrmt8A'
.NameInList 'Форма N Т-8a'
.DEFO LANDSCAPE
.P 40
.Fields
Организация  ОКПО
номер_документа  дата_составления
FIO
TabN
подразделение
должность
ContractNmb
ContractDate
DisDate
Reason
ProfNmb
ДолжнРук
ФиоРук

.EndFields



 Р                                                                                                                                                Унифицированная форма N Т-8a
                                                                                                                                                Утверждена Постановлением Госкомстата
                                                                                                                                                России от 06.04.2001 N 26
                                                                                                                                                                            ┌────────┐
                                                                                                                                                                            │  Код   │
                                                                                                                                                                            ├────────┤
                                                                                                                                                             Форма по ОКУД  │ 0301021│
                                                                                                                                                                            ├────────┤
            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                     по ОКПО │@@@@@@@@│
            ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────         └────────┘
                                                наименование организации
                                                                                               ┌─────────┬──────────┐
                                                                                               │  Номер  │   Дата   │
                                                                                               │документа│          │
                                                                                               ├─────────┼──────────┤
                                                                               БПРИКАЗ Б           │@@@@@@@@@│@@@@@@@@@@│
                                                                           Б(распоряжение) Б       └─────────┴──────────┘
                                                   Бо прекращении действия трудового договора (контракта) с работниками Б
                  БУволить: Б
            ┌──────────────────────────────────┬──────────┬───────────────────────────┬──────────────────────┬───────────────────┬──────────┬─────────────┬────────────────┬──────────┐
            │      Фамилия,имя,отчество        │Табельный │       Структурное         │      Профессия       │  Трудовой договор │Дата      │Основание    │Номер и дата    │С приказом│
            │                                  │  номер   │      подразделение        │     (должность),     │    (контракт)     │увольне-  │увольнения   │решения         │(распоря- │
            │                                  │          │                           │    разряд, класс     ├───────┬───────────┤ния       │             │профсоюзного    │жением)   │
            │                                  │          │                           │     (категория)      │       │           │          │             │органа о        │ознакомлен│
            │                                  │          │                           │    квалификации      │ номер │    дата   │          │             │согласии        │Подпись   │
            │                                  │          │                           │                      │       │           │          │             │на увольнение   │работника.│
            │                                  │          │                           │                      │       │           │          │             │                │Дата.     │
            ├──────────────────────────────────┼──────────┼───────────────────────────┼──────────────────────┼───────┼───────────┼──────────┼─────────────┼────────────────┼──────────┤
            │                1                 │    2     │            3              │          4           │   5   │     6     │    7     │      8      │       9        │    10    │
            ├──────────────────────────────────┼──────────┼───────────────────────────┼──────────────────────┼───────┼───────────┼──────────┼─────────────┼────────────────┼──────────┤
.{ myPsnCycle8 CheckEnter
.[H skip
            ┌──────────────────────────────────┬──────────┬───────────────────────────┬──────────────────────┬───────┬───────────┬──────────┬─────────────┬────────────────┬──────────┐
            │                1                 │    2     │            3              │          4           │    5  │      6    │    7     │      8      │       9        │    10    │
            ├──────────────────────────────────┼──────────┼───────────────────────────┼──────────────────────┼───────┴───────────┼──────────┼─────────────┼────────────────┼──────────┤
.]H
            │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │@@@@@@@@@ │@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@│@@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@│          │
.}
            └──────────────────────────────────┴──────────┴───────────────────────────┴──────────────────────┴───────┴───────────┴──────────┴─────────────┴────────────────┴──────────┘

            Руководитель организации @@@@@@@@@@@@@@@@@@@@@@@@@@@                        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                                      ───────────────────────────   ───────────────────  ──────────────────────────────────────────
                                             должность                  подпись                 расшифровка подписи
.endform

.LinkForm 'Nfrmt8A_01_2' Prototype is 'Nfrmt8A'
.NameInList 'Форма N Т-8a со склонением ФИО'
.DEFO LANDSCAPE
.P 40
.Fields
Организация  ОКПО
номер_документа  дата_составления
FIO_VP
TabN
подразделение
должность
ContractNmb
ContractDate
DisDate
Reason
ProfNmb
ДолжнРук
ФиоРук

.EndFields



 Р                                                                                                                                                Унифицированная форма N Т-8a
                                                                                                                                                Утверждена Постановлением Госкомстата
                                                                                                                                                России от 06.04.2001 N 26
                                                                                                                                                                            ┌────────┐
                                                                                                                                                                            │  Код   │
                                                                                                                                                                            ├────────┤
                                                                                                                                                             Форма по ОКУД  │ 0301021│
                                                                                                                                                                            ├────────┤
            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                     по ОКПО │@@@@@@@@│
            ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────         └────────┘
                                                наименование организации
                                                                                               ┌─────────┬──────────┐
                                                                                               │  Номер  │   Дата   │
                                                                                               │документа│          │
                                                                                               ├─────────┼──────────┤
                                                                               БПРИКАЗ Б           │@@@@@@@@@│@@@@@@@@@@│
                                                                           Б(распоряжение) Б       └─────────┴──────────┘
                                                   Бо прекращении действия трудового договора (контракта) с работниками Б
                  БУволить: Б
            ┌──────────────────────────────────┬──────────┬───────────────────────────┬──────────────────────┬───────────────────┬──────────┬─────────────┬────────────────┬──────────┐
            │      Фамилия,имя,отчество        │Табельный │       Структурное         │      Профессия       │  Трудовой договор │Дата      │Основание    │Номер и дата    │С приказом│
            │                                  │  номер   │      подразделение        │     (должность),     │    (контракт)     │увольне-  │увольнения   │решения         │(распоря- │
            │                                  │          │                           │    разряд, класс     ├───────┬───────────┤ния       │             │профсоюзного    │жением)   │
            │                                  │          │                           │     (категория)      │       │           │          │             │органа о        │ознакомлен│
            │                                  │          │                           │    квалификации      │ номер │    дата   │          │             │согласии        │Подпись   │
            │                                  │          │                           │                      │       │           │          │             │на увольнение   │работника.│
            │                                  │          │                           │                      │       │           │          │             │                │Дата.     │
            ├──────────────────────────────────┼──────────┼───────────────────────────┼──────────────────────┼───────┼───────────┼──────────┼─────────────┼────────────────┼──────────┤
            │                1                 │    2     │            3              │          4           │   5   │     6     │    7     │      8      │       9        │    10    │
            ├──────────────────────────────────┼──────────┼───────────────────────────┼──────────────────────┼───────┼───────────┼──────────┼─────────────┼────────────────┼──────────┤
.{ myPsnCycle8 CheckEnter
.[H skip
            ┌──────────────────────────────────┬──────────┬───────────────────────────┬──────────────────────┬───────┬───────────┬──────────┬─────────────┬────────────────┬──────────┐
            │                1                 │    2     │            3              │          4           │    5  │      6    │    7     │      8      │       9        │    10    │
            ├──────────────────────────────────┼──────────┼───────────────────────────┼──────────────────────┼───────┴───────────┼──────────┼─────────────┼────────────────┼──────────┤
.]H
            │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │@@@@@@@@@ │@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@│@@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@│          │
.}
            └──────────────────────────────────┴──────────┴───────────────────────────┴──────────────────────┴───────┴───────────┴──────────┴─────────────┴────────────────┴──────────┘

            Руководитель организации @@@@@@@@@@@@@@@@@@@@@@@@@@@                        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                                      ───────────────────────────   ───────────────────  ──────────────────────────────────────────
                                             должность                  подпись                 расшифровка подписи
.endform