//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.70 - Управление договорами
// Печать оборотов к актам на передачу векселей
//------------------------------------------------------------------------------

#doc
Печать оборотов к актам на передачу векселей
#end

.linkform 'Ree_Vk_Ob' prototype is 'Ree_Vk'
.NameInList 'Обороты к актам'
.fields
  CommonFormHeader
  obKatDoc_Name
  obAppVeks_NoApp
  obAppVeks_DatVip
  obOborot_krSCHETK
  obOborot_SubSchK
  obkrKAU
  obOborot_dbSCHETO
  obOborot_SubOsSch
  obdbKAU
  obOborot_SumOb
  obHozOper_Name1
.endfields
^
 Щ                             &&&&&&&&&&&&&&&&&&&&&&&&&&&& N @@@@@@
                                              за   @@@@@@@@@@@@@@@@@@@
 Щ
 Ш ───────────────────────────────────────────────────┬──────────────────────────────────────────────────┬────────────────
                     БОсновной счет Б                   │           БКорреспондирующий счет Б                  │
 ────┬─────┬─────────────┬──────────────────────────┼────┬─────┬─────────────┬─────────────────────────┤
  БСчет Б│ БСуб-  Б│ БКод структур- Б│          БОбъект Б           │ БСчет Б│ БСуб- Б │ БКод структур- Б│          БОбъект Б          │       БСумма Б
     │ Бсчет Б │ Бного подразд. Б│      Баналитического Б       │    │ Бсчет Б │ Бного подразд. Б│      Баналитического Б      │
     │     │             │          Бучета Б            │    │     │             │          Бучета Б           │
 ────┴─────┴─────────────┴──────────────────────────┴────┴─────┴─────────────┴─────────────────────────┴────────────────

.{ CheckEnter Vk_Ree_Oborot
  @@@ @@@@@               @~@@@@@@@@@@@@@@@@@@@@@@@@ @@@@ @@@@@               @~@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&.&&
.}

  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
 Б Содержание операции Б
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@


 Б Главный бухгалтер                                      Исполнитель Б Ш
.endform
