#doc
Список типовых примечаний
#end
.Set Name = 'BDOCNAME'
.hide
.fields
 NameTP : string
.endfields
.{
  ^
.}
.endform

#doc
Список типовых примечаний
#end
.linkform 'BDOCNAME01' prototype is 'BDOCNAME'
.fields
 NameTP
.endfields
.{
.[h OverWrite
 Р──────────────────────────────────────────────────────────────────────────────────────────────────────
 С                   Список типовых примечаний 
────────────────────────────────────────────────────────────────────────────────────────────────────── Р
.]h
  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.endform
