//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 7.12 - Сметная документация
// Каталог лимитированных затрат
//------------------------------------------------------------------------------

#doc
Печать каталога лимитированных затрат
#end
.set name = 'kat_KL'
.hide
.fields
 namekat katnrec nazv koef
.endfields
 ^
.{ ForKatLim CHECKENTER
 ^ ^ ^
.}
.endform

#doc
Печать каталога лимитированных затрат
#end
.linkform 'Lkat_KL' prototype is 'kat_KL'
.fields
 namekat
 nazv
 koef
.endfields
            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Ш┌───────────────────────────────────────────────────────────────────────────────────┬───────────────────────┐
│                                     Наименование                                  │       Коэффициент     │
└───────────────────────────────────────────────────────────────────────────────────┴───────────────────────┘
.{ ForKatLim CHECKENTER
  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @@@@@@@@@@@@@@@@@@@@@
.}
.endform
