//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 7.12 - Сметная документация
// Каталог сметных коэффициентов
//------------------------------------------------------------------------------

#doc
Печать каталога сметных коэффициентов
#end
.set name = 'kat_SK'
.hide
.fields
 namekat katnrec nazv koef
.endfields
 ^
.{ ForKatKoeff CHECKENTER
 ^ ^ ^
.}
.endform

#doc
Печать каталога сметных коэффициентов
#end
.linkform 'Lkat_SK' prototype is 'kat_SK'
.fields
 namekat
 nazv
 koef
.endfields
            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Ш┌─────────────────────────────────────────────────────────────────────────┬─────────────────────────────────┐
│                                Наименование                             │         Тип коэффициента        │
└─────────────────────────────────────────────────────────────────────────┴─────────────────────────────────┘
.{ ForKatKoeff CHECKENTER
  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.endform
