//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 7.12 - Сметная документация
// Печать отчета о наличии ПСД
//------------------------------------------------------------------------------

#doc
Печать отчета о наличии ПСД
#end
.set name='NalPsd'
.hide
.fields
  Data
  Шапка1 Шапка2 Шапка3 Шапка4
  Шапка_провер  Шапка_примеч

  Region  KonR00 Prover00

  ПорНомер Наименование Заказчик Подрядчик Срок
  KonR11 Prover11

  Наим
  ОтКого1 Дата1 Кол1
  Кому2   Дата2 Кол2
  НаимЗам КомуЗам ДатаЗам ОтветЗам
  KonResh Prover
.endfields


^
 .{.?KonResh10;^ .}
 .{.?KonResh20;^ .}
 .{.?KonResh30;^ .}
 .{.?KonResh40;^ .}

^ ^
.{ nalpsd1 CHECKENTER
  ^
  .{.?KonR00;^ .}
  ^

.{ nalpsd2 CHECKENTER
  ^ ^ ^ ^ ^
  .{.?KonR11;^ .}
  ^
.{ nalpsd3 CHECKENTER
  ^
  ^ ^ ^
  ^ ^ ^
  ^ ^ ^ ^
  .{.?KonR0;^ .}
  ^
.}
.}
.}
.endform
