#doc
  Протокол корректировки картотеки ОС и НМА в соответствии с изменениями в связях
  каталога амортизационных групп и ОКОФ.
#end
.form UpdateKatOsAGForm
.fields
  ModeName
  TiDkName
  NastrOsName

  KatOsInNum
  KatOsName
  OldAg
  NewAg
.endfields
^ ^
по методу учета ^

───────────┬────────────────────────────────────────────────┬─────────┬────────
Инвентарный│Наименование                                    │Старая АГ│Новая АГ
   номер   │                                                │         │
───────────┴────────────────────────────────────────────────┴─────────┴────────
.{ UpdateKatOsAGFormLoop CheckEnter
@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @~@@@@@@@ @~@@@@@@
.}
───────────────────────────────────────────────────────────────────────────────
.endform
