//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
// Галактика 8.1 - Бухгалтерский контур
// Отчет по реструктуризации долга
//------------------------------------------------------------------------------
#doc
Форма для печати отчета по реструктуризации долга
#end
.set name = 'RestDolg'
.set filler = ' '
.hide
.nameinlist 'Отчет по реструктуризации долга'
.fields
  ValNameah
  NameOrg BegDate:date EndDate:date 
  NameType
  NoDogovor ProdName BuhDolgBeg:double DogDolgBeg:double RestDolgBeg:double 
  PlanDate PlanSum:double OplAllDolg:double OplTekDolg:double OplRestDolg:double 
  BuhDolgEnd:double DogDolgEnd:double RestDolgEnd:double RestDolgProsr:double
.endfields
   ^
   ^ ^ ^ 
.if IsFilterOnSoglRestDolg
   ^
.end
.{
   ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.endform

.linkform 'RestDolg_01' prototype is 'RestDolg'
.group 'Отчеты по реструктуризации долга'
.nameinlist '1. Отчет по реструктуризации долга'
.defo landscape
.fields
  CommonFormHeader
  NameOrg EndDate BegDate Sub_Day(EndDate,1) 
  NameType
  BegDate Sub_Day(EndDate,1)
  BegDate BegDate BegDate EndDate EndDate EndDate EndDate 
  NoDogovor ProdName BuhDolgBeg DogDolgBeg RestDolgBeg
  PlanDate PlanSum OplAllDolg OplTekDolg OplRestDolg
  BuhDolgEnd DogDolgEnd RestDolgEnd RestDolgProsr
  BuhDolgBeg:'SUM' DogDolgBeg:'SUM' RestDolgBeg:'SUM' PlanSum:'SUM' OplAllDolg:'SUM' OplTekDolg:'SUM'
  OplRestDolg:'SUM' BuhDolgEnd:'SUM' DogDolgEnd:'SUM' RestDolgEnd:'SUM' RestDolgProsr:'SUM'
  ValNameah
.endfields
 Ш^
 Б                                                                                    Справка
                                                          о реструктуризации задолженности ^
                                                                          по состоянию на ^
                                                                    (за период c ^ по ^) Щ
 Ш.if IsFilterOnSoglRestDolg
   Фильтр на соглашения : ^
.end

 Б─────────────┬────────────────────────┬──────────────┬──────────────┬──────────────┬─────────────────────────┬────────────────────────────────────────────┬─────────────────────────────┬─────────────────────────────
   Договор   │       Продукция        │Задолженность │  Задолж. по  │Реструкт. долг│        План погашения   │               Оплата за период             │        Задолженность по     │Задолженность реструктуризи-
             │                        │ по бух. учету│усл.договоров │ по состоянию │реструктуризирован. долга│          с @@@@@@@@@@ по @@@@@@@@@@        │                             │     рованного долга
             │                        │ на @@@@@@@@@@│ на @@@@@@@@@@│ на @@@@@@@@@@├──────────┬──────────────┼──────────────┬──────────────┬──────────────┼──────────────┬──────────────┼──────────────┬──────────────
             │                        │              │              │              │          │              │    Всего     │  Текущих     │ Реструктур.  │  бух.учету   │по усл.догов. │     Всего    │ Просроченного
             │                        │              │              │              │     до   │    сумма     │              │  долгов      │    долга     │ на @@@@@@@@@@│на @@@@@@@@@@ │ на @@@@@@@@@@│ на @@@@@@@@@@
─────────────┼────────────────────────┼──────────────┼──────────────┼──────────────┼──────────┼──────────────┼──────────────┼──────────────┼──────────────┼──────────────┼──────────────┼──────────────┼────────────── Щ
 Ш.{
@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@│&'#&&&&&&&&.&&│&'#&&&&&&&&.&&│&'#&&&&&&&&.&&│@@@@@@@@@@│&'&&&&&&&&&.&&│&'#&&&&&&&&.&&│&'#&&&&&&&&.&&│&'#&&&&&&&&.&&│&'#&&&&&&&&.&&│&'#&&&&&&&&.&&│&'#&&&&&&&&.&&│&'#&&&&&&&&.&&
.}
 Б─────────────┼────────────────────────┼──────────────┼──────────────┼──────────────┼──────────┼──────────────┼──────────────┼──────────────┼──────────────┼──────────────┼──────────────┼──────────────┼──────────────
   ИТОГО     │                        │&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│          │&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&│&&&&&&&&&&&.&&
─────────────┴────────────────────────┴──────────────┴──────────────┴──────────────┴──────────┴──────────────┴──────────────┴──────────────┴──────────────┴──────────────┴──────────────┴──────────────┴────────────── Щ
 Ш Ведомость сформирована в ^

 БРуководитель Б

Исполнитель Ш
 Б.endform