//-----------------------------------------------------------------------------
//                                                     (c) корпорация ГАЛАКТИКА
// Галактика 8.10 - заработная плата
// Сведения о доходах плательщика 
//-----------------------------------------------------------------------------
#doc
Сведения о доходах плательщика
#end
.set name='bfrm_new'
.hide
.set filler = '-'
.{ bfrm2T_New CheckEnter
.fields
 Prim
 Дата_отчета_шап: date
 код_ГНИ
 месяц
 год_за_который_отчет
 месяц_ок
 KolDoc
 Всего_дохода_Контроль
 ИНН_работодателя
 название_работодателя

 ИНН_налогоплательщика
! ГНИ_налогоплательщика
 ФИО_налогоплательщика

 код_документа_удостоверяющего_личность
 серия_документа
 номер_документа
 дата_выдачи_документа

 кем_выдан
 личный_номер

 Код_страны
 Индекс
 КодПоСОАТО
 Область
 Район
 Сельсовет
 Тип_Нас_пункт
 Нас_пункт

!-----
 Тип_Улица_м
 Улица_м
 Дом_м
 Корпус_м
 Квартира_м
 Полный_адрес
!-----
 Статус
 Код_работы
 УНП_работы_сейчас
 УНП_работы_предыдущей

.endfields
 ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
.fields
 Доход1 Доход3 Доход5 Доход7 Доход9  Доход11
 Доход2 Доход4 Доход6 Доход8 Доход10 Доход12

 КодАвтор1  СуммаАвтор1
 КодАвтор2  СуммаАвтор2
 КодАвтор3  СуммаАвтор3
 КодАвтор4  СуммаАвтор4
 New1_КодАвтор1  New1_СуммаАвтор1
 New1_КодАвтор2  New1_СуммаАвтор2
 New1_КодАвтор3  New1_СуммаАвтор3
 New1_КодАвтор4  New1_СуммаАвтор4

 КодБум1 СуммаБум1 
 КодБум2 СуммаБум2 
 КодБум3 СуммаБум3 
 КодБум4 СуммаБум4

 КодНеобл1  MesНеобл1  СуммаНеобл1
 КодНеобл2  MesНеобл2  СуммаНеобл2
 КодНеобл3  MesНеобл3  СуммаНеобл3
 КодНеобл4  MesНеобл4  СуммаНеобл4

 New2_КодНеобл1  New2_MesНеобл1  New2_СуммаНеобл1
 New2_КодНеобл2  New2_MesНеобл2  New2_СуммаНеобл2
 New2_КодНеобл3  New2_MesНеобл3  New2_СуммаНеобл3
 New2_КодНеобл4  New2_MesНеобл4  New2_СуммаНеобл4
! 4.2
 КодЛьг1 МесЛьг1 СуммаЛьг1 СуммаВыч1
 КодЛьг2 МесЛьг2 СуммаЛьг2 СуммаВыч2
 КодЛьг3 МесЛьг3 СуммаЛьг3 СуммаВыч3

 КодЛьг4 МесЛьг4 СуммаЛьг4 СуммаВыч4
 КодЛьг5 МесЛьг5 СуммаЛьг5 СуммаВыч5
 КодЛьг6 МесЛьг6 СуммаЛьг6 СуммаВыч6

 КодЛьг7 МесЛьг7 СуммаЛьг7 СуммаВыч7
 КодЛьг8 МесЛьг8 СуммаЛьг8 СуммаВыч8
 КодЛьг9 МесЛьг9 СуммаЛьг9 СуммаВыч9

 КодЛьг10 МесЛьг10 СуммаЛьг10 СуммаВыч10
 КодЛьг11 МесЛьг11 СуммаЛьг11 СуммаВыч11
 КодЛьг12 МесЛьг12 СуммаЛьг12 СуммаВыч12

 КодВычета1  СуммаВычета1  КодВычета2  СуммаВычета2
 КодВычета3  СуммаВычета3  КодВычета4  СуммаВычета4
 КодВычета5  СуммаВычета5  КодВычета6  СуммаВычета6

 КодВычета1_Доп  СуммаВычета1_Доп  КодВычета2_Доп  СуммаВычета2_Доп
 КодВычета3_Доп  СуммаВычета3_Доп  КодВычета4_Доп  СуммаВычета4_Доп
 КодВычета5_Доп  СуммаВычета5_Доп  КодВычета6_Доп  СуммаВычета6_Доп

 Общая_сумма_льгот
 Общая_сумма_вычетов
 Совокупный_доход
! для реестра
 DatPosReestr
 DatUvReestr
 Облагаемый_доход
 Удержано_налога

 КодВычета6_1 Mes6_1 Сумма6_1 Налог6_1
 КодВычета6_2 Mes6_2 Сумма6_2 Налог6_2
 КодВычета6_3 Mes6_3 Сумма6_3 Налог6_3

 КодВычета6_4 Mes6_4 Сумма6_4 Налог6_4
 КодВычета6_5 Mes6_5 Сумма6_5 Налог6_5
 КодВычета6_6 Mes6_6 Сумма6_6 Налог6_6

 КодВычета6_7 Mes6_7 Сумма6_7 Налог6_7
 КодВычета6_8 Mes6_8 Сумма6_8 Налог6_8
 КодВычета6_9 Mes6_9 Сумма6_9 Налог6_9

 КодВычета6_10 Mes6_10 Сумма6_10 Налог6_10
 КодВычета6_11 Mes6_11 Сумма6_11 Налог6_11
 КодВычета6_12 Mes6_12 Сумма6_12 Налог6_12

 New4_КодВычета6_1 New4_Mes6_1 New4_Сумма6_1 New4_Налог6_1
 New4_КодВычета6_2 New4_Mes6_2 New4_Сумма6_2 New4_Налог6_2
 New4_КодВычета6_3 New4_Mes6_3 New4_Сумма6_3 New4_Налог6_3

 Общая_сумма_дохода_6
 Сумма_удержанного_налога_6

 Всего_Совокупный_доход
 Всего_Удержано_налога

 ФИО_руководителя
 ФИО_бухгалтера
 Дата: date
.endfields
 ^^^^^^^^^^^^

 ^^^^^^^^
.{ bfrm2T_New1 CheckEnter
 ^^^^^^^^
.}

 ^^^^^^^^

 ^^^^^^^^^^^^
.{ bfrm2T_New2 CheckEnter
 ^^^^^^^^^^^^
.}

 ^^^^^^^^^^^^
 ^^^^^^^^^^^^
 ^^^^^^^^^^^^
 ^^^^^^^^^^^^

 ^^^^^^^^^^^^
 ^^^^^^^^^^^^
 ^
 ^
 ^
 ^
 ^
 ^
 ^
 ^^^^^^^^^^^^
 ^^^^^^^^^^^^
 ^^^^^^^^^^^^
 ^^^^^^^^^^^^
.{ bfrm2T_New4 CheckEnter
 ^^^^^^^^^^^^
.}
 ^^
 ^
 ^
 ^
 ^
 ^
.}
.endform
!
!
!
.linkform 'bfrm_new_MAGNIT' prototype is 'bfrm_New'
.nameinlist'Сведения о доходах плательщика на магнитных носителях'
.F 'BFRM_new.OUT'
!.group '2006'
.DEFP PA4
.p 37
.var
   _Dat: date;
   IsHeader : boolean ;
   сумма_льгот_вар   : double;
   Совокупный_доход_вар : double;
   fior: string[100];
   posr: word;
   fam, im, ot: string[30];
   RNomDoc: word;
   R_три_собаки: string[3]
.endvar
.begin
   IsHeader := false;
   RNomDoc := 0;
   R_три_собаки := '@@@'
 end.
.{ bfrm2T_New CheckEnter
.fields
!!!! шапка !!!!!!!
ИНН_работодателя
код_ГНИ
DateToStr(Дата_отчета_шап,'DD.MM.YYYY')
год_за_который_отчет
!исключен LPadCh(месяц_ок, '0', 2)
!LPadCh(KolDoc, '0', 9)
KolDoc
Всего_дохода_Контроль
R_три_собаки
.endfields
.{?internal; not IsHeader
.begin
  IsHeader := true;
end.
0.1:^
0.2:^
0.3:^
0.4:^
!0.5:^
0.6:^
0.7:^  
^
.}
.fields
!!!! Анкета !!!!!!!
!LPadCh(RNomDoc, '0', 6)
RNomDoc
!исключен 1.1 ИНН_работодателя
!исключен 1.2 название_работодателя
ИНН_налогоплательщика
UpCase(fam)
UpCase(im)
UpCase(ot)
код_документа_удостоверяющего_личность
серия_документа
номер_документа
DateToStr(StrToDate(дата_выдачи_документа, 'DD/MM/YYYY'),'DD.MM.YYYY')
личный_номер
.endfields
.begin
  RNomDoc := RNomDoc + 1;
  fam := '';
  im  := '';
  ot  := '';
  сумма_льгот_вар := 0;
  Совокупный_доход_вар:= 0;
  fior := trim(ФИО_налогоплательщика);
  fam  := trim(ФИО_налогоплательщика);
  posr := instr(' ',fior)
  if posr <> 0
  then
  {
     fam  := substr(fior,1,posr);
     fior := trim(substr(fior,posr,Length(fior)));
     posr := instr(' ',fior);
     if posr <> 0
     {
       im := substr(fior,1,posr);
       ot := trim(substr(fior,posr,Length(fior)));
     }
     else
       im := trim(fior);
  }
 end.
1.0:^
! исключен 1.1:^
! исключен  1.2:^
.{?internal; (length(ИНН_налогоплательщика) <> 0)
2.1:^
.}
2.2.1:^
2.2.2:^
.{?internal; (length(ot) <> 0)
2.2.3:^
.}
.{?internal; (length(код_документа_удостоверяющего_личность) <> 0)
2.3:^
.}
.{?internal; (length(серия_документа) <> 0)
2.4.1:^
.}
2.4.2:^
2.4.3:^
.{?internal; (length(trim(личный_номер)) <> 0)
2.5:^
.}
.fields
!!!! адреса !!!!!!!
Код_страны
Индекс
! исключен КодПоСОАТО
UpCase(Область)
UpCase(Район)
Сельсовет
Upcase(Тип_Нас_пункт)
Upcase(Нас_пункт)
Тип_Улица_м
Улица_м
Дом_м
Корпус_м
Квартира_м
.endfields
.{?internal; (length(Код_страны) <> 0)
2.6.1:^
.}
.{?internal; (length(Индекс) <> 0)
2.6.2:^
.}
! исключен.{?internal; (length(КодПоСОАТО) <> 0)
! исключен2.6.3:^
! исключен.}
.{?internal; (length(Область) <> 0)
2.6.4:^
.}
.{?internal; (length(Район) <> 0)
2.6.5:^
.}
.{?internal; (length(Сельсовет) <> 0)
2.6.6:^
.}
.{?internal; (length(Тип_Нас_пункт) <> 0)
2.6.7:^
.}
2.6.8:^
.{?internal; (length(Тип_Улица_м) <> 0)
2.6.9:^
.}
.{?internal; (length(Улица_м) <> 0)
2.6.10:^
.}
.{?internal; (length(Дом_м) <> 0)
2.6.11:^
.}
.{?internal; (length(Корпус_м) <> 0)
2.6.12:^
.}
.{?internal; (length(Квартира_м) <> 0)
2.6.13:^
.}
.fields
 Статус
 Код_работы
! ГНИ_налогоплательщика
! исключен  УНП_работы_сейчас
! исключен  УНП_работы_предыдущей
.endfields
.{?internal; (length(Статус) <> 0)
2.7:^
.}
.{?internal; (length(Код_работы) <> 0)
2.8:^
.}
! исключен.{?internal; (trim(Код_работы) ='02') and (length(УНП_работы_сейчас) <> 0)
! исключен2.9:^
! исключен.}
! исключен.{?internal; (length(УНП_работы_предыдущей) <> 0)
! исключен2.10:^
! исключен.}
.fields
 Доход1 Доход2 Доход3 Доход4  Доход5  Доход6
 Доход7 Доход8 Доход9 Доход10 Доход11 Доход12
.endfields
.{?internal; (Double(Доход1) <> 0) 
3.1:01;^
.begin
   Совокупный_доход_вар :=  Совокупный_доход_вар + double(Доход1)
end.
.}
.{?internal; Double(Доход2) <> 0
3.1:02;^
.begin Совокупный_доход_вар := Совокупный_доход_вар + double(Доход2) end.
.}
.{?internal; Double(Доход3) <> 0
3.1:03;^
.begin Совокупный_доход_вар := Совокупный_доход_вар + double(Доход3) end.
.}
.{?internal; Double(Доход4) <> 0
3.1:04;^
.begin Совокупный_доход_вар := Совокупный_доход_вар + double(Доход4) end.
.}
.{?internal; Double(Доход5) <> 0
3.1:05;^
.begin Совокупный_доход_вар := Совокупный_доход_вар + double(Доход5) end.
.}
.{?internal; Double(Доход6) <> 0
3.1:06;^
.begin Совокупный_доход_вар := Совокупный_доход_вар + double(Доход6) end.
.}
.{?internal; Double(Доход7) <> 0
3.1:07;^
.begin Совокупный_доход_вар := Совокупный_доход_вар + double(Доход7) end.
.}
.{?internal; Double(Доход8) <> 0
3.1:08;^
.begin Совокупный_доход_вар := Совокупный_доход_вар + double(Доход8) end.
.}
.{?internal; Double(Доход9) <> 0
3.1:09;^
.begin Совокупный_доход_вар := Совокупный_доход_вар + double(Доход9) end.
.}
.{?internal; Double(Доход10) <> 0
3.1:10;^
.begin Совокупный_доход_вар := Совокупный_доход_вар + double(Доход10) end.
.}
.{?internal; Double(Доход11) <> 0
3.1:11;^
.begin Совокупный_доход_вар := Совокупный_доход_вар + double(Доход11) end.
.}
.{?internal; Double(Доход12) <> 0
3.1:12;^
.begin Совокупный_доход_вар := Совокупный_доход_вар + double(Доход12) end.
.}
.fields
 КодАвтор1  СуммаАвтор1
 КодАвтор2  СуммаАвтор2
 КодАвтор3  СуммаАвтор3
 КодАвтор4  СуммаАвтор4
.endfields
.{?internal; (Double(СуммаАвтор1) <> 0)
3.1.1:^;^
.}
.{?internal; (Double(СуммаАвтор2) <> 0)
3.1.1:^;^
.}
.{?internal; (Double(СуммаАвтор3) <> 0)
3.1.1:^;^
.}
.{?internal; (Double(СуммаАвтор4) <> 0)
3.1.1:^;^
.}
.{ bfrm2T_New1 CheckEnter
.fields
 New1_КодАвтор1  New1_СуммаАвтор1
 New1_КодАвтор2  New1_СуммаАвтор2
 New1_КодАвтор3  New1_СуммаАвтор3
 New1_КодАвтор4  New1_СуммаАвтор4
.endfields
.{?internal; (Double(New1_СуммаАвтор1) <> 0)
3.1.1:^;^
.}
.{?internal; (Double(New1_СуммаАвтор2) <> 0)
3.1.1:^;^
.}
.{?internal; (Double(New1_СуммаАвтор3) <> 0)
3.1.1:^;^
.}
.{?internal; (Double(New1_СуммаАвтор4) <> 0)
3.1.1:^;^
.}
.}
.fields
 КодБум1 СуммаБум1
 КодБум2 СуммаБум2
 КодБум3 СуммаБум3
 КодБум4 СуммаБум4
.endfields
.{?internal; (Double(СуммаБум1) <> 0)
3.1.2:^;^
.}
.{?internal; (Double(СуммаБум2) <> 0)
3.1.2:^;^
.}
.{?internal; (Double(СуммаБум3) <> 0)
3.1.2:^;^
.}
.{?internal; (Double(СуммаБум4) <> 0)
3.1.2:^;^
.}
.fields
 КодНеобл1  LPadCh(MesНеобл1, '0', 2) СуммаНеобл1
 КодНеобл2  LPadCh(MesНеобл2, '0', 2) СуммаНеобл2
 КодНеобл3  LPadCh(MesНеобл3, '0', 2) СуммаНеобл3
 КодНеобл4  LPadCh(MesНеобл4, '0', 2) СуммаНеобл4
.endfields
.{?internal; (Double(СуммаНеобл1) <> 0)
4.1:^;^;^
.}
.{?internal; (Double(СуммаНеобл2) <> 0)
4.1:^;^;^
.}
.{?internal; (Double(СуммаНеобл3) <> 0)
4.1:^;^;^
.}
.{?internal; (Double(СуммаНеобл4) <> 0)
4.1:^;^;^
.}
.{ bfrm2T_New2 CheckEnter
.fields
 New2_КодНеобл1  LPadCh(New2_MesНеобл1, '0', 2)  New2_СуммаНеобл1
 New2_КодНеобл2  LPadCh(New2_MesНеобл2, '0', 2)  New2_СуммаНеобл2
 New2_КодНеобл3  LPadCh(New2_MesНеобл3, '0', 2)  New2_СуммаНеобл3
 New2_КодНеобл4  LPadCh(New2_MesНеобл4, '0', 2)  New2_СуммаНеобл4
.endfields
.{?internal; (Double(New2_СуммаНеобл1) <> 0)
4.1:^;^;^
.}
.{?internal; (Double(New2_СуммаНеобл2) <> 0)
4.1:^;^;^
.}
.{?internal; (Double(New2_СуммаНеобл3) <> 0)
4.1:^;^;^
.}
.{?internal; (Double(New2_СуммаНеобл4) <> 0)
4.1:^;^;^
.}
.}
.fields
 КодЛьг1 LPadCh(МесЛьг1, '0', 2) СуммаЛьг1 СуммаВыч1
 КодЛьг2 LPadCh(МесЛьг2, '0', 2) СуммаЛьг2 СуммаВыч2
 КодЛьг3 LPadCh(МесЛьг3, '0', 2) СуммаЛьг3 СуммаВыч3

 КодЛьг4 LPadCh(МесЛьг4, '0', 2) СуммаЛьг4 СуммаВыч4
 КодЛьг5 LPadCh(МесЛьг5, '0', 2) СуммаЛьг5 СуммаВыч5
 КодЛьг6 LPadCh(МесЛьг6, '0', 2) СуммаЛьг6 СуммаВыч6

 КодЛьг7 LPadCh(МесЛьг7, '0', 2) СуммаЛьг7 СуммаВыч7
 КодЛьг8 LPadCh(МесЛьг8, '0', 2) СуммаЛьг8 СуммаВыч8
 КодЛьг9 LPadCh(МесЛьг9, '0', 2) СуммаЛьг9 СуммаВыч9

 КодЛьг10 LPadCh(МесЛьг10, '0', 2) СуммаЛьг10 СуммаВыч10
 КодЛьг11 LPadCh(МесЛьг11, '0', 2) СуммаЛьг11 СуммаВыч11
 КодЛьг12 LPadCh(МесЛьг12, '0', 2) СуммаЛьг12 СуммаВыч12
.endfields
.{?internal; (Double(СуммаЛьг1) <> 0)
4.2:^;^;^;^
.begin сумма_льгот_вар := сумма_льгот_вар + double(СуммаВыч1) end.
.}
.{?internal; (Double(СуммаЛьг2) <> 0)
4.2:^;^;^;^
.begin сумма_льгот_вар := сумма_льгот_вар + double(СуммаВыч2) end.
.}
.{?internal; (Double(СуммаЛьг3) <> 0)
4.2:^;^;^;^
.begin сумма_льгот_вар := сумма_льгот_вар + double(СуммаВыч3) end.
.}
.{?internal; (Double(СуммаЛьг4) <> 0)
4.2:^;^;^;^
.begin сумма_льгот_вар := сумма_льгот_вар + double(СуммаВыч4) end.
.}
.{?internal; (Double(СуммаЛьг5) <> 0)
4.2:^;^;^;^
.begin сумма_льгот_вар := сумма_льгот_вар + double(СуммаВыч5) end.
.}
.{?internal; (Double(СуммаЛьг6) <> 0)
4.2:^;^;^;^
.begin сумма_льгот_вар := сумма_льгот_вар + double(СуммаВыч6) end.
.}
.{?internal; (Double(СуммаЛьг7) <> 0)
4.2:^;^;^;^
.begin сумма_льгот_вар := сумма_льгот_вар + double(СуммаВыч7) end.
.}
.{?internal; (Double(СуммаЛьг8) <> 0)
4.2:^;^;^;^
.begin сумма_льгот_вар := сумма_льгот_вар + double(СуммаВыч8) end.
.}
.{?internal; (Double(СуммаЛьг9) <> 0)
4.2:^;^;^;^
.begin сумма_льгот_вар := сумма_льгот_вар + double(СуммаВыч9) end.
.}
.{?internal; (Double(СуммаЛьг10) <> 0)
4.2:^;^;^;^
.begin сумма_льгот_вар := сумма_льгот_вар + double(СуммаВыч10) end.
.}
.{?internal; (Double(СуммаЛьг11) <> 0)
4.2:^;^;^;^
.begin сумма_льгот_вар := сумма_льгот_вар + double(СуммаВыч11) end.
.}
.{?internal; (Double(СуммаЛьг12) <> 0)
4.2:^;^;^;^
.begin сумма_льгот_вар := сумма_льгот_вар + double(СуммаВыч12) end.
.}
.fields
 КодВычета1      СуммаВычета1
 КодВычета2      СуммаВычета2
 КодВычета3      СуммаВычета3
 КодВычета4      СуммаВычета4
 КодВычета5      СуммаВычета5
 КодВычета6      СуммаВычета6
 КодВычета1_Доп  СуммаВычета1_Доп
 КодВычета2_Доп  СуммаВычета2_Доп
 КодВычета3_Доп  СуммаВычета3_Доп
 КодВычета4_Доп  СуммаВычета4_Доп
 КодВычета5_Доп  СуммаВычета5_Доп
 КодВычета6_Доп  СуммаВычета6_Доп
.endfields
.{?internal; (Double(СуммаВычета1) <> 0)
4.3:^;^
.}
.{?internal; (Double(СуммаВычета2) <> 0)
4.3:^;^
.}
.{?internal; (Double(СуммаВычета3) <> 0)
4.3:^;^
.}
.{?internal; (Double(СуммаВычета4) <> 0)
4.3:^;^
.}
.{?internal; (Double(СуммаВычета5) <> 0)
4.3:^;^
.}
.{?internal; (Double(СуммаВычета6) <> 0)
4.3:^;^
.}
.{?internal; (Double(СуммаВычета1_Доп) <> 0)
4.3:^;^
.}
.{?internal; (Double(СуммаВычета2_Доп) <> 0)
4.3:^;^
.}
.{?internal; (Double(СуммаВычета3_Доп) <> 0)
4.3:^;^
.}
.{?internal; (Double(СуммаВычета4_Доп) <> 0)
4.3:^;^
.}
.{?internal; (Double(СуммаВычета5_Доп) <> 0)
4.3:^;^
.}
.{?internal; (Double(СуммаВычета6_Доп) <> 0)
4.3:^;^
.}
.fields
 Общая_сумма_льгот
 Общая_сумма_вычетов
 Совокупный_доход
 Облагаемый_доход
 Удержано_налога
.endfields
.{?internal; Double(Общая_сумма_льгот) <> 0
4.4:^
.}
.{?internal; Double(Общая_сумма_вычетов) <> 0
4.5:^
.}
.{?internal; Prim = '1'
5.1:^
5.2:^
.}
.{?internal; Double(Удержано_налога) <> 0
5.3:^
.}
.fields
 КодВычета6_1 LPadCh(Mes6_1, '0', 2)  Сумма6_1 Налог6_1
 КодВычета6_2 LPadCh(Mes6_2, '0', 2)  Сумма6_2 Налог6_2
 КодВычета6_3 LPadCh(Mes6_3, '0', 2)  Сумма6_3 Налог6_3

 КодВычета6_4 LPadCh(Mes6_4, '0', 2)  Сумма6_4 Налог6_4
 КодВычета6_5 LPadCh(Mes6_5, '0', 2)  Сумма6_5 Налог6_5
 КодВычета6_6 LPadCh(Mes6_6, '0', 2)  Сумма6_6 Налог6_6

 КодВычета6_7 LPadCh(Mes6_7, '0', 2)  Сумма6_7 Налог6_7
 КодВычета6_8 LPadCh(Mes6_8, '0', 2)  Сумма6_8 Налог6_8
 КодВычета6_9 LPadCh(Mes6_9, '0', 2)  Сумма6_9 Налог6_9

 КодВычета6_10 LPadCh(Mes6_10, '0', 2)  Сумма6_7 Налог6_10
 КодВычета6_11 LPadCh(Mes6_11, '0', 2)  Сумма6_8 Налог6_11
 КодВычета6_12 LPadCh(Mes6_12, '0', 2)  Сумма6_9 Налог6_12
.endfields
.{?internal; (Double(Сумма6_1) <> 0)
6.1:^;^;^;^
.}
.{?internal; (Double(Сумма6_2) <> 0)
6.1:^;^;^;^
.}
.{?internal; (Double(Сумма6_3) <> 0)
6.1:^;^;^;^
.}
.{?internal; (Double(Сумма6_4) <> 0)
6.1:^;^;^;^
.}
.{?internal; (Double(Сумма6_5) <> 0)
6.1:^;^;^;^
.}
.{?internal; (Double(Сумма6_6) <> 0)
6.1:^;^;^;^
.}
.{?internal; (Double(Сумма6_7) <> 0)
6.1:^;^;^;^
.}
.{?internal; (Double(Сумма6_8) <> 0)
6.1:^;^;^;^
.}
.{?internal; (Double(Сумма6_9) <> 0)
6.1:^;^;^;^
.}
.{?internal; (Double(Сумма6_10) <> 0)
6.1:^;^;^;^
.}
.{?internal; (Double(Сумма6_11) <> 0)
6.1:^;^;^;^
.}
.{?internal; (Double(Сумма6_12) <> 0)
6.1:^;^;^;^
.}
.{ bfrm2T_New4 CheckEnter
.fields
 New4_КодВычета6_1 LPadCh(New4_Mes6_1, '0', 2) New4_Сумма6_1 New4_Налог6_1
 New4_КодВычета6_2 LPadCh(New4_Mes6_2, '0', 2) New4_Сумма6_2 New4_Налог6_2
 New4_КодВычета6_3 LPadCh(New4_Mes6_3, '0', 2) New4_Сумма6_3 New4_Налог6_3
.endfields
.{?internal; (Double(New4_Сумма6_1) <> 0)
6.1:^;^;^;^
.}
.{?internal; (Double(New4_Сумма6_2) <> 0)
6.1:^;^;^;^
.}
.{?internal; (Double(New4_Сумма6_3) <> 0)
6.1:^;^;^;^
.}
.}
.fields
 Общая_сумма_дохода_6
 Сумма_удержанного_налога_6
.endfields
.{?internal; Double(Общая_сумма_дохода_6) <> 0
6.2:^
.}
.{?internal; Double(Сумма_удержанного_налога_6) <> 0
6.3:^
.}
.fields
 Всего_Совокупный_доход
 Всего_Удержано_налога
.endfields
7.1:^
7.2:^
.fields
 R_три_собаки
.endfields
^
!6.0:
.}
===
.endform