 Ш/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,2004 корпорация ГАЛАКТИКА                    ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Заработная плата                                          ║
 ║ Версия        : 8.1                                                       ║
 ║ Назначение    : Налоговая карточка РФ                                     ║
 ║ Ответственный :                                                           ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
#doc
Налоговая карточка РФ за 2005 год
#end
.set name = 'Card2005'
.hide
.DEFO LANDSCAPE
.p 70
.fields
DataForm
ЗаГод: word
Номер
ИНН
КодГни
ФИОАгента
KodOKATO
.endfields
.{ PersLoop1_2005 CheckEnter
 ^^^
   Раздел 1. Сведения о налоговом агенте (источнике доходов)
 ^^^^
   Раздел 2. Сведения о налогоплательщике (получателе доходов)
.fields
nRec_лицевого_счета
ИННПлательщика
НомерСвидПФ
ФИО
ВидДокументаЛичности
Код
СерияНомДок
Дата_рождения
Гражданство
КодСтраны
Индекс
КодРегиона
Район
Город
НасПункт
Улица
Дом
Корпус
Квартира
Статус
ДокСтатуса
ВычетыЗаяв
.endfields
^^^^^^^^^^^^^^^^^^^^^^

 Раздел 3. Расчет налоговой базы и налога на доходы физического лица
(кроме дивидендов и доходов, облагаемых по ставке 35%)
.fields
ДолгПлательщика1
ДолгАгента1
Доход_с_пред_места_работы

КодДохода1
Доход1_1:double
Доход1_2:double
Доход1_3:double
Доход1_4:double
Доход1_5:double
Доход1_6:double
Доход1_7:double
Доход1_8:double
Доход1_9:double
Доход1_10:double
Доход1_11:double
Доход1_12:double
КодВычета1
Вычет1_1:double
Вычет1_2:double
Вычет1_3:double
Вычет1_4:double
Вычет1_5:double
Вычет1_6:double
Вычет1_7:double
Вычет1_8:double
Вычет1_9:double
Вычет1_10:double
Вычет1_11:double
Вычет1_12:double
КодВычета2 Вычет2_1:double Вычет2_2:double Вычет2_3:double Вычет2_4:double Вычет2_5:double Вычет2_6:double Вычет2_7:double Вычет2_8:double Вычет2_9:double Вычет2_10:double Вычет2_11:double Вычет2_12:double
КодВычета3 Вычет3_1:double Вычет3_2:double Вычет3_3:double Вычет3_4:double Вычет3_5:double Вычет3_6:double Вычет3_7:double Вычет3_8:double Вычет3_9:double Вычет3_10:double Вычет3_11:double Вычет3_12:double
КодВычета4 Вычет4_1:double Вычет4_2:double Вычет4_3:double Вычет4_4:double Вычет4_5:double Вычет4_6:double Вычет4_7:double Вычет4_8:double Вычет4_9:double Вычет4_10:double Вычет4_11:double Вычет4_12:double
// сумма необлагаемого дохода при наличии зарубежного представительства
NeObl_1:double
NeObl_2:double
NeObl_3:double
NeObl_4:double
NeObl_5:double
NeObl_6:double
NeObl_7:double
NeObl_8:double
NeObl_9:double
NeObl_10:double
NeObl_11:double
NeObl_12:double

СтандВычет1_1:double СтандВычет1_2:double СтандВычет1_3:double СтандВычет1_4:double СтандВычет1_5:double СтандВычет1_6:double СтандВычет1_7:double СтандВычет1_8:double СтандВычет1_9:double СтандВычет1_10:double СтандВычет1_11:double СтандВычет1_12:double
СтандВычет2_1:double СтандВычет2_2:double СтандВычет2_3:double СтандВычет2_4:double СтандВычет2_5:double СтандВычет2_6:double СтандВычет2_7:double СтандВычет2_8:double СтандВычет2_9:double СтандВычет2_10:double СтандВычет2_11:double СтандВычет2_12:double
СтандВычет3_1:double СтандВычет3_2:double СтандВычет3_3:double СтандВычет3_4:double СтандВычет3_5:double СтандВычет3_6:double СтандВычет3_7:double СтандВычет3_8:double СтандВычет3_9:double СтандВычет3_10:double СтандВычет3_11:double СтандВычет3_12:double
СтандВычет4_1:double СтандВычет4_2:double СтандВычет4_3:double СтандВычет4_4:double СтандВычет4_5:double СтандВычет4_6:double СтандВычет4_7:double СтандВычет4_8:double СтандВычет4_9:double СтандВычет4_10:double СтандВычет4_11:double СтандВычет4_12:double
СтандВычет5_1:double СтандВычет5_2:double СтандВычет5_3:double СтандВычет5_4:double СтандВычет5_5:double СтандВычет5_6:double СтандВычет5_7:double СтандВычет5_8:double СтандВычет5_9:double СтандВычет5_10:double СтандВычет5_11:double СтандВычет5_12:double
СтандВычет6_1:double СтандВычет6_2:double СтандВычет6_3:double СтандВычет6_4:double СтандВычет6_5:double СтандВычет6_6:double СтандВычет6_7:double СтандВычет6_8:double СтандВычет6_9:double СтандВычет6_10:double СтандВычет6_11:double СтандВычет6_12:double
СтандВычет7_1:double СтандВычет7_2:double СтандВычет7_3:double СтандВычет7_4:double СтандВычет7_5:double СтандВычет7_6:double СтандВычет7_7:double СтандВычет7_8:double СтандВычет7_9:double СтандВычет7_10:double СтандВычет7_11:double СтандВычет7_12:double
СтандВычет8_1:double СтандВычет8_2:double СтандВычет8_3:double СтандВычет8_4:double СтандВычет8_5:double СтандВычет8_6:double СтандВычет8_7:double СтандВычет8_8:double СтандВычет8_9:double СтандВычет8_10:double СтандВычет8_11:double СтандВычет8_12:double
СтандВычет9_1:double СтандВычет9_2:double СтандВычет9_3:double СтандВычет9_4:double СтандВычет9_5:double СтандВычет9_6:double СтандВычет9_7:double СтандВычет9_8:double СтандВычет9_9:double СтандВычет9_10:double СтандВычет9_11:double СтандВычет9_12:double
СтандВычет10_1:double СтандВычет10_2:double СтандВычет10_3:double СтандВычет10_4:double СтандВычет10_5:double СтандВычет10_6:double СтандВычет10_7:double СтандВычет10_8:double СтандВычет10_9:double СтандВычет10_10:double СтандВычет10_11:double СтандВычет10_12:double
СтандВычет11_1:double СтандВычет11_2:double СтандВычет11_3:double СтандВычет11_4:double СтандВычет11_5:double СтандВычет11_6:double СтандВычет11_7:double СтандВычет11_8:double СтандВычет11_9:double СтандВычет11_10:double СтандВычет11_11:double СтандВычет11_12:double
СтандВычет12_1:double СтандВычет12_2:double СтандВычет12_3:double СтандВычет12_4:double СтандВычет12_5:double СтандВычет12_6:double СтандВычет12_7:double СтандВычет12_8:double СтандВычет12_9:double СтандВычет12_10:double СтандВычет12_11:double СтандВычет12_12:double
СтандВычет13_1:double СтандВычет13_2:double СтандВычет13_3:double СтандВычет13_4:double СтандВычет13_5:double СтандВычет13_6:double СтандВычет13_7:double СтандВычет13_8:double СтандВычет13_9:double СтандВычет13_10:double СтандВычет13_11:double СтандВычет13_12:double



ОстИмущВычета1:double ОстИмущВычета2:double ОстИмущВычета3:double ОстИмущВычета4:double ОстИмущВычета5:double ОстИмущВычета6:double
ОстИмущВычета7:double ОстИмущВычета8:double ОстИмущВычета9:double ОстИмущВычета10:double ОстИмущВычета11:double ОстИмущВычета12:double
ИмущВычет1:double ИмущВычет2:double ИмущВычет3:double ИмущВычет4:double ИмущВычет5:double ИмущВычет6:double
ИмущВычет7:double ИмущВычет8:double ИмущВычет9:double ИмущВычет10:double ИмущВычет11:double ИмущВычет12:double

Не_работник
UchDoh
XarOcrug5: double

RealVich1: double
RealVich2: double
RealVich3: double
RealVich4: double
RealVich5: double
RealVich6: double
RealVich7: double
RealVich8: double
RealVich9: double
RealVich10: double
RealVich11: double
RealVich12: double

НалогИсчисл1:double НалогИсчисл2:double НалогИсчисл3:double НалогИсчисл4:double НалогИсчисл5:double НалогИсчисл6:double НалогИсчисл7:double НалогИсчисл8:double НалогИсчисл9:double НалогИсчисл10:double НалогИсчисл11:double НалогИсчисл12:double
НалогУдер1:double НалогУдер2:double НалогУдер3:double НалогУдер4:double НалогУдер5:double НалогУдер6:double НалогУдер7:double НалогУдер8:double НалогУдер9:double НалогУдер10:double НалогУдер11:double НалогУдер12:double
IschNalog2620_1:double  IschNalog2620_2:double IschNalog2620_3:double IschNalog2620_4:double IschNalog2620_5:double IschNalog2620_6:double
IschNalog2620_7:double  IschNalog2620_8:double IschNalog2620_9:double IschNalog2620_10:double IschNalog2620_11:double IschNalog2620_12:double

NalPred63_1: double NalPred63_2: double NalPred63_3: double NalPred63_4: double NalPred63_5: double NalPred63_6: double
NalPred63_7: double NalPred63_8: double NalPred63_9: double NalPred63_10: double NalPred63_11: double NalPred63_12: double

NalPred64_1: double NalPred64_2: double NalPred64_3: double NalPred64_4: double NalPred64_5: double NalPred64_6: double
NalPred64_7: double NalPred64_8: double NalPred64_9: double NalPred64_10: double NalPred64_11: double NalPred64_12: double
.endfields
   ┌─────────────────────────┬─────────────────────────────────────┬────────────────────────────────┬───────────────────────┬─────────────────────────────────┬──────────────────────────┐
   │   На начало налогового  │        Долг по налогу               │                                │      Перенесено       │        Долг по налогу           │                          │
   │         периода         │      за налогоплательщиком          │      &~#&&&&&&&&&&&.&&         │     в налоговую       │      за налогоплательщиком      │   &~#&&&&&&&&&&&.&&      │
   │                         ├─────────────────────────────────────┼────────────────────────────────┤       карточку        ├─────────────────────────────────┼──────────────────────────┤
   │                         │        Долг по налогу               │                                │      следующего       │        Долг по налогу           │                          │
   │                         │      за налоговым агентом           │      &~#&&&&&&&&&&&.&&         │         года          │      за налоговым агентом       │                          │
   ├─────────────────────────┼───────────┬───────────┬───────────┬─┴─────────┬───────────┬──────────┴┬───────────┬──────────┴┬───────────┬───────────┬────────┴──┬───────────┬───────────┤
   │Наименование (код) дохода│   Январь  │  Февраль  │   Март    │   Апрель  │    Май    │    Июнь   │     Июль  │  Август   │  Сентябрь │  Октябрь  │   Ноябрь  │  Декабрь  │  Итого    │
   ├─────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
.{ DoxodLoop1_2005 CheckEnter
   │@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│           │
.}
   ├─────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │Вычеты,        │ Код @@@@│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│           │
   │предусмотренные├─────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │пунктом 28     │ Код @@@@│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│           │
   │ст. 217,       ├─────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │подпунктами    │ Код @@@@│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│           │
   │2, 3 ст. 221   ├─────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │НК РФ          │            │
.{ LastVychLoop1_2005 CheckEnter
   │               ├─────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │               │ Код @@@@│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│           │
.}
// сумма необлагаемого дохода при наличии зарубежного представительства
^^^^^^^^^^^^
   ├───────────────┼─────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │Общая сумма    │ За месяц│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │доходов за     ├─────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │минусом        │ С начала│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │вычетов (п. 28 │ года    │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │ст. 217, п. 2, │         │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │3 ст. 221 НК РФ│         │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├───────────────┼─────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │               │ За месяц│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │               │код  │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│           │
   │               ├─────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │               │ За месяц│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │               │код  │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│           │
   │Стандартные    ├─────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │вычеты (ст. 218│ За месяц│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │НК РФ)         │код  │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│           │
   │               ├─────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │               │ За месяц│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │               │код  │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│           │
   │               │ За месяц│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │               │код  │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│           │
^^^^^^^^^^^^
^^^^^^^^^^^^
^^^^^^^^^^^^
^^^^^^^^^^^^
^^^^^^^^^^^^
^^^^^^^^^^^^
^^^^^^^^^^^^
^^^^^^^^^^^^
   │               │ Общая   │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │               │ сумма   │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │               │ с начала│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │               │ года    │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├───────────────┴─────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
.{ Card2005_Imu CheckEnter
      │Остаток вычета на начало месяца│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&││
      ├───────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
      │Сумма использованного имущест- │           │           │           │           │           │           │           │           │           │           │           │           │           │
      │венного налогового вычета      │           │           │           │           │           │           │           │           │           │           │           │           │           │
      │нарастающим итогом             │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&││
      ├───────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
.}
! реальные вычеты
 ^^^^^^^^^^^^
   │Налоговая база (с начала │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │года)                    │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├─────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │Налог исчисленный   ^ ^  │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│           │
   ├─────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │Налог удержанный         │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│           │
   ├─────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤

! налог с матвыгоды 2620
^^^^^^^^^^^^
^^^^^^^^^^^^
^^^^^^^^^^^^

   │Долг по налогу за        │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │налогоплательщиком       │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├─────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │Долг по налогу за        │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │налоговым агентом        │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├─────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │Сумма налога, переданная │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │на взыскание в налоговый │     ^     │           │           │           │           │           │           │           │           │           │           │           │           │
   │орган                    │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├─────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │Возвращена налоговым     │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │агентом излишне          │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │удержанная сумма налога  │           │           │           │           │           │           │           │           │           │           │           │           │           │
   └─────────────────────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┘
.fields
Минимум1  Минимум2 Минимум3
ОсноваВыч3
Расходы1  Расходы2 Расходы3
КолДетей
ПериодВыч ОсноваВыч1
СтатусВдовы ОсноваВыч2
ВидВыч
.endfields
    3. Право на стандартные налоговые вычеты:                ┌──┐               ┌──┐               ┌──┐
   3.1. Необлагаемый минимум дохода в размере: 3000 рублей - │@@│, 500 рублей - │@@│, 400 рублей - │@@│- (в нужном поле
                                                             └──┘               └──┘               └──┘
   проставить любой знак);
   основание для предоставления налогового вычета ^_____________________________________________________________
                                                                ┌──┐                         ┌──┐
   3.2. Расходы на содержание 1 ребенка в размере: 600 рублей - │@@│, в размере 1200 рублей -│@@│ - (в нужном поле ^
                                                                └──┘                         └──┘
   проставить любой знак); количество детей @@@@
   период действия вычета @@@@@@@@@@@@@@@@@@@@@ основание для предоставления налогового вычета @@@@@@@@@@@@@@@@@@@@@
   документы, подтверждающие статус вдовы (вдовца), одинокого родителя, опекуна или попечителя @@@@@@@@@@@@@@@@@@@@@
   4. Право на налоговые вычеты, предусмотренные в п. 2, 3 ст. 221 НК РФ
   вид вычета @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ основание для предоставления вычета @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
   Раздел 4. Расчет налоговой базы и налога на доходы физического лица от долевого участия в деятельности
   организации (дивиденды)
.fields

СумДивиденд1:double СумДивиденд2:double СумДивиденд3:double СумДивиденд4:double СумДивиденд5:double СумДивиденд6:double СумДивиденд7:double СумДивиденд8:double СумДивиденд9:double СумДивиденд10:double СумДивиденд11:double СумДивиденд12:double
ОблСумДивиденд1:double ОблСумДивиденд2:double ОблСумДивиденд3:double ОблСумДивиденд4:double ОблСумДивиденд5:double ОблСумДивиденд6:double ОблСумДивиденд7:double ОблСумДивиденд8:double ОблСумДивиденд9:double ОблСумДивиденд10:double ОблСумДивиденд11:double ОблСумДивиденд12:double
INalДивиденд1:double INalДивиденд2:double INalДивиденд3:double INalДивиденд4:double INalДивиденд5:double INalДивиденд6:double INalДивиденд7:double INalДивиденд8:double INalДивиденд9:double INalДивиденд10:double INalДивиденд11:double INalДивиденд12:double
INalДивиденд13:double
UNalДивиденд1:double UNalДивиденд2:double UNalДивиденд3:double UNalДивиденд4:double UNalДивиденд5:double UNalДивиденд6:double UNalДивиденд7:double UNalДивиденд8:double UNalДивиденд9:double UNalДивиденд10:double UNalДивиденд11:double UNalДивиденд12:double
UNalДивиденд13:double
.endfields
   ┌──┬──────────────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┐
   │N │    Показатели    │   Январь  │  Февраль  │   Март    │   Апрель  │    Май    │    Июнь   │     Июль  │  Август   │  Сентябрь │  Октябрь  │   Ноябрь  │  Декабрь  │  Итого    │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 1│Сумма  дивидендов,│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │распределенная   в│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │пользу физического│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│           │
   │  │лица             -│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │налогоплательщика │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 2│Облагаемая сумма  │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│           │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 3│Сумма налога    на│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │доход  физического│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │по ставке      30%│    ^      │    ^      │     ^     │    ^      │     ^     │     ^     │     ^     │     ^     │     ^     │     ^     │     ^     │    ^      │    ^      │
   │  │(стр. 2  х  30)  /│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │100               │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
│ 5│удержанная │ ^ │ ^ │ ^ │ ^ │ ^ │ ^ │ ^ │ ^ │ ^ │  ^
│ ^ │ ^ │ ^ │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 6│Долг по налогу  за│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │налогоплательщиком│           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 7│Долг по  налогу за│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │налоговым агентом │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 8│Сумма      налога,│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │переданная      на│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │взыскание        в│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │налоговый орган   │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 9│Возвращена        │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │налоговым  агентом│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │излишне удержанная│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │сумма налога      │           │           │           │           │           │           │           │           │           │           │           │           │           │
   └──┴──────────────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┘
   Раздел 5. Расчет налога с доходов, облагаемых по ставке 35%
.fields
 Код_дохода
 Призы1:double Призы2:double Призы3:double Призы4:double Призы5:double Призы6:double Призы7:double Призы8:double Призы9:double Призы10:double Призы11:double Призы12:double
 Вычет35_1:double Вычет35_2:double Вычет35_3:double Вычет35_4:double Вычет35_5:double Вычет35_6:double Вычет35_7:double Вычет35_8:double Вычет35_9:double Вычет35_10:double Вычет35_11:double Вычет35_12:double
 НалБаза35_1:double НалБаза35_2:double НалБаза35_3:double НалБаза35_4:double НалБаза35_5:double НалБаза35_6:double НалБаза35_7:double
 НалБаза35_8:double НалБаза35_9:double НалБаза35_10:double НалБаза35_11:double НалБаза35_12:double
 Нал35_Исчисл1:double Нал35_Исчисл2:double Нал35_Исчисл3:double Нал35_Исчисл4:double Нал35_Исчисл5:double
 Нал35_Исчисл6:double Нал35_Исчисл7:double Нал35_Исчисл8:double Нал35_Исчисл9:double Нал35_Исчисл10:double
 Нал35_Исчисл11:double Нал35_Исчисл12:double

 Нал35_Удер1:double Нал35_Удер2:double Нал35_Удер3:double Нал35_Удер4:double Нал35_Удер5:double
 Нал35_Удер6:double Нал35_Удер7:double Нал35_Удер8:double Нал35_Удер9:double Нал35_Удер10:double
 Нал35_Удер11:double Нал35_Удер12:double
.endfields
.{ Stavka35_2005 CheckEnter
   ┌──┬──────────────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┐
   │N │Наименование (код)│   Январь  │  Февраль  │   Март    │   Апрель  │    Май    │    Июнь   │     Июль  │  Август   │  Сентябрь │  Октябрь  │   Ноябрь  │  Декабрь  │  Итого    │
   │  │      дохода      │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 1│Сумма выигрышей  и│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │призов в     целях│&&  &&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│           │
   │  │рекламы           │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 2│Выигрыши        от│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │лотерей,          │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │тотализаторов    и│           │           │           │           │           │           │           │           │           │           │           │           │
   │  │других  основанных│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │на риске игр      │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 3│Сумма      разницы│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │страховой  выплаты│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │по       договорам│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │добровольного     │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │страхования       │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 4│Налогооблагаемый  │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │процент по вкладам│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │в банках          │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 5│Материальная      │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │выгода по  заемным│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │средствам         │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 6│Вычет,            │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │предусмотренный   │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │п. 28 ст.  217  по│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │выигрышам и призам│&&&&&&&&.&&│&&&&&&&&&&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│           │
   │  │в целях рекламы   │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
│ 7│Налоговая база│^ │^ │^ │^ │^│^│^│^│^│^│^│^│ │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 8│Сумма       налога│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │исчисленная       │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│           │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 9│Сумма       налога│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │удержанная        │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│           │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │10│Долг по налогу  за│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │налогоплательщиком│           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │11│Долг по  налогу за│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │налоговым агентом │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │12│Сумма      налога,│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │переданная      на│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │взыскание        в│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │налоговый орган   │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├──┼──────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │13│Возвращена        │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │налоговым  агентом│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │излишне удержанная│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │сумма налога      │           │           │           │           │           │           │           │           │           │           │           │           │           │
   └──┴──────────────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┘
.}
   Раздел 7. Сведения о выплатах, произведенных физическому лицу от продажи имущества, принадлежащего ему
   на праве собственности
.fields
ВыплатыКод  Выплата1:double Выплата2:double Выплата3:double Выплата4:double Выплата5:double Выплата6:double Выплата7:double Выплата8:double Выплата9:double Выплата10:double Выплата11:double Выплата12:double
.endfields
   ┌─────────────────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┐
   │  Наименование (код) │   Январь  │  Февраль  │   Март    │   Апрель  │    Май    │    Июнь   │     Июль  │  Август   │  Сентябрь │  Октябрь  │   Ноябрь  │  Декабрь  │  Итого    │
   │        дохода       │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├─────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
.{ DoxodImu1_2005 CheckEnter
   │@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│           │
   ├─────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
.}
   └─────────────────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┘
.fields
НомерСправ ДатаСправ
Dolj_Check FIO_Check
.endfields
   Сведения о представлении справок:
   а) налоговому органу о доходах: N справки @@@@@@@@@@ дата @@@@@@@@@@
   б) налогоплательщику о доходах: N справки            дата
   в) налоговому  органу  о  сумме   задолженности,   переданной   на
   взыскание: N справки (письма)              дата

   Правильность заполнения налоговой карточки проверена:
     (дата)      (должность) ^   (Фамилия, Имя, Отчество) ^   (Подпись)
.}
.endform
!
!
!
.linkForm 'Card2005_01' prototype is 'Card2005'
.group 'lower2009'
.DEFO LANDSCAPE
.p 70
.var
 RДоходИтог1, RДоходИтог: double;
 RВычетИтог1, RВычетИтог2,RВычетИтог3,RВычетИтог4,
 RВычетИтог: double;
 RNeOblИтог:  double;
 RЗаГод    : array [1..12] of double;
RЗаМесяц     : array [1..12] of double;
RДОходМес    : array [1..12] of double;
RСтандВычетНГ: array [1..12] of double;
RВычетМес    : array [1..12] of double;
RNeOblМес    : array [1..12] of double;

RНалогБаза   : array [1..13] of double;
RНалогИсчисл : array [1..13] of double;
RНалогУдер   : array [1..13] of double;
RДолгНалПлат : array [1..13] of double;
RДолгНалАгент: array [1..13] of double;
RДолгНалПлатDiv: array [1..13] of double;
RДолгНалАгентDiv: array [1..13] of double;
RNalPred63: array [1..13] of double;
RNalPred64: array [1..13] of double;
RСтандВычетИтог1: double;
RСтандВычетИтог2: double;
RСтандВычетИтог3: double;
RСтандВычетИтог4: double;
RСтандВычетИтог5: double;
RСтандВычетИтог6: double;
RСтандВычетИтог7: double;
RСумДивиденд13: double;
RОблСумДивиденд13: double;
RНалБаза35_13: double;
RНал35_Исчисл13, RНал35_Удер13: double;
RAllНал35_Исчисл13, RAllНал35_Удер13: double;
RПризы13, RВычет35_13: double;
AllZero, AllНал13_Исч,  AllНал13_Удер, AllНал30_Исч,  AllНал30_Удер,
AllДолгНалПлат13, AllДолгНалАгент13, AllДолгНалПлат30, AllДолгНалАгент30: double;
AllДолгНалПлатDiv, AllДолгНалАгентDiv: double
RAllPred63Rez, RAllPred63NoRez, RAllPred64Rez, RAllPred64NoRez: double;
RВыплата13, RОстИмущВычета13, RИмущВычет13: double;
RДолг1Нал35_1, RДолг1Нал35_2, RДолг1Нал35_3,
RДолг1Нал35_4,      RДолг1Нал35_5,       RДолг1Нал35_6,
RДолг1Нал35_7,      RДолг1Нал35_8,       RДолг1Нал35_9,
RДолг1Нал35_10,     RДолг1Нал35_11,     RДолг1Нал35_12,
RДолг1Нал35_13,      RДолг2Нал35_1,      RДолг2Нал35_2,
RДолг2Нал35_3,      RДолг2Нал35_4,       RДолг2Нал35_5,
RДолг2Нал35_6, RДолг2Нал35_7, RДолг2Нал35_8,
RДолг2Нал35_9,     RДолг2Нал35_10,      RДолг2Нал35_11,
RДолг2Нал35_12, RДолг2Нал35_13: double
RИмущВычет: array [1..12] of double;
RВзыскание: array [1..13] of double;
i: integer;
RAllVz13, RAllVz30 : double;
RINalДивиденд: array [1..13] of string;
RUNalДивиденд: array [1..13] of string;
RСтандВычет1: array [1..12] of double;
RСтандВычет2: array [1..12] of double;
RСтандВычет3: array [1..12] of double;
RСтандВычет4: array [1..12] of double;
RСтандВычет5: array [1..12] of double;
RСтандВычет6: array [1..12] of double;
RСтандВычет7: array [1..12] of double;
RProcDiv: string[3];
Rгражданство:      string;
PrizGod:       boolean;
.endvar

.fields
ЗаГод Номер
ИНН
КодГни
ФИОАгента
KodOKATO
.endfields
.{ PersLoop1_2005 CheckEnter
.begin
 if ( not ReadMyDsk(PrizGod, 'NDFL_PrizGod', false) )
   PrizGod := true;
 for(i := 1; i <= 12; i := i + 1)
   RИмущВычет[i] := 0;
 Rгражданство :=  Гражданство;

 if (Rгражданство = '') and (Статус = '1')
   Rгражданство := '643'

end.
                                                                                      Утверждена
                                                                                      Приказом МНС РФ
                                                                                      от 31.10.2003
                                                                                      № БГ-3-04/583
                                                                                      Форма 1-НДФЛ








     НАЛОГОВАЯ КАРТОЧКА ПО УЧЕТУ ДОХОДОВ И НАЛОГА НА ДОХОДЫ ФИЗИЧЕСКИХ ЛИЦ ЗА @@@@ ГОД N @@@@@@@@

   Раздел 1. СВЕДЕНИЯ О НАЛОГОВОМ АГЕНТЕ (ИСТОЧНИКЕ ДОХОДОВ)

   1.1. ИНН/КПП (для организации или ИНН для налогового агента - индивидуального предпринимателя) @@@@@@@@@@@@@@@@@@@@@@@

   1.2. Код налогового органа, где налоговый агент состоит на учете @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

   1.3. Наименование (фамилия, имя, отчество) налогового агента @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

   1.4. Код ОКАТО @@@@@@@@@@@

   Раздел 2. СВЕДЕНИЯ О НАЛОГОПЛАТЕЛЬЩИКЕ (ПОЛУЧАТЕЛЕ ДОХОДОВ)
.fields
ИННПлательщика
НомерСвидПФ
ФИО
Код СерияНомДок
Дата_рождения
RГражданство
КодСтраны
Индекс
КодРегиона
Район Город
НасПункт Улица Дом Корпус Квартира
Статус ДокСтатуса
ВычетыЗаяв
.endfields
   2.1. ИНН @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ 2.2. Номер страхового свидетельства ПФР @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

   2.3. Фамилия, Имя, Отчество @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

   2.4. Вид документа, удостоверяющего личность: Код <*> @@@ 2.5. Серия, номер документа @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

   2.6. Дата рождения (число, месяц, год)  @@@@@@@@@@       2.7. Гражданство @@@@@@@@@

   2.8. Адрес постоянного места жительства: Код страны @@@@@@@@@@@@@@ Почтовый индекс @@@@@@@@@@@@ Код региона @@@@@@@@@@@@

   Район @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Город @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

   Населенный пункт @@@@@@@@@@@@@@@@@@@@@@@@@ Улица @@@@@@@@@@@@@@@@@@@@@ Дом @@@@@@@@@ Корпус @@@@@@@@@ Квартира @@@@@@@@@

   2.9. Статус (1 - резидент, 2 - нерезидент) @@@@@ реквизиты документа, подтверждающего статус @@@@@@@@@@@@@@@@@@@@@@@@@@@

   2.10. Стандартные налоговые вычеты заявлены (1), не заявлены (2) @@@

.fields
'true':'s'
.endfields
^

 Раздел 3. РАСЧЕТ НАЛОГОВОЙ БАЗЫ И НАЛОГА НА ДОХОДЫ ФИЗИЧЕСКОГО ЛИЦА
 (для доходов, облагаемых по ставкам 13% и 30%)
.fields
ДолгПлательщика1
ДолгАгента1
Доход_с_пред_места_работы

КодДохода1
/*  зачем эта проверка? С ней сторнирование с минусом не работает 101.38804
if(RДоходИтог1<>0,String(Доход1_1),'')
if(RДоходИтог1<>0,String(Доход1_2),'')
if(RДоходИтог1<>0,String(Доход1_3),'')
if(RДоходИтог1<>0,String(Доход1_4),'')
if(RДоходИтог1<>0,String(Доход1_5),'')
if(RДоходИтог1<>0,String(Доход1_6),'')
if(RДоходИтог1<>0,String(Доход1_7),'')
if(RДоходИтог1<>0,String(Доход1_8),'')
if(RДоходИтог1<>0,String(Доход1_9),'')
if(RДоходИтог1<>0,String(Доход1_10),'')
if(RДоходИтог1<>0,String(Доход1_11),'')
if(RДоходИтог1<>0,String(Доход1_12),'')
if(RДоходИтог1<>0,String(RДоходИтог1),'')
*/

String(Доход1_1)
String(Доход1_2)
String(Доход1_3)
String(Доход1_4)
String(Доход1_5)
String(Доход1_6)
String(Доход1_7)
String(Доход1_8)
String(Доход1_9)
String(Доход1_10)
String(Доход1_11)
String(Доход1_12)
String(RДоходИтог1)

КодВычета1
if(trim(КодВычета1)<> '',String(Вычет1_1),'')
if(trim(КодВычета1)<> '',String(Вычет1_2),'')
if(trim(КодВычета1)<> '',String(Вычет1_3),'')
if(trim(КодВычета1)<> '',String(Вычет1_4),'')
if(trim(КодВычета1)<> '',String(Вычет1_5),'')
if(trim(КодВычета1)<> '',String(Вычет1_6),'')
if(trim(КодВычета1)<> '',String(Вычет1_7),'')
if(trim(КодВычета1)<> '',String(Вычет1_8),'')
if(trim(КодВычета1)<> '',String(Вычет1_9),'')
if(trim(КодВычета1)<> '',String(Вычет1_10),'')
if(trim(КодВычета1)<> '',String(Вычет1_11),'')
if(trim(КодВычета1)<> '',String(Вычет1_12),' ')
if(trim(КодВычета1)<> '',String(RВычетИтог1),'')

КодВычета2
if(trim(КодВычета2)<> '',String(Вычет2_1),'')
if(trim(КодВычета2)<> '',String(Вычет2_2),'')
if(trim(КодВычета2)<> '',String(Вычет2_3),'')
if(trim(КодВычета2)<> '',String(Вычет2_4),'')
if(trim(КодВычета2)<> '',String(Вычет2_5),'')
if(trim(КодВычета2)<> '',String(Вычет2_6),'')
if(trim(КодВычета2)<> '',String(Вычет2_7),'')
if(trim(КодВычета2)<> '',String(Вычет2_8),'')
if(trim(КодВычета2)<> '',String(Вычет2_9),'')
if(trim(КодВычета2)<> '',String(Вычет2_10),'')
if(trim(КодВычета2)<> '',String(Вычет2_11),'')
if(trim(КодВычета2)<> '',String(Вычет2_12),'')
if(trim(КодВычета2)<> '',String(RВычетИтог2),'')

КодВычета3
if(trim(КодВычета3)<> '',String(Вычет3_1),'')
if(trim(КодВычета3)<> '',String(Вычет3_2),'')
if(trim(КодВычета3)<> '',String(Вычет3_3),'')
if(trim(КодВычета3)<> '',String(Вычет3_4),'')
if(trim(КодВычета3)<> '',String(Вычет3_5),'')
if(trim(КодВычета3)<> '',String(Вычет3_6),'')
if(trim(КодВычета3)<> '',String(Вычет3_7),'')
if(trim(КодВычета3)<> '',String(Вычет3_8),'')
if(trim(КодВычета3)<> '',String(Вычет3_9),'')
if(trim(КодВычета3)<> '',String(Вычет3_10),'')
if(trim(КодВычета3)<> '',String(Вычет3_11),'')
if(trim(КодВычета3)<> '',String(Вычет3_12),'')
if(trim(КодВычета3)<> '',String(RВычетИтог3),'')

КодВычета4
if(trim(КодВычета4)<> '',String(Вычет4_1),'')
if(trim(КодВычета4)<> '',String(Вычет4_2),'')
if(trim(КодВычета4)<> '',String(Вычет4_3),'')
if(trim(КодВычета4)<> '',String(Вычет4_4),'')
if(trim(КодВычета4)<> '',String(Вычет4_5),'')
if(trim(КодВычета4)<> '',String(Вычет4_6),'')
if(trim(КодВычета4)<> '',String(Вычет4_7),'')
if(trim(КодВычета4)<> '',String(Вычет4_8),'')
if(trim(КодВычета4)<> '',String(Вычет4_9),'')
if(trim(КодВычета4)<> '',String(Вычет4_10),'')
if(trim(КодВычета4)<> '',String(Вычет4_11),'')
if(trim(КодВычета4)<> '',String(Вычет4_12),'')
if(trim(КодВычета4)<> '',String(RВычетИтог4),'')
.endfields
.begin
   for(i := 1; i <= 12; i := i + 1)
   {
     RСтандВычет1[i] := 0;
     RСтандВычет2[i] := 0;
     RСтандВычет3[i] := 0;
     RСтандВычет4[i] := 0;
     RСтандВычет5[i] := 0;
     RСтандВычет6[i] := 0;
     RСтандВычет7[i] := 0;

     RДОходМес[i]    := 0;
     RВычетМес[i]    := 0;
     RNeOblМес[i]    := 0;
     RСтандВычетНГ[i]:= 0;
    }
    RДоходИтог := 0; RВычетИтог := 0; RNeOblИтог := 0;
end.
   ┌───────────────────────────────┬─────────────────────────────────────┬──────────────────────────┐
   │ На начало налогового          │Долг по налогу за налогоплательщиком │      &~#&&&&&&&&&&&.&&   │
   │       периода                 ├─────────────────────────────────────┼──────────────────────────┤ ┌───────────────────────────────────────────────────────────────────┬────────────────────┐
   │                               │Долг по налогу за налоговым агентом  │      &~#&&&&&&&&&&&.&&   │ │Сумма дохода, облагаемого по ставке 13% с предыдущего места работы:│ &#&&&&&&&&&&&&.&&  │
   ├───────────────────────────────┼───────────┬───────────┬───────────┬─┴─────────┬───────────┬────┴─┴────┬───────────┬───────────┬───────────┬───────────┬───────────┬──┴────────┬───────────┤
   │Наименование показателя        │   Январь  │  Февраль  │   Март    │   Апрель  │    Май    │    Июнь   │     Июль  │  Август   │  Сентябрь │  Октябрь  │   Ноябрь  │  Декабрь  │  Итого    │
   ├───────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
.{ DoxodLoop1_2005 CheckEnter
.begin
  RДоходИтог1:= 0;
  RДоходИтог1:= RДоходИтог1 + Доход1_1 + Доход1_2 + Доход1_3 +Доход1_4 +Доход1_5 + Доход1_6 +
  Доход1_7 + Доход1_8 + Доход1_9 +Доход1_10 + Доход1_11 +Доход1_12;
  RДоходИтог := RДоходИтог + RДоходИтог1;
      RДОходМес[1] := RДОходМес[1] + Доход1_1;
      RДОходМес[2] := RДОходМес[2] + Доход1_2;
      RДОходМес[3] := RДОходМес[3] + Доход1_3;
      RДОходМес[4] := RДОходМес[4] + Доход1_4;
      RДОходМес[5] := RДОходМес[5] + Доход1_5;
      RДОходМес[6] := RДОходМес[6] + Доход1_6;
      RДОходМес[7] := RДОходМес[7] + Доход1_7;
      RДОходМес[8] := RДОходМес[8] + Доход1_8;
      RДОходМес[9] := RДОходМес[9] + Доход1_9;
      RДОходМес[10]:= RДОходМес[10]+ Доход1_10;
      RДОходМес[11]:= RДОходМес[11]+ Доход1_11;
      RДОходМес[12]:= RДОходМес[12]+ Доход1_12;
end.
   │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
.}
   ├───────────────┬───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
.begin
    RВычетИтог1:= 0;
    RВычетИтог1:= Вычет1_1 + Вычет1_2 +Вычет1_3 + Вычет1_4 + Вычет1_5 + Вычет1_6 +
                  Вычет1_7 + Вычет1_8 +Вычет1_9 + Вычет1_10 + Вычет1_11 + Вычет1_12;
    RВычетИтог:= RВычетИтог + RВычетИтог1;
    RВычетМес[1] := RВычетМес[1] + Вычет1_1;
    RВычетМес[2] := RВычетМес[2] + Вычет1_2;
    RВычетМес[3] := RВычетМес[3] + Вычет1_3;
    RВычетМес[4] := RВычетМес[4] + Вычет1_4;
    RВычетМес[5] := RВычетМес[5] + Вычет1_5;
    RВычетМес[6] := RВычетМес[6] + Вычет1_6;
    RВычетМес[7] := RВычетМес[7] + Вычет1_7;
    RВычетМес[8] := RВычетМес[8] + Вычет1_8;
    RВычетМес[9] := RВычетМес[9] + Вычет1_9;
    RВычетМес[10]:= RВычетМес[10]+ Вычет1_10;
    RВычетМес[11]:= RВычетМес[11]+ Вычет1_11;
    RВычетМес[12]:= RВычетМес[12]+ Вычет1_12;

    RВычетИтог2:= 0;
    RВычетИтог2:= Вычет2_1 + Вычет2_2 + Вычет2_3 + Вычет2_4 + Вычет2_5 + Вычет2_6 +
    Вычет2_7 + Вычет2_8 + Вычет2_9 + Вычет2_10 + Вычет2_11 + Вычет2_12;
    RВычетИтог := RВычетИтог + RВычетИтог2;
    RВычетМес[1] := RВычетМес[1] + Вычет2_1;
    RВычетМес[2] := RВычетМес[2] + Вычет2_2;
    RВычетМес[3] := RВычетМес[3] + Вычет2_3;
    RВычетМес[4] := RВычетМес[4] + Вычет2_4;
    RВычетМес[5] := RВычетМес[5] + Вычет2_5;
    RВычетМес[6] := RВычетМес[6] + Вычет2_6;
    RВычетМес[7] := RВычетМес[7] + Вычет2_7;
    RВычетМес[8] := RВычетМес[8] + Вычет2_8;
    RВычетМес[9] := RВычетМес[9] + Вычет2_9;
    RВычетМес[10]:= RВычетМес[10]+ Вычет2_10;
    RВычетМес[11]:= RВычетМес[11]+ Вычет2_11;
    RВычетМес[12]:= RВычетМес[12]+ Вычет2_12;

    RВычетИтог3:= 0;
    RВычетИтог3 :=  Вычет3_1 + Вычет3_2 + Вычет3_3 + Вычет3_4 + Вычет3_5 + Вычет3_6 +
                    Вычет3_7 + Вычет3_8 + Вычет3_9 + Вычет3_10 +Вычет3_11 + Вычет3_12;
    RВычетИтог := RВычетИтог + RВычетИтог3;
    RВычетМес[1] := RВычетМес[1] + Вычет3_1;
    RВычетМес[2] := RВычетМес[2] + Вычет3_2;
    RВычетМес[3] := RВычетМес[3] + Вычет3_3;
    RВычетМес[4] := RВычетМес[4] + Вычет3_4;
    RВычетМес[5] := RВычетМес[5] + Вычет3_5;
    RВычетМес[6] := RВычетМес[6] + Вычет3_6;
    RВычетМес[7] := RВычетМес[7] + Вычет3_7;
    RВычетМес[8] := RВычетМес[8] + Вычет3_8;
    RВычетМес[9] := RВычетМес[9] + Вычет3_9;
    RВычетМес[10]:= RВычетМес[10]+ Вычет3_10;
    RВычетМес[11]:= RВычетМес[11]+ Вычет3_11;
    RВычетМес[12]:= RВычетМес[12]+ Вычет3_12;
end. Ш
 Ш   │Налоговые выче-│ Код @@@@      │&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│
   │ты, за исклю-  ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │чением         │ Код @@@@      │&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│
   │стандартных    ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │               │ Код @@@@      │&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│
 Ш.{ LastVychLoop1_2005 CheckEnter
 Ш   │               ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш.begin
    RВычетИтог4 := 0;
    RВычетИтог4 := Вычет4_1 + Вычет4_2 + Вычет4_3 + Вычет4_4 +  Вычет4_5 + Вычет4_6 +
                   Вычет4_7 + Вычет4_8 + Вычет4_9 + Вычет4_10 + Вычет4_11 + Вычет4_12;
    RВычетИтог := RВычетИтог + RВычетИтог4;
    RВычетМес[1] := RВычетМес[1] + Вычет4_1;
    RВычетМес[2] := RВычетМес[2] + Вычет4_2;
    RВычетМес[3] := RВычетМес[3] + Вычет4_3;
    RВычетМес[4] := RВычетМес[4] + Вычет4_4;
    RВычетМес[5] := RВычетМес[5] + Вычет4_5;
    RВычетМес[6] := RВычетМес[6] + Вычет4_6;
    RВычетМес[7] := RВычетМес[7] + Вычет4_7;
    RВычетМес[8] := RВычетМес[8] + Вычет4_8;
    RВычетМес[9] := RВычетМес[9] + Вычет4_9;
    RВычетМес[10]:= RВычетМес[10]+ Вычет4_10;
    RВычетМес[11]:= RВычетМес[11]+ Вычет4_11;
    RВычетМес[12]:= RВычетМес[12]+ Вычет4_12;
end.
   │               │ Код @@@@      │&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│
.}
.begin
    RNeOblИтог:= NeObl_1 + NeObl_2 + NeObl_3 + NeObl_4 + NeObl_5 + NeObl_6 +
                 NeObl_7 + NeObl_8 + NeObl_9 + NeObl_10 + NeObl_11 + NeObl_12;

    if Статус = '1'
    {
      RNeOblМес[1] := NeObl_1;
      RNeOblМес[2] := RNeOblМес[1] + NeObl_2;
      RNeOblМес[3] := RNeOblМес[2] + NeObl_3;
      RNeOblМес[4] := RNeOblМес[3] + NeObl_4;
      RNeOblМес[5] := RNeOblМес[4] + NeObl_5;
      RNeOblМес[6] := RNeOblМес[5] + NeObl_6;
      RNeOblМес[7] := RNeOblМес[6] + NeObl_7;
      RNeOblМес[8] := RNeOblМес[7] + NeObl_8;
      RNeOblМес[9] := RNeOblМес[8] + NeObl_9;
      RNeOblМес[10]:= RNeOblМес[9] + NeObl_10;
      RNeOblМес[11]:= RNeOblМес[10]+ NeObl_11;
      RNeOblМес[12]:= RNeOblМес[11]+ NeObl_12;
    }
    else
    {
      RNeOblМес[1] := NeObl_1;
      RNeOblМес[2] := NeObl_2;
      RNeOblМес[3] := NeObl_3;
      RNeOblМес[4] := NeObl_4;
      RNeOblМес[5] := NeObl_5;
      RNeOblМес[6] := NeObl_6;
      RNeOblМес[7] := NeObl_7;
      RNeOblМес[8] := NeObl_8;
      RNeOblМес[9] := NeObl_9;
      RNeOblМес[10]:= NeObl_10;
      RNeOblМес[11]:= NeObl_11;
      RNeOblМес[12]:= NeObl_12;

    }

end.
.begin
  for(i := 1; i <= 12; i := i + 1)
  {
    RЗаГод  [i]:= 0;
    RЗаМесяц[i]:= 0;
  }

  for(i := 1; i <= 12; i := i + 1)
  {
    RЗаМесяц[i] := RДОходМес[i] - RВычетМес[i];
    if i=1
      RЗаГод[i] :=  RЗаМесяц[i]
    else
      RЗаГод[i] := RЗаГод[i-1] + RЗаМесяц[i];
  }

!  if ((ЗаГод < YearRas1) and (PrevChild1 >= RЗаГод[1]) or (ЗаГод >= YearRas1))
  {
    RСтандВычет1[1] := СтандВычет1_1 //101
    RСтандВычет2[1] := СтандВычет2_1 //102
    RСтандВычет6[1] := СтандВычет6_1 //106
    RСтандВычет7[1] := СтандВычет7_1 //107
  }

    RСтандВычет1[2] := СтандВычет1_2
    RСтандВычет2[2] := СтандВычет2_2
    RСтандВычет6[2] := СтандВычет6_2 //106
    RСтандВычет7[2] := СтандВычет7_2 //107

    RСтандВычет1[3] := СтандВычет1_3
    RСтандВычет2[3] := СтандВычет2_3
    RСтандВычет6[3] := СтандВычет6_3 //106
    RСтандВычет7[3] := СтандВычет7_3 //107

    RСтандВычет1[4] := СтандВычет1_4
    RСтандВычет2[4] := СтандВычет2_4
    RСтандВычет6[4] := СтандВычет6_4 //106
    RСтандВычет7[4] := СтандВычет7_4 //107

    RСтандВычет1[5] := СтандВычет1_5
    RСтандВычет2[5] := СтандВычет2_5
    RСтандВычет6[5] := СтандВычет6_5 //106
    RСтандВычет7[5] := СтандВычет7_5 //107

    RСтандВычет1[6] := СтандВычет1_6
    RСтандВычет2[6] := СтандВычет2_6
    RСтандВычет6[6] := СтандВычет6_6 //106
    RСтандВычет7[6] := СтандВычет7_6 //107

    RСтандВычет1[7] := СтандВычет1_7
    RСтандВычет2[7] := СтандВычет2_7
    RСтандВычет6[7] := СтандВычет6_7 //106
    RСтандВычет7[7] := СтандВычет7_7 //107

    RСтандВычет1[8] := СтандВычет1_8
    RСтандВычет2[8] := СтандВычет2_8
    RСтандВычет6[8] := СтандВычет6_8 //106
    RСтандВычет7[8] := СтандВычет7_8 //107

    RСтандВычет1[9] := СтандВычет1_9
    RСтандВычет2[9] := СтандВычет2_9
    RСтандВычет6[9] := СтандВычет6_9 //106
    RСтандВычет7[9] := СтандВычет7_9 //107



    RСтандВычет1[10] := СтандВычет1_10
    RСтандВычет2[10] := СтандВычет2_10
    RСтандВычет6[10] := СтандВычет6_10 //106
    RСтандВычет7[10] := СтандВычет7_10 //107

    RСтандВычет1[11] := СтандВычет1_11
    RСтандВычет2[11] := СтандВычет2_11
    RСтандВычет6[11] := СтандВычет6_11 //106
    RСтандВычет7[11] := СтандВычет7_11 //107

    RСтандВычет1[12] := СтандВычет1_12
    RСтандВычет2[12] := СтандВычет2_12
    RСтандВычет6[12] := СтандВычет6_12 //106
    RСтандВычет7[12] := СтандВычет7_12 //107

  RСтандВычетИтог1 := RСтандВычет1[1] + RСтандВычет1[2] + RСтандВычет1[3] + RСтандВычет1[4] + RСтандВычет1[5] +
                      RСтандВычет1[6] + RСтандВычет1[7] + RСтандВычет1[8] + RСтандВычет1[9] + RСтандВычет1[10] +
                      RСтандВычет1[11] + RСтандВычет1[12];

  RСтандВычетИтог2 := RСтандВычет2[1] + RСтандВычет2[2] + RСтандВычет2[3] + RСтандВычет2[4] + RСтандВычет2[5] +
                      RСтандВычет2[6] + RСтандВычет2[7] + RСтандВычет2[8] + RСтандВычет2[9] + RСтандВычет2[10] +
                      RСтандВычет2[11] + RСтандВычет2[12];

  RСтандВычетИтог6 := RСтандВычет6[1] + RСтандВычет6[2] + RСтандВычет6[3] + RСтандВычет6[4] + RСтандВычет6[5] +
                      RСтандВычет6[6] + RСтандВычет6[7] + RСтандВычет6[8] + RСтандВычет6[9] + RСтандВычет6[10] +
                      RСтандВычет6[11] + RСтандВычет6[12];

  RСтандВычетИтог7 := RСтандВычет7[1] + RСтандВычет7[2] + RСтандВычет7[3] + RСтандВычет7[4] + RСтандВычет7[5] +
                      RСтандВычет7[6] + RСтандВычет7[7] + RСтандВычет7[8] + RСтандВычет7[9] + RСтандВычет7[10] +
                      RСтандВычет7[11] + RСтандВычет7[12];

    RСтандВычет3[1] := СтандВычет3_1 //103
    RСтандВычет4[1] := СтандВычет4_1 //104
    RСтандВычет5[1] := СтандВычет5_1 //105

    RСтандВычет3[2] := СтандВычет3_2 //103
    RСтандВычет4[2] := СтандВычет4_2 //104

    RСтандВычет5[2] := СтандВычет5_2 //105
    RСтандВычет3[3] := СтандВычет3_3 //103
    RСтандВычет4[3] := СтандВычет4_3 //104
    RСтандВычет5[3] := СтандВычет5_3 //105

    RСтандВычет3[4] := СтандВычет3_4 //103
    RСтандВычет4[4] := СтандВычет4_4 //104
    RСтандВычет5[4] := СтандВычет5_4 //105

    RСтандВычет3[5] := СтандВычет3_5 //103
    RСтандВычет4[5] := СтандВычет4_5 //104
    RСтандВычет5[5] := СтандВычет5_5 //105

    RСтандВычет3[6] := СтандВычет3_6 //103
    RСтандВычет4[6] := СтандВычет4_6 //104
    RСтандВычет5[6] := СтандВычет5_6 //105

    RСтандВычет3[7] := СтандВычет3_7 //103
    RСтандВычет4[7] := СтандВычет4_7 //104
    RСтандВычет5[7] := СтандВычет5_7 //105

    RСтандВычет3[8] := СтандВычет3_8 //103
    RСтандВычет4[8] := СтандВычет4_8 //104
    RСтандВычет5[8] := СтандВычет5_8 //105

    RСтандВычет3[9] := СтандВычет3_9 //103
    RСтандВычет4[9] := СтандВычет4_9 //104
    RСтандВычет5[9] := СтандВычет5_9 //105

    RСтандВычет3[10] := СтандВычет3_10 //103
    RСтандВычет4[10] := СтандВычет4_10 //104
    RСтандВычет5[10] := СтандВычет5_10 //105

    RСтандВычет3[11] := СтандВычет3_11 //103
    RСтандВычет4[11] := СтандВычет4_11 //104
    RСтандВычет5[11] := СтандВычет5_11 //105

    RСтандВычет3[12] := СтандВычет3_12 //103
    RСтандВычет4[12] := СтандВычет4_12 //104
    RСтандВычет5[12] := СтандВычет5_12 //105

  RСтандВычетИтог3 := RСтандВычет3[1] + RСтандВычет3[2] + RСтандВычет3[3] + RСтандВычет3[4] + RСтандВычет3[5] +
                      RСтандВычет3[6] + RСтандВычет3[7] + RСтандВычет3[8] + RСтандВычет3[9] + RСтандВычет3[10] +
                      RСтандВычет3[11] + RСтандВычет3[12];

  RСтандВычетИтог4 := RСтандВычет4[1] + RСтандВычет4[2] + RСтандВычет4[3] + RСтандВычет4[4] + RСтандВычет4[5] +
                      RСтандВычет4[6] + RСтандВычет4[7] + RСтандВычет4[8] + RСтандВычет4[9] + RСтандВычет4[10] +
                      RСтандВычет4[11] + RСтандВычет4[12];

  RСтандВычетИтог5 := RСтандВычет5[1] + RСтандВычет5[2] + RСтандВычет5[3] + RСтандВычет5[4] + RСтандВычет5[5] +
                      RСтандВычет5[6] + RСтандВычет5[7] + RСтандВычет5[8] + RСтандВычет5[9] + RСтандВычет5[10] +
                      RСтандВычет5[11] + RСтандВычет5[12];

end.
.fields
RЗаМесяц[1] RЗаМесяц[2] RЗаМесяц[3] RЗаМесяц[4] RЗаМесяц[5]
RЗаМесяц[6] RЗаМесяц[7] RЗаМесяц[8] RЗаМесяц[9] RЗаМесяц[10] RЗаМесяц[11] RЗаМесяц[12]
(RДоходИтог - RВычетИтог)

if(trim(Статус)= '1',String(RЗаГод[1]),'') if(trim(Статус)= '1',String(RЗаГод[2]),'')
if(trim(Статус)= '1',String(RЗаГод[3]),'') if(trim(Статус)= '1',String(RЗаГод[4]),'')
if(trim(Статус)= '1',String(RЗаГод[5]),'') if(trim(Статус)= '1',String(RЗаГод[6]),'')
if(trim(Статус)= '1',String(RЗаГод[7]),'') if(trim(Статус)= '1',String(RЗаГод[8]),'')
if(trim(Статус)= '1',String(RЗаГод[9]),'') if(trim(Статус)= '1',String(RЗаГод[10]),'')
if(trim(Статус)= '1',String(RЗаГод[11]),'') if(trim(Статус)= '1',String(RЗаГод[12]),'')
if(trim(Статус) = '1',String(RЗаГод[12]),'')

RСтандВычет1[1]  RСтандВычет1[2]
RСтандВычет1[3]  RСтандВычет1[4]
RСтандВычет1[5]  RСтандВычет1[6]
RСтандВычет1[7]  RСтандВычет1[8]
RСтандВычет1[9]  RСтандВычет1[10]
RСтандВычет1[11] RСтандВычет1[12]
RСтандВычетИтог1
RСтандВычет2[1]  RСтандВычет2[2]
RСтандВычет2[3]  RСтандВычет2[4]
RСтандВычет2[5]  RСтандВычет2[6]
RСтандВычет2[7]  RСтандВычет2[8]
RСтандВычет2[9]  RСтандВычет2[10]
RСтандВычет2[11] RСтандВычет2[12]
RСтандВычетИтог2
RСтандВычет3[1]  RСтандВычет3[2]
RСтандВычет3[3]  RСтандВычет3[4]
RСтандВычет3[5]  RСтандВычет3[6]
RСтандВычет3[7]  RСтандВычет3[8]
RСтандВычет3[9]  RСтандВычет3[10]
RСтандВычет3[11] RСтандВычет3[12]
RСтандВычетИтог3
RСтандВычет4[1] RСтандВычет4[2]
RСтандВычет4[3] RСтандВычет4[4]
RСтандВычет4[5] RСтандВычет4[6]
RСтандВычет4[7] RСтандВычет4[8]
RСтандВычет4[9] RСтандВычет4[10]
RСтандВычет4[11] RСтандВычет4[12]
RСтандВычетИтог4

RСтандВычет5[1]  RСтандВычет5[2]
RСтандВычет5[3]  RСтандВычет5[4]
RСтандВычет5[5]  RСтандВычет5[6]
RСтандВычет5[7]  RСтандВычет5[8]
RСтандВычет5[9]  RСтандВычет5[10]
RСтандВычет5[11] RСтандВычет5[12]
RСтандВычетИтог5

RСтандВычет6[1] RСтандВычет6[2]
RСтандВычет6[3] RСтандВычет6[4]
RСтандВычет6[5] RСтандВычет6[6]
RСтандВычет6[7] RСтандВычет6[8]
RСтандВычет6[9]
RСтандВычет6[10] RСтандВычет6[11] RСтандВычет6[12]
RСтандВычетИтог6

RСтандВычет7[1]  RСтандВычет7[2]
RСтандВычет7[3]  RСтандВычет7[4]
RСтандВычет7[5]  RСтандВычет7[6]
RСтандВычет7[7]  RСтандВычет7[8]
RСтандВычет7[9]  RСтандВычет7[10]
RСтандВычет7[11] RСтандВычет7[12]
RСтандВычетИтог7
.endfields
   ├───────────────┼───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │Общая сумма    │ За месяц      │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
   │доходов за     ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │минусом вычетов│ С начала года │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
   ├───────────────┼───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
.begin
  RСтандВычетИтог1 := RСтандВычет1[1] + RСтандВычет1[2] + RСтандВычет1[3] + RСтандВычет1[4] + RСтандВычет1[5] +
                      RСтандВычет1[6] + RСтандВычет1[7] + RСтандВычет1[8] + RСтандВычет1[9] + RСтандВычет1[10] +
                      RСтандВычет1[11] + RСтандВычет1[12];

  RСтандВычетИтог2 := RСтандВычет2[1] + RСтандВычет2[2] + RСтандВычет2[3] + RСтандВычет2[4] + RСтандВычет2[5] +
                      RСтандВычет2[6] + RСтандВычет2[7] + RСтандВычет2[8] + RСтандВычет2[9] + RСтандВычет2[10] +
                      RСтандВычет2[11] + RСтандВычет2[12];

  RСтандВычетИтог3 := RСтандВычет3[1]+ RСтандВычет3[2] + RСтандВычет3[3] + RСтандВычет3[4] + RСтандВычет3[5] +
                      RСтандВычет3[6]+ RСтандВычет3[7] + RСтандВычет3[8] + RСтандВычет3[9] + RСтандВычет3[10] +
                      RСтандВычет3[11] +RСтандВычет3[12];

  RСтандВычетИтог4 := RСтандВычет4[1] + RСтандВычет4[2] + RСтандВычет4[3] + RСтандВычет4[4] + RСтандВычет4[5] +
                        RСтандВычет4[6] + RСтандВычет4[7] + RСтандВычет4[8] + RСтандВычет4[9] + RСтандВычет4[10] +
                        RСтандВычет4[11] + RСтандВычет4[12];

  RСтандВычетИтог5 := RСтандВычет5[1] + RСтандВычет5[2] + RСтандВычет5[3] + RСтандВычет5[4] + RСтандВычет5[5] +
                      RСтандВычет5[6] + RСтандВычет5[7] + RСтандВычет5[8] + RСтандВычет5[9] + RСтандВычет5[10] +
                      RСтандВычет5[11] + RСтандВычет5[12];

RСтандВычетИтог6 := RСтандВычет6[1] + RСтандВычет6[2] + RСтандВычет6[3] + RСтандВычет6[4] + RСтандВычет6[5] +
                    RСтандВычет6[6] + RСтандВычет6[7] + RСтандВычет6[8] + RСтандВычет6[9] + RСтандВычет6[10] +
                    RСтандВычет6[11] + RСтандВычет6[12];

RСтандВычетИтог7 := RСтандВычет7[1] + RСтандВычет7[2] + RСтандВычет7[3] + RСтандВычет7[4] + RСтандВычет7[5] +
                    RСтандВычет7[6] + RСтандВычет7[7] + RСтандВычет7[8] + RСтандВычет7[9] + RСтандВычет7[10] +
                    RСтандВычет7[11] + RСтандВычет7[12];
end.
   │Стандартные    │За месяц (101) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
   │налоговые      ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │вычеты         │За месяц (102) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
   │(статья 218    ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │Налогового     │За месяц (103) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
   │кодекса        │───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │Российской     │За месяц (104) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
   │Федерации)     ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │               │За месяц (105) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
   │               ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │               │За месяц (106) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
   │               ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │               │За месяц (107) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
.begin
 RСтандВычетНГ[1] := RСтандВычет1[1] + RСтандВычет2[1] + RСтандВычет3[1] + RСтандВычет4[1] + RСтандВычет5[1] +
                     RСтандВычет6[1] + RСтандВычет7[1];
 RСтандВычетНГ[2] := RСтандВычетНГ[1]+ RСтандВычет1[2] + RСтандВычет2[2] + RСтандВычет3[2] + RСтандВычет4[2] +
                     RСтандВычет5[2] + RСтандВычет6[2] + RСтандВычет7[2] ;
 RСтандВычетНГ[3] := RСтандВычетНГ[2] + RСтандВычет1[3] + RСтандВычет2[3] + RСтандВычет3[3] + RСтандВычет4[3] +
                     RСтандВычет5[3] + RСтандВычет6[3] + RСтандВычет7[3] ;
 RСтандВычетНГ[4] := RСтандВычетНГ[3] + RСтандВычет1[4] + RСтандВычет2[4] + RСтандВычет3[4] + RСтандВычет4[4] +
                     RСтандВычет5[4] + RСтандВычет6[4] + RСтандВычет7[4] ;
 RСтандВычетНГ[5] := RСтандВычетНГ[4] + RСтандВычет1[5] + RСтандВычет2[5] + RСтандВычет3[5] + RСтандВычет4[5] +
                     RСтандВычет5[5] + RСтандВычет6[5] + RСтандВычет7[5] ;
 RСтандВычетНГ[6] := RСтандВычетНГ[5] + RСтандВычет1[6] + RСтандВычет2[6] + RСтандВычет3[6] + RСтандВычет4[6] +
                     RСтандВычет5[6] + RСтандВычет6[6] + RСтандВычет7[6] ;
 RСтандВычетНГ[7] := RСтандВычетНГ[6] + RСтандВычет1[7] + RСтандВычет2[7] + RСтандВычет3[7] + RСтандВычет4[7] +
                     RСтандВычет5[7] + RСтандВычет6[7] + RСтандВычет7[7] ;
 RСтандВычетНГ[8] := RСтандВычетНГ[7] + RСтандВычет1[8] + RСтандВычет2[8] + RСтандВычет3[8] + RСтандВычет4[8] +
                     RСтандВычет5[8] + RСтандВычет6[8] + RСтандВычет7[8] ;
 RСтандВычетНГ[9] := RСтандВычетНГ[8] + RСтандВычет1[9] + RСтандВычет2[9] + RСтандВычет3[9] + RСтандВычет4[9] +
                     RСтандВычет5[9] + RСтандВычет6[9] + RСтандВычет7[9] ;
 RСтандВычетНГ[10]:= RСтандВычетНГ[9] + RСтандВычет1[10]+ RСтандВычет2[10]+ RСтандВычет3[10]+ RСтандВычет4[10]+
                     RСтандВычет5[10]+ RСтандВычет6[10]+ RСтандВычет7[10];
 RСтандВычетНГ[11]:= RСтандВычетНГ[10]+ RСтандВычет1[11]+ RСтандВычет2[11]+ RСтандВычет3[11]+ RСтандВычет4[11]+
                     RСтандВычет5[11]+ RСтандВычет6[11]+ RСтандВычет7[11];
 RСтандВычетНГ[12]:= RСтандВычетНГ[11]+ RСтандВычет1[12]+ RСтандВычет2[12]+ RСтандВычет3[12]+ RСтандВычет4[12]+
                     RСтандВычет5[12]+ RСтандВычет6[12]+ RСтандВычет7[12];
end.
.fields
RСтандВычетНГ[1] RСтандВычетНГ[2] RСтандВычетНГ[3] RСтандВычетНГ[4] RСтандВычетНГ[5] RСтандВычетНГ[6]
RСтандВычетНГ[7] RСтандВычетНГ[8] RСтандВычетНГ[9] RСтандВычетНГ[10] RСтандВычетНГ[11] RСтандВычетНГ[12]
  (RСтандВычетИтог1 + RСтандВычетИтог2 +  RСтандВычетИтог3
+  RСтандВычетИтог4 + RСтандВычетИтог5 +  RСтандВычетИтог6 + RСтандВычетИтог7)
.endfields Ш
 Ш   │               ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │               │Общая сумма    │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │               │с начала года  │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   ├───────────────┴───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
.{ Card2005_Imu CheckEnter
.begin
  RОстИмущВычета13 := ОстИмущВычета12 - (ОстИмущВычета11 - ОстИмущВычета12);
!  RИмущВычет13 := ИмущВычет12 - (ИмущВычет11 - ИмущВычет12);
  RИмущВычет13 := ИмущВычет12;
end.
.fields
  ОстИмущВычета1 ОстИмущВычета2 ОстИмущВычета3 ОстИмущВычета4  ОстИмущВычета5  ОстИмущВычета6
  ОстИмущВычета7 ОстИмущВычета8 ОстИмущВычета9 ОстИмущВычета10 ОстИмущВычета11 ОстИмущВычета12
  RОстИмущВычета13
  ИмущВычет1 ИмущВычет2 ИмущВычет3 ИмущВычет4  ИмущВычет5  ИмущВычет6
  ИмущВычет7 ИмущВычет8 ИмущВычет9 ИмущВычет10 ИмущВычет11 ИмущВычет12 RИмущВычет13
.endfields Ш
 Ш   │Остаток вычета на начало месяца│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   ├───────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │Сумма использованного имущест- │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │венного налогового вычета      │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │нарастающим итогом             │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
   ├───────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
.begin
  RИмущВычет[1] := ИмущВычет1;
  RИмущВычет[2] := ИмущВычет2;
  RИмущВычет[3] := ИмущВычет3;
  RИмущВычет[4] := ИмущВычет4;
  RИмущВычет[5] := ИмущВычет5;
  RИмущВычет[6] := ИмущВычет6;
  RИмущВычет[7] := ИмущВычет7;
  RИмущВычет[8] := ИмущВычет8;
  RИмущВычет[9] := ИмущВычет9;
  RИмущВычет[10] := ИмущВычет10;
  RИмущВычет[11] := ИмущВычет11;
  RИмущВычет[12] := ИмущВычет12;
end.
.}
.begin
  for(i := 1; i <= 13; i := i + 1)
  {
    RВзыскание[i]   := 0;
    RДолгНалПлат[i] := 0;
    RДолгНалАгент[i]:= 0;
  }

  RОстИмущВычета13 := 0;
  RИмущВычет13 := 0;

  for(i := 1; i <= 13; i := i + 1)
  {
    RНалогИсчисл[i] := 0
    RНалогУдер[i] := 0
    RНалогБаза[i] := 0
    RNalPred63[i] := 0;
    RNalPred64[i] := 0;
  }

  if Статус = '1'
  {
 И    if ( ( not boGetTune('UP.ZAR.XP.DATE0') ) and  // разница по вычетам не переносится Р
          ( ( PrizGod ) or  // разница по вычетам не переносится Р
            ( coGetTune('UP.TekBud') = 1 ) ) )  // разница по вычетам не переносится Р
    {
 Ш    RНалогБаза[1] := RЗаГод[1] - RealVich1 - RNeOblМес[1]
      RНалогБаза[2] := RЗаГод[2] - RealVich1 - RealVich2 -  RNeOblМес[2]
      RНалогБаза[3] := RЗаГод[3] - RealVich1 - RealVich2 - RealVich3 -  RNeOblМес[3]
      RНалогБаза[4] := RЗаГод[4] - RealVich1 - RealVich2 - RealVich3 - RealVich4 -  RNeOblМес[4]
      RНалогБаза[5] := RЗаГод[5] - RealVich1 - RealVich2 - RealVich3 - RealVich4 - RealVich5 -  RNeOblМес[5]
      RНалогБаза[6] := RЗаГод[6] - RealVich1 - RealVich2 - RealVich3 - RealVich4 - RealVich5 - RealVich6 -  RNeOblМес[6]
      RНалогБаза[7] := RЗаГод[7] - RealVich1 - RealVich2 - RealVich3 - RealVich4 - RealVich5 - RealVich6 - RealVich7 -
                       RNeOblМес[7]
      RНалогБаза[8] := RЗаГод[8] - RealVich1 - RealVich2 - RealVich3 - RealVich4 - RealVich5 - RealVich6 - RealVich7 -
                       RealVich8 - RNeOblМес[8]
      RНалогБаза[9] := RЗаГод[9] - RealVich1 - RealVich2 - RealVich3 - RealVich4 - RealVich5 - RealVich6 - RealVich7 -
                       RealVich8 - RealVich9 -  RNeOblМес[9]
      RНалогБаза[10] :=RЗаГод[10] - RealVich1 - RealVich2 - RealVich3 - RealVich4 - RealVich5 - RealVich6 - RealVich7 -
                       RealVich8 - RealVich9 - RealVich10 - RNeOblМес[10]
      RНалогБаза[11] :=RЗаГод[11] - RealVich1 - RealVich2 - RealVich3 - RealVich4 - RealVich5 - RealVich6 - RealVich7 -
                       RealVich8 - RealVich9 - RealVich10 - RealVich11  - RNeOblМес[11]
      RНалогБаза[12] :=RЗаГод[12] - RealVich1 - RealVich2 - RealVich3 - RealVich4 - RealVich5 - RealVich6 - RealVich7 -
                       RealVich8 - RealVich9 - RealVich10 - RealVich11 - RealVich12  - RNeOblМес[12]
    }
    else
    {
      for (i := 1; i <= 12; i := i + 1)
      {
        RНалогБаза[i] := RЗаГод[i] - RСтандВычетНГ[i] - RИмущВычет[i] - RNeOblМес[i];
      }
    }
    for (i := 1; i <= 12; i := i + 1)
    {
     if RНалогБаза[i] < 0
      RНалогБаза[i] := 0;
    }

    RНалогБаза[13] := RНалогБаза[12];
  }
  else // нерезидент
  {
 Ш    if not boGetTune('UP.ZAR.XP.DATE0') // разница по вычетам не переносится
    {
 Ш      RНалогБаза[1]:= RЗаМесяц[1]- RИмущВычет[1] + RNeOblМес[1] - RealVich1
      RНалогБаза[2]:= RЗаМесяц[2]- RИмущВычет[2] + RИмущВычет[1]-RNeOblМес[2] - RealVich2
      RНалогБаза[3]:= RЗаМесяц[3]- RИмущВычет[3] + RИмущВычет[2]-RNeOblМес[3] - RealVich3
      RНалогБаза[4]:= RЗаМесяц[4]- RИмущВычет[4] + RИмущВычет[3]-RNeOblМес[4] - RealVich4
      RНалогБаза[5]:= RЗаМесяц[5]- RИмущВычет[5] + RИмущВычет[4]-RNeOblМес[5] - RealVich5
      RНалогБаза[6]:= RЗаМесяц[6]- RИмущВычет[6] + RИмущВычет[5]-RNeOblМес[6] - RealVich6
      RНалогБаза[7]:= RЗаМесяц[7]- RИмущВычет[7] + RИмущВычет[6]-RNeOblМес[7] - RealVich7
      RНалогБаза[8]:= RЗаМесяц[8]- RИмущВычет[8] + RИмущВычет[7]-RNeOblМес[8] - RealVich8
      RНалогБаза[9]:= RЗаМесяц[9]- RИмущВычет[9] + RИмущВычет[8]-RNeOblМес[9] - RealVich9
      RНалогБаза[10]:= RЗаМесяц[10]- RИмущВычет[10] + RИмущВычет[9]-RNeOblМес[10] - RealVich10
      RНалогБаза[11]:= RЗаМесяц[11]- RИмущВычет[11] + RИмущВычет[10]-RNeOblМес[11] - RealVich11
      RНалогБаза[12]:= RЗаМесяц[12]- RИмущВычет[12] + RИмущВычет[11]-RNeOblМес[12] - RealVich12
    }
    else
    {
 Ш Ш      for(i := 1; i <= 12; i := i + 1)
      {
        if i <> 1
        {
          RНалогБаза[i] := RЗаМесяц[i] - RИмущВычет[i] + RИмущВычет[i - 1] - RNeOblМес[i]
                         - RСтандВычет1[i]
                         - RСтандВычет2[i]
                         - RСтандВычет3[i]
                         - RСтандВычет4[i]
                         - RСтандВычет5[i]
                         - RСтандВычет6[i]
                         - RСтандВычет7[i]
        }
        else
          RНалогБаза[i] := RЗаМесяц[i] - RИмущВычет[i] - RNeOblМес[i]
                         - RСтандВычет1[i]
                         - RСтандВычет2[i]
                         - RСтандВычет3[i]
                         - RСтандВычет4[i]
                         - RСтандВычет5[i]
                         - RСтандВычет6[i]
                         - RСтандВычет7[i]

      }

    }
 Ш Ш     RНалогБаза[13] := RНалогБаза[1] + RНалогБаза[2] + RНалогБаза[3] + RНалогБаза[4] +
     RНалогБаза[5] + RНалогБаза[6] + RНалогБаза[7] + RНалогБаза[8] + RНалогБаза[9] +
     RНалогБаза[10] + RНалогБаза[11] + RНалогБаза[12]
  }

  if RНалогБаза[13] < 0
    RНалогБаза[13] := 0;


//  if (Trim(UchDoh) = '1') // смена настройки Учет дохода
  {

    for(i := 1; i <= 12; i := i + 1)
    {
      if Статус = '1' then
        RНалогИсчисл[i] := OcrugNaRuk(RНалогБаза[i] * 0.13, XarOcrug5)
      else
        RНалогИсчисл[i] := OcrugNaRuk(RНалогБаза[i] * 0.30, XarOcrug5)

    }

  }

   if Статус = '1' then
   {
     RНалогУдер[1] := НалогУдер1;
     RНалогУдер[2] := RНалогУдер[1] + НалогУдер2;
     RНалогУдер[3] := RНалогУдер[2] + НалогУдер3;
     RНалогУдер[4] := RНалогУдер[3] + НалогУдер4;
     RНалогУдер[5] := RНалогУдер[4] + НалогУдер5;
     RНалогУдер[6] := RНалогУдер[5] + НалогУдер6;
     RНалогУдер[7] := RНалогУдер[6] + НалогУдер7;
     RНалогУдер[8] := RНалогУдер[7] + НалогУдер8;
     RНалогУдер[9] := RНалогУдер[8] + НалогУдер9;
     RНалогУдер[10] := RНалогУдер[9] + НалогУдер10;
     RНалогУдер[11] := RНалогУдер[10]+ НалогУдер11;
     RНалогУдер[12] := RНалогУдер[11]+ НалогУдер12;
     RНалогИсчисл[13]:= RНалогИсчисл[12]
     RНалогУдер[13]  := RНалогУдер[12]

     RNalPred63[1]:=  NalPred63_1
     RNalPred63[2]:=  RNalPred63[1] + NalPred63_2
     RNalPred63[3]:=  RNalPred63[2] + NalPred63_3
     RNalPred63[4]:=  RNalPred63[3] + NalPred63_4
     RNalPred63[5]:=  RNalPred63[4] + NalPred63_5
     RNalPred63[6]:=  RNalPred63[5] + NalPred63_6
     RNalPred63[7]:=  RNalPred63[6] + NalPred63_7
     RNalPred63[8]:=  RNalPred63[7] + NalPred63_8
     RNalPred63[9]:=  RNalPred63[8] + NalPred63_9
     RNalPred63[10]:=  RNalPred63[9] + NalPred63_10
     RNalPred63[11]:=  RNalPred63[10] + NalPred63_11
     RNalPred63[12]:=  RNalPred63[11] + NalPred63_12
     RNalPred63[13]:=  RNalPred63[12]

     RNalPred64[1]:=  NalPred64_1
     RNalPred64[2]:=  RNalPred64[1] + NalPred64_2
     RNalPred64[3]:=  RNalPred64[2] + NalPred64_3
     RNalPred64[4]:=  RNalPred64[3] + NalPred64_4
     RNalPred64[5]:=  RNalPred64[4] + NalPred64_5
     RNalPred64[6]:=  RNalPred64[5] + NalPred64_6
     RNalPred64[7]:=  RNalPred64[6] + NalPred64_7
     RNalPred64[8]:=  RNalPred64[7] + NalPred64_8
     RNalPred64[9]:=  RNalPred64[8] + NalPred64_9
     RNalPred64[10]:=  RNalPred64[9] + NalPred64_10
     RNalPred64[11]:=  RNalPred64[10] + NalPred64_11
     RNalPred64[12]:=  RNalPred64[11] + NalPred64_12
     RNalPred64[13]:=  RNalPred64[12]
    }
    else
    {
      RНалогУдер[1] :=  НалогУдер1;
      RНалогУдер[2] :=  НалогУдер2;
      RНалогУдер[3] :=  НалогУдер3;
      RНалогУдер[4] :=  НалогУдер4;
      RНалогУдер[5] :=  НалогУдер5;
      RНалогУдер[6] :=  НалогУдер6;
      RНалогУдер[7] :=  НалогУдер7;
      RНалогУдер[8] :=  НалогУдер8;
      RНалогУдер[9] :=  НалогУдер9;
      RНалогУдер[10] := НалогУдер10;
      RНалогУдер[11] := НалогУдер11;
      RНалогУдер[12] := НалогУдер12;
      RНалогИсчисл[13] :=  RНалогИсчисл[1] + RНалогИсчисл[2] + RНалогИсчисл[3] +
                           RНалогИсчисл[4] + RНалогИсчисл[5] + RНалогИсчисл[6] +
                           RНалогИсчисл[7] + RНалогИсчисл[8] + RНалогИсчисл[9] +
                           RНалогИсчисл[10]+ RНалогИсчисл[11]+ RНалогИсчисл[12];
      RНалогУдер[13] :=  RНалогУдер[1] + RНалогУдер[2] + RНалогУдер[3] +
                         RНалогУдер[4] + RНалогУдер[5] + RНалогУдер[6] +
                         RНалогУдер[7] + RНалогУдер[8] + RНалогУдер[9] +
                         RНалогУдер[10]+ RНалогУдер[11]+ RНалогУдер[12];

     RNalPred63[1]:=  NalPred63_1
     RNalPred63[2]:=  NalPred63_2
     RNalPred63[3]:=  NalPred63_3
     RNalPred63[4]:=  NalPred63_4
     RNalPred63[5]:=  NalPred63_5
     RNalPred63[6]:=  NalPred63_6
     RNalPred63[7]:=  NalPred63_7
     RNalPred63[8]:=  NalPred63_8
     RNalPred63[9]:=  NalPred63_9
     RNalPred63[10]:= NalPred63_10
     RNalPred63[11]:= NalPred63_11
     RNalPred63[12]:= NalPred63_12
     RNalPred63[13]:= NalPred63_1 + NalPred63_2 + NalPred63_3 + NalPred63_4 + NalPred63_5 + NalPred63_6 +
                      NalPred63_7 + NalPred63_8 + NalPred63_9 + NalPred63_10 + NalPred63_11 + NalPred63_12

     RNalPred64[1]:=  NalPred64_1
     RNalPred64[2]:=  NalPred64_2
     RNalPred64[3]:=  NalPred64_3
     RNalPred64[4]:=  NalPred64_4
     RNalPred64[5]:=  NalPred64_5
     RNalPred64[6]:=  NalPred64_6
     RNalPred64[7]:=  NalPred64_7
     RNalPred64[8]:=  NalPred64_8
     RNalPred64[9]:=  NalPred64_9
     RNalPred64[10]:= NalPred64_10
     RNalPred64[11]:= NalPred64_11
     RNalPred64[12]:= NalPred64_12
     RNalPred64[13]:= NalPred64_1 + NalPred64_2 + NalPred64_3 + NalPred64_4 + NalPred64_5 + NalPred64_6 +
                      NalPred64_7 + NalPred64_8 + NalPred64_9 + NalPred64_10 + NalPred64_11 + NalPred64_12

    }


    if Trim(Не_работник) = '1'
    {
      for (i := 1; i <= 13; i := i + 1)
      {
        if ( abs( RНалогУдер[i] - RНалогИсчисл[i]) <= 1 )
          RНалогИсчисл[i] := RНалогУдер[i];
        if Round(RНалогИсчисл[i]) > Round(RНалогУдер[i])
          RВзыскание[i] := Round(RНалогИсчисл[i]) - Round(RНалогУдер[i]);
      }

    }
    else
    {

      for (i := 1; i <= 13; i := i + 1)
      {
        if ( abs( RНалогУдер[i] - RНалогИсчисл[i]) <= 1 )
          RНалогИсчисл[i] := RНалогУдер[i];
        if Round(RНалогИсчисл[i]) >  Round(RНалогУдер[i])
          RДолгНалПлат[i] :=  Round(RНалогИсчисл[i]) - Round(RНалогУдер[i]) - Round(RNalPred63[i])
        else
          RДолгНалАгент[i] := Round(RНалогУдер[i]) - Round(RНалогИсчисл[i]) - Round(RNalPred64[i])

      }

      if Статус = '1' then
      {
        RВзыскание[1] := IschNalog2620_1
        RВзыскание[2] := RВзыскание[1] + IschNalog2620_2
        RВзыскание[3] := RВзыскание[2] + IschNalog2620_3
        RВзыскание[4] := RВзыскание[3] + IschNalog2620_4
        RВзыскание[5] := RВзыскание[4] + IschNalog2620_5
        RВзыскание[6] := RВзыскание[5] + IschNalog2620_6
        RВзыскание[7] := RВзыскание[6] + IschNalog2620_7
        RВзыскание[8] := RВзыскание[7] + IschNalog2620_8
        RВзыскание[9] := RВзыскание[8] + IschNalog2620_9
        RВзыскание[10] := RВзыскание[9] + IschNalog2620_10
        RВзыскание[11] := RВзыскание[10] + IschNalog2620_11
        RВзыскание[12] := RВзыскание[11] + IschNalog2620_12
        RВзыскание[13] := RВзыскание[12]
      }
      else
      {
        RВзыскание[1] := IschNalog2620_1
        RВзыскание[2] := IschNalog2620_2
        RВзыскание[3] := IschNalog2620_3
        RВзыскание[4] := IschNalog2620_4
        RВзыскание[5] := IschNalog2620_5
        RВзыскание[6] := IschNalog2620_6
        RВзыскание[7] := IschNalog2620_7
        RВзыскание[8] := IschNalog2620_8
        RВзыскание[9] := IschNalog2620_9
        RВзыскание[10] := IschNalog2620_10
        RВзыскание[11] := IschNalog2620_11
        RВзыскание[12] := IschNalog2620_12
        RВзыскание[13] := IschNalog2620_1 + IschNalog2620_2 + IschNalog2620_3 + IschNalog2620_4 +
                          IschNalog2620_5 + IschNalog2620_6 + IschNalog2620_7 + IschNalog2620_8 +
                          IschNalog2620_9 + IschNalog2620_10 + IschNalog2620_11 + IschNalog2620_12
      }

    }

end.
.fields
RНалогБаза[1] RНалогБаза[2]  RНалогБаза[3]  RНалогБаза[4]
RНалогБаза[5] RНалогБаза[6]  RНалогБаза[7]  RНалогБаза[8]
RНалогБаза[9] RНалогБаза[10] RНалогБаза[11] RНалогБаза[12]
RНалогБаза[13]
Round(RНалогИсчисл[1])  Round(RНалогИсчисл[2])  Round(RНалогИсчисл[3])
Round(RНалогИсчисл[4])  Round(RНалогИсчисл[5])  Round(RНалогИсчисл[6])
Round(RНалогИсчисл[7])  Round(RНалогИсчисл[8])  Round(RНалогИсчисл[9])
Round(RНалогИсчисл[10]) Round(RНалогИсчисл[11]) Round(RНалогИсчисл[12])
Round(RНалогИсчисл[13])
Round(RНалогУдер[1])   Round(RНалогУдер[2])  Round(RНалогУдер[3]) Round(RНалогУдер[4])
Round(RНалогУдер[5])   Round(RНалогУдер[6])  Round(RНалогУдер[7]) Round(RНалогУдер[8])
Round(RНалогУдер[9])   Round(RНалогУдер[10]) Round(RНалогУдер[11])
Round(RНалогУдер[12])  Round(RНалогУдер[13])

RДолгНалПлат[1]   RДолгНалПлат[2]    RДолгНалПлат[3]   RДолгНалПлат[4]
RДолгНалПлат[5]   RДолгНалПлат[6]    RДолгНалПлат[7]   RДолгНалПлат[8]
RДолгНалПлат[9]   RДолгНалПлат[10]   RДолгНалПлат[11]
RДолгНалПлат[12]  RДолгНалПлат[13]
RДолгНалАгент[1]  RДолгНалАгент[2]   RДолгНалАгент[3]
RДолгНалАгент[4]  RДолгНалАгент[5]   RДолгНалАгент[6]
RДолгНалАгент[7]  RДолгНалАгент[8]   RДолгНалАгент[9]
RДолгНалАгент[10] RДолгНалАгент[11]  RДолгНалАгент[12]  RДолгНалАгент[13]
RВзыскание[1]     RВзыскание[2]      RВзыскание[3]      RВзыскание[4]
RВзыскание[5]     RВзыскание[6]      RВзыскание[7]      RВзыскание[8]
RВзыскание[9]     RВзыскание[10]     RВзыскание[11]
RВзыскание[12]    RВзыскание[13]
.endfields
   │Налоговая база (с начала года) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
   ├───────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │Налог исчисленный              │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│
   ├───────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │Налог удержанный               │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│
   ├───────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │Долг по налогу за              │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │налогоплательщиком             │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│
   ├───────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │Долг по налогу за              │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │налоговым агентом              │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│
   ├───────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │Сумма налога, переданная на    │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │взыскание в налоговый  орган   │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│
   ├───────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │Возвращена налоговым агентом   │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │излишне удержанная сумма налога│           │           │           │           │           │           │           │           │           │           │           │           │           │
   └───────────────────────────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┘ Ш
 Ш.fields
'true':'s'
.endfields
^
.fields
Минимум1  Минимум2 Минимум3
ОсноваВыч3
Расходы1  Расходы2  Расходы3
КолДетей ПериодВыч ОсноваВыч1
СтатусВдовы
ВидВыч ОсноваВыч2
.endfields

     ПРАВО НА СТАНДАРТНЫЕ НАЛОГОВЫЕ ВЫЧЕТЫ:
                                                               ┌──┐               ┌──┐               ┌──┐
     3.1. Необлагаемый минимум дохода в размере: 3000 рублей - │@@│, 500 рублей - │@@│, 400 рублей - │@@│- (в нужном поле проставить любой знак);
                                                               └──┘               └──┘               └──┘
     основание для предоставления налогового вычета  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                                                 ┌──┐                         ┌──┐                         ┌──┐
     3.2. Расходы на содержание 1 ребенка в размере: 600 рублей -│@@│, в размере 1200 рублей -│@@│, в размере 2400 рублей -│@@│- (в нужном поле проставить любой знак);
                                                                 └──┘                         └──┘                         └──┘
     количество детей  Ж&&& Ж период действия вычета  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@  Доснование для предоставления налогового вычета  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д

     документы, подтверждающие статус вдовы (вдовца), одинокого родителя, опекуна или попечителя  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д


     ПРАВО НА НАЛОГОВЫЕ ВЫЧЕТЫ, ПРЕДУСМОТРЕННЫЕ ПУНКТАМИ 2 И 3 СТАТЬИ 221 НАЛОГОВОГО КОДЕКСА РОССИЙСКОЙ ФЕДЕРАЦИИ

     вид вычета  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д основание для предоставления вычета  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ь
 И

 И
 Щ   Раздел 4.РАСЧЕТ НАЛОГОВОЙ БАЗЫ И НАЛОГА НА ДОХОДЫ ФИЗИЧЕСКОГО ЛИЦА ОТ ДОЛЕВОГО УЧАСТИЯ
   В ДЕЯТЕЛЬНОСТИ ОРГАНИЗАЦИИ (ДИВИДЕНДЫ) Б
.begin
  RСумДивиденд13:=
  СумДивиденд1+ СумДивиденд2+ СумДивиденд3+  СумДивиденд4+
  СумДивиденд5+ СумДивиденд6+ СумДивиденд7+  СумДивиденд8+
  СумДивиденд9+ СумДивиденд10+СумДивиденд11+ СумДивиденд12;

  RОблСумДивиденд13:=
  ОблСумДивиденд1+ОблСумДивиденд2 + ОблСумДивиденд3 + ОблСумДивиденд4+
  ОблСумДивиденд5+ОблСумДивиденд6 + ОблСумДивиденд7 + ОблСумДивиденд8+
  ОблСумДивиденд9+ОблСумДивиденд10+ ОблСумДивиденд11+ ОблСумДивиденд12;

  for (i := 1; i <= 13; i := i + 1)
  {
    RДолгНалПлатDiv[i] := 0;
    RДолгНалАгентDiv[i]:= 0;
  }

  if INalДивиденд1 >= 0
    RINalДивиденд[1] := DoubleToStr(INalДивиденд1,'666666666667')
  else
    RINalДивиденд[1] := DoubleToStr(INalДивиденд1,'-666666666667')

  if INalДивиденд2 >= 0
    RINalДивиденд[2] := DoubleToStr(INalДивиденд2,'666666666667')
  else
    RINalДивиденд[2] := DoubleToStr(INalДивиденд2,'-666666666667')

  if INalДивиденд3 >= 0
    RINalДивиденд[3] := DoubleToStr(INalДивиденд3,'666666666667')
  else
    RINalДивиденд[3] := DoubleToStr(INalДивиденд3,'-666666666667')

  if INalДивиденд4 >= 0
    RINalДивиденд[4] := DoubleToStr(INalДивиденд4,'666666666667')
  else
    RINalДивиденд[4] := DoubleToStr(INalДивиденд4,'-666666666667')

  if INalДивиденд5 >= 0
    RINalДивиденд[5] := DoubleToStr(INalДивиденд5,'666666666667')
  else
    RINalДивиденд[5] := DoubleToStr(INalДивиденд5,'-666666666667')

  if INalДивиденд6 >= 0
    RINalДивиденд[6] := DoubleToStr(INalДивиденд6,'666666666667')
  else
    RINalДивиденд[6] := DoubleToStr(INalДивиденд6,'-666666666667')

  if INalДивиденд7 >= 0
    RINalДивиденд[7] := DoubleToStr(INalДивиденд7,'666666666667')
  else
    RINalДивиденд[7] := DoubleToStr(INalДивиденд7,'-666666666667')

  if INalДивиденд8 >= 0
    RINalДивиденд[8] := DoubleToStr(INalДивиденд8,'666666666667')
  else
    RINalДивиденд[8] := DoubleToStr(INalДивиденд8,'-666666666667')

  if INalДивиденд9 >= 0
    RINalДивиденд[9] := DoubleToStr(INalДивиденд9,'666666666667')
  else
    RINalДивиденд[9] := DoubleToStr(INalДивиденд9,'-666666666667')

  if INalДивиденд10 >= 0
    RINalДивиденд[10] := DoubleToStr(INalДивиденд10,'666666666667')
  else
    RINalДивиденд[10] := DoubleToStr(INalДивиденд10,'-666666666667')

  if INalДивиденд11 >= 0
    RINalДивиденд[11] := DoubleToStr(INalДивиденд11,'666666666667')
  else
    RINalДивиденд[11] := DoubleToStr(INalДивиденд11,'-666666666667')

  if INalДивиденд12 >= 0
    RINalДивиденд[12] := DoubleToStr(INalДивиденд12,'666666666667')
  else
    RINalДивиденд[12] := DoubleToStr(INalДивиденд12,'-666666666667')

  if INalДивиденд13 >= 0
    RINalДивиденд[13] := DoubleToStr(INalДивиденд13,'666666666667')
  else
    RINalДивиденд[13] := DoubleToStr(INalДивиденд13,'-666666666667')


  if UNalДивиденд1 >= 0
    RUNalДивиденд[1] := DoubleToStr(UNalДивиденд1,'666666666667')
  else
    RUNalДивиденд[1] := DoubleToStr(UNalДивиденд1,'-666666666667')

  if UNalДивиденд2 >= 0
    RUNalДивиденд[2] := DoubleToStr(UNalДивиденд2,'666666666667')
  else
    RUNalДивиденд[2] := DoubleToStr(UNalДивиденд2,'-666666666667')

  if UNalДивиденд3 >= 0
    RUNalДивиденд[3] := DoubleToStr(UNalДивиденд3,'666666666667')
  else
    RUNalДивиденд[3] := DoubleToStr(UNalДивиденд3,'-666666666667')

  if UNalДивиденд4 >= 0
    RUNalДивиденд[4] := DoubleToStr(UNalДивиденд4,'666666666667')
  else
    RUNalДивиденд[4] := DoubleToStr(UNalДивиденд4,'-666666666667')

  if UNalДивиденд5 >= 0
    RUNalДивиденд[5] := DoubleToStr(UNalДивиденд5,'666666666667')
  else
    RUNalДивиденд[5] := DoubleToStr(UNalДивиденд5,'-666666666667')

  if UNalДивиденд6 >= 0
    RUNalДивиденд[6] := DoubleToStr(UNalДивиденд6,'666666666667')
  else
    RUNalДивиденд[6] := DoubleToStr(UNalДивиденд6,'-666666666667')

  if UNalДивиденд7 >= 0
    RUNalДивиденд[7] := DoubleToStr(UNalДивиденд7,'666666666667')
  else
    RUNalДивиденд[7] := DoubleToStr(UNalДивиденд7,'-666666666667')

  if UNalДивиденд8 >= 0
    RUNalДивиденд[8] := DoubleToStr(UNalДивиденд8,'666666666667')
  else
    RUNalДивиденд[8] := DoubleToStr(UNalДивиденд8,'-666666666667')

  if UNalДивиденд9 >= 0
    RUNalДивиденд[9] := DoubleToStr(UNalДивиденд9,'666666666667')
  else
    RUNalДивиденд[9] := DoubleToStr(UNalДивиденд9,'-666666666667')

  if UNalДивиденд10 >= 0
    RUNalДивиденд[10] := DoubleToStr(UNalДивиденд10,'666666666667')
  else
    RUNalДивиденд[10] := DoubleToStr(UNalДивиденд10,'-666666666667')

  if UNalДивиденд11 >= 0
    RUNalДивиденд[11] := DoubleToStr(UNalДивиденд11,'666666666667')
  else
    RUNalДивиденд[11] := DoubleToStr(UNalДивиденд11,'-666666666667')

  if UNalДивиденд12 >= 0
    RUNalДивиденд[12] := DoubleToStr(UNalДивиденд12,'666666666667')
  else
    RUNalДивиденд[12] := DoubleToStr(UNalДивиденд12,'-666666666667')

  if UNalДивиденд13 >= 0
    RUNalДивиденд[13] := DoubleToStr(UNalДивиденд13,'666666666667')
  else
    RUNalДивиденд[13] := DoubleToStr(UNalДивиденд13,'-666666666667')

  for (i := 1; i <= 13; i := i + 1)
    if Round(RINalДивиденд[i]) > Round(RUNalДивиденд[i])
      RДолгНалПлатDiv[i] :=  Round(RINalДивиденд[i]) - Round(RUNalДивиденд[i])
    else
      RДолгНалАгентDiv[i] := Round(RUNalДивиденд[i]) - Round(RINalДивиденд[i])
end.
.fields
  СумДивиденд1  СумДивиденд2  СумДивиденд3   СумДивиденд4 СумДивиденд5 СумДивиденд6
  СумДивиденд7 СумДивиденд8 СумДивиденд9 СумДивиденд10 СумДивиденд11 СумДивиденд12 RСумДивиденд13
  ОблСумДивиденд1 ОблСумДивиденд2 ОблСумДивиденд3 ОблСумДивиденд4 ОблСумДивиденд5 ОблСумДивиденд6
  ОблСумДивиденд7 ОблСумДивиденд8 ОблСумДивиденд9 ОблСумДивиденд10 ОблСумДивиденд11 ОблСумДивиденд12
  RОблСумДивиденд13

  RINalДивиденд[1]  RINalДивиденд[2]  RINalДивиденд[3]
  RINalДивиденд[4]  RINalДивиденд[5]  RINalДивиденд[6]
  RINalДивиденд[7]  RINalДивиденд[8]  RINalДивиденд[9]
  RINalДивиденд[10] RINalДивиденд[11] RINalДивиденд[12]
  RINalДивиденд[13]

  RUNalДивиденд[1]  RUNalДивиденд[2]  RUNalДивиденд[3]
  RUNalДивиденд[4]  RUNalДивиденд[5]  RUNalДивиденд[6]
  RUNalДивиденд[7]  RUNalДивиденд[8]  RUNalДивиденд[9]
  RUNalДивиденд[10] RUNalДивиденд[11] RUNalДивиденд[12]
  RUNalДивиденд[13]

  RДолгНалПлатDiv[1]   RДолгНалПлатDiv[2]   RДолгНалПлатDiv[3]
  RДолгНалПлатDiv[4]   RДолгНалПлатDiv[5]   RДолгНалПлатDiv[6]
  RДолгНалПлатDiv[7]   RДолгНалПлатDiv[8]   RДолгНалПлатDiv[9]
  RДолгНалПлатDiv[10]  RДолгНалПлатDiv[11]  RДолгНалПлатDiv[12]
  RДолгНалПлатDiv[13]

  RДолгНалАгентDiv[1]  RДолгНалАгентDiv[2]  RДолгНалАгентDiv[3]
  RДолгНалАгентDiv[4]  RДолгНалАгентDiv[5]  RДолгНалАгентDiv[6]
  RДолгНалАгентDiv[7]  RДолгНалАгентDiv[8]  RДолгНалАгентDiv[9]
  RДолгНалАгентDiv[10] RДолгНалАгентDiv[11] RДолгНалАгентDiv[12]
  RДолгНалАгентDiv[13]
.endfields
   ┌──┬────────────────────────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┐
   │N │    Показатели              │   Январь  │  Февраль  │   Март    │   Апрель  │    Май    │    Июнь   │     Июль  │  Август   │  Сентябрь │  Октябрь  │   Ноябрь  │  Декабрь  │  Итого    │
   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 1│Сумма дивидендов, распреде- │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │ленная в пользу физического │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │лица - налогоплательщика    │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 2│Облагаемая сумма дивидендов │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 3│Сумма налога исчисленная    │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│
   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤───────────┼───────────┤
   │ 4│Сумма налога удержанная     │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│
   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 5│Долг по налогу  за          │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│
   │  │налогоплательщиком          │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 6│Долг по  налогу за          │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│
   │  │налоговым агентом           │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 7│Сумма налога, переданная на │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │взыскание в налоговый орган │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 8│Возвращена налоговым        │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │агентом  излишне удержанная │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │сумма налога                │           │           │           │           │           │           │           │           │           │           │           │           │           │
   └──┴────────────────────────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┘ Ш
 Ш.fields
'true':'s'
.endfields
^

 Б   Раздел 5.РАСЧЕТ НАЛОГА С ДОХОДОВ, ОБЛАГАЕМЫХ ПО СТАВКЕ 35% Б
.begin
RAllНал35_Исчисл13:= 0;
RAllНал35_Удер13  := 0;
RДолг1Нал35_1:= 0; RДолг1Нал35_2:= 0; RДолг1Нал35_3:= 0;   RДолг1Нал35_4:= 0;
RДолг1Нал35_5:= 0; RДолг1Нал35_6:= 0; RДолг1Нал35_7:= 0;   RДолг1Нал35_8:= 0;
RДолг1Нал35_9:= 0; RДолг1Нал35_10:= 0; RДолг1Нал35_11:= 0; RДолг1Нал35_12:= 0; RДолг1Нал35_13:= 0;
 RДолг2Нал35_1:= 0; RДолг2Нал35_2:= 0; RДолг2Нал35_3:= 0;   RДолг2Нал35_4:= 0;
 RДолг2Нал35_5:= 0; RДолг2Нал35_6:= 0; RДолг2Нал35_7:= 0;   RДолг2Нал35_8:= 0;
 RДолг2Нал35_9:= 0; RДолг2Нал35_10:= 0; RДолг2Нал35_11:= 0; RДолг2Нал35_12:= 0; RДолг2Нал35_13:= 0;
end.
.fields
 Код_дохода
 Призы1 Призы2 Призы3 Призы4 Призы5 Призы6 Призы7 Призы8 Призы9 Призы10 Призы11 Призы12 RПризы13
 Вычет35_1  Вычет35_2  Вычет35_3  Вычет35_4  Вычет35_5  Вычет35_6  Вычет35_7  Вычет35_8 Вычет35_9
 Вычет35_10 Вычет35_11 Вычет35_12 RВычет35_13
 НалБаза35_1 НалБаза35_2 НалБаза35_3 НалБаза35_4 НалБаза35_5 НалБаза35_6
 НалБаза35_7 НалБаза35_8 НалБаза35_9 НалБаза35_10 НалБаза35_11 НалБаза35_12
 RНалБаза35_13
 Нал35_Исчисл1 Нал35_Исчисл2 Нал35_Исчисл3 Нал35_Исчисл4 Нал35_Исчисл5 Нал35_Исчисл6
 Нал35_Исчисл7 Нал35_Исчисл8 Нал35_Исчисл9 Нал35_Исчисл10 Нал35_Исчисл11 Нал35_Исчисл12
 RНал35_Исчисл13
 Нал35_Удер1 Нал35_Удер2 Нал35_Удер3 Нал35_Удер4 Нал35_Удер5 Нал35_Удер6 Нал35_Удер7
 Нал35_Удер8 Нал35_Удер9 Нал35_Удер10 Нал35_Удер11 Нал35_Удер12 RНал35_Удер13
 RДолг1Нал35_1 RДолг1Нал35_2 RДолг1Нал35_3   RДолг1Нал35_4
 RДолг1Нал35_5 RДолг1Нал35_6 RДолг1Нал35_7   RДолг1Нал35_8
 RДолг1Нал35_9 RДолг1Нал35_10 RДолг1Нал35_11 RДолг1Нал35_12 RДолг1Нал35_13
 RДолг2Нал35_1 RДолг2Нал35_2 RДолг2Нал35_3   RДолг2Нал35_4
 RДолг2Нал35_5 RДолг2Нал35_6 RДолг2Нал35_7   RДолг2Нал35_8
 RДолг2Нал35_9 RДолг2Нал35_10 RДолг2Нал35_11 RДолг2Нал35_12 RДолг2Нал35_13
.endfields
.{ Stavka35_2005 CheckEnter
.begin
 RПризы13:= Призы1+Призы2+Призы3+Призы4+Призы5+Призы6+Призы7+Призы8+Призы9+Призы10+Призы11+Призы12;
 RВычет35_13:= Вычет35_1+Вычет35_2+Вычет35_3+Вычет35_4+Вычет35_5+Вычет35_6+Вычет35_7+Вычет35_8+Вычет35_9+Вычет35_10+Вычет35_11+Вычет35_12;
 RНалБаза35_13:= НалБаза35_1+ НалБаза35_2+ НалБаза35_3+НалБаза35_4+
 НалБаза35_5+НалБаза35_6+НалБаза35_7+НалБаза35_8+НалБаза35_9+
 НалБаза35_10+ НалБаза35_11+ НалБаза35_12;

 RНал35_Исчисл13 := Нал35_Исчисл1 + Нал35_Исчисл2 + Нал35_Исчисл3  +
                   Нал35_Исчисл4 + Нал35_Исчисл5 + Нал35_Исчисл6  + Нал35_Исчисл7+
                   Нал35_Исчисл8 + Нал35_Исчисл9 + Нал35_Исчисл10 + Нал35_Исчисл11+
                   Нал35_Исчисл12;

 RНал35_Удер13 :=   Нал35_Удер1  + Нал35_Удер2  + Нал35_Удер3  + Нал35_Удер4 +
                   Нал35_Удер5  + Нал35_Удер6  + Нал35_Удер7  + Нал35_Удер8 +
                   Нал35_Удер9  + Нал35_Удер10 + Нал35_Удер11 + Нал35_Удер12;
 RAllНал35_Исчисл13:= RAllНал35_Исчисл13 + RНал35_Исчисл13;
 RAllНал35_Удер13  := RAllНал35_Удер13 + RНал35_Удер13;

 if  Нал35_Исчисл1>  Нал35_Удер1  then   RДолг1Нал35_1:= Round(Нал35_Исчисл1)- Round(Нал35_Удер1)
 else RДолг2Нал35_1:= Round(Нал35_Удер1) - Round(Нал35_Исчисл1);
 if  Нал35_Исчисл2>  Нал35_Удер2  then   RДолг1Нал35_2:= Round(Нал35_Исчисл2)- Round(Нал35_Удер2)
 else RДолг2Нал35_2:= Round(Нал35_Удер2) - Round(Нал35_Исчисл2);
 if  Нал35_Исчисл3>  Нал35_Удер3  then   RДолг1Нал35_3:= Round(Нал35_Исчисл3)- Round(Нал35_Удер3)
 else RДолг2Нал35_3:= Round(Нал35_Удер3) - Round(Нал35_Исчисл3);
 if  Нал35_Исчисл4>  Нал35_Удер4  then   RДолг1Нал35_4:= Round(Нал35_Исчисл4)- Round(Нал35_Удер4)
 else RДолг2Нал35_4:= Round(Нал35_Удер4) - Round(Нал35_Исчисл4);
 if  Нал35_Исчисл5>  Нал35_Удер5  then   RДолг1Нал35_5:= Round(Нал35_Исчисл5)- Round(Нал35_Удер5)
 else RДолг2Нал35_5:= Round(Нал35_Удер5) - Round(Нал35_Исчисл5);
 if  Нал35_Исчисл6>  Нал35_Удер6  then   RДолг1Нал35_6:= Round(Нал35_Исчисл6)- Round(Нал35_Удер6)
 else RДолг2Нал35_6:= Round(Нал35_Удер6) - Round(Нал35_Исчисл6);
 if  Нал35_Исчисл7>  Нал35_Удер7  then   RДолг1Нал35_7:= Round(Нал35_Исчисл7)- Round(Нал35_Удер7)
 else RДолг2Нал35_7:= Round(Нал35_Удер7) - Round(Нал35_Исчисл7);
 if  Нал35_Исчисл8>  Нал35_Удер8  then   RДолг1Нал35_8:=  Round(Нал35_Исчисл8)- Round(Нал35_Удер8)
 else RДолг2Нал35_8:= Round(Нал35_Удер8)- Round(Нал35_Исчисл8);
 if  Нал35_Исчисл9>  Нал35_Удер9  then   RДолг1Нал35_9:= Round(Нал35_Исчисл9)- Round(Нал35_Удер9)
 else RДолг2Нал35_9:= Round(Нал35_Удер9)- Round(Нал35_Исчисл9);
 if Нал35_Исчисл10>  Нал35_Удер10 then  RДолг1Нал35_10:= Round(Нал35_Исчисл10)- Round(Нал35_Удер10)
 else RДолг2Нал35_10:= Round(Нал35_Удер10)- Round(Нал35_Исчисл10);
 if Нал35_Исчисл11>  Нал35_Удер11 then  RДолг1Нал35_11:= Round(Нал35_Исчисл11)- Round(Нал35_Удер11)
 else RДолг2Нал35_11:= Round(Нал35_Удер11)- Round(Нал35_Исчисл11);
 if Нал35_Исчисл12>  Нал35_Удер12 then  RДолг1Нал35_12:= Round(Нал35_Исчисл12)- Round(Нал35_Удер12)
 else RДолг2Нал35_12:= Round(Нал35_Удер12)- Round(Нал35_Исчисл12);
 if RНал35_Исчисл13>  RНал35_Удер13 then  RДолг1Нал35_13:= RНал35_Исчисл13- RНал35_Удер13
 else RДолг2Нал35_13:= RНал35_Удер13- RНал35_Исчисл13;
end.
   ┌──┬────────────────────────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┐
   │N │    Показатель              │   Январь  │  Февраль  │   Март    │   Апрель  │    Май    │    Июнь   │     Июль  │  Август   │  Сентябрь │  Октябрь  │   Ноябрь  │  Декабрь  │  Итого    │
   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 1│Код дохода @@@@ сумма дохода│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 2│Налоговый вычет, предусмот- │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │ренный пунктом 28 статьи 217│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │Налогового кодекса Российс- │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │кой Федерации по выигрышам  │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │и призам в целях рекламы    │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 3│Налоговая база (стр.1-стр.2)│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 4│Сумма  налога исчисленная   │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│
   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 5│Сумма налога удержанная     │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│
   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 6│Долг по налогу  за          │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │налогоплательщиком          │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│
   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 7│Долг по  налогу за          │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │налоговым агентом           │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│
   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 8│Сумма налога, переданная на │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │взыскание в налоговый орган │           │           │           │           │           │           │           │           │           │           │           │           │           │
   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │ 9│Возвращена налоговым агентом│           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │излишне удержанная          │           │           │           │           │           │           │           │           │           │           │           │           │           │
   │  │сумма налога                │           │           │           │           │           │           │           │           │           │           │           │           │           │
   └──┴────────────────────────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┘ Ш
 Ш.fields
'true':'s'
.endfields
^
.}
 Б   Раздел 6.ОБЩАЯ СУММА НАЛОГА ПО ИТОГАМ НАЛОГОВОГО ПЕРИОДА Б
.begin
 AllZero:= 0;
 AllНал13_Исч := 0;
 AllНал13_Удер:= 0;
 AllНал30_Исч := 0;
 AllНал30_Удер:= 0;
 AllДолгНалПлат13 := 0;
 AllДолгНалАгент13:= 0;
 AllДолгНалПлат30 := 0;
 AllДолгНалАгент30:= 0;
 AllДолгНалПлатDiv := 0;
 AllДолгНалАгентDiv := 0;
 RAllPred63Rez  := 0;
 RAllPred63NoRez:= 0;
 RAllPred64Rez  := 0;
 RAllPred64NoRez:= 0;
 RAllVz13:= 0;
 RAllVz30:= 0;
 RProcDiv := '';

if Статус ='1'
!13%
 begin
   RProcDiv := '9%'
   AllНал13_Исч := Round(RНалогИсчисл[13]);
   AllНал13_Удер:= Round(RНалогУдер[13]);
   RAllVz13:= RВзыскание[13]

   AllДолгНалПлат13 := RДолгНалПлат[13]
   AllДолгНалАгент13:= RДолгНалАгент[13]

   RAllPred63Rez:= NalPred63_1 + NalPred63_2 + NalPred63_3 + NalPred63_4 + NalPred63_5 + NalPred63_6 +
                   NalPred63_7 + NalPred63_8 + NalPred63_9 + NalPred63_10 + NalPred63_11 + NalPred63_12

   RAllPred64Rez:= NalPred64_1 + NalPred64_2 + NalPred64_3 + NalPred64_4 + NalPred64_5 + NalPred64_6 +
                   NalPred64_7 + NalPred64_8 + NalPred64_9 + NalPred64_10 + NalPred64_11 + NalPred64_12
 end
 else
 begin
   if ЗаГод > 2007
     RProcDiv := '15%'
   else
     RProcDiv := '9%'

   AllНал30_Исч := Round(RНалогИсчисл[13]);
   AllНал30_Удер:= Round(RНалогУдер[13]);
   RAllVz30 := RВзыскание[13]
   AllДолгНалПлат30 := RДолгНалПлат[13];
   AllДолгНалАгент30 := RДолгНалАгент[13];

   RAllPred63NoRez:= NalPred63_1 + NalPred63_2 + NalPred63_3 + NalPred63_4 + NalPred63_5 + NalPred63_6 +
                     NalPred63_7 + NalPred63_8 + NalPred63_9 + NalPred63_10 + NalPred63_11 + NalPred63_12

   RAllPred64NoRez:= NalPred64_1 + NalPred64_2 + NalPred64_3 + NalPred64_4 + NalPred64_5 + NalPred64_6 +
                     NalPred64_7 + NalPred64_8 + NalPred64_9 + NalPred64_10 + NalPred64_11 + NalPred64_12
 end
 AllДолгНалПлатDiv := RДолгНалПлатDiv[13]
 AllДолгНалАгентDiv := RДолгНалАгентDiv[13]

 if RAllНал35_Исчисл13 >  RAllНал35_Удер13  RДолг1Нал35_13 := RAllНал35_Исчисл13 - RAllНал35_Удер13
 else RДолг2Нал35_13 := RAllНал35_Удер13 - RAllНал35_Исчисл13;
end.
.fields
!9% или 15%
RProcDiv
RINalДивиденд[13]
RUNalДивиденд[13]
AllДолгНалПлатDiv
AllДолгНалАгентDiv

!13%
AllНал13_Исч
AllНал13_Удер
RAllVz13
AllZero
! Зачтено
RAllPred63Rez
!RAllPred64Rez
AllДолгНалПлат13
AllДолгНалАгент13

!30%
AllНал30_Исч
AllНал30_Удер
RAllVz30
AllZero
! Зачтено
RAllPred63NoRez
!RAllPred64NoRez
AllДолгНалПлат30
AllДолгНалАгент30

!35%
RAllНал35_Исчисл13
RAllНал35_Удер13
RДолг1Нал35_13
RДолг2Нал35_13

! Итого

double(RINalДивиденд[13]) + AllНал13_Исч + AllНал30_Исч + RAllНал35_Исчисл13
double(RUNalДивиденд[13]) + AllНал13_Удер + AllНал30_Удер + RAllНал35_Удер13
RAllVz13 + RAllVz30

AllZero
! Зачтено
RAllPred63Rez + RAllPred63NoRez
!RAllPred64Rez + RAllPred64NoRez
AllДолгНалПлатDiv  + AllДолгНалПлат13  +  AllДолгНалПлат30  + RДолг1Нал35_13
AllДолгНалАгентDiv + AllДолгНалАгент13 +  AllДолгНалАгент30 + RДолг2Нал35_13
.endfields
   ┌─────────────┬───────────────────────┬────────────┬──────────────────────────────────────────────────┬───────────────────────────────────────────┐
   │Показатели   │   Общая сумма налога  │Передано на │По перерасчету за предшествующие налоговые периоды│                Долг по налогу             │
   │             ├───────────┬───────────┤взыскание в ├──────────────────────┬───────────────────────────┤─────────────────────┬─────────────────────┤
   │             │Исчисленная│Удержанная │ налоговый  │     Возвращено       │ Зачтено в счет налоговых  │За налогоплательщиком│За налоговым агентом │
   │             │           │           │  орган     │                      │обязательств отчетного года│                     │                     │
   ├─────────────┼───────────┼───────────┼────────────┼──────────────────────┼───────────────────────────┼─────────────────────┼─────────────────────┤
   │По ставке @@@│&&&&&&&&&&&│&&&&&&&&&&&│            │                      │                           │ &&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&& │
   ├─────────────┼───────────┼───────────┼────────────┼──────────────────────┼───────────────────────────┼─────────────────────┼─────────────────────┤
   │По ставке 13%│&&&&&&&&&&&│&&&&&&&&&&&│ &&&&&&&&&&&│ &&&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&& │
   ├─────────────┼───────────┼───────────┼────────────┼──────────────────────┼───────────────────────────┼─────────────────────┼─────────────────────┤
   │По ставке 30%│&&&&&&&&&&&│&&&&&&&&&&&│ &&&&&&&&&&&│ &&&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&& │
   ├─────────────┼───────────┼───────────┼────────────┼──────────────────────┼───────────────────────────┼─────────────────────┼─────────────────────┤
   │По ставке 35%│&&&&&&&&&&&│&&&&&&&&&&&│            │                      │                           │ &&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&& │
   ├─────────────┼───────────┼───────────┼────────────┼──────────────────────┼───────────────────────────┼─────────────────────┼─────────────────────┤
   │   Итого     │&&&&&&&&&&&│&&&&&&&&&&&│ &&&&&&&&&&&│ &&&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&& │
   └─────────────┴───────────┴───────────┴────────────┴──────────────────────┴───────────────────────────┴─────────────────────┴─────────────────────┘ Ш

 Щ   Раздел 7.СВЕДЕНИЯ О ДОХОДАХ, НАЛОГООБЛОЖЕНИЕ КОТОРЫХ ОСУЩЕСТВЛЯЕТСЯ НАЛОГОВЫМИ ОРГАНАМИ
 Б   ┌─────────────────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┐
   │  Код  дохода        │   Январь  │  Февраль  │   Март    │   Апрель  │    Май    │    Июнь   │     Июль  │  Август   │  Сентябрь │  Октябрь  │   Ноябрь  │  Декабрь  │  Итого    │
   ├─────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш.begin
RВыплата13:= 0;
end.
.{ DoxodImu1_2005 CheckEnter
.fields
ВыплатыКод  Выплата1 Выплата2 Выплата3 Выплата4 Выплата5 Выплата6 Выплата7 Выплата8 Выплата9 Выплата10 Выплата11 Выплата12 RВыплата13
.endfields
.begin
RВыплата13:= Выплата1+ Выплата2+ Выплата3+ Выплата4+Выплата5+ Выплата6+Выплата7+Выплата8+Выплата9+Выплата10+Выплата11+Выплата12
end.
   │@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
   ├─────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш.}
 Ш Ш   └─────────────────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┘

    БРаздел 8. Б  БРЕЗУЛЬТАТЫ ПЕРЕРАСЧЕТА НАЛОГА ЗА ПРЕДШЕСТВУЮЩИЕ ПЕРИОДЫ Б
  ┌─────────────────────────────────────────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┐
  │                                             │Общая сумма│Общая сумма│Общая сумма│  Сумма    │   Сумма   │Долг по на-│  Долг     │Сумма нало-│
  │                                             │доходов,   │налоговых  │доходов,   │ исчислен- │удержанного│логу за на-│по налогу  │га, пере-  │
  │                                             │включаемых │вычетов,   │включаемых │  ного     │  налога   │логовым    │за налого- │данная на  │
  │                                             │в налоговую│исключаемых│в налоговую│  налога   │           │агентом    │плательщи- │взыскание  │
  │                                             │базу       │из налого- │базу и     │           │           │перед нало-│   ком     │в налоговый│
  │                                             │           │вой базы   │уменьшенных│           │           │гоплатель- │           │   орган   │
  │                                             │           │           │на налого- │           │           │щиком      │           │           │
  │                                             │           │           │вые вычеты │           │           │           │           │           │
  ├─────────────────────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
  │Отражено в налоговой карточке за _______ год │           │           │           │           │           │           │           │           │
  ├─────────────────────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
  │Результаты перерасчета налога за _______ год │           │           │           │           │           │           │           │           │
  ├─────────────────────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
  │Отражено в налоговой карточке за _______ год │           │           │           │           │           │           │           │           │
  ├─────────────────────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
  │Результаты перерасчета налога за _______ год │           │           │           │           │           │           │           │           │
  ├─────────────────────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
  │Отражено в налоговой карточке за _______ год │           │           │           │           │           │           │           │           │
  ├─────────────────────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
  │Результаты перерасчета налога за _______ год │           │           │           │           │           │           │           │           │
  └─────────────────────────────────────────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┘ Ш
 Ш.fields
НомерСправ ДатаСправ
DataForm
Dolj_Check FIO_Check
.endfields

  БРаздел 9. Б  БСВЕДЕНИЯ О ПРЕДСТАВЛЕНИИ СПРАВОК Б:

   а) налоговому органу о доходах: N справки ^ дата @@@@@@@@@@@ б) налогоплательщику о доходах: N справки ____________ дата _____________________

   в) налоговому органу о сумме задолженности, переданной на взыскание: N справки (письма) __________________________  дата  ____________________

   Правильность заполнения налоговой карточки проверена:

    Д&~&&&&&&&&&&& Д   Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д   Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д  _______________________

       (дата)               (должность)                                     (Фамилия, Имя, Отчество)                              (Подпись)
 Ш

 Ш.fields
'true':'s'
.endfields
^
.}
.endform
.linkForm 'Card2005_02' prototype is 'Card2005'
.group '2009'
.DEFO LANDSCAPE
.p 70
.var
 RДоходИтог1, RДоходИтог: double;
 RВычетИтог1, RВычетИтог2,RВычетИтог3,RВычетИтог4,
 RВычетИтог: double;
 RNeOblИтог:  double;
 RЗаГод    : array [1..12] of double;
RЗаМесяц     : array [1..12] of double;
RДОходМес    : array [1..12] of double;
RСтандВычетНГ: array [1..12] of double;
RВычетМес    : array [1..12] of double;
RNeOblМес    : array [1..12] of double;

RНалогБаза   : array [1..13] of double;
RНалогИсчисл : array [1..13] of double;
RНалогУдер   : array [1..13] of double;
RДолгНалПлат : array [1..13] of double;
RДолгНалАгент: array [1..13] of double;
RДолгНалПлатDiv: array [1..13] of double;
RДолгНалАгентDiv: array [1..13] of double;
RNalPred63: array [1..13] of double;
RNalPred64: array [1..13] of double;
RСтандВычетИтог1: double;
RСтандВычетИтог2: double;
RСтандВычетИтог3: double;
RСтандВычетИтог4: double;
RСтандВычетИтог5: double;
RСтандВычетИтог6: double;
RСтандВычетИтог7: double;
RСтандВычетИтог8: double;
RСтандВычетИтог9: double;
RСтандВычетИтог10: double;
RСтандВычетИтог11: double;
RСтандВычетИтог12: double;
RСтандВычетИтог13: double;
RСумДивиденд13: double;
RОблСумДивиденд13: double;
RНалБаза35_13: double;
RНал35_Исчисл13, RНал35_Удер13: double;
RAllНал35_Исчисл13, RAllНал35_Удер13: double;
RПризы13, RВычет35_13: double;
AllZero, AllНал13_Исч,  AllНал13_Удер, AllНал30_Исч,  AllНал30_Удер,
AllДолгНалПлат13, AllДолгНалАгент13, AllДолгНалПлат30, AllДолгНалАгент30: double;
AllДолгНалПлатDiv, AllДолгНалАгентDiv: double
RAllPred63Rez, RAllPred63NoRez, RAllPred64Rez, RAllPred64NoRez: double;
RВыплата13, RОстИмущВычета13, RИмущВычет13: double;
RДолг1Нал35_1, RДолг1Нал35_2, RДолг1Нал35_3,
RДолг1Нал35_4,      RДолг1Нал35_5,       RДолг1Нал35_6,
RДолг1Нал35_7,      RДолг1Нал35_8,       RДолг1Нал35_9,
RДолг1Нал35_10,     RДолг1Нал35_11,     RДолг1Нал35_12,
RДолг1Нал35_13,      RДолг2Нал35_1,      RДолг2Нал35_2,
RДолг2Нал35_3,      RДолг2Нал35_4,       RДолг2Нал35_5,
RДолг2Нал35_6, RДолг2Нал35_7, RДолг2Нал35_8,
RДолг2Нал35_9,     RДолг2Нал35_10,      RДолг2Нал35_11,
RДолг2Нал35_12, RДолг2Нал35_13: double
RИмущВычет: array [1..12] of double;
RВзыскание: array [1..13] of double;
i: integer;
RAllVz13, RAllVz30 : double;
RINalДивиденд: array [1..13] of string;
RUNalДивиденд: array [1..13] of string;
RСтандВычет1: array [1..12] of double;
RСтандВычет2: array [1..12] of double;
RСтандВычет3: array [1..12] of double;
RСтандВычет4: array [1..12] of double;
RСтандВычет5: array [1..12] of double;
RСтандВычет6: array [1..12] of double;
RСтандВычет7: array [1..12] of double;
RСтандВычет8: array [1..12] of double;
RСтандВычет9: array [1..12] of double;
RСтандВычет10: array [1..12] of double;
RСтандВычет11: array [1..12] of double;
RСтандВычет12: array [1..12] of double;
RСтандВычет13: array [1..12] of double;
RProcDiv: string[3];
Rгражданство:      string;
PrizGod:       boolean;
.endvar

.fields
ЗаГод Номер
ИНН
КодГни
ФИОАгента
KodOKATO
.endfields
.{ PersLoop1_2005 CheckEnter
.begin
 if ( not ReadMyDsk(PrizGod, 'NDFL_PrizGod', false) )
   PrizGod := true;
 for(i := 1; i <= 12; i := i + 1)
   RИмущВычет[i] := 0;
 Rгражданство :=  Гражданство;

 if (Rгражданство = '') and (Статус = '1')
   Rгражданство := '643'

end.
                                                                                      Утверждена
                                                                                      Приказом МНС РФ
                                                                                      от 31.10.2003
                                                                                      № БГ-3-04/583
                                                                                      Форма 1-НДФЛ








      БНАЛОГОВАЯ КАРТОЧКА Б  БПО УЧЕТУ ДОХОДОВ И НАЛОГА НА ДОХОДЫ ФИЗИЧЕСКИХ ЛИЦ Б  БЗА Б  Д@@@@ Д  БГОД Б  БN Б  Д@@@@@@@@ Д

    БРаздел 1. СВЕДЕНИЯ О НАЛОГОВОМ АГЕНТЕ (ИСТОЧНИКЕ ДОХОДОВ) Б

 И   1.1. ИНН/КПП (для организации или ИНН для налогового агента - индивидуального предпринимателя)  Д@@@@@@@@@@@@@@@@@@@@@@@ Д

   1.2. Код налогового органа, где налоговый агент состоит на учете  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д

   1.3. Наименование (фамилия, имя, отчество) налогового агента  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д

   1.4. Код ОКАТО Д @@@@@@@@@@@ М

    БРаздел 2. СВЕДЕНИЯ О НАЛОГОПЛАТЕЛЬЩИКЕ (ПОЛУЧАТЕЛЕ ДОХОДОВ) Б
.fields
ИННПлательщика
НомерСвидПФ
ФИО
Код СерияНомДок
Дата_рождения
RГражданство
КодСтраны
Индекс
КодРегиона
Район Город
НасПункт Улица Дом Корпус Квартира
Статус ДокСтатуса
ВычетыЗаяв
.endfields
 И   2.1. ИНН  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д 2.2. Номер страхового свидетельства ПФР  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д

   2.3. Фамилия, Имя, Отчество  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д

   2.4. Вид документа, удостоверяющего личность: Код <*>  Д@@@ Д 2.5. Серия, номер документа  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д

   2.6. Дата рождения (число, месяц, год)   Д@@@@@@@@@@ Д       2.7. Гражданство  Д@@@@@@@@@ Д

   2.8. Адрес постоянного места жительства: Код страны  Д@@@@@@@@@@@@@@ Д Почтовый индекс  Д@@@@@@@@@@@@ Д Код региона  Д@@@@@@@@@@@@ Д

   Район  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д Город  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д

   Населенный пункт  Д@@@@@@@@@@@@@@@@@@@@@@@@@ Д Улица  Д@@@@@@@@@@@@@@@@@@@@@ Д Дом  Д@@@@@@@@@ Д Корпус  Д@@@@@@@@@ Д Квартира  Д@@@@@@@@@ Д

   2.9. Статус (1 - резидент, 2 - нерезидент)  Д@@@@@ Д реквизиты документа, подтверждающего статус  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д

   2.10. Стандартные налоговые вычеты заявлены (1), не заявлены (2)  Д@@@ Д
 И
.fields
'true':'s'
.endfields
^

 Б Раздел 3. РАСЧЕТ НАЛОГОВОЙ БАЗЫ И НАЛОГА НА ДОХОДЫ ФИЗИЧЕСКОГО ЛИЦА
 (для доходов, облагаемых по ставкам 13% и 30%) Б
.fields
ДолгПлательщика1
ДолгАгента1
Доход_с_пред_места_работы

КодДохода1
String(Доход1_1)
String(Доход1_2)
String(Доход1_3)
String(Доход1_4)
String(Доход1_5)
String(Доход1_6)
String(Доход1_7)
String(Доход1_8)
String(Доход1_9)
String(Доход1_10)
String(Доход1_11)
String(Доход1_12)
String(RДоходИтог1)

КодВычета1
if(trim(КодВычета1)<> '',String(Вычет1_1),'')
if(trim(КодВычета1)<> '',String(Вычет1_2),'')
if(trim(КодВычета1)<> '',String(Вычет1_3),'')
if(trim(КодВычета1)<> '',String(Вычет1_4),'')
if(trim(КодВычета1)<> '',String(Вычет1_5),'')
if(trim(КодВычета1)<> '',String(Вычет1_6),'')
if(trim(КодВычета1)<> '',String(Вычет1_7),'')
if(trim(КодВычета1)<> '',String(Вычет1_8),'')
if(trim(КодВычета1)<> '',String(Вычет1_9),'')
if(trim(КодВычета1)<> '',String(Вычет1_10),'')
if(trim(КодВычета1)<> '',String(Вычет1_11),'')
if(trim(КодВычета1)<> '',String(Вычет1_12),' ')
if(trim(КодВычета1)<> '',String(RВычетИтог1),'')

КодВычета2
if(trim(КодВычета2)<> '',String(Вычет2_1),'')
if(trim(КодВычета2)<> '',String(Вычет2_2),'')
if(trim(КодВычета2)<> '',String(Вычет2_3),'')
if(trim(КодВычета2)<> '',String(Вычет2_4),'')
if(trim(КодВычета2)<> '',String(Вычет2_5),'')
if(trim(КодВычета2)<> '',String(Вычет2_6),'')
if(trim(КодВычета2)<> '',String(Вычет2_7),'')
if(trim(КодВычета2)<> '',String(Вычет2_8),'')
if(trim(КодВычета2)<> '',String(Вычет2_9),'')
if(trim(КодВычета2)<> '',String(Вычет2_10),'')
if(trim(КодВычета2)<> '',String(Вычет2_11),'')
if(trim(КодВычета2)<> '',String(Вычет2_12),'')
if(trim(КодВычета2)<> '',String(RВычетИтог2),'')

КодВычета3
if(trim(КодВычета3)<> '',String(Вычет3_1),'')
if(trim(КодВычета3)<> '',String(Вычет3_2),'')
if(trim(КодВычета3)<> '',String(Вычет3_3),'')
if(trim(КодВычета3)<> '',String(Вычет3_4),'')
if(trim(КодВычета3)<> '',String(Вычет3_5),'')
if(trim(КодВычета3)<> '',String(Вычет3_6),'')
if(trim(КодВычета3)<> '',String(Вычет3_7),'')
if(trim(КодВычета3)<> '',String(Вычет3_8),'')
if(trim(КодВычета3)<> '',String(Вычет3_9),'')
if(trim(КодВычета3)<> '',String(Вычет3_10),'')
if(trim(КодВычета3)<> '',String(Вычет3_11),'')
if(trim(КодВычета3)<> '',String(Вычет3_12),'')
if(trim(КодВычета3)<> '',String(RВычетИтог3),'')

КодВычета4
if(trim(КодВычета4)<> '',String(Вычет4_1),'')
if(trim(КодВычета4)<> '',String(Вычет4_2),'')
if(trim(КодВычета4)<> '',String(Вычет4_3),'')
if(trim(КодВычета4)<> '',String(Вычет4_4),'')
if(trim(КодВычета4)<> '',String(Вычет4_5),'')
if(trim(КодВычета4)<> '',String(Вычет4_6),'')
if(trim(КодВычета4)<> '',String(Вычет4_7),'')
if(trim(КодВычета4)<> '',String(Вычет4_8),'')
if(trim(КодВычета4)<> '',String(Вычет4_9),'')
if(trim(КодВычета4)<> '',String(Вычет4_10),'')
if(trim(КодВычета4)<> '',String(Вычет4_11),'')
if(trim(КодВычета4)<> '',String(Вычет4_12),'')
if(trim(КодВычета4)<> '',String(RВычетИтог4),'')
.endfields
.begin
   for(i := 1; i <= 12; i := i + 1)
   {
     RСтандВычет1[i] := 0;
     RСтандВычет2[i] := 0;
     RСтандВычет3[i] := 0;
     RСтандВычет4[i] := 0;
     RСтандВычет5[i] := 0;
     RСтандВычет6[i] := 0;
     RСтандВычет7[i] := 0;

     RДОходМес[i]    := 0;
     RВычетМес[i]    := 0;
     RNeOblМес[i]    := 0;
     RСтандВычетНГ[i]:= 0;
    }
    RДоходИтог := 0; RВычетИтог := 0; RNeOblИтог := 0;
end.
   ┌───────────────────────────────┬─────────────────────────────────────┬──────────────────────────┐
   │ На начало налогового          │Долг по налогу за налогоплательщиком │      &~#&&&&&&&&&&&.&&   │
   │       периода                 ├─────────────────────────────────────┼──────────────────────────┤ ┌───────────────────────────────────────────────────────────────────┬────────────────────┐
   │                               │Долг по налогу за налоговым агентом  │      &~#&&&&&&&&&&&.&&   │ │Сумма дохода, облагаемого по ставке 13% с предыдущего места работы:│ &#&&&&&&&&&&&&.&&  │
   ├───────────────────────────────┼───────────┬───────────┬───────────┬─┴─────────┬───────────┬────┴─┴────┬───────────┬───────────┬───────────┬───────────┬───────────┬──┴────────┬───────────┤
   │Наименование показателя        │   Январь  │  Февраль  │   Март    │   Апрель  │    Май    │    Июнь   │     Июль  │  Август   │  Сентябрь │  Октябрь  │   Ноябрь  │  Декабрь  │  Итого    │
   ├───────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
.{ DoxodLoop1_2005 CheckEnter
.begin
  RДоходИтог1:= 0;
  RДоходИтог1:= RДоходИтог1 + Доход1_1 + Доход1_2 + Доход1_3 +Доход1_4 +Доход1_5 + Доход1_6 +
  Доход1_7 + Доход1_8 + Доход1_9 +Доход1_10 + Доход1_11 +Доход1_12;
  RДоходИтог := RДоходИтог + RДоходИтог1;
      RДОходМес[1] := RДОходМес[1] + Доход1_1;
      RДОходМес[2] := RДОходМес[2] + Доход1_2;
      RДОходМес[3] := RДОходМес[3] + Доход1_3;
      RДОходМес[4] := RДОходМес[4] + Доход1_4;
      RДОходМес[5] := RДОходМес[5] + Доход1_5;
      RДОходМес[6] := RДОходМес[6] + Доход1_6;
      RДОходМес[7] := RДОходМес[7] + Доход1_7;
      RДОходМес[8] := RДОходМес[8] + Доход1_8;
      RДОходМес[9] := RДОходМес[9] + Доход1_9;
      RДОходМес[10]:= RДОходМес[10]+ Доход1_10;
      RДОходМес[11]:= RДОходМес[11]+ Доход1_11;
      RДОходМес[12]:= RДОходМес[12]+ Доход1_12;
end.
   │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
.}
   ├───────────────┬───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
.begin
    RВычетИтог1:= 0;
    RВычетИтог1:= Вычет1_1 + Вычет1_2 +Вычет1_3 + Вычет1_4 + Вычет1_5 + Вычет1_6 +
                  Вычет1_7 + Вычет1_8 +Вычет1_9 + Вычет1_10 + Вычет1_11 + Вычет1_12;
    RВычетИтог:= RВычетИтог + RВычетИтог1;
    RВычетМес[1] := RВычетМес[1] + Вычет1_1;
    RВычетМес[2] := RВычетМес[2] + Вычет1_2;
    RВычетМес[3] := RВычетМес[3] + Вычет1_3;
    RВычетМес[4] := RВычетМес[4] + Вычет1_4;
    RВычетМес[5] := RВычетМес[5] + Вычет1_5;
    RВычетМес[6] := RВычетМес[6] + Вычет1_6;
    RВычетМес[7] := RВычетМес[7] + Вычет1_7;
    RВычетМес[8] := RВычетМес[8] + Вычет1_8;
    RВычетМес[9] := RВычетМес[9] + Вычет1_9;
    RВычетМес[10]:= RВычетМес[10]+ Вычет1_10;
    RВычетМес[11]:= RВычетМес[11]+ Вычет1_11;
    RВычетМес[12]:= RВычетМес[12]+ Вычет1_12;

    RВычетИтог2:= 0;
    RВычетИтог2:= Вычет2_1 + Вычет2_2 + Вычет2_3 + Вычет2_4 + Вычет2_5 + Вычет2_6 +
    Вычет2_7 + Вычет2_8 + Вычет2_9 + Вычет2_10 + Вычет2_11 + Вычет2_12;
    RВычетИтог := RВычетИтог + RВычетИтог2;
    RВычетМес[1] := RВычетМес[1] + Вычет2_1;
    RВычетМес[2] := RВычетМес[2] + Вычет2_2;
    RВычетМес[3] := RВычетМес[3] + Вычет2_3;
    RВычетМес[4] := RВычетМес[4] + Вычет2_4;
    RВычетМес[5] := RВычетМес[5] + Вычет2_5;
    RВычетМес[6] := RВычетМес[6] + Вычет2_6;
    RВычетМес[7] := RВычетМес[7] + Вычет2_7;
    RВычетМес[8] := RВычетМес[8] + Вычет2_8;
    RВычетМес[9] := RВычетМес[9] + Вычет2_9;
    RВычетМес[10]:= RВычетМес[10]+ Вычет2_10;
    RВычетМес[11]:= RВычетМес[11]+ Вычет2_11;
    RВычетМес[12]:= RВычетМес[12]+ Вычет2_12;

    RВычетИтог3:= 0;
    RВычетИтог3 :=  Вычет3_1 + Вычет3_2 + Вычет3_3 + Вычет3_4 + Вычет3_5 + Вычет3_6 +
                    Вычет3_7 + Вычет3_8 + Вычет3_9 + Вычет3_10 +Вычет3_11 + Вычет3_12;
    RВычетИтог := RВычетИтог + RВычетИтог3;
    RВычетМес[1] := RВычетМес[1] + Вычет3_1;
    RВычетМес[2] := RВычетМес[2] + Вычет3_2;
    RВычетМес[3] := RВычетМес[3] + Вычет3_3;
    RВычетМес[4] := RВычетМес[4] + Вычет3_4;
    RВычетМес[5] := RВычетМес[5] + Вычет3_5;
    RВычетМес[6] := RВычетМес[6] + Вычет3_6;
    RВычетМес[7] := RВычетМес[7] + Вычет3_7;
    RВычетМес[8] := RВычетМес[8] + Вычет3_8;
    RВычетМес[9] := RВычетМес[9] + Вычет3_9;
    RВычетМес[10]:= RВычетМес[10]+ Вычет3_10;
    RВычетМес[11]:= RВычетМес[11]+ Вычет3_11;
    RВычетМес[12]:= RВычетМес[12]+ Вычет3_12;
end.
   │Налоговые выче-│ Код @@@@      │&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│ Ш
 Ш   │ты, за исклю-  ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │чением         │ Код @@@@      │&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│ Ш
 Ш   │стандартных    ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
   │               │ Код @@@@      │&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│ Ш
 Ш.{ LastVychLoop1_2005 CheckEnter
   │               ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
.begin
    RВычетИтог4 := 0;
    RВычетИтог4 := Вычет4_1 + Вычет4_2 + Вычет4_3 + Вычет4_4 +  Вычет4_5 + Вычет4_6 +
                   Вычет4_7 + Вычет4_8 + Вычет4_9 + Вычет4_10 + Вычет4_11 + Вычет4_12;
    RВычетИтог := RВычетИтог + RВычетИтог4;
    RВычетМес[1] := RВычетМес[1] + Вычет4_1;
    RВычетМес[2] := RВычетМес[2] + Вычет4_2;
    RВычетМес[3] := RВычетМес[3] + Вычет4_3;
    RВычетМес[4] := RВычетМес[4] + Вычет4_4;
    RВычетМес[5] := RВычетМес[5] + Вычет4_5;
    RВычетМес[6] := RВычетМес[6] + Вычет4_6;
    RВычетМес[7] := RВычетМес[7] + Вычет4_7;
    RВычетМес[8] := RВычетМес[8] + Вычет4_8;
    RВычетМес[9] := RВычетМес[9] + Вычет4_9;
    RВычетМес[10]:= RВычетМес[10]+ Вычет4_10;
    RВычетМес[11]:= RВычетМес[11]+ Вычет4_11;
    RВычетМес[12]:= RВычетМес[12]+ Вычет4_12;
end. Ш
 Ш   │               │ Код @@@@      │&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│&#&&&&&&.&&│
.}
.begin
    RNeOblИтог:= NeObl_1 + NeObl_2 + NeObl_3 + NeObl_4 + NeObl_5 + NeObl_6 +
                 NeObl_7 + NeObl_8 + NeObl_9 + NeObl_10 + NeObl_11 + NeObl_12;

    if Статус = '1'
    {
      RNeOblМес[1] := NeObl_1;
      RNeOblМес[2] := RNeOblМес[1] + NeObl_2;
      RNeOblМес[3] := RNeOblМес[2] + NeObl_3;
      RNeOblМес[4] := RNeOblМес[3] + NeObl_4;
      RNeOblМес[5] := RNeOblМес[4] + NeObl_5;
      RNeOblМес[6] := RNeOblМес[5] + NeObl_6;
      RNeOblМес[7] := RNeOblМес[6] + NeObl_7;
      RNeOblМес[8] := RNeOblМес[7] + NeObl_8;
      RNeOblМес[9] := RNeOblМес[8] + NeObl_9;
      RNeOblМес[10]:= RNeOblМес[9] + NeObl_10;
      RNeOblМес[11]:= RNeOblМес[10]+ NeObl_11;
      RNeOblМес[12]:= RNeOblМес[11]+ NeObl_12;
    }
    else
    {
      RNeOblМес[1] := NeObl_1;
      RNeOblМес[2] := NeObl_2;
      RNeOblМес[3] := NeObl_3;
      RNeOblМес[4] := NeObl_4;
      RNeOblМес[5] := NeObl_5;
      RNeOblМес[6] := NeObl_6;
      RNeOblМес[7] := NeObl_7;
      RNeOblМес[8] := NeObl_8;
      RNeOblМес[9] := NeObl_9;
      RNeOblМес[10]:= NeObl_10;
      RNeOblМес[11]:= NeObl_11;
      RNeOblМес[12]:= NeObl_12;

    }

end.
.begin
  for(i := 1; i <= 12; i := i + 1)
  {
    RЗаГод  [i]:= 0;
    RЗаМесяц[i]:= 0;
  }

  for(i := 1; i <= 12; i := i + 1)
  {
    RЗаМесяц[i] := RДОходМес[i] - RВычетМес[i];
    if i=1
      RЗаГод[i] :=  RЗаМесяц[i]
    else
      RЗаГод[i] := RЗаГод[i-1] + RЗаМесяц[i];
  }

!  if ((ЗаГод < YearRas1) and (PrevChild1 >= RЗаГод[1]) or (ЗаГод >= YearRas1))
  {
    RСтандВычет1[1] := СтандВычет1_1 //101
    RСтандВычет2[1] := СтандВычет2_1 //102
    RСтандВычет6[1] := СтандВычет6_1 //106
    RСтандВычет7[1] := СтандВычет7_1 //107
    RСтандВычет8[1] := СтандВычет8_1 //108
    RСтандВычет9[1] := СтандВычет9_1 //109
    RСтандВычет10[1] := СтандВычет10_1 //110
    RСтандВычет11[1] := СтандВычет11_1 //111
    RСтандВычет12[1] := СтандВычет12_1 //112
    RСтандВычет13[1] := СтандВычет13_1 //113
  }

    RСтандВычет1[2] := СтандВычет1_2
    RСтандВычет2[2] := СтандВычет2_2
    RСтандВычет6[2] := СтандВычет6_2 //106
    RСтандВычет7[2] := СтандВычет7_2 //107
    RСтандВычет8[2] := СтандВычет8_2 //108
    RСтандВычет9[2] := СтандВычет9_2 //109
    RСтандВычет10[2] := СтандВычет10_2 //110
    RСтандВычет11[2] := СтандВычет11_2 //111
    RСтандВычет12[2] := СтандВычет12_2 //112
    RСтандВычет13[2] := СтандВычет13_2 //113

    RСтандВычет1[3] := СтандВычет1_3
    RСтандВычет2[3] := СтандВычет2_3
    RСтандВычет6[3] := СтандВычет6_3 //106
    RСтандВычет7[3] := СтандВычет7_3 //107
    RСтандВычет8[3] := СтандВычет8_3 //108
    RСтандВычет9[3] := СтандВычет9_3 //109
    RСтандВычет10[3] := СтандВычет10_3 //110
    RСтандВычет11[3] := СтандВычет11_3 //111
    RСтандВычет12[3] := СтандВычет12_3 //112
    RСтандВычет13[3] := СтандВычет13_3 //113

    RСтандВычет1[4] := СтандВычет1_4
    RСтандВычет2[4] := СтандВычет2_4
    RСтандВычет6[4] := СтандВычет6_4 //106
    RСтандВычет7[4] := СтандВычет7_4 //107
    RСтандВычет8[4] := СтандВычет8_4 //108
    RСтандВычет9[4] := СтандВычет9_4 //109
    RСтандВычет10[4] := СтандВычет10_4 //110
    RСтандВычет11[4] := СтандВычет11_4 //111
    RСтандВычет12[4] := СтандВычет12_4 //112
    RСтандВычет13[4] := СтандВычет13_4 //113

    RСтандВычет1[5] := СтандВычет1_5
    RСтандВычет2[5] := СтандВычет2_5
    RСтандВычет6[5] := СтандВычет6_5 //106
    RСтандВычет7[5] := СтандВычет7_5 //107
    RСтандВычет8[5] := СтандВычет8_5 //108
    RСтандВычет9[5] := СтандВычет9_5 //109
    RСтандВычет10[5] := СтандВычет10_5 //110
    RСтандВычет11[5] := СтандВычет11_5 //111
    RСтандВычет12[5] := СтандВычет12_5 //112
    RСтандВычет13[5] := СтандВычет13_5 //113

    RСтандВычет1[6] := СтандВычет1_6
    RСтандВычет2[6] := СтандВычет2_6
    RСтандВычет6[6] := СтандВычет6_6 //106
    RСтандВычет7[6] := СтандВычет7_6 //107
    RСтандВычет8[6] := СтандВычет8_6 //108
    RСтандВычет9[6] := СтандВычет9_6 //109
    RСтандВычет10[6] := СтандВычет10_6 //110
    RСтандВычет11[6] := СтандВычет11_6 //111
    RСтандВычет12[6] := СтандВычет12_6 //112
    RСтандВычет13[6] := СтандВычет13_6 //113

    RСтандВычет1[7] := СтандВычет1_7
    RСтандВычет2[7] := СтандВычет2_7
    RСтандВычет6[7] := СтандВычет6_7 //106
    RСтандВычет7[7] := СтандВычет7_7 //107
    RСтандВычет8[7] := СтандВычет8_7 //108
    RСтандВычет9[7] := СтандВычет9_7 //109
    RСтандВычет10[7] := СтандВычет10_7 //110
    RСтандВычет11[7] := СтандВычет11_7 //111
    RСтандВычет12[7] := СтандВычет12_7 //112
    RСтандВычет13[7] := СтандВычет13_7 //113

    RСтандВычет1[8] := СтандВычет1_8
    RСтандВычет2[8] := СтандВычет2_8
    RСтандВычет6[8] := СтандВычет6_8 //106
    RСтандВычет7[8] := СтандВычет7_8 //107
    RСтандВычет8[8] := СтандВычет8_8 //108
    RСтандВычет9[8] := СтандВычет9_8 //109
    RСтандВычет10[8] := СтандВычет10_8 //110
    RСтандВычет11[8] := СтандВычет11_8 //111
    RСтандВычет12[8] := СтандВычет12_8 //112
    RСтандВычет13[8] := СтандВычет13_8 //113

    RСтандВычет1[9] := СтандВычет1_9
    RСтандВычет2[9] := СтандВычет2_9
    RСтандВычет6[9] := СтандВычет6_9 //106
    RСтандВычет7[9] := СтандВычет7_9 //107
    RСтандВычет8[9] := СтандВычет8_9 //108
    RСтандВычет9[9] := СтандВычет9_9 //109
    RСтандВычет10[9] := СтандВычет10_9 //110
    RСтандВычет11[9] := СтандВычет11_9 //111
    RСтандВычет12[9] := СтандВычет12_9 //112
    RСтандВычет13[9] := СтандВычет13_9 //113

    RСтандВычет1[10] := СтандВычет1_10
    RСтандВычет2[10] := СтандВычет2_10
    RСтандВычет6[10] := СтандВычет6_10 //106
    RСтандВычет7[10] := СтандВычет7_10 //107
    RСтандВычет8[10] := СтандВычет8_10 //108
    RСтандВычет9[10] := СтандВычет9_10 //109
    RСтандВычет10[10] := СтандВычет10_10 //110
    RСтандВычет11[10] := СтандВычет11_10 //111
    RСтандВычет12[10] := СтандВычет12_10 //112
    RСтандВычет13[10] := СтандВычет13_10 //113

    RСтандВычет1[11] := СтандВычет1_11
    RСтандВычет2[11] := СтандВычет2_11
    RСтандВычет6[11] := СтандВычет6_11 //106
    RСтандВычет7[11] := СтандВычет7_11 //107
    RСтандВычет8[11] := СтандВычет8_11 //108
    RСтандВычет9[11] := СтандВычет9_11 //109
    RСтандВычет10[11] := СтандВычет10_11 //110
    RСтандВычет11[11] := СтандВычет11_11 //111
    RСтандВычет12[11] := СтандВычет12_11 //112
    RСтандВычет13[11] := СтандВычет13_11 //113

    RСтандВычет1[12] := СтандВычет1_12
    RСтандВычет2[12] := СтандВычет2_12
    RСтандВычет6[12] := СтандВычет6_12 //106
    RСтандВычет7[12] := СтандВычет7_12 //107
    RСтандВычет8[12] := СтандВычет8_12 //108
    RСтандВычет9[12] := СтандВычет9_12 //109
    RСтандВычет10[12] := СтандВычет10_12 //110
    RСтандВычет11[12] := СтандВычет11_12 //111
    RСтандВычет12[12] := СтандВычет12_12 //112
    RСтандВычет13[12] := СтандВычет13_12 //113

  RСтандВычетИтог1 := RСтандВычет1[1] + RСтандВычет1[2] + RСтандВычет1[3] + RСтандВычет1[4] + RСтандВычет1[5] +
                      RСтандВычет1[6] + RСтандВычет1[7] + RСтандВычет1[8] + RСтандВычет1[9] + RСтандВычет1[10] +
                      RСтандВычет1[11] + RСтандВычет1[12];

  RСтандВычетИтог2 := RСтандВычет2[1] + RСтандВычет2[2] + RСтандВычет2[3] + RСтандВычет2[4] + RСтандВычет2[5] +
                      RСтандВычет2[6] + RСтандВычет2[7] + RСтандВычет2[8] + RСтандВычет2[9] + RСтандВычет2[10] +
                      RСтандВычет2[11] + RСтандВычет2[12];

  RСтандВычетИтог6 := RСтандВычет6[1] + RСтандВычет6[2] + RСтандВычет6[3] + RСтандВычет6[4] + RСтандВычет6[5] +
                      RСтандВычет6[6] + RСтандВычет6[7] + RСтандВычет6[8] + RСтандВычет6[9] + RСтандВычет6[10] +
                      RСтандВычет6[11] + RСтандВычет6[12];

  RСтандВычетИтог7 := RСтандВычет7[1] + RСтандВычет7[2] + RСтандВычет7[3] + RСтандВычет7[4] + RСтандВычет7[5] +
                      RСтандВычет7[6] + RСтандВычет7[7] + RСтандВычет7[8] + RСтандВычет7[9] + RСтандВычет7[10] +
                      RСтандВычет7[11] + RСтандВычет7[12];

    RСтандВычет3[1] := СтандВычет3_1 //103
    RСтандВычет4[1] := СтандВычет4_1 //104
    RСтандВычет5[1] := СтандВычет5_1 //105

    RСтандВычет3[2] := СтандВычет3_2 //103
    RСтандВычет4[2] := СтандВычет4_2 //104

    RСтандВычет5[2] := СтандВычет5_2 //105
    RСтандВычет3[3] := СтандВычет3_3 //103
    RСтандВычет4[3] := СтандВычет4_3 //104
    RСтандВычет5[3] := СтандВычет5_3 //105

    RСтандВычет3[4] := СтандВычет3_4 //103
    RСтандВычет4[4] := СтандВычет4_4 //104
    RСтандВычет5[4] := СтандВычет5_4 //105

    RСтандВычет3[5] := СтандВычет3_5 //103
    RСтандВычет4[5] := СтандВычет4_5 //104
    RСтандВычет5[5] := СтандВычет5_5 //105

    RСтандВычет3[6] := СтандВычет3_6 //103
    RСтандВычет4[6] := СтандВычет4_6 //104
    RСтандВычет5[6] := СтандВычет5_6 //105

    RСтандВычет3[7] := СтандВычет3_7 //103
    RСтандВычет4[7] := СтандВычет4_7 //104
    RСтандВычет5[7] := СтандВычет5_7 //105

    RСтандВычет3[8] := СтандВычет3_8 //103
    RСтандВычет4[8] := СтандВычет4_8 //104
    RСтандВычет5[8] := СтандВычет5_8 //105

    RСтандВычет3[9] := СтандВычет3_9 //103
    RСтандВычет4[9] := СтандВычет4_9 //104
    RСтандВычет5[9] := СтандВычет5_9 //105

    RСтандВычет3[10] := СтандВычет3_10 //103
    RСтандВычет4[10] := СтандВычет4_10 //104
    RСтандВычет5[10] := СтандВычет5_10 //105

    RСтандВычет3[11] := СтандВычет3_11 //103
    RСтандВычет4[11] := СтандВычет4_11 //104
    RСтандВычет5[11] := СтандВычет5_11 //105

    RСтандВычет3[12] := СтандВычет3_12 //103
    RСтандВычет4[12] := СтандВычет4_12 //104
    RСтандВычет5[12] := СтандВычет5_12 //105

  RСтандВычетИтог3 := RСтандВычет3[1] + RСтандВычет3[2] + RСтандВычет3[3] + RСтандВычет3[4] + RСтандВычет3[5] +
                      RСтандВычет3[6] + RСтандВычет3[7] + RСтандВычет3[8] + RСтандВычет3[9] + RСтандВычет3[10] +
                      RСтандВычет3[11] + RСтандВычет3[12];

  RСтандВычетИтог4 := RСтандВычет4[1] + RСтандВычет4[2] + RСтандВычет4[3] + RСтандВычет4[4] + RСтандВычет4[5] +
                      RСтандВычет4[6] + RСтандВычет4[7] + RСтандВычет4[8] + RСтандВычет4[9] + RСтандВычет4[10] +
                      RСтандВычет4[11] + RСтандВычет4[12];

  RСтандВычетИтог5 := RСтандВычет5[1] + RСтандВычет5[2] + RСтандВычет5[3] + RСтандВычет5[4] + RСтандВычет5[5] +
                      RСтандВычет5[6] + RСтандВычет5[7] + RСтандВычет5[8] + RСтандВычет5[9] + RСтандВычет5[10] +
                      RСтандВычет5[11] + RСтандВычет5[12];

end.
.fields
RЗаМесяц[1] RЗаМесяц[2] RЗаМесяц[3] RЗаМесяц[4] RЗаМесяц[5]
RЗаМесяц[6] RЗаМесяц[7] RЗаМесяц[8] RЗаМесяц[9] RЗаМесяц[10] RЗаМесяц[11] RЗаМесяц[12]
(RДоходИтог - RВычетИтог)

if(trim(Статус)= '1',String(RЗаГод[1]),'') if(trim(Статус)= '1',String(RЗаГод[2]),'')
if(trim(Статус)= '1',String(RЗаГод[3]),'') if(trim(Статус)= '1',String(RЗаГод[4]),'')
if(trim(Статус)= '1',String(RЗаГод[5]),'') if(trim(Статус)= '1',String(RЗаГод[6]),'')
if(trim(Статус)= '1',String(RЗаГод[7]),'') if(trim(Статус)= '1',String(RЗаГод[8]),'')
if(trim(Статус)= '1',String(RЗаГод[9]),'') if(trim(Статус)= '1',String(RЗаГод[10]),'')
if(trim(Статус)= '1',String(RЗаГод[11]),'') if(trim(Статус)= '1',String(RЗаГод[12]),'')
if(trim(Статус) = '1',String(RЗаГод[12]),'')

RСтандВычет1[1]  RСтандВычет1[2]
RСтандВычет1[3]  RСтандВычет1[4]
RСтандВычет1[5]  RСтандВычет1[6]
RСтандВычет1[7]  RСтандВычет1[8]
RСтандВычет1[9]  RСтандВычет1[10]
RСтандВычет1[11] RСтандВычет1[12]
RСтандВычетИтог1

RСтандВычет2[1]  RСтандВычет2[2]
RСтандВычет2[3]  RСтандВычет2[4]
RСтандВычет2[5]  RСтандВычет2[6]
RСтандВычет2[7]  RСтандВычет2[8]
RСтандВычет2[9]  RСтандВычет2[10]
RСтандВычет2[11] RСтандВычет2[12]
RСтандВычетИтог2

RСтандВычет3[1]  RСтандВычет3[2]
RСтандВычет3[3]  RСтандВычет3[4]
RСтандВычет3[5]  RСтандВычет3[6]
RСтандВычет3[7]  RСтандВычет3[8]
RСтандВычет3[9]  RСтандВычет3[10]
RСтандВычет3[11] RСтандВычет3[12]
RСтандВычетИтог3

RСтандВычет4[1] RСтандВычет4[2]
RСтандВычет4[3] RСтандВычет4[4]
RСтандВычет4[5] RСтандВычет4[6]
RСтандВычет4[7] RСтандВычет4[8]
RСтандВычет4[9] RСтандВычет4[10]
RСтандВычет4[11] RСтандВычет4[12]
RСтандВычетИтог4

RСтандВычет5[1]  RСтандВычет5[2]
RСтандВычет5[3]  RСтандВычет5[4]
RСтандВычет5[5]  RСтандВычет5[6]
RСтандВычет5[7]  RСтандВычет5[8]
RСтандВычет5[9]  RСтандВычет5[10]
RСтандВычет5[11] RСтандВычет5[12]
RСтандВычетИтог5

RСтандВычет6[1] RСтандВычет6[2]
RСтандВычет6[3] RСтандВычет6[4]
RСтандВычет6[5] RСтандВычет6[6]
RСтандВычет6[7] RСтандВычет6[8]
RСтандВычет6[9]
RСтандВычет6[10] RСтандВычет6[11] RСтандВычет6[12]
RСтандВычетИтог6

RСтандВычет7[1]  RСтандВычет7[2]
RСтандВычет7[3]  RСтандВычет7[4]
RСтандВычет7[5]  RСтандВычет7[6]
RСтандВычет7[7]  RСтандВычет7[8]
RСтандВычет7[9]  RСтандВычет7[10]
RСтандВычет7[11] RСтандВычет7[12]
RСтандВычетИтог7

RСтандВычет8[1]  RСтандВычет8[2]
RСтандВычет8[3]  RСтандВычет8[4]
RСтандВычет8[5]  RСтандВычет8[6]
RСтандВычет8[7]  RСтандВычет8[8]
RСтандВычет8[9]  RСтандВычет8[10]
RСтандВычет8[11] RСтандВычет8[12]
RСтандВычетИтог8

RСтандВычет9[1]  RСтандВычет9[2]
RСтандВычет9[3]  RСтандВычет9[4]
RСтандВычет9[5]  RСтандВычет9[6]
RСтандВычет9[7]  RСтандВычет9[8]
RСтандВычет9[9]  RСтандВычет9[10]
RСтандВычет9[11] RСтандВычет9[12]
RСтандВычетИтог9

RСтандВычет10[1]  RСтандВычет10[2]
RСтандВычет10[3]  RСтандВычет10[4]
RСтандВычет10[5]  RСтандВычет10[6]
RСтандВычет10[7]  RСтандВычет10[8]
RСтандВычет10[9]  RСтандВычет10[10]
RСтандВычет10[11] RСтандВычет10[12]
RСтандВычетИтог10

RСтандВычет11[1]  RСтандВычет11[2]
RСтандВычет11[3]  RСтандВычет11[4]
RСтандВычет11[5]  RСтандВычет11[6]
RСтандВычет11[7]  RСтандВычет11[8]
RСтандВычет11[9]  RСтандВычет11[10]
RСтандВычет11[11] RСтандВычет11[12]
RСтандВычетИтог11

RСтандВычет12[1]  RСтандВычет12[2]
RСтандВычет12[3]  RСтандВычет12[4]
RСтандВычет12[5]  RСтандВычет12[6]
RСтандВычет12[7]  RСтандВычет12[8]
RСтандВычет12[9]  RСтандВычет12[10]
RСтандВычет12[11] RСтандВычет12[12]
RСтандВычетИтог12

RСтандВычет13[1]  RСтандВычет13[2]
RСтандВычет13[3]  RСтандВычет13[4]
RСтандВычет13[5]  RСтандВычет13[6]
RСтандВычет13[7]  RСтандВычет13[8]
RСтандВычет13[9]  RСтандВычет13[10]
RСтандВычет13[11] RСтандВычет13[12]
RСтандВычетИтог13

.endfields
   ├───────────────┼───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │Общая сумма    │ За месяц      │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   │доходов за     ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │минусом вычетов│ С начала года │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   ├───────────────┼───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш.begin
  RСтандВычетИтог1 := RСтандВычет1[1]  + RСтандВычет1[2] + RСтандВычет1[3] + RСтандВычет1[4] + RСтандВычет1[5] +
                      RСтандВычет1[6]  + RСтандВычет1[7] + RСтандВычет1[8] + RСтандВычет1[9] + RСтандВычет1[10] +
                      RСтандВычет1[11] + RСтандВычет1[12];

  RСтандВычетИтог2 := RСтандВычет2[1]  + RСтандВычет2[2] + RСтандВычет2[3] + RСтандВычет2[4] + RСтандВычет2[5] +
                      RСтандВычет2[6]  + RСтандВычет2[7] + RСтандВычет2[8] + RСтандВычет2[9] + RСтандВычет2[10] +
                      RСтандВычет2[11] + RСтандВычет2[12];

  RСтандВычетИтог3 := RСтандВычет3[1]  + RСтандВычет3[2] + RСтандВычет3[3] + RСтандВычет3[4] + RСтандВычет3[5] +
                      RСтандВычет3[6]  + RСтандВычет3[7] + RСтандВычет3[8] + RСтандВычет3[9] + RСтандВычет3[10] +
                      RСтандВычет3[11] + RСтандВычет3[12];

 И  RСтандВычетИтог4 := RСтандВычет4[1]  + RСтандВычет4[2] + RСтандВычет4[3] + RСтандВычет4[4] + RСтандВычет4[5] +
                        RСтандВычет4[6]  + RСтандВычет4[7] + RСтандВычет4[8] + RСтандВычет4[9] + RСтандВычет4[10] +
                        RСтандВычет4[11] + RСтандВычет4[12];

  RСтандВычетИтог5 := RСтандВычет5[1]  + RСтандВычет5[2] + RСтандВычет5[3] + RСтандВычет5[4] + RСтандВычет5[5] +
                      RСтандВычет5[6]  + RСтандВычет5[7] + RСтандВычет5[8] + RСтандВычет5[9] + RСтандВычет5[10] +
                      RСтандВычет5[11] + RСтандВычет5[12];

  RСтандВычетИтог6 := RСтандВычет6[1]  + RСтандВычет6[2] + RСтандВычет6[3] + RСтандВычет6[4] + RСтандВычет6[5] +
                      RСтандВычет6[6]  + RСтандВычет6[7] + RСтандВычет6[8] + RСтандВычет6[9] + RСтандВычет6[10] +
                      RСтандВычет6[11] + RСтандВычет6[12];

  RСтандВычетИтог7 := RСтандВычет7[1]  + RСтандВычет7[2] + RСтандВычет7[3] + RСтандВычет7[4] + RСтандВычет7[5] +
                      RСтандВычет7[6]  + RСтандВычет7[7] + RСтандВычет7[8] + RСтандВычет7[9] + RСтандВычет7[10] +
                      RСтандВычет7[11] + RСтандВычет7[12];

  RСтандВычетИтог8 := RСтандВычет8[1]  + RСтандВычет8[2] + RСтандВычет8[3] + RСтандВычет8[4] + RСтандВычет8[5] +
                      RСтандВычет8[6]  + RСтандВычет8[7] + RСтандВычет8[8] + RСтандВычет8[9] + RСтандВычет8[10] +
                      RСтандВычет8[11] + RСтандВычет8[12];

  RСтандВычетИтог9 := RСтандВычет9[1]  + RСтандВычет9[2] + RСтандВычет9[3] + RСтандВычет9[4] + RСтандВычет9[5] +
                      RСтандВычет9[6]  + RСтандВычет9[7] + RСтандВычет9[8] + RСтандВычет9[9] + RСтандВычет9[10] +
                      RСтандВычет9[11] + RСтандВычет9[12];

  RСтандВычетИтог10 := RСтандВычет10[1]  + RСтандВычет10[2] + RСтандВычет10[3] + RСтандВычет10[4] + RСтандВычет10[5] +
                       RСтандВычет10[6]  + RСтандВычет10[7] + RСтандВычет10[8] + RСтандВычет10[9] + RСтандВычет10[10] +
                       RСтандВычет10[11] + RСтандВычет10[12];

  RСтандВычетИтог11 := RСтандВычет11[1]  + RСтандВычет11[2] + RСтандВычет11[3] + RСтандВычет11[4] + RСтандВычет11[5] +
                       RСтандВычет11[6]  + RСтандВычет11[7] + RСтандВычет11[8] + RСтандВычет11[9] + RСтандВычет11[10] +
                       RСтандВычет11[11] + RСтандВычет11[12];

  RСтандВычетИтог12 := RСтандВычет12[1]  + RСтандВычет12[2] + RСтандВычет12[3] + RСтандВычет12[4] + RСтандВычет12[5] +
                       RСтандВычет12[6]  + RСтандВычет12[7] + RСтандВычет12[8] + RСтандВычет12[9] + RСтандВычет12[10] +
                       RСтандВычет12[11] + RСтандВычет12[12];

  RСтандВычетИтог13 := RСтандВычет13[1]  + RСтандВычет13[2] + RСтандВычет13[3] + RСтандВычет13[4] + RСтандВычет13[5] +
                       RСтандВычет13[6]  + RСтандВычет13[7] + RСтандВычет13[8] + RСтандВычет13[9] + RСтандВычет13[10] +
                       RСтандВычет13[11] + RСтандВычет13[12];


 Иend.
   │Стандартные    │За месяц (101) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   │налоговые      ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │вычеты         │За месяц (102) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   │(статья 218    ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │Налогового     │За месяц (103) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   │кодекса        │───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │Российской     │За месяц (104) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   │Федерации)     ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │               │За месяц (105) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   │               ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │               │За месяц (106) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   │               ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │               │За месяц (107) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   │               ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │               │За месяц (108) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   │               ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │               │За месяц (109) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   │               ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │               │За месяц (110) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   │               ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │               │За месяц (111) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   │               ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │               │За месяц (112) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   │               ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │               │За месяц (113) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш.begin
 RСтандВычетНГ[1] := RСтандВычет1[1]   + RСтандВычет2[1]   + RСтандВычет3[1]   + RСтандВычет4[1]   + RСтандВычет5[1]  +
                     RСтандВычет6[1]   + RСтандВычет7[1]   + RСтандВычет8[1]   + RСтандВычет9[1]   + RСтандВычет10[1] +
                     RСтандВычет11[1]  + RСтандВычет12[1]  + RСтандВычет13[1];
 RСтандВычетНГ[2] := RСтандВычетНГ[1]  + RСтандВычет1[2]   + RСтандВычет2[2]   + RСтандВычет3[2]   + RСтандВычет4[2]  +
                     RСтандВычет5[2]   + RСтандВычет6[2]   + RСтандВычет7[2]   + RСтандВычет8[2]   + RСтандВычет9[2]  +
                     RСтандВычет10[2]  + RСтандВычет11[2]  + RСтандВычет12[2]  + RСтандВычет13[2] ;
 RСтандВычетНГ[3] := RСтандВычетНГ[2]  + RСтандВычет1[3]   + RСтандВычет2[3]   + RСтандВычет3[3]   + RСтандВычет4[3]  +
                     RСтандВычет5[3]   + RСтандВычет6[3]   + RСтандВычет7[3]   + RСтандВычет8[3]   + RСтандВычет9[3]  +
                     RСтандВычет10[3]  + RСтандВычет11[3]  + RСтандВычет12[3]  + RСтандВычет13[3];
 RСтандВычетНГ[4] := RСтандВычетНГ[3]  + RСтандВычет1[4]   + RСтандВычет2[4]   + RСтандВычет3[4]   + RСтандВычет4[4]  +
                     RСтандВычет5[4]   + RСтандВычет6[4]   + RСтандВычет7[4]   + RСтандВычет8[4]   + RСтандВычет9[4]  +
                     RСтандВычет10[4]  + RСтандВычет11[4]  + RСтандВычет12[4]  + RСтандВычет13[4];
 RСтандВычетНГ[5] := RСтандВычетНГ[4]  + RСтандВычет1[5]   + RСтандВычет2[5]   + RСтандВычет3[5]   + RСтандВычет4[5]  +
                     RСтандВычет5[5]   + RСтандВычет6[5]   + RСтандВычет7[5]   + RСтандВычет8[5]   + RСтандВычет9[5]  +
                     RСтандВычет10[5]  + RСтандВычет11[5]  + RСтандВычет12[5]  + RСтандВычет13[5];
 RСтандВычетНГ[6] := RСтандВычетНГ[5]  + RСтандВычет1[6]   + RСтандВычет2[6]   + RСтандВычет3[6]   + RСтандВычет4[6]  +
                     RСтандВычет5[6]   + RСтандВычет6[6]   + RСтандВычет7[6]   + RСтандВычет8[6]   + RСтандВычет9[6]  +
                     RСтандВычет10[6]  + RСтандВычет11[6]  + RСтандВычет12[6]  + RСтандВычет13[6];
 RСтандВычетНГ[7] := RСтандВычетНГ[6]  + RСтандВычет1[7]   + RСтандВычет2[7]   + RСтандВычет3[7]   + RСтандВычет4[7]  +
                     RСтандВычет5[7]   + RСтандВычет6[7]   + RСтандВычет7[7]   + RСтандВычет8[7]   + RСтандВычет9[7]  +
                     RСтандВычет10[7]  + RСтандВычет11[7]  + RСтандВычет12[7]  + RСтандВычет13[7] ;
 RСтандВычетНГ[8] := RСтандВычетНГ[7]  + RСтандВычет1[8]   + RСтандВычет2[8]   + RСтандВычет3[8]   + RСтандВычет4[8]  +
                     RСтандВычет5[8]   + RСтандВычет6[8]   + RСтандВычет7[8]   + RСтандВычет8[8]   + RСтандВычет9[8]  +
                     RСтандВычет10[8]  + RСтандВычет11[8]  + RСтандВычет12[8]  + RСтандВычет13[8];
 RСтандВычетНГ[9] := RСтандВычетНГ[8]  + RСтандВычет1[9]   + RСтандВычет2[9]   + RСтандВычет3[9]   + RСтандВычет4[9]  +
                     RСтандВычет5[9]   + RСтандВычет6[9]   + RСтандВычет7[9]   + RСтандВычет8[9]   + RСтандВычет9[9]  +
                     RСтандВычет10[9]  + RСтандВычет11[9]  + RСтандВычет12[9]  + RСтандВычет13[9];
 RСтандВычетНГ[10]:= RСтандВычетНГ[9]  + RСтандВычет1[10]  + RСтандВычет2[10]  + RСтандВычет3[10]  + RСтандВычет4[10] +
                     RСтандВычет5[10]  + RСтандВычет6[10]  + RСтандВычет7[10]  + RСтандВычет8[10]  + RСтандВычет9[10] +
                     RСтандВычет10[10] + RСтандВычет11[10] + RСтандВычет12[10] + RСтандВычет13[10];
 RСтандВычетНГ[11]:= RСтандВычетНГ[10] + RСтандВычет1[11]  + RСтандВычет2[11]  + RСтандВычет3[11]  + RСтандВычет4[11] +
                     RСтандВычет5[11]  + RСтандВычет6[11]  + RСтандВычет7[11]  + RСтандВычет8[11]  + RСтандВычет9[11] +
                     RСтандВычет10[11] + RСтандВычет11[11] + RСтандВычет12[11] + RСтандВычет13[11];
 RСтандВычетНГ[12]:= RСтандВычетНГ[11] + RСтандВычет1[12]  + RСтандВычет2[12]  + RСтандВычет3[12]  + RСтандВычет4[12] +
                     RСтандВычет5[12]  + RСтандВычет6[12]  + RСтандВычет7[12]  + RСтандВычет8[12]  + RСтандВычет9[12] +
                     RСтандВычет10[12] + RСтандВычет11[12] + RСтандВычет12[12] + RСтандВычет13[12];
end.
.fields
RСтандВычетНГ[1] RСтандВычетНГ[2] RСтандВычетНГ[3] RСтандВычетНГ[4] RСтандВычетНГ[5] RСтандВычетНГ[6]
RСтандВычетНГ[7] RСтандВычетНГ[8] RСтандВычетНГ[9] RСтандВычетНГ[10] RСтандВычетНГ[11] RСтандВычетНГ[12]
  (RСтандВычетИтог1 + RСтандВычетИтог2 +  RСтандВычетИтог3
+  RСтандВычетИтог4 + RСтандВычетИтог5 +  RСтандВычетИтог6 + RСтандВычетИтог7 + RСтандВычетИтог8 + RСтандВычетИтог9
+ RСтандВычетИтог10 + RСтандВычетИтог11 + RСтандВычетИтог12)
.endfields
   │               ├───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │               │Общая сумма    │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │               │с начала года  │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
   ├───────────────┴───────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш.{ Card2005_Imu CheckEnter
.begin
  RОстИмущВычета13 := ОстИмущВычета12 - (ОстИмущВычета11 - ОстИмущВычета12);
!  RИмущВычет13 := ИмущВычет12 - (ИмущВычет11 - ИмущВычет12);
  RИмущВычет13 := ИмущВычет12;
end.
.fields
  ОстИмущВычета1 ОстИмущВычета2 ОстИмущВычета3 ОстИмущВычета4  ОстИмущВычета5  ОстИмущВычета6
  ОстИмущВычета7 ОстИмущВычета8 ОстИмущВычета9 ОстИмущВычета10 ОстИмущВычета11 ОстИмущВычета12
  RОстИмущВычета13
  ИмущВычет1 ИмущВычет2 ИмущВычет3 ИмущВычет4  ИмущВычет5  ИмущВычет6
  ИмущВычет7 ИмущВычет8 ИмущВычет9 ИмущВычет10 ИмущВычет11 ИмущВычет12 RИмущВычет13
.endfields
   │Остаток вычета на начало месяца│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│
   ├───────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │Сумма использованного имущест- │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │венного налогового вычета      │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │нарастающим итогом             │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   ├───────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 И.begin И
 И  RИмущВычет[1] := ИмущВычет1; И
 И  RИмущВычет[2] := ИмущВычет2; И
 И  RИмущВычет[3] := ИмущВычет3; И
 И  RИмущВычет[4] := ИмущВычет4; И
 И  RИмущВычет[5] := ИмущВычет5; И
 И  RИмущВычет[6] := ИмущВычет6; И
 И  RИмущВычет[7] := ИмущВычет7; И
 И  RИмущВычет[8] := ИмущВычет8; И
 И  RИмущВычет[9] := ИмущВычет9; И
 И  RИмущВычет[10] := ИмущВычет10; И
 И  RИмущВычет[11] := ИмущВычет11; И
 И  RИмущВычет[12] := ИмущВычет12; И
 Иend. И
 И.} И
 И.begin И
 И  for(i := 1; i <= 13; i := i + 1) И
 И  { И
 И    RВзыскание[i]   := 0; И
 И    RДолгНалПлат[i] := 0; И
 И    RДолгНалАгент[i]:= 0; И
 И  } И

 И  RОстИмущВычета13 := 0; И
 И  RИмущВычет13 := 0; И

 И  for(i := 1; i <= 13; i := i + 1) И
 И  { И
 И    RНалогИсчисл[i] := 0 И
 И    RНалогУдер[i] := 0 И
 И    RНалогБаза[i] := 0 И
 И    RNalPred63[i] := 0; И
 И    RNalPred64[i] := 0; И
 И  } И

 И  if Статус = '1' И
 И  { И
 И    if ( ( not boGetTune('UP.ZAR.XP.DATE0') ) and  // разница по вычетам не переносится Р
          ( ( PrizGod ) or  // разница по вычетам не переносится Р
            ( coGetTune('UP.TekBud') = 1 ) ) )  // разница по вычетам не переносится Р
 Р    { Р
 Р    RНалогБаза[1] := RЗаГод[1] - RealVich1 - RNeOblМес[1] И
 И      RНалогБаза[2] := RЗаГод[2] - RealVich1 - RealVich2 -  RNeOblМес[2] И
 И      RНалогБаза[3] := RЗаГод[3] - RealVich1 - RealVich2 - RealVich3 -  RNeOblМес[3] И
 И      RНалогБаза[4] := RЗаГод[4] - RealVich1 - RealVich2 - RealVich3 - RealVich4 -  RNeOblМес[4] И
 И      RНалогБаза[5] := RЗаГод[5] - RealVich1 - RealVich2 - RealVich3 - RealVich4 - RealVich5 -  RNeOblМес[5] И
 И      RНалогБаза[6] := RЗаГод[6] - RealVich1 - RealVich2 - RealVich3 - RealVich4 - RealVich5 - RealVich6 -  RNeOblМес[6] И
 И      RНалогБаза[7] := RЗаГод[7] - RealVich1 - RealVich2 - RealVich3 - RealVich4 - RealVich5 - RealVich6 - RealVich7 - И
 И                       RNeOblМес[7] И
 И      RНалогБаза[8] := RЗаГод[8] - RealVich1 - RealVich2 - RealVich3 - RealVich4 - RealVich5 - RealVich6 - RealVich7 - И
 И                       RealVich8 - RNeOblМес[8] И
 И      RНалогБаза[9] := RЗаГод[9] - RealVich1 - RealVich2 - RealVich3 - RealVich4 - RealVich5 - RealVich6 - RealVich7 - И
 И                       RealVich8 - RealVich9 -  RNeOblМес[9] И
 И      RНалогБаза[10] :=RЗаГод[10] - RealVich1 - RealVich2 - RealVich3 - RealVich4 - RealVich5 - RealVich6 - RealVich7 - И
 И                       RealVich8 - RealVich9 - RealVich10 - RNeOblМес[10] И
 И      RНалогБаза[11] :=RЗаГод[11] - RealVich1 - RealVich2 - RealVich3 - RealVich4 - RealVich5 - RealVich6 - RealVich7 - И
 И                       RealVich8 - RealVich9 - RealVich10 - RealVich11  - RNeOblМес[11] И
 И      RНалогБаза[12] :=RЗаГод[12] - RealVich1 - RealVich2 - RealVich3 - RealVich4 - RealVich5 - RealVich6 - RealVich7 - И
 И                       RealVich8 - RealVich9 - RealVich10 - RealVich11 - RealVich12  - RNeOblМес[12] И
 И    } И
 И    else И
 И    { И
 И      for (i := 1; i <= 12; i := i + 1) И
 И      { И
 И        RНалогБаза[i] := RЗаГод[i] - RСтандВычетНГ[i] - RИмущВычет[i] - RNeOblМес[i]; И
 И      } И
 И    } И
 И    for (i := 1; i <= 12; i := i + 1) И
 И    { И
 И     if RНалогБаза[i] < 0 И
 И      RНалогБаза[i] := 0; И
 И    } И

 И    RНалогБаза[13] := RНалогБаза[12]; И
 И  } И
 И  else // нерезидент И
 И  { И
 И    if not boGetTune('UP.ZAR.XP.DATE0') // разница по вычетам не переносится Р
 Р    { Р
 Р      RНалогБаза[1]:= RЗаМесяц[1]- RИмущВычет[1] + RNeOblМес[1] - RealVich1 И
 И      RНалогБаза[2]:= RЗаМесяц[2]- RИмущВычет[2] + RИмущВычет[1]-RNeOblМес[2] - RealVich2 И
 И      RНалогБаза[3]:= RЗаМесяц[3]- RИмущВычет[3] + RИмущВычет[2]-RNeOblМес[3] - RealVich3 И
 И      RНалогБаза[4]:= RЗаМесяц[4]- RИмущВычет[4] + RИмущВычет[3]-RNeOblМес[4] - RealVich4 И
 И      RНалогБаза[5]:= RЗаМесяц[5]- RИмущВычет[5] + RИмущВычет[4]-RNeOblМес[5] - RealVich5 И
 И      RНалогБаза[6]:= RЗаМесяц[6]- RИмущВычет[6] + RИмущВычет[5]-RNeOblМес[6] - RealVich6 И
 И      RНалогБаза[7]:= RЗаМесяц[7]- RИмущВычет[7] + RИмущВычет[6]-RNeOblМес[7] - RealVich7 И
 И      RНалогБаза[8]:= RЗаМесяц[8]- RИмущВычет[8] + RИмущВычет[7]-RNeOblМес[8] - RealVich8 И
 И      RНалогБаза[9]:= RЗаМесяц[9]- RИмущВычет[9] + RИмущВычет[8]-RNeOblМес[9] - RealVich9 И
 И      RНалогБаза[10]:= RЗаМесяц[10]- RИмущВычет[10] + RИмущВычет[9]-RNeOblМес[10] - RealVich10 И
 И      RНалогБаза[11]:= RЗаМесяц[11]- RИмущВычет[11] + RИмущВычет[10]-RNeOblМес[11] - RealVich11 И
 И      RНалогБаза[12]:= RЗаМесяц[12]- RИмущВычет[12] + RИмущВычет[11]-RNeOblМес[12] - RealVich12 И
 И    } И
 И    else И
 И    { И
 И      for(i := 1; i <= 12; i := i + 1) И
 И      { И
 И        if i <> 1 И
 И        { И
 И          RНалогБаза[i] := RЗаМесяц[i] - RИмущВычет[i] + RИмущВычет[i - 1] - RNeOblМес[i] И
 И                         - RСтандВычет1[i] И
 И                         - RСтандВычет2[i] И
 И                         - RСтандВычет3[i] И
 И                         - RСтандВычет4[i] И
 И                         - RСтандВычет5[i] И
 И                         - RСтандВычет6[i] И
 И                         - RСтандВычет7[i] И
 И        } И
 И        else И
 И          RНалогБаза[i] := RЗаМесяц[i] - RИмущВычет[i] - RNeOblМес[i] И
 И                         - RСтандВычет1[i] И
 И                         - RСтандВычет2[i] И
 И                         - RСтандВычет3[i] И
 И                         - RСтандВычет4[i] И
 И                         - RСтандВычет5[i] И
 И                         - RСтандВычет6[i] И
 И                         - RСтандВычет7[i] И

 И      } И

 И    } И
 И     RНалогБаза[13] := RНалогБаза[1] + RНалогБаза[2] + RНалогБаза[3] + RНалогБаза[4] + И
 И     RНалогБаза[5] + RНалогБаза[6] + RНалогБаза[7] + RНалогБаза[8] + RНалогБаза[9] + И
 И     RНалогБаза[10] + RНалогБаза[11] + RНалогБаза[12] И
 И  } И

 И  if RНалогБаза[13] < 0 И
 И    RНалогБаза[13] := 0; И


 И//  if (Trim(UchDoh) = '1') // смена настройки Учет дохода И
 И  { И

 И    for(i := 1; i <= 12; i := i + 1) И
 И    { И
 И      if Статус = '1' then И
 И        RНалогИсчисл[i] := OcrugNaRuk(RНалогБаза[i] * 0.13, XarOcrug5) И
 И      else И
 И        RНалогИсчисл[i] := OcrugNaRuk(RНалогБаза[i] * 0.30, XarOcrug5) И

 И    } И

 И  } И
 И/* И
 И  else И
 И  { И
 И    if Статус = '1' И
 И    { И
 И      RНалогИсчисл[1] := НалогИсчисл1 + IschNalog2620_1; И
 И      RНалогИсчисл[2] := RНалогИсчисл[1] + НалогИсчисл2 + IschNalog2620_2; И
 И      RНалогИсчисл[3] := RНалогИсчисл[2] + НалогИсчисл3 + IschNalog2620_3; И
 И      RНалогИсчисл[4] := RНалогИсчисл[3] + НалогИсчисл4 + IschNalog2620_4; И
 И      RНалогИсчисл[5] := RНалогИсчисл[4] + НалогИсчисл5 + IschNalog2620_5 ; И
 И      RНалогИсчисл[6] := RНалогИсчисл[5] + НалогИсчисл6 + IschNalog2620_6; И
 И      RНалогИсчисл[7] := RНалогИсчисл[6] + НалогИсчисл7 + IschNalog2620_7; И
 И      RНалогИсчисл[8] := RНалогИсчисл[7] + НалогИсчисл8 + IschNalog2620_8; И
 И      RНалогИсчисл[9] := RНалогИсчисл[8] + НалогИсчисл9 + IschNalog2620_9; И
 И      RНалогИсчисл[10] := RНалогИсчисл[9] + НалогИсчисл10 + IschNalog2620_10; И
 И      RНалогИсчисл[11] := RНалогИсчисл[10] + НалогИсчисл11 + IschNalog2620_11; И
 И      RНалогИсчисл[12] := RНалогИсчисл[11] + НалогИсчисл12 + IschNalog2620_12; И

 И     if  IschNalog2620_1 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[1] * 0.13, XarOcrug5) < RНалогИсчисл[1] И
 И         RНалогИсчисл[1] :=  OcrugNaRuk(RНалогБаза[1] * 0.13, XarOcrug5) И

 И     if  IschNalog2620_2 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[2] * 0.13, XarOcrug5) < RНалогИсчисл[2] И
 И         RНалогИсчисл[2] :=  OcrugNaRuk(RНалогБаза[2] * 0.13, XarOcrug5) И

 И     if  IschNalog2620_3 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[3] * 0.13, XarOcrug5) < RНалогИсчисл[3] И
 И         RНалогИсчисл[3] :=  OcrugNaRuk(RНалогБаза[3] * 0.13, XarOcrug5) И

 И     if  IschNalog2620_4 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[4] * 0.13, XarOcrug5) < RНалогИсчисл[4] И
 И         RНалогИсчисл[4] :=  OcrugNaRuk(RНалогБаза[4] * 0.13, XarOcrug5) И

 И     if  IschNalog2620_5 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[5] * 0.13, XarOcrug5) < RНалогИсчисл[5] И
 И         RНалогИсчисл[5] :=  OcrugNaRuk(RНалогБаза[5] * 0.13, XarOcrug5) И

 И     if  IschNalog2620_6 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[6] * 0.13, XarOcrug5) < RНалогИсчисл[6] И
 И         RНалогИсчисл[6] :=  OcrugNaRuk(RНалогБаза[6] * 0.13, XarOcrug5) И

 И     if IschNalog2620_7 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[7] * 0.13, XarOcrug5) < RНалогИсчисл[7] И
 И         RНалогИсчисл[7] :=  OcrugNaRuk(RНалогБаза[7] * 0.13, XarOcrug5) И

 И     if IschNalog2620_8 > 0.001 И
 И       if OcrugNaRuk(RНалогБаза[8] * 0.13, XarOcrug5) < RНалогИсчисл[8] И
 И         RНалогИсчисл[8] :=  OcrugNaRuk(RНалогБаза[8] * 0.13, XarOcrug5) И

 И     if IschNalog2620_9 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[9] * 0.13, XarOcrug5) < RНалогИсчисл[9] И
 И         RНалогИсчисл[9] :=  OcrugNaRuk(RНалогБаза[9] * 0.13, XarOcrug5) И


 И     if IschNalog2620_10 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[10] * 0.13, XarOcrug5) < RНалогИсчисл[10] И
 И         RНалогИсчисл[10] :=  OcrugNaRuk(RНалогБаза[10] * 0.13, XarOcrug5) И

 И     if IschNalog2620_11 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[11] * 0.13, XarOcrug5) < RНалогИсчисл[11] И
 И         RНалогИсчисл[11] :=  OcrugNaRuk(RНалогБаза[11] * 0.13, XarOcrug5) И

 И     if IschNalog2620_12 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[12] * 0.13, XarOcrug5) < RНалогИсчисл[12] И
 И         RНалогИсчисл[12] :=  OcrugNaRuk(RНалогБаза[12] * 0.13, XarOcrug5) И

 И    } И
 И    else И
 И    { И

 И       RНалогИсчисл[1] :=  НалогИсчисл1 + IschNalog2620_1; И
 И       RНалогИсчисл[2] :=  НалогИсчисл2 + IschNalog2620_2 ; И
 И       RНалогИсчисл[3] :=  НалогИсчисл3 + IschNalog2620_3; И
 И       RНалогИсчисл[4] :=  НалогИсчисл4 + IschNalog2620_4; И
 И       RНалогИсчисл[5] :=  НалогИсчисл5 + IschNalog2620_5; И
 И       RНалогИсчисл[6] :=  НалогИсчисл6 + IschNalog2620_6; И
 И       RНалогИсчисл[7] :=  НалогИсчисл7 + IschNalog2620_7; И
 И       RНалогИсчисл[8] :=  НалогИсчисл8 + IschNalog2620_8; И
 И       RНалогИсчисл[9] :=  НалогИсчисл9 + IschNalog2620_9; И
 И       RНалогИсчисл[10] := НалогИсчисл10 + IschNalog2620_10; И
 И       RНалогИсчисл[11] := НалогИсчисл11 + IschNalog2620_11; И
 И       RНалогИсчисл[12] := НалогИсчисл12 + IschNalog2620_12; И

 И      if  IschNalog2620_1 > 0.001 И
 И        if  OcrugNaRuk(RНалогБаза[1] * 0.3, XarOcrug5) < RНалогИсчисл[1] И
 И          RНалогИсчисл[1] :=  OcrugNaRuk(RНалогБаза[1] * 0.3, XarOcrug5) И

 И     if  IschNalog2620_2 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[2] * 0.3, XarOcrug5) < RНалогИсчисл[2] И
 И         RНалогИсчисл[2] :=  OcrugNaRuk(RНалогБаза[2] * 0.3, XarOcrug5) И

 И     if  IschNalog2620_3 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[3] * 0.3, XarOcrug5) < RНалогИсчисл[3] И
 И         RНалогИсчисл[3] :=  OcrugNaRuk(RНалогБаза[3] * 0.3, XarOcrug5) И

 И     if  IschNalog2620_4 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[4] * 0.3, XarOcrug5) < RНалогИсчисл[4] И
 И         RНалогИсчисл[4] :=  OcrugNaRuk(RНалогБаза[4] * 0.3, XarOcrug5) И

 И     if  IschNalog2620_5 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[5] * 0.3, XarOcrug5) < RНалогИсчисл[5] И
 И         RНалогИсчисл[5] :=  OcrugNaRuk(RНалогБаза[5] * 0.3, XarOcrug5) И

 И     if  IschNalog2620_6 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[6] * 0.3, XarOcrug5) < RНалогИсчисл[6] И
 И         RНалогИсчисл[6] :=  OcrugNaRuk(RНалогБаза[6] * 0.3, XarOcrug5) И

 И     if IschNalog2620_7 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[7] * 0.3, XarOcrug5) < RНалогИсчисл[7] И
 И         RНалогИсчисл[7] :=  OcrugNaRuk(RНалогБаза[7] * 0.3, XarOcrug5) И

 И     if IschNalog2620_8 > 0.001 И
 И       if OcrugNaRuk(RНалогБаза[8] * 0.3, XarOcrug5) < RНалогИсчисл[8] И
 И         RНалогИсчисл[8] :=  OcrugNaRuk(RНалогБаза[8] * 0.3, XarOcrug5) И

 И     if IschNalog2620_9 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[9] * 0.3, XarOcrug5) < RНалогИсчисл[9] И
 И         RНалогИсчисл[9] :=  OcrugNaRuk(RНалогБаза[9] * 0.3, XarOcrug5) И


 И     if IschNalog2620_10 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[10] * 0.3, XarOcrug5) < RНалогИсчисл[10] И
 И         RНалогИсчисл[10] :=  OcrugNaRuk(RНалогБаза[10] * 0.3, XarOcrug5) И

 И     if IschNalog2620_11 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[11] * 0.3, XarOcrug5) < RНалогИсчисл[11] И
 И         RНалогИсчисл[11] :=  OcrugNaRuk(RНалогБаза[11] * 0.3, XarOcrug5) И

 И     if IschNalog2620_12 > 0.001 И
 И       if  OcrugNaRuk(RНалогБаза[12] * 0.3, XarOcrug5) < RНалогИсчисл[12] И
 И         RНалогИсчисл[12] :=  OcrugNaRuk(RНалогБаза[12] * 0.3, XarOcrug5) И

 И    } И

 И  } И
 И*/ И

 И   if Статус = '1' then И
 И   { И
 И     RНалогУдер[1] := НалогУдер1; И
 И     RНалогУдер[2] := RНалогУдер[1] + НалогУдер2; И
 И     RНалогУдер[3] := RНалогУдер[2] + НалогУдер3; И
 И     RНалогУдер[4] := RНалогУдер[3] + НалогУдер4; И
 И     RНалогУдер[5] := RНалогУдер[4] + НалогУдер5; И
 И     RНалогУдер[6] := RНалогУдер[5] + НалогУдер6; И
 И     RНалогУдер[7] := RНалогУдер[6] + НалогУдер7; И
 И     RНалогУдер[8] := RНалогУдер[7] + НалогУдер8; И
 И     RНалогУдер[9] := RНалогУдер[8] + НалогУдер9; И
 И     RНалогУдер[10] := RНалогУдер[9] + НалогУдер10; И
 И     RНалогУдер[11] := RНалогУдер[10]+ НалогУдер11; И
 И     RНалогУдер[12] := RНалогУдер[11]+ НалогУдер12; И
 И     RНалогИсчисл[13]:= RНалогИсчисл[12] И
 И     RНалогУдер[13]  := RНалогУдер[12] И

 И     RNalPred63[1]:=  NalPred63_1 И
 И     RNalPred63[2]:=  RNalPred63[1] + NalPred63_2 И
 И     RNalPred63[3]:=  RNalPred63[2] + NalPred63_3 И
 И     RNalPred63[4]:=  RNalPred63[3] + NalPred63_4 И
 И     RNalPred63[5]:=  RNalPred63[4] + NalPred63_5 И
 И     RNalPred63[6]:=  RNalPred63[5] + NalPred63_6 И
 И     RNalPred63[7]:=  RNalPred63[6] + NalPred63_7 И
 И     RNalPred63[8]:=  RNalPred63[7] + NalPred63_8 И
 И     RNalPred63[9]:=  RNalPred63[8] + NalPred63_9 И
 И     RNalPred63[10]:=  RNalPred63[9] + NalPred63_10 И
 И     RNalPred63[11]:=  RNalPred63[10] + NalPred63_11 И
 И     RNalPred63[12]:=  RNalPred63[11] + NalPred63_12 И
 И     RNalPred63[13]:=  RNalPred63[12] И

 И     RNalPred64[1]:=  NalPred64_1 И
 И     RNalPred64[2]:=  RNalPred64[1] + NalPred64_2 И
 И     RNalPred64[3]:=  RNalPred64[2] + NalPred64_3 И
 И     RNalPred64[4]:=  RNalPred64[3] + NalPred64_4 И
 И     RNalPred64[5]:=  RNalPred64[4] + NalPred64_5 И
 И     RNalPred64[6]:=  RNalPred64[5] + NalPred64_6 И
 И     RNalPred64[7]:=  RNalPred64[6] + NalPred64_7 И
 И     RNalPred64[8]:=  RNalPred64[7] + NalPred64_8 И
 И     RNalPred64[9]:=  RNalPred64[8] + NalPred64_9 И
 И     RNalPred64[10]:=  RNalPred64[9] + NalPred64_10 И
 И     RNalPred64[11]:=  RNalPred64[10] + NalPred64_11 И
 И     RNalPred64[12]:=  RNalPred64[11] + NalPred64_12 И
 И     RNalPred64[13]:=  RNalPred64[12] И
 И    } И
 И    else И
 И    { И
 И      RНалогУдер[1] :=  НалогУдер1; И
 И      RНалогУдер[2] :=  НалогУдер2; И
 И      RНалогУдер[3] :=  НалогУдер3; И
 И      RНалогУдер[4] :=  НалогУдер4; И
 И      RНалогУдер[5] :=  НалогУдер5; И
 И      RНалогУдер[6] :=  НалогУдер6; И
 И      RНалогУдер[7] :=  НалогУдер7; И
 И      RНалогУдер[8] :=  НалогУдер8; И
 И      RНалогУдер[9] :=  НалогУдер9; И
 И      RНалогУдер[10] := НалогУдер10; И
 И      RНалогУдер[11] := НалогУдер11; И
 И      RНалогУдер[12] := НалогУдер12; И
 И      RНалогИсчисл[13] :=  RНалогИсчисл[1] + RНалогИсчисл[2] + RНалогИсчисл[3] + И
 И                           RНалогИсчисл[4] + RНалогИсчисл[5] + RНалогИсчисл[6] + И
 И                           RНалогИсчисл[7] + RНалогИсчисл[8] + RНалогИсчисл[9] + И
 И                           RНалогИсчисл[10]+ RНалогИсчисл[11]+ RНалогИсчисл[12]; И
 И      RНалогУдер[13] :=  RНалогУдер[1] + RНалогУдер[2] + RНалогУдер[3] + И
 И                         RНалогУдер[4] + RНалогУдер[5] + RНалогУдер[6] + И
 И                         RНалогУдер[7] + RНалогУдер[8] + RНалогУдер[9] + И
 И                         RНалогУдер[10]+ RНалогУдер[11]+ RНалогУдер[12]; И

 И     RNalPred63[1]:=  NalPred63_1 И
 И     RNalPred63[2]:=  NalPred63_2 И
 И     RNalPred63[3]:=  NalPred63_3 И
 И     RNalPred63[4]:=  NalPred63_4 И
 И     RNalPred63[5]:=  NalPred63_5 И
 И     RNalPred63[6]:=  NalPred63_6 И
 И     RNalPred63[7]:=  NalPred63_7 И
 И     RNalPred63[8]:=  NalPred63_8 И
 И     RNalPred63[9]:=  NalPred63_9 И
 И     RNalPred63[10]:= NalPred63_10 И
 И     RNalPred63[11]:= NalPred63_11 И
 И     RNalPred63[12]:= NalPred63_12 И
 И     RNalPred63[13]:= NalPred63_1 + NalPred63_2 + NalPred63_3 + NalPred63_4 + NalPred63_5 + NalPred63_6 + И
 И                      NalPred63_7 + NalPred63_8 + NalPred63_9 + NalPred63_10 + NalPred63_11 + NalPred63_12 И

 И     RNalPred64[1]:=  NalPred64_1 И
 И     RNalPred64[2]:=  NalPred64_2 И
 И     RNalPred64[3]:=  NalPred64_3 И
 И     RNalPred64[4]:=  NalPred64_4 И
 И     RNalPred64[5]:=  NalPred64_5 И
 И     RNalPred64[6]:=  NalPred64_6 И
 И     RNalPred64[7]:=  NalPred64_7 И
 И     RNalPred64[8]:=  NalPred64_8 И
 И     RNalPred64[9]:=  NalPred64_9 И
 И     RNalPred64[10]:= NalPred64_10 И
 И     RNalPred64[11]:= NalPred64_11 И
 И     RNalPred64[12]:= NalPred64_12 И
 И     RNalPred64[13]:= NalPred64_1 + NalPred64_2 + NalPred64_3 + NalPred64_4 + NalPred64_5 + NalPred64_6 + И
 И                      NalPred64_7 + NalPred64_8 + NalPred64_9 + NalPred64_10 + NalPred64_11 + NalPred64_12 И

 И    } И


 И    if Trim(Не_работник) = '1' И
 И    { И
 И      for (i := 1; i <= 13; i := i + 1) И
 И      { И
 И        IF ( ABS(RНАЛОГИСЧИСЛ[I] - RНАЛОГУДЕР[I]) <= 1 )
          RНалогИсчисл[i] := RНалогУдер[i];
        if Round(RНалогИсчисл[i]) > Round(RНалогУдер[i]) И
 И          RВзыскание[i] := Round(RНалогИсчисл[i]) - Round(RНалогУдер[i]); И
 И      } И

 И    } И
 И    else И
 И    { И

 И      for (i := 1; i <= 13; i := i + 1) И
 И      { И
 И        if ( Abs(RНалогИсчисл[i] - RНалогУдер[i]) <= 1 )
          RНалогИсчисл[i] := RНалогУдер[i];
        if Round(RНалогИсчисл[i]) >  Round(RНалогУдер[i]) И
 И          RДолгНалПлат[i] :=  Round(RНалогИсчисл[i]) - Round(RНалогУдер[i]) - Round(RNalPred63[i]) И
 И        else И
 И          RДолгНалАгент[i] := Round(RНалогУдер[i]) - Round(RНалогИсчисл[i]) - Round(RNalPred64[i]) И

 И      } И

 И      if Статус = '1' then И
 И      { И
 И        RВзыскание[1] := IschNalog2620_1 И
 И        RВзыскание[2] := RВзыскание[1] + IschNalog2620_2 И
 И        RВзыскание[3] := RВзыскание[2] + IschNalog2620_3 И
 И        RВзыскание[4] := RВзыскание[3] + IschNalog2620_4 И
 И        RВзыскание[5] := RВзыскание[4] + IschNalog2620_5 И
 И        RВзыскание[6] := RВзыскание[5] + IschNalog2620_6 И
 И        RВзыскание[7] := RВзыскание[6] + IschNalog2620_7 И
 И        RВзыскание[8] := RВзыскание[7] + IschNalog2620_8 И
 И        RВзыскание[9] := RВзыскание[8] + IschNalog2620_9 И
 И        RВзыскание[10] := RВзыскание[9] + IschNalog2620_10 И
 И        RВзыскание[11] := RВзыскание[10] + IschNalog2620_11 И
 И        RВзыскание[12] := RВзыскание[11] + IschNalog2620_12 И
 И        RВзыскание[13] := RВзыскание[12] И
 И      } И
 И      else И
 И      { И
 И        RВзыскание[1] := IschNalog2620_1 И
 И        RВзыскание[2] := IschNalog2620_2 И
 И        RВзыскание[3] := IschNalog2620_3 И
 И        RВзыскание[4] := IschNalog2620_4 И
 И        RВзыскание[5] := IschNalog2620_5 И
 И        RВзыскание[6] := IschNalog2620_6 И
 И        RВзыскание[7] := IschNalog2620_7 И
 И        RВзыскание[8] := IschNalog2620_8 И
 И        RВзыскание[9] := IschNalog2620_9 И
 И        RВзыскание[10] := IschNalog2620_10 И
 И        RВзыскание[11] := IschNalog2620_11 И
 И        RВзыскание[12] := IschNalog2620_12 И
 И        RВзыскание[13] := IschNalog2620_1 + IschNalog2620_2 + IschNalog2620_3 + IschNalog2620_4 + И
 И                          IschNalog2620_5 + IschNalog2620_6 + IschNalog2620_7 + IschNalog2620_8 + И
 И                          IschNalog2620_9 + IschNalog2620_10 + IschNalog2620_11 + IschNalog2620_12 И
 И      } И

 И    } И

 Иend. И
 И.fields И
 ИRНалогБаза[1] RНалогБаза[2]  RНалогБаза[3]  RНалогБаза[4] И
 ИRНалогБаза[5] RНалогБаза[6]  RНалогБаза[7]  RНалогБаза[8] И
 ИRНалогБаза[9] RНалогБаза[10] RНалогБаза[11] RНалогБаза[12] И
 ИRНалогБаза[13] И
 ИRound(RНалогИсчисл[1])  Round(RНалогИсчисл[2])  Round(RНалогИсчисл[3]) И
 ИRound(RНалогИсчисл[4])  Round(RНалогИсчисл[5])  Round(RНалогИсчисл[6]) И
 ИRound(RНалогИсчисл[7])  Round(RНалогИсчисл[8])  Round(RНалогИсчисл[9]) И
 ИRound(RНалогИсчисл[10]) Round(RНалогИсчисл[11]) Round(RНалогИсчисл[12]) И
 ИRound(RНалогИсчисл[13]) И
 ИRound(RНалогУдер[1])   Round(RНалогУдер[2])  Round(RНалогУдер[3]) Round(RНалогУдер[4]) И
 ИRound(RНалогУдер[5])   Round(RНалогУдер[6])  Round(RНалогУдер[7]) Round(RНалогУдер[8]) И
 ИRound(RНалогУдер[9])   Round(RНалогУдер[10]) Round(RНалогУдер[11]) И
 ИRound(RНалогУдер[12])  Round(RНалогУдер[13]) И

 ИRДолгНалПлат[1]   RДолгНалПлат[2]    RДолгНалПлат[3]   RДолгНалПлат[4] И
 ИRДолгНалПлат[5]   RДолгНалПлат[6]    RДолгНалПлат[7]   RДолгНалПлат[8] И
 ИRДолгНалПлат[9]   RДолгНалПлат[10]   RДолгНалПлат[11] И
 ИRДолгНалПлат[12]  RДолгНалПлат[13] И
 ИRДолгНалАгент[1]  RДолгНалАгент[2]   RДолгНалАгент[3] И
 ИRДолгНалАгент[4]  RДолгНалАгент[5]   RДолгНалАгент[6] И
 ИRДолгНалАгент[7]  RДолгНалАгент[8]   RДолгНалАгент[9] И
 ИRДолгНалАгент[10] RДолгНалАгент[11]  RДолгНалАгент[12]  RДолгНалАгент[13] И
 ИRВзыскание[1]     RВзыскание[2]      RВзыскание[3]      RВзыскание[4] И
 ИRВзыскание[5]     RВзыскание[6]      RВзыскание[7]      RВзыскание[8] И
 ИRВзыскание[9]     RВзыскание[10]     RВзыскание[11] И
 ИRВзыскание[12]    RВзыскание[13] И
 И.endfields И
 Ш   │Налоговая база (с начала года) │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   ├───────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │Налог исчисленный              │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│ Ш
 Ш   ├───────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │Налог удержанный               │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│ Ш
 Ш   ├───────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │Долг по налогу за              │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │налогоплательщиком             │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│ Ш
 Ш   ├───────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │Долг по налогу за              │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │налоговым агентом              │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│ Ш
 Ш   ├───────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │Сумма налога, переданная на    │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │взыскание в налоговый  орган   │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│ Ш
 Ш   ├───────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │Возвращена налоговым агентом   │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │излишне удержанная сумма налога│           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   └───────────────────────────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┘
 Р.fields И
 И'true':'s' И
 И.endfields И
 И^ И
 И.fields И
 ИМинимум1  Минимум2 Минимум3 И
 ИОсноваВыч3 И
 ИРасходы1  Расходы2  Расходы3 И
 ИКолДетей ПериодВыч ОсноваВыч1 И
 ИСтатусВдовы И
 ИВидВыч ОсноваВыч2 И
 И.endfields И

 И      РПРАВО НА СТАНДАРТНЫЕ НАЛОГОВЫЕ ВЫЧЕТЫ:
                                                               ┌──┐               ┌──┐               ┌──┐
     3.1. Необлагаемый минимум дохода в размере: 3000 рублей - │@@│, 500 рублей - │@@│, 400 рублей - │@@│- (в нужном поле проставить любой знак);
                                                               └──┘               └──┘               └──┘
     основание для предоставления налогового вычета @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                                                                  ┌──┐                         ┌──┐                         ┌──┐
     3.2. Расходы на содержание 1 ребенка в размере: 1000 рублей -│@@│, в размере 2000 рублей -│@@│, в размере 4000 рублей -│@@│- (в нужном поле проставить любой знак);
                                                                  └──┘                         └──┘                         └──┘
     количество детей &&& период действия вычета @@@@@@@@@@@@@@@@@@@@@@@@@@@ основание для предоставления налогового вычета @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

     документы, подтверждающие статус вдовы (вдовца), одинокого родителя, опекуна или попечителя @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@


     ПРАВО НА НАЛОГОВЫЕ ВЫЧЕТЫ, ПРЕДУСМОТРЕННЫЕ ПУНКТАМИ 2 И 3 СТАТЬИ 221 НАЛОГОВОГО КОДЕКСА РОССИЙСКОЙ ФЕДЕРАЦИИ

     вид вычета @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ основание для предоставления вычета @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Ш
 Р

 И
 Щ    ШРаздел 4.РАСЧЕТ НАЛОГОВОЙ БАЗЫ И НАЛОГА НА ДОХОДЫ ФИЗИЧЕСКОГО ЛИЦА ОТ ДОЛЕВОГО УЧАСТИЯ
   В ДЕЯТЕЛЬНОСТИ ОРГАНИЗАЦИИ (ДИВИДЕНДЫ) Щ
.begin
  RСумДивиденд13:=
  СумДивиденд1+ СумДивиденд2+ СумДивиденд3+  СумДивиденд4+
  СумДивиденд5+ СумДивиденд6+ СумДивиденд7+  СумДивиденд8+
  СумДивиденд9+ СумДивиденд10+СумДивиденд11+ СумДивиденд12;

  RОблСумДивиденд13:=
  ОблСумДивиденд1+ОблСумДивиденд2 + ОблСумДивиденд3 + ОблСумДивиденд4+
  ОблСумДивиденд5+ОблСумДивиденд6 + ОблСумДивиденд7 + ОблСумДивиденд8+
  ОблСумДивиденд9+ОблСумДивиденд10+ ОблСумДивиденд11+ ОблСумДивиденд12;

  for (i := 1; i <= 13; i := i + 1)
  {
    RДолгНалПлатDiv[i] := 0;
    RДолгНалАгентDiv[i]:= 0;
  }

  if INalДивиденд1 >= 0
    RINalДивиденд[1] := DoubleToStr(INalДивиденд1,'666666666667')
  else
    RINalДивиденд[1] := DoubleToStr(INalДивиденд1,'-666666666667')

  if INalДивиденд2 >= 0
    RINalДивиденд[2] := DoubleToStr(INalДивиденд2,'666666666667')
  else
    RINalДивиденд[2] := DoubleToStr(INalДивиденд2,'-666666666667')

  if INalДивиденд3 >= 0
    RINalДивиденд[3] := DoubleToStr(INalДивиденд3,'666666666667')
  else
    RINalДивиденд[3] := DoubleToStr(INalДивиденд3,'-666666666667')

  if INalДивиденд4 >= 0
    RINalДивиденд[4] := DoubleToStr(INalДивиденд4,'666666666667')
  else
    RINalДивиденд[4] := DoubleToStr(INalДивиденд4,'-666666666667')

  if INalДивиденд5 >= 0
    RINalДивиденд[5] := DoubleToStr(INalДивиденд5,'666666666667')
  else
    RINalДивиденд[5] := DoubleToStr(INalДивиденд5,'-666666666667')

  if INalДивиденд6 >= 0
    RINalДивиденд[6] := DoubleToStr(INalДивиденд6,'666666666667')
  else
    RINalДивиденд[6] := DoubleToStr(INalДивиденд6,'-666666666667')

  if INalДивиденд7 >= 0
    RINalДивиденд[7] := DoubleToStr(INalДивиденд7,'666666666667')
  else
    RINalДивиденд[7] := DoubleToStr(INalДивиденд7,'-666666666667')

  if INalДивиденд8 >= 0
    RINalДивиденд[8] := DoubleToStr(INalДивиденд8,'666666666667')
  else
    RINalДивиденд[8] := DoubleToStr(INalДивиденд8,'-666666666667')

  if INalДивиденд9 >= 0
    RINalДивиденд[9] := DoubleToStr(INalДивиденд9,'666666666667')
  else
    RINalДивиденд[9] := DoubleToStr(INalДивиденд9,'-666666666667')

  if INalДивиденд10 >= 0
    RINalДивиденд[10] := DoubleToStr(INalДивиденд10,'666666666667')
  else
    RINalДивиденд[10] := DoubleToStr(INalДивиденд10,'-666666666667')

  if INalДивиденд11 >= 0
    RINalДивиденд[11] := DoubleToStr(INalДивиденд11,'666666666667')
  else
    RINalДивиденд[11] := DoubleToStr(INalДивиденд11,'-666666666667')

  if INalДивиденд12 >= 0
    RINalДивиденд[12] := DoubleToStr(INalДивиденд12,'666666666667')
  else
    RINalДивиденд[12] := DoubleToStr(INalДивиденд12,'-666666666667')

  if INalДивиденд13 >= 0
    RINalДивиденд[13] := DoubleToStr(INalДивиденд13,'666666666667')
  else
    RINalДивиденд[13] := DoubleToStr(INalДивиденд13,'-666666666667')


  if UNalДивиденд1 >= 0
    RUNalДивиденд[1] := DoubleToStr(UNalДивиденд1,'666666666667')
  else
    RUNalДивиденд[1] := DoubleToStr(UNalДивиденд1,'-666666666667')

  if UNalДивиденд2 >= 0
    RUNalДивиденд[2] := DoubleToStr(UNalДивиденд2,'666666666667')
  else
    RUNalДивиденд[2] := DoubleToStr(UNalДивиденд2,'-666666666667')

  if UNalДивиденд3 >= 0
    RUNalДивиденд[3] := DoubleToStr(UNalДивиденд3,'666666666667')
  else
    RUNalДивиденд[3] := DoubleToStr(UNalДивиденд3,'-666666666667')

  if UNalДивиденд4 >= 0
    RUNalДивиденд[4] := DoubleToStr(UNalДивиденд4,'666666666667')
  else
    RUNalДивиденд[4] := DoubleToStr(UNalДивиденд4,'-666666666667')

  if UNalДивиденд5 >= 0
    RUNalДивиденд[5] := DoubleToStr(UNalДивиденд5,'666666666667')
  else
    RUNalДивиденд[5] := DoubleToStr(UNalДивиденд5,'-666666666667')

  if UNalДивиденд6 >= 0
    RUNalДивиденд[6] := DoubleToStr(UNalДивиденд6,'666666666667')
  else
    RUNalДивиденд[6] := DoubleToStr(UNalДивиденд6,'-666666666667')

  if UNalДивиденд7 >= 0
    RUNalДивиденд[7] := DoubleToStr(UNalДивиденд7,'666666666667')
  else
    RUNalДивиденд[7] := DoubleToStr(UNalДивиденд7,'-666666666667')

  if UNalДивиденд8 >= 0
    RUNalДивиденд[8] := DoubleToStr(UNalДивиденд8,'666666666667')
  else
    RUNalДивиденд[8] := DoubleToStr(UNalДивиденд8,'-666666666667')

  if UNalДивиденд9 >= 0
    RUNalДивиденд[9] := DoubleToStr(UNalДивиденд9,'666666666667')
  else
    RUNalДивиденд[9] := DoubleToStr(UNalДивиденд9,'-666666666667')

  if UNalДивиденд10 >= 0
    RUNalДивиденд[10] := DoubleToStr(UNalДивиденд10,'666666666667')
  else
    RUNalДивиденд[10] := DoubleToStr(UNalДивиденд10,'-666666666667')

  if UNalДивиденд11 >= 0
    RUNalДивиденд[11] := DoubleToStr(UNalДивиденд11,'666666666667')
  else
    RUNalДивиденд[11] := DoubleToStr(UNalДивиденд11,'-666666666667')

  if UNalДивиденд12 >= 0
    RUNalДивиденд[12] := DoubleToStr(UNalДивиденд12,'666666666667')
  else
    RUNalДивиденд[12] := DoubleToStr(UNalДивиденд12,'-666666666667')

  if UNalДивиденд13 >= 0
    RUNalДивиденд[13] := DoubleToStr(UNalДивиденд13,'666666666667')
  else
    RUNalДивиденд[13] := DoubleToStr(UNalДивиденд13,'-666666666667')

  for (i := 1; i <= 13; i := i + 1)
    if Round(RINalДивиденд[i]) > Round(RUNalДивиденд[i])
      RДолгНалПлатDiv[i] :=  Round(RINalДивиденд[i]) - Round(RUNalДивиденд[i])
    else
      RДолгНалАгентDiv[i] := Round(RUNalДивиденд[i]) - Round(RINalДивиденд[i])
end.
.fields
  СумДивиденд1  СумДивиденд2  СумДивиденд3   СумДивиденд4 СумДивиденд5 СумДивиденд6
  СумДивиденд7 СумДивиденд8 СумДивиденд9 СумДивиденд10 СумДивиденд11 СумДивиденд12 RСумДивиденд13
  ОблСумДивиденд1 ОблСумДивиденд2 ОблСумДивиденд3 ОблСумДивиденд4 ОблСумДивиденд5 ОблСумДивиденд6
  ОблСумДивиденд7 ОблСумДивиденд8 ОблСумДивиденд9 ОблСумДивиденд10 ОблСумДивиденд11 ОблСумДивиденд12
  RОблСумДивиденд13

  RINalДивиденд[1]  RINalДивиденд[2]  RINalДивиденд[3]
  RINalДивиденд[4]  RINalДивиденд[5]  RINalДивиденд[6]
  RINalДивиденд[7]  RINalДивиденд[8]  RINalДивиденд[9]
  RINalДивиденд[10] RINalДивиденд[11] RINalДивиденд[12]
  RINalДивиденд[13]

  RUNalДивиденд[1]  RUNalДивиденд[2]  RUNalДивиденд[3]
  RUNalДивиденд[4]  RUNalДивиденд[5]  RUNalДивиденд[6]
  RUNalДивиденд[7]  RUNalДивиденд[8]  RUNalДивиденд[9]
  RUNalДивиденд[10] RUNalДивиденд[11] RUNalДивиденд[12]
  RUNalДивиденд[13]

  RДолгНалПлатDiv[1]   RДолгНалПлатDiv[2]   RДолгНалПлатDiv[3]
  RДолгНалПлатDiv[4]   RДолгНалПлатDiv[5]   RДолгНалПлатDiv[6]
  RДолгНалПлатDiv[7]   RДолгНалПлатDiv[8]   RДолгНалПлатDiv[9]
  RДолгНалПлатDiv[10]  RДолгНалПлатDiv[11]  RДолгНалПлатDiv[12]
  RДолгНалПлатDiv[13]

  RДолгНалАгентDiv[1]  RДолгНалАгентDiv[2]  RДолгНалАгентDiv[3]
  RДолгНалАгентDiv[4]  RДолгНалАгентDiv[5]  RДолгНалАгентDiv[6]
  RДолгНалАгентDiv[7]  RДолгНалАгентDiv[8]  RДолгНалАгентDiv[9]
  RДолгНалАгентDiv[10] RДолгНалАгентDiv[11] RДолгНалАгентDiv[12]
  RДолгНалАгентDiv[13]
.endfields
 Ш   ┌──┬────────────────────────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┐ Ш
 Ш   │N │    Показатели              │   Январь  │  Февраль  │   Март    │   Апрель  │    Май    │    Июнь   │     Июль  │  Август   │  Сентябрь │  Октябрь  │   Ноябрь  │  Декабрь  │  Итого    │ Ш
 Ш   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │ 1│Сумма дивидендов, распреде- │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │  │ленная в пользу физического │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │  │лица - налогоплательщика    │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │ 2│Облагаемая сумма дивидендов │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │ 3│Сумма налога исчисленная    │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│ Ш
 Ш   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤───────────┼───────────┤ Ш
 Ш   │ 4│Сумма налога удержанная     │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│ Ш
 Ш   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │ 5│Долг по налогу  за          │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│ Ш
 Ш   │  │налогоплательщиком          │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │ 6│Долг по  налогу за          │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│ Ш
 Ш   │  │налоговым агентом           │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │ 7│Сумма налога, переданная на │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │  │взыскание в налоговый орган │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │ 8│Возвращена налоговым        │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │  │агентом  излишне удержанная │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │  │сумма налога                │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   └──┴────────────────────────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┘
 Ш.fields
'true':'s'
.endfields
^

 Б  Ш  Раздел 5.РАСЧЕТ НАЛОГА С ДОХОДОВ, ОБЛАГАЕМЫХ ПО СТАВКЕ 35% Щ
.begin
RAllНал35_Исчисл13:= 0;
RAllНал35_Удер13  := 0;
RДолг1Нал35_1:= 0; RДолг1Нал35_2:= 0; RДолг1Нал35_3:= 0;   RДолг1Нал35_4:= 0;
RДолг1Нал35_5:= 0; RДолг1Нал35_6:= 0; RДолг1Нал35_7:= 0;   RДолг1Нал35_8:= 0;
RДолг1Нал35_9:= 0; RДолг1Нал35_10:= 0; RДолг1Нал35_11:= 0; RДолг1Нал35_12:= 0; RДолг1Нал35_13:= 0;
 RДолг2Нал35_1:= 0; RДолг2Нал35_2:= 0; RДолг2Нал35_3:= 0;   RДолг2Нал35_4:= 0;
 RДолг2Нал35_5:= 0; RДолг2Нал35_6:= 0; RДолг2Нал35_7:= 0;   RДолг2Нал35_8:= 0;
 RДолг2Нал35_9:= 0; RДолг2Нал35_10:= 0; RДолг2Нал35_11:= 0; RДолг2Нал35_12:= 0; RДолг2Нал35_13:= 0;
end.
.fields
 Код_дохода
 Призы1 Призы2 Призы3 Призы4 Призы5 Призы6 Призы7 Призы8 Призы9 Призы10 Призы11 Призы12 RПризы13
 Вычет35_1  Вычет35_2  Вычет35_3  Вычет35_4  Вычет35_5  Вычет35_6  Вычет35_7  Вычет35_8 Вычет35_9
 Вычет35_10 Вычет35_11 Вычет35_12 RВычет35_13
 НалБаза35_1 НалБаза35_2 НалБаза35_3 НалБаза35_4 НалБаза35_5 НалБаза35_6
 НалБаза35_7 НалБаза35_8 НалБаза35_9 НалБаза35_10 НалБаза35_11 НалБаза35_12
 RНалБаза35_13
 Нал35_Исчисл1 Нал35_Исчисл2 Нал35_Исчисл3 Нал35_Исчисл4 Нал35_Исчисл5 Нал35_Исчисл6
 Нал35_Исчисл7 Нал35_Исчисл8 Нал35_Исчисл9 Нал35_Исчисл10 Нал35_Исчисл11 Нал35_Исчисл12
 RНал35_Исчисл13
 Нал35_Удер1 Нал35_Удер2 Нал35_Удер3 Нал35_Удер4 Нал35_Удер5 Нал35_Удер6 Нал35_Удер7
 Нал35_Удер8 Нал35_Удер9 Нал35_Удер10 Нал35_Удер11 Нал35_Удер12 RНал35_Удер13
 RДолг1Нал35_1 RДолг1Нал35_2 RДолг1Нал35_3   RДолг1Нал35_4
 RДолг1Нал35_5 RДолг1Нал35_6 RДолг1Нал35_7   RДолг1Нал35_8
 RДолг1Нал35_9 RДолг1Нал35_10 RДолг1Нал35_11 RДолг1Нал35_12 RДолг1Нал35_13
 RДолг2Нал35_1 RДолг2Нал35_2 RДолг2Нал35_3   RДолг2Нал35_4
 RДолг2Нал35_5 RДолг2Нал35_6 RДолг2Нал35_7   RДолг2Нал35_8
 RДолг2Нал35_9 RДолг2Нал35_10 RДолг2Нал35_11 RДолг2Нал35_12 RДолг2Нал35_13
.endfields
.{ Stavka35_2005 CheckEnter
.begin
 RПризы13:= Призы1+Призы2+Призы3+Призы4+Призы5+Призы6+Призы7+Призы8+Призы9+Призы10+Призы11+Призы12;
 RВычет35_13:= Вычет35_1+Вычет35_2+Вычет35_3+Вычет35_4+Вычет35_5+Вычет35_6+Вычет35_7+Вычет35_8+Вычет35_9+Вычет35_10+Вычет35_11+Вычет35_12;
 RНалБаза35_13:= НалБаза35_1+ НалБаза35_2+ НалБаза35_3+НалБаза35_4+
 НалБаза35_5+НалБаза35_6+НалБаза35_7+НалБаза35_8+НалБаза35_9+
 НалБаза35_10+ НалБаза35_11+ НалБаза35_12;

 RНал35_Исчисл13 := Нал35_Исчисл1 + Нал35_Исчисл2 + Нал35_Исчисл3  +
                   Нал35_Исчисл4 + Нал35_Исчисл5 + Нал35_Исчисл6  + Нал35_Исчисл7+
                   Нал35_Исчисл8 + Нал35_Исчисл9 + Нал35_Исчисл10 + Нал35_Исчисл11+
                   Нал35_Исчисл12;

 RНал35_Удер13 :=   Нал35_Удер1  + Нал35_Удер2  + Нал35_Удер3  + Нал35_Удер4 +
                   Нал35_Удер5  + Нал35_Удер6  + Нал35_Удер7  + Нал35_Удер8 +
                   Нал35_Удер9  + Нал35_Удер10 + Нал35_Удер11 + Нал35_Удер12;
 RAllНал35_Исчисл13:= RAllНал35_Исчисл13 + RНал35_Исчисл13;
 RAllНал35_Удер13  := RAllНал35_Удер13 + RНал35_Удер13;

 if  Нал35_Исчисл1>  Нал35_Удер1  then   RДолг1Нал35_1:= Round(Нал35_Исчисл1)- Round(Нал35_Удер1)
 else RДолг2Нал35_1:= Round(Нал35_Удер1) - Round(Нал35_Исчисл1);
 if  Нал35_Исчисл2>  Нал35_Удер2  then   RДолг1Нал35_2:= Round(Нал35_Исчисл2)- Round(Нал35_Удер2)
 else RДолг2Нал35_2:= Round(Нал35_Удер2) - Round(Нал35_Исчисл2);
 if  Нал35_Исчисл3>  Нал35_Удер3  then   RДолг1Нал35_3:= Round(Нал35_Исчисл3)- Round(Нал35_Удер3)
 else RДолг2Нал35_3:= Round(Нал35_Удер3) - Round(Нал35_Исчисл3);
 if  Нал35_Исчисл4>  Нал35_Удер4  then   RДолг1Нал35_4:= Round(Нал35_Исчисл4)- Round(Нал35_Удер4)
 else RДолг2Нал35_4:= Round(Нал35_Удер4) - Round(Нал35_Исчисл4);
 if  Нал35_Исчисл5>  Нал35_Удер5  then   RДолг1Нал35_5:= Round(Нал35_Исчисл5)- Round(Нал35_Удер5)
 else RДолг2Нал35_5:= Round(Нал35_Удер5) - Round(Нал35_Исчисл5);
 if  Нал35_Исчисл6>  Нал35_Удер6  then   RДолг1Нал35_6:= Round(Нал35_Исчисл6)- Round(Нал35_Удер6)
 else RДолг2Нал35_6:= Round(Нал35_Удер6) - Round(Нал35_Исчисл6);
 if  Нал35_Исчисл7>  Нал35_Удер7  then   RДолг1Нал35_7:= Round(Нал35_Исчисл7)- Round(Нал35_Удер7)
 else RДолг2Нал35_7:= Round(Нал35_Удер7) - Round(Нал35_Исчисл7);
 if  Нал35_Исчисл8>  Нал35_Удер8  then   RДолг1Нал35_8:=  Round(Нал35_Исчисл8)- Round(Нал35_Удер8)
 else RДолг2Нал35_8:= Round(Нал35_Удер8)- Round(Нал35_Исчисл8);
 if  Нал35_Исчисл9>  Нал35_Удер9  then   RДолг1Нал35_9:= Round(Нал35_Исчисл9)- Round(Нал35_Удер9)
 else RДолг2Нал35_9:= Round(Нал35_Удер9)- Round(Нал35_Исчисл9);
 if Нал35_Исчисл10>  Нал35_Удер10 then  RДолг1Нал35_10:= Round(Нал35_Исчисл10)- Round(Нал35_Удер10)
 else RДолг2Нал35_10:= Round(Нал35_Удер10)- Round(Нал35_Исчисл10);
 if Нал35_Исчисл11>  Нал35_Удер11 then  RДолг1Нал35_11:= Round(Нал35_Исчисл11)- Round(Нал35_Удер11)
 else RДолг2Нал35_11:= Round(Нал35_Удер11)- Round(Нал35_Исчисл11);
 if Нал35_Исчисл12>  Нал35_Удер12 then  RДолг1Нал35_12:= Round(Нал35_Исчисл12)- Round(Нал35_Удер12)
 else RДолг2Нал35_12:= Round(Нал35_Удер12)- Round(Нал35_Исчисл12);
 if RНал35_Исчисл13>  RНал35_Удер13 then  RДолг1Нал35_13:= RНал35_Исчисл13- RНал35_Удер13
 else RДолг2Нал35_13:= RНал35_Удер13- RНал35_Исчисл13;
end.
 Ш   ┌──┬────────────────────────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┐ Ш
 Ш   │N │    Показатель              │   Январь  │  Февраль  │   Март    │   Апрель  │    Май    │    Июнь   │     Июль  │  Август   │  Сентябрь │  Октябрь  │   Ноябрь  │  Декабрь  │  Итого    │ Ш
 Ш   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │ 1│Код дохода @@@@ сумма дохода│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │ 2│Налоговый вычет, предусмот- │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │  │ренный пунктом 28 статьи 217│           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │  │Налогового кодекса Российс- │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │  │кой Федерации по выигрышам  │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │  │и призам в целях рекламы    │&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │ 3│Налоговая база (стр.1-стр.2)│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │ 4│Сумма  налога исчисленная   │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│ Ш
 Ш   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │ 5│Сумма налога удержанная     │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│ Ш
 Ш   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │ 6│Долг по налогу  за          │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │  │налогоплательщиком          │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│ Ш
 Ш   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │ 7│Долг по  налогу за          │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │  │налоговым агентом           │&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│&&&&&&&&&&&│ Ш
 Ш   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │ 8│Сумма налога, переданная на │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │  │взыскание в налоговый орган │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   ├──┼────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш   │ 9│Возвращена налоговым агентом│           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │  │излишне удержанная          │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   │  │сумма налога                │           │           │           │           │           │           │           │           │           │           │           │           │           │ Ш
 Ш   └──┴────────────────────────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┘
 Ш.fields
'true':'s'
.endfields
^
.}
 Б    ШРаздел 6.ОБЩАЯ СУММА НАЛОГА ПО ИТОГАМ НАЛОГОВОГО ПЕРИОДА Щ
.begin
 AllZero:= 0;
 AllНал13_Исч := 0;
 AllНал13_Удер:= 0;
 AllНал30_Исч := 0;
 AllНал30_Удер:= 0;
 AllДолгНалПлат13 := 0;
 AllДолгНалАгент13:= 0;
 AllДолгНалПлат30 := 0;
 AllДолгНалАгент30:= 0;
 AllДолгНалПлатDiv := 0;
 AllДолгНалАгентDiv := 0;
 RAllPred63Rez  := 0;
 RAllPred63NoRez:= 0;
 RAllPred64Rez  := 0;
 RAllPred64NoRez:= 0;
 RAllVz13:= 0;
 RAllVz30:= 0;
 RProcDiv := '';

if Статус ='1'
!13%
 begin
   RProcDiv := '9%'
   AllНал13_Исч := Round(RНалогИсчисл[13]);
   AllНал13_Удер:= Round(RНалогУдер[13]);
   RAllVz13:= RВзыскание[13]

   AllДолгНалПлат13 := RДолгНалПлат[13]
   AllДолгНалАгент13:= RДолгНалАгент[13]

   RAllPred63Rez:= NalPred63_1 + NalPred63_2 + NalPred63_3 + NalPred63_4 + NalPred63_5 + NalPred63_6 +
                   NalPred63_7 + NalPred63_8 + NalPred63_9 + NalPred63_10 + NalPred63_11 + NalPred63_12

   RAllPred64Rez:= NalPred64_1 + NalPred64_2 + NalPred64_3 + NalPred64_4 + NalPred64_5 + NalPred64_6 +
                   NalPred64_7 + NalPred64_8 + NalPred64_9 + NalPred64_10 + NalPred64_11 + NalPred64_12
 end
 else
 begin
   if ЗаГод > 2007
     RProcDiv := '15%'
   else
     RProcDiv := '9%'

   AllНал30_Исч := Round(RНалогИсчисл[13]);
   AllНал30_Удер:= Round(RНалогУдер[13]);
   RAllVz30 := RВзыскание[13]
   AllДолгНалПлат30 := RДолгНалПлат[13];
   AllДолгНалАгент30 := RДолгНалАгент[13];

   RAllPred63NoRez:= NalPred63_1 + NalPred63_2 + NalPred63_3 + NalPred63_4 + NalPred63_5 + NalPred63_6 +
                     NalPred63_7 + NalPred63_8 + NalPred63_9 + NalPred63_10 + NalPred63_11 + NalPred63_12

   RAllPred64NoRez:= NalPred64_1 + NalPred64_2 + NalPred64_3 + NalPred64_4 + NalPred64_5 + NalPred64_6 +
                     NalPred64_7 + NalPred64_8 + NalPred64_9 + NalPred64_10 + NalPred64_11 + NalPred64_12
 end
 AllДолгНалПлатDiv := RДолгНалПлатDiv[13]
 AllДолгНалАгентDiv := RДолгНалАгентDiv[13]

 if RAllНал35_Исчисл13 >  RAllНал35_Удер13  RДолг1Нал35_13 := RAllНал35_Исчисл13 - RAllНал35_Удер13
 else RДолг2Нал35_13 := RAllНал35_Удер13 - RAllНал35_Исчисл13;
end.
.fields
!9% или 15%
RProcDiv
RINalДивиденд[13]
RUNalДивиденд[13]
AllДолгНалПлатDiv
AllДолгНалАгентDiv

!13%
AllНал13_Исч
AllНал13_Удер
RAllVz13
AllZero
! Зачтено
RAllPred63Rez
!RAllPred64Rez
AllДолгНалПлат13
AllДолгНалАгент13

!30%
AllНал30_Исч
AllНал30_Удер
RAllVz30
AllZero
! Зачтено
RAllPred63NoRez
!RAllPred64NoRez
AllДолгНалПлат30
AllДолгНалАгент30

!35%
RAllНал35_Исчисл13
RAllНал35_Удер13
RДолг1Нал35_13
RДолг2Нал35_13

! Итого

double(RINalДивиденд[13]) + AllНал13_Исч + AllНал30_Исч + RAllНал35_Исчисл13
double(RUNalДивиденд[13]) + AllНал13_Удер + AllНал30_Удер + RAllНал35_Удер13
RAllVz13 + RAllVz30

AllZero
! Зачтено
RAllPred63Rez + RAllPred63NoRez
!RAllPred64Rez + RAllPred64NoRez
AllДолгНалПлатDiv  + AllДолгНалПлат13  +  AllДолгНалПлат30  + RДолг1Нал35_13
AllДолгНалАгентDiv + AllДолгНалАгент13 +  AllДолгНалАгент30 + RДолг2Нал35_13
.endfields
 Ш   ┌─────────────┬───────────────────────┬────────────┬──────────────────────────────────────────────────┬───────────────────────────────────────────┐ Ш
 Ш   │Показатели   │   Общая сумма налога  │Передано на │По перерасчету за предшествующие налоговые периоды│                Долг по налогу             │ Ш
 Ш   │             ├───────────┬───────────┤взыскание в ├──────────────────────┬───────────────────────────┤─────────────────────┬─────────────────────┤ Ш
 Ш   │             │Исчисленная│Удержанная │ налоговый  │     Возвращено       │ Зачтено в счет налоговых  │За налогоплательщиком│За налоговым агентом │ Ш
 Ш   │             │           │           │  орган     │                      │обязательств отчетного года│                     │                     │ Ш
 Ш   ├─────────────┼───────────┼───────────┼────────────┼──────────────────────┼───────────────────────────┼─────────────────────┼─────────────────────┤ Ш
 Ш   │По ставке @@@│&&&&&&&&&&&│&&&&&&&&&&&│            │                      │                           │ &&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&& │ Ш
 Ш   ├─────────────┼───────────┼───────────┼────────────┼──────────────────────┼───────────────────────────┼─────────────────────┼─────────────────────┤ Ш
 Ш   │По ставке 13%│&&&&&&&&&&&│&&&&&&&&&&&│ &&&&&&&&&&&│ &&&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&& │ Ш
 Ш   ├─────────────┼───────────┼───────────┼────────────┼──────────────────────┼───────────────────────────┼─────────────────────┼─────────────────────┤ Ш
 Ш   │По ставке 30%│&&&&&&&&&&&│&&&&&&&&&&&│ &&&&&&&&&&&│ &&&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&& │ Ш
 Ш   ├─────────────┼───────────┼───────────┼────────────┼──────────────────────┼───────────────────────────┼─────────────────────┼─────────────────────┤ Ш
 Ш   │По ставке 35%│&&&&&&&&&&&│&&&&&&&&&&&│            │                      │                           │ &&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&& │ Ш
 Ш   ├─────────────┼───────────┼───────────┼────────────┼──────────────────────┼───────────────────────────┼─────────────────────┼─────────────────────┤ Ш
 Ш   │   Итого     │&&&&&&&&&&&│&&&&&&&&&&&│ &&&&&&&&&&&│ &&&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&& │ &&&&&&&&&&&&&&&&&&& │ Ш
 Ш   └─────────────┴───────────┴───────────┴────────────┴──────────────────────┴───────────────────────────┴─────────────────────┴─────────────────────┘

 Щ    ШРаздел 7.СВЕДЕНИЯ О ДОХОДАХ, НАЛОГООБЛОЖЕНИЕ КОТОРЫХ ОСУЩЕСТВЛЯЕТСЯ НАЛОГОВЫМИ ОРГАНАМИ Ш
 Щ   ┌─────────────────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┐ Ш
 Ш   │  Код  дохода        │   Январь  │  Февраль  │   Март    │   Апрель  │    Май    │    Июнь   │     Июль  │  Август   │  Сентябрь │  Октябрь  │   Ноябрь  │  Декабрь  │  Итого    │ Ш
 Ш   ├─────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
.begin Ш
 ШRВыплата13:= 0; Ш
 Шend. Ш
 Ш.{ DoxodImu1_2005 CheckEnter Ш
 Ш.fields Ш
 ШВыплатыКод  Выплата1 Выплата2 Выплата3 Выплата4 Выплата5 Выплата6 Выплата7 Выплата8 Выплата9 Выплата10 Выплата11 Выплата12 RВыплата13 Ш
 Ш.endfields Ш
 Ш.begin Ш
 ШRВыплата13:= Выплата1+ Выплата2+ Выплата3+ Выплата4+Выплата5+ Выплата6+Выплата7+Выплата8+Выплата9+Выплата10+Выплата11+Выплата12 Ш
 Шend. Ш
 Ш   │@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│&&&&&&&&.&&│ Ш
 Ш   ├─────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤
.} Ш
 Ш   └─────────────────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┘ Ш

    ЩРаздел 8. РЕЗУЛЬТАТЫ ПЕРЕРАСЧЕТА НАЛОГА ЗА ПРЕДШЕСТВУЮЩИЕ ПЕРИОДЫ Щ
 Ш  ┌─────────────────────────────────────────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────┐ Ш
 Ш  │                                             │Общая сумма│Общая сумма│Общая сумма│  Сумма    │   Сумма   │Долг по на-│  Долг     │Сумма нало-│ Ш
 Ш  │                                             │доходов,   │налоговых  │доходов,   │ исчислен- │удержанного│логу за на-│по налогу  │га, пере-  │ Ш
 Ш  │                                             │включаемых │вычетов,   │включаемых │  ного     │  налога   │логовым    │за налого- │данная на  │ Ш
 Ш  │                                             │в налоговую│исключаемых│в налоговую│  налога   │           │агентом    │плательщи- │взыскание  │ Ш
 Ш  │                                             │базу       │из налого- │базу и     │           │           │перед нало-│   ком     │в налоговый│ Ш
 Ш  │                                             │           │вой базы   │уменьшенных│           │           │гоплатель- │           │   орган   │ Ш
 Ш  │                                             │           │           │на налого- │           │           │щиком      │           │           │ Ш
 Ш  │                                             │           │           │вые вычеты │           │           │           │           │           │ Ш
 Ш  ├─────────────────────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш  │Отражено в налоговой карточке за _______ год │           │           │           │           │           │           │           │           │ Ш
 Ш  ├─────────────────────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш  │Результаты перерасчета налога за _______ год │           │           │           │           │           │           │           │           │ Ш
 Ш  ├─────────────────────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш  │Отражено в налоговой карточке за _______ год │           │           │           │           │           │           │           │           │ Ш
 Ш  ├─────────────────────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш  │Результаты перерасчета налога за _______ год │           │           │           │           │           │           │           │           │ Ш
 Ш  ├─────────────────────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш  │Отражено в налоговой карточке за _______ год │           │           │           │           │           │           │           │           │ Ш
 Ш  ├─────────────────────────────────────────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┼───────────┤ Ш
 Ш  │Результаты перерасчета налога за _______ год │           │           │           │           │           │           │           │           │ Ш
 Ш  └─────────────────────────────────────────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────┘
 Ш.fields
НомерСправ ДатаСправ
DataForm
Dolj_Check FIO_Check
.endfields

  ЩРаздел 9. СВЕДЕНИЯ О ПРЕДСТАВЛЕНИИ СПРАВОК: Щ

 Ш   а) налоговому органу о доходах: N справки ^ дата @@@@@@@@@@@ б) налогоплательщику о доходах: N справки ____________ дата _____________________

   в) налоговому органу о сумме задолженности, переданной на взыскание: N справки (письма) __________________________  дата  ____________________

   Правильность заполнения налоговой карточки проверена:

   &~&&&&&&&&&&&  @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  _______________________

       (дата)               (должность)                                     (Фамилия, Имя, Отчество)                              (Подпись) Ш
 Ш

 Ш.fields
'true':'s'
.endfields
^
.}
.endform
