/*
 ╔══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) Корпорация ГАЛАКТИКА, 1994,2000                  ║
 ║ Проект        : ГАЛАКТИКА                                                ║
 ║ Система       : Оперативный контур                                       ║
 ║ Версия        : 5.80                                                     ║
 ║ Назначение    : Печать применимостей сложных скидок                      ║
 ║ Ответственный : Шишов Виктор Васильевич (ShV)                            ║
 ╚══════════════════════════════════════════════════════════════════════════╝
*/

#doc
Печать применимостей сложных скидок
#end
.form 'LstKlSk1'
.hide
.var
  IsFirstPrim  : boolean;
  IsPrim       : boolean;
.endvar
.{CheckEnter ChFilter
.fields
   pSkidka             : string
   pFilter_GrOrg       : string
   pFilter_Org         : string
   pFilter_GrPrices    : string
   pFilter_Prices      : string
   pFilter_PrMC        : string
   pFilter_GroupMCUsl  : string
   pFilter_MCUsl       : string
.endfields
  ^^^^^^^^
.}
.{CheckEnter ChVid0
.fields
  Npp_0
  IsUses_0
  GrOrg_0
  Org_0
  GrPrice_0
  Price_0
  PrMC_0
  GrMCUsl_0
  MCUsl_0
  Skid_Name_0
.endfields
   ^^^^^^^^^^
.}
.{CheckEnter ChVid1
.fields
  Npp_1
  IsUses_1
  GrOrg_1
  Org_1
  GrPrice_1
  PrMC_1
  GrMCUsl_1
  Skid_Name_1
.endfields
   ^^^^^^^^
.}
.{CheckEnter ChVid2
.fields
  Npp_2
  IsUses_2
  GrOrg_2
  Org_2
  Skid_Name_2
.endfields
   ^^^^^
.}

.endform

#doc
Применимости сложных скидок
#end
.linkform 'LstKlSk1_00' prototype is 'LstKlSk1'
.nameInList 'Применимости сложных скидок'

.fields
  CommonFormHeader
.endfields
^
                                                  Применимости сложных скидок
.{CheckEnter ChFilter
  Наложены фильтры:
.{ ?INTERNAL; (pSkidka <>'');
.Fields
   pSkidka
.EndFields
   - по скидке:              @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.{ ?INTERNAL; (pFilter_GrOrg <>'');
.Fields
   pFilter_GrOrg
.EndFields
   - по группе контрагентов: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.{ ?INTERNAL; (pFilter_Org <>'');
.Fields
   pFilter_Org
.EndFields
   - по контрагенту:         @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.{ ?INTERNAL; (pFilter_GrPrices <>'');
.Fields
   pFilter_GrPrices
.EndFields
   - по группе прайс-листов: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.{ ?INTERNAL; (pFilter_Prices <>'');
.Fields
   pFilter_Prices
.EndFields
   - по прайс-листу:         @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.{ ?INTERNAL; (pFilter_PrMC <>'');
.Fields
   pFilter_PrMC
.EndFields
   - по признаку МЦ/Усл:     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.{ ?INTERNAL; (pFilter_GroupMCUsl <>'');
.Fields
   pFilter_GroupMCUsl
.EndFields
   - по группе МЦ/Усл:       @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.{ ?INTERNAL; (pFilter_MCUsl <>'');
.Fields
   pFilter_MCUsl
.EndFields
   - по МЦ/Усл:              @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.}

.begin
  IsFirstPrim := True;
  IsPrim      := False;
end.

.{CheckEnter ChVid0
.fields
  Npp_0
  IsUses_0
  GrOrg_0
  Org_0
  GrPrice_0
  Price_0
  PrMC_0
  GrMCUsl_0
  MCUsl_0
  Skid_Name_0
.endfields
.{while IsFirstPrim=True

   БПрименения по позиции спецификации Б
  ────┬──────┬─────────────────────────────────┬─────────────────────────────────┬────────────────────────────────────────────┬──────────────────────────────────────────
      │      │         Контрагенты             │          Прайс-листы            │                 МЦ/Усл                     │
    № │ При- ├─────────────┬───────────────────┼───────────────┬─────────────────┼───────┬───────────────┬────────────────────┤                 Скидка
      │менять│   Группа    │    Контрагент     │    Группа     │   Прайс-лист    │Признак│    Группа     │      МЦ/Усл        │
  ────┼──────┼─────────────┼───────────────────┼───────────────┼─────────────────┼───────┼───────────────┼────────────────────┼──────────────────────────────────────────
.begin
  IsFirstPrim := False;
end.
.}
   @~@│@~@@@@│@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@│@~@@@@@│@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.{while IsFirstPrim=False
  ────┴──────┴─────────────┴───────────────────┴───────────────┴─────────────────┴───────┴───────────────┴────────────────────┴──────────────────────────────────────────
.begin
  IsFirstPrim := True;
  IsPrim      := True;
end.
.}
.begin
  IsFirstPrim := True;
end.

.{CheckEnter ChVid1
.fields
  Npp_1
  IsUses_1
  GrOrg_1
  Org_1
  GrPrice_1
  PrMC_1
  GrMCUsl_1
  Skid_Name_1
.endfields
.{while IsFirstPrim=True

   БПрименения по группе позиций спецификации Б
  ────┬──────┬─────────────────────────────────┬───────────────┬────────────────────────┬──────────────────────────────────────────
      │      │         Контрагенты             │               │        МЦ/Усл          │
    № │ При- ├─────────────┬───────────────────┤    Группы     ├───────┬────────────────┤                 Скидка
      │менять│   Группа    │    Контрагент     │ прайс-листов  │Признак│    Группа      │
  ────┼──────┼─────────────┼───────────────────┼───────────────┼───────┼────────────────┼──────────────────────────────────────────
.begin
  IsFirstPrim := False;
end.
.}
   @~@│@~@@@@│@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@│@~@@@@@│@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.{while IsFirstPrim=False
  ────┴──────┴─────────────┴───────────────────┴───────────────┴───────┴────────────────┴──────────────────────────────────────────
.begin
  IsFirstPrim := True;
  IsPrim      := True;
end.
.}
.begin
  IsFirstPrim := True;
end.

.{CheckEnter ChVid2
.fields
  Npp_2
  IsUses_2
  GrOrg_2
  Org_2
  Skid_Name_2
.endfields
.{while IsFirstPrim=True

   БПрименения по документу в целом Б
  ────┬──────┬──────────────────────────────────┬──────────────────────────────────────────
      │      │         Контрагенты              │
    № │ При- ├─────────────┬────────────────────┤                 Скидка
      │менять│   Группа    │    Контрагент      │
  ────┼──────┼─────────────┼────────────────────┼──────────────────────────────────────────
.begin
  IsFirstPrim := False;
end.
.}
   @~@│@~@@@@│@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.{while IsFirstPrim=False
  ────┴──────┴─────────────┴────────────────────┴──────────────────────────────────────────
.begin
  IsFirstPrim := True;
  IsPrim      := True;
end.
.}
.{while IsPrim=False
                                                     НЕТ ПРИМЕНИМОСТЕЙ
.begin
  IsPrim      := True;
end.
.}
.endform