// Реестр счетов-фактур
// Розничная торговля

#doc
Реестр счетов-фактур
#end
.Form prschfakt
.hide
.fields
date1  
date2  
myorg
podr

orgname
Nomerf
Dataf
Sum     : double
dataopl
.endfields

 ^ ^ ^ ^
.{ CHECKENTER sfdopc
^ ^ ^ ^ ^
.}
.endform


#doc
Реестр счетов-фактур
#end
.linkform 'prschfakt01' prototype is prschfakt
.NameInList 'Реестр счетов-фактур'
.Fields
date1  
date2  
myorg
podr

orgname
Nomerf
Dataf
Sum
dataopl
.Endfields
 Р  И
                                                Б Реестр №_____ Б
                                     выписанных счетов-фактур на продажу
                                       товаров по безналичному расчету
                             юридическим лицам и индивидуальным предпринимателям
                                    за период с @@@@@@@@@@  по @@@@@@@@@@
                                        по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 ┌───────────────────────────────────────────┬─────────────────────────────────────────────────┬────────────┐
 │                                           │                  Счет-фактура                   │    Дата    │
 │                Получатель                 ├──────────────────┬────────────┬─────────────────┤   оплаты   │
 │                                           │       номер      │    дата    │      сумма      │            │
 ├───────────────────────────────────────────┼──────────────────┼────────────┼─────────────────┼────────────┤
.{ CHECKENTER sfdopc                                         
 │@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│ @@@@@@@@@@@│&&&&&&&&&&&&&&.&&│ @@@@@@@@@@@│
.}                                                            
 └───────────────────────────────────────────┴──────────────────┴────────────┴─────────────────┴────────────┘

 Р  И
.endform
