#doc
Резервы товаров для продажи по безналичному расчету
#end
.set name = 'repBezRez'
.hide
.fields
  oname    : string
  odate    : string

  name_mc  : string
  date_kut : date
  num_kut  : string
  rezerv   : double
  edizm    : string
  dRezerv  : string
  nomernnn : string
  NameKO   : string

  mc_itogo : double
  edizm_ito: string
.endfields

^ ^
.{
.{
^ ^ ^ ^ ^ ^ ^ ^
.}
^ ^
.}

.endform

! =============================================================================
#doc
Резервы товаров для продажи по безналичному расчету
#end
.linkform 'repBezRez_01' prototype is 'repBezRez'
.NameInList 'Резервы товаров для продажи по безналичному расчету'
.fields
  odate

  name_mc
  date_kut
  num_kut
  rezerv
  edizm
  dRezerv
  nomernnn
  NameKO 

  mc_itogo
  edizm_ito
.endfields

  Резервы товаров по безналичному расчету на ^
 Ш
──────────────────────────────────┬───────────┬───────────┬─────────────┬──────────┬──────────────┬───────────────┬───────────────
       Наименование товара        │  Дата КУТ │ Номер КУТ │   Резерв    │  Ед.изм. │Дата документа│Номер документа│  Организация  
──────────────────────────────────┴───────────┴───────────┴─────────────┴──────────┴──────────────┴───────────────┴───────────────
.{
.{
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@ &&&&&&&&&&& &&&&&&&&&.&&& @@@@@@@@@@  @@@@@@@@@@@@  @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@                                           
.}
Итого зарезервировано: &&&&&&&&&.&&& ^
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
 Ш
.}
.endform
