#doc
Отчет по дефицитам
#end
.Form 'Zakaz'
.NameInList 'Отчет по дефицитам'
.Fields
  реалНач
  реалКон
  поставщик
  норма
  фильтр
  округл1
  округл2
  сезон
  алгоритм
  группа // группа_nrec
  наименование // мц_nrec
  едИзм
  наличие
  скорРеализ
  запас
  пополн
.Endfields
  Р                                  ОТЧЕТ ПО ДЕФИЦИТАМ
    Анализируемый период  с  @@@@@@@@@@  по  @@@@@@@@@@
    Поставщик   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
    Период пополнения запасов (дней)    @@@@@@@@@@
    Фильтр по: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
    Округление до ^:@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
    Сезонный коэффициент: @@@@@@@
──────────────────────────────────────────────┬───────────┬─────────────┬──────────────┬────────────┬─────────────
               Наименование                   │Единица    │   Наличие   │@@@@@@@@@@@@@@│Товарный за-│ Кол-во для
                                              │измер.     │             │  реализация  │ пас в днях │ пополнения
──────────────────────────────────────────────┴───────────┴─────────────┴──────────────┴────────────┴─────────────
.{
   БГруппа:  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
.{
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@ &&&&&&&&&&&&&  &&&&&&&&&&&&  &&&&&&&&&&&& &&&&&&&&&&&& Р
.}
.}
.endform