/*
 ╔══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) Корпорация ГАЛАКТИКА, 1996,99                    ║
 ║ Проект        : ГАЛАКТИКА                                                ║
 ║ Система       : Модуль Управление ресурсами                              ║
 ║ Версия        : 6.00                                                     ║
 ║ Назначение    : Печать каталога приоритетов заявки-заказа                ║
 ║ Ответственный : Скороход Димтрий Владимирович (SDV)                      ║
 ╚══════════════════════════════════════════════════════════════════════════╝
*/
.set name='gPriority'
.hide
.fields
  _High _Tree _Code _Name
.endfields
.{ CheckEnter gPriority_Loop1
^^^^
.}
.endform
.linkform 'gPriority_01' prototype is 'gPriority'
.NameInList 'Линейный отчет'
.Group 'Линейные'
.fields
  CommonFormHeader
.endfields
^
.fields
   _Code _Name
.endfields
                     Список приоритетов
────────────────┬───────────────────────────────────────────
      Код       │                 Наименование
────────────────┴───────────────────────────────────────────
.{ CheckEnter gPriority_Loop1
@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.endform
.linkform 'gPriority_03' prototype is 'gPriority'
.NameInList 'Иерархический отчет'
.Group 'Иерархические'
.fields
  CommonFormHeader
.endfields
^
.fields
   _Tree _Name
.endfields
                     Список приоритетов
────────────────┬───────────────────────────────────────────
      Код       │                 Наименование
────────────────┴───────────────────────────────────────────
.{ CheckEnter gPriority_Loop1
@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.endform
