/*
 ╔══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) Корпорация ГАЛАКТИКА, 1996,99                    ║
 ║ Проект        : ГАЛАКТИКА                                                ║
 ║ Система       : Модуль Управление ресурсами                              ║
 ║ Версия        : 6.00                                                     ║
 ║ Назначение    : Печать каталога состояний заявки-заказа                  ║
 ║ Ответственный : Скороход Димтрий Владимирович (SDV)                      ║
 ╚══════════════════════════════════════════════════════════════════════════╝
*/
.set name='gState'
.hide
.fields
  _High _Tree _Code _Name
.endfields
.{ CheckEnter gState_Loop1
^^^^
.}
.endform
.linkform 'gState_01' prototype is 'gState'
.NameInList 'Линейный отчет'
.Group 'Линейные'
.fields
  CommonFormHeader
.endfields
^
.fields
   _Code _Name
.endfields
                     Список состояний
────────────────┬───────────────────────────────────────────
      Код       │                 Наименование
────────────────┴───────────────────────────────────────────
.{ CheckEnter gState_Loop1
@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.endform
.linkform 'gState_03' prototype is 'gState'
.NameInList 'Иерархический отчет'
.Group 'Иерархические'
.fields
  CommonFormHeader
.endfields
^
.fields
   _Tree _Name
.endfields
                     Список состояний
────────────────┬───────────────────────────────────────────
      Код       │                 Наименование
────────────────┴───────────────────────────────────────────
.{ CheckEnter gState_Loop1
@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.endform
