!=============================================================================
.Form 'ReportIn'
!=============================================================================
.Hide
.Fields
UserDeskRep_NRec
Наименование_организации
Дата
ФорматСум
Валюта_метода
Группировка
Сортировка

Фильтр

Head_TempDescr_NRec
Ветка
Итого_верх_стоимость
Ф_итого_верх_стоимость

Пустая_строка1

Номер_заказа
Дата_заказа
Стоимость

Наименование_товара
Цена_товара
Количество_товара
Стоимость_товара

Пустая_строка2

Tail_TempDescr_NRec
Итого
Итого_стоимость
Ф_итого_стоимость
.EndFields
^ ^ ^ ^ ^ ^ ^
.{ CheckEnter RepInFRes1
^
.}
.{
.{ CheckEnter RepInGrRes1
^ ^ ^ ^
.}
^
.{ CheckEnter RepInNameRes
^ ^ ^
.{ CheckEnter RepIn_Res_
^ ^ ^ ^
.}
.}
^
.{ CheckEnter RepInSumma
^ ^ ^ ^
.}
.}
.EndForm

!=============================================================================
.LinkForm 'ReportIndent' Prototype is 'ReportIn'
!=============================================================================
.NameInList 'Иерархический отчет'
.Group 'Отчеты по портфелям заказов'
.Fields
CommonFormHeader
Дата
Валюта_метода
Группировка
Сортировка
Фильтр

Ветка
Ф_итого_верх_стоимость

Пустая_строка1

Номер_заказа
Дата_заказа
Стоимость

Наименование_товара
Цена_товара
Количество_товара
Стоимость_товара

Пустая_строка2

Итого
Ф_итого_стоимость
.EndFields
^

                          Отчет по портфелям заказов
                            по состоянию на ^

Денежная единица:     ^
Группировка:          ^
Сортировка:           ^
Фильтры:
.{ CheckEnter RepInFRes1
 ^
.}
────────────────┬───────────────────┬────────────────┬────────────────┬────────────┬───────────────┬────────────────
  Номер заказа  │Дата приема заказа │  Сумма заказа  │   Наименование │ Цена       │ Количество    │   Стоимость
────────────────┴───────────────────┴────────────────┴────────────────┴────────────┴───────────────┴────────────────
.{
.{ CheckEnter RepInGrRes1
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  &&&&&&&&&&&&&&&
.}
^
.{ CheckEnter RepInNameRes
&&&&&&&&&&&        @@@@@@@@@@         &&&&&&&&&&&&&&
.{ CheckEnter RepIn_Res_
                                                   @@@@@@@@@@@@@@@@@@@ &&&&&&&&&&&&& &&&&&&&&&&&&&& &&&&&&&&&&&&&&&&&
.}
.}
^
.{ CheckEnter RepInSumma
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@    &&&&&&&&&&&&&&&
.}
.}
.EndForm