// =============================================================================
//                                                     (c)  корпорация Галактика
// Галактика 8.1
// Печать календарно-плановых нормативов в разрезе "Параметры - Объекты"
// =============================================================================

.set name='frmKPNPO'
.hide
.fields
  _Параметр
  _СтрокаРазделитель
  _Объект _ЗначениеПараметра1 _ЗначениеПараметра2 _ЗначениеПараметра3
.endfields

.{ CheckEnter frmKPNPO_Loop1
^
.{ CheckEnter frmKPNPO_Loop2
^
.{ CheckEnter frmKPNPO_Loop3
^^^^
.}
.}
.}
.endform

.linkform 'frmKPN_Par_Obj' prototype is 'frmKPNPO'
.group 'ParObj'
.NameInList 'Параметры - Объекты'
.fields
  _Параметр
  _СтрокаРазделитель
  _Объект _ЗначениеПараметра1 _ЗначениеПараметра2 _ЗначениеПараметра3
.endfields
                                            КАЛЕНДАРНО-ПЛАНОВЫЕ НОРМАТИВЫ
                                           в разрезе "Параметры - Объекты"
.{ CheckEnter frmKPNPO_Loop1

════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════
Наименование параметра КПН: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
────────────────────────────────────────────────────────┬─────────────┬──────────────────┬──────────────────────────────────
Тип объекта \ Наименование объекта                      │ Дата начала │ Значение         │ Дополнительно
                                                        │ действия    │                  │
.{ CheckEnter frmKPNPO_Loop2
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{ CheckEnter frmKPNPO_Loop3
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ │ @@@@@@@@@@@ │ @@@@@@@@@@@@@@@@ │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.}
════════════════════════════════════════════════════════╧═════════════╧══════════════════╧══════════════════════════════════
.}
.endform