/*
 ╔══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) Корпорация ГАЛАКТИКА, 1996,2009                  ║
 ║ Проект        : ГАЛАКТИКА                                                ║
 ║ Система       : Управление ресурсами                                     ║
 ║ Версия        : 7.00                                                     ║
 ║ Назначение    : Печать представления связей  в журнале резервирования    ║
 ║ Ответственный : Борткевич В.Т											                      ║
 ╚══════════════════════════════════════════════════════════════════════════╝
*/
.set name='Links'
.hide
.fields
	_StringData : string
	_KOl _EdIzm _Partia
	_Start _End

  /* _NomencNumber  _Oboznachenie   _Operacia //   Номенклатурный номер  Обозначение  Операция
  _StatusS  _Sostoianie   _Count         	 //   Статус  Состояние  Кл-во
  _EdIzm _ProizvCeh _Ceh                	 //    Ед.изм  Производственный цех   Цех
	_Partia _StartRezerv _EndRezerv */      	 //   Партия  Начало резервирования  Конец  резервирования
  /*_Power _Comment _Type _Naimenov        	//   Мощность(час) Комментарий   Тип	 Наименование
	_Status _RowNumber _PosType             //   Статус   Номер строки  Тип.поз.
	_PosName _PosStatus   */                  //   Наименование поз.    Статус поз.
.endfields
──────────────────────────────────────────────────┬─────────────────────────┬───────────────┬──────────────────────────────┬────────────────┬─────────────┬───────┬────────┬─────────────┬─────────────────┬──────────┬──────────────────┬──────────────────
                    Изделие                       │  Номенклатурный номер   │   Обозначение │              Операция        │      Статус    │ Состтояние  │ Кл-во │ Ед.изм │ Произв  цех │       Цех       │  Партия  │    Нач резерв    │    К-ц  резерв   │
──────────────────────────────────────────────────┴─────────────────────────┴───────────────┴──────────────────────────────┴────────────────┴─────────────┴───────┴────────┴─────────────┴─────────────────┴──────────┴──────────────────┴──────────────────
.{ CheckEnter Links_Loop1
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &&&&& @@@@@@ @@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@
.}

.endform

.linkform 'Links_01' prototype is 'Links'
.NameInList 'Печать журнала резервирования'
.fields
	_StringData :"d:r"
	_KOl _EdIzm _Partia
	_Start _End

 /* _NomencNumber _Oboznachenie _Operacia
  _StatusS  _Sostoianie _Count
  _EdIzm _ProizvCeh _Ceh
	_Partia _StartRezerv _EndRezerv     */
	.endfields
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
        Номенк.номер Изделие     \  Обозначение   \  Операция  \   Статус  \  Состояние  \  Производственный центр \    Цех      \   Кол.   \   Ед.изм   \  Партия     \    Нач. резерв.    \   К-ц  резерв.
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.{ CheckEnter Links_Loop1
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &&&&&&&.&&& @@@@@@@@@@@ @@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@
.}
.endform


