/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,02 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Корпоративное планирование                                ║
 ║ Версия        : 7.10                                                      ║
 ║ Назначение    :                                                           ║
 ║ Ответственный :                                                           ║
 ║ Параметры     :                                                           ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
.set name='frmPrM_ECO'
.hide
.fields _DateOfReport
        _KauPrEd
				_PrEd
				_TypeMnCp
				_KauObj
				_Obj
				_DateStart _cEd _CapQT _cEdTime
.endfields
^
.{ CheckEnter frmPrM_ECO_Loop1
^
.{ CheckEnter frmPrM_ECO_Loop2
^
.{ CheckEnter frmPrM_ECO_Loop3
^
.{ CheckEnter frmPrM_ECO_Loop4
^
.{ CheckEnter frmPrM_ECO_Loop5
^
.{ CheckEnter frmPrM_ECO_Loop6
^^^^
.}
.}
.}
.}
.}
.}
.endform

.linkform 'linkfrmPrM_ECO' prototype is 'frmPrM_ECO'
.NameInList 'Производственные единицы - Тип мощности - Объекты - Значения мощности'
.fields _DateOfReport
        _KauPrEd
				_PrEd
				_TypeMnCp
				_KauObj
				_Obj
				_DateStart _cEd _CapQT _cEdTime
.endfields

                                  Производственная мощность
                   Производственные единицы - Тип мощности - Объекты - Значения мощности
                                 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 ───────────────────────────────────────────────────┬──────────┬────────────┬──────────────┬─────────
  Тип производственной единицы                      │          │            │              │
    Производственная единица                        │   Дата   │  Единица   │              │ Единица
      Тип мощности                                  │  начала  │ измерения  │   Мощность   │ времени
        Тип объекта                                 │ действия │            │              │
          Объект                                    │          │            │              │
.{ CheckEnter frmPrM_ECO_Loop1
 ───────────────────────────────────────────────────┼──────────┼────────────┼──────────────┼─────────
  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │            │              │
.{ CheckEnter frmPrM_ECO_Loop2
    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │            │              │
.{ CheckEnter frmPrM_ECO_Loop3
      Мощность: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │            │              │
.{ CheckEnter frmPrM_ECO_Loop4
        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │            │              │
.{ CheckEnter frmPrM_ECO_Loop5
          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │            │              │
.{ CheckEnter frmPrM_ECO_Loop6
                                                    │@@@@@@@@@@│@~@@@@@@@@@@│&&&&&&&&&&&&&&│@@@@@@@@@
.}
.}
.}
.}
.}
.}
 ───────────────────────────────────────────────────┴──────────┴────────────┴──────────────┴───────

.endform
