/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,02 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Корпоративное планирование                                ║
 ║ Версия        : 7.10                                                      ║
 ║ Назначение    :                                                           ║
 ║ Ответственный :                                                           ║
 ║ Параметры     :                                                           ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/

.set name='frmPrM_EOC'
.hide
.fields _DateOfReport
        _KauPrEd
        _PrEd
        _KauObj
        _Obj
        _TypeMnCp
        _DateStart _cEd _CapQT _cEdTime
.endfields
^
.{ CheckEnter frmPrM_EOC_Loop1
^
.{ CheckEnter frmPrM_EOC_Loop2
^
.{ CheckEnter frmPrM_EOC_Loop3
^
.{ CheckEnter frmPrM_EOC_Loop4
^
.{ CheckEnter frmPrM_EOC_Loop5
^
.{ CheckEnter frmPrM_EOC_Loop6
^^^^
.}
.}
.}
.}
.}
.}
.endform


.linkform 'linkfrmPrM_EOC' prototype is 'frmPrM_EOC'
!.group 'ObjPar'
.NameInList 'Производственные единицы - Объекты - Тип мощности - Значения мощности'
.fields _DateOfReport
        _KauPrEd
        _PrEd
        _KauObj
        _Obj
				_TypeMnCp
				_DateStart _cEd _CapQT _cEdTime
.endfields

                                  Производственная мощность
                 Производственные единицы - Объекты - Тип мощности - Значения мощности
                                 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 ───────────────────────────────────────────────────┬──────────┬────────────┬──────────────┬─────────
  Тип производственной единицы                      │          │            │              │
    Производственная единица                        │   Дата   │  Единица   │              │ Единица
      Тип объекта                                   │  начала  │ измерения  │   Мощность   │ времени
        Объект                                      │ действия │            │              │
          Тип мощности                              │          │            │              │
.{ CheckEnter frmPrM_EOC_Loop1
 ───────────────────────────────────────────────────┼──────────┼────────────┼──────────────┼─────────
  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │            │              │
.{ CheckEnter frmPrM_EOC_Loop2
    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │            │              │
.{ CheckEnter frmPrM_EOC_Loop3
      @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │            │              │
.{ CheckEnter frmPrM_EOC_Loop4
        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │            │              │
.{ CheckEnter frmPrM_EOC_Loop5
          Мощность: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│          │            │              │
.{ CheckEnter frmPrM_EOC_Loop6
                                                    │@@@@@@@@@@│@~@@@@@@@@@@│&&&&&&&&&&&&&&│@@@@@@@@@
.}
.}
.}
.}
.}
.}
 ───────────────────────────────────────────────────┴──────────┴────────────┴──────────────┴───────

.endform
