! иммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм╩
! ╨  ░═╖Ю═║╝Б═╚:  ·ЮЛ╔╒ ▌╚╔ё                                                ╨
! ╨  █═╖╜═Г╔╜╗╔:  ▐╚═╜ ╖═ ╞╔Ю╗╝╓                                            ╨
! хммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм╪

.FORM 'OPSumPerPlan'
.hide
.fields
  sPlan      : string
  dBegDate   : Date
  dEndDate   : Date
!  sDataKind  : string
  sGrMC      : string
  sGrUsl     : string
  sAn1       : string
  sAn2       : string
  sAn3       : string
  PosName    : string
  SpKod      : string
  SpObozn    : string
  EdIzm      : string
  fAnalSp1   : string
  fAnalSp2   : string
  fAnalSp3   : string
  InvOnHand  : Double
  SumDem     : Double
  SumSup     : Double
  SR         : Double
  PIQ        : Double
  SZ         : Double
  ATP        : Double
  SumDem1    : Double
  SumSup1    : Double
  SR1        : Double
  PIQ1       : Double
  ATP1       : Double

.endfields
.{
╞╚═╜ ^
╓═БК ^ ^
!╓═╜╜К╔ ^
┐ЮЦ╞╞К ^ ^
═╜═╚╗Б╗╙╗ ▌▐ ^ ^ ^
.{
   ▌▐ ^ ^ ^ ^ ^ ^ ^
   ┼╝╚╗Г╔АБ╒═ ^ ^ ^ ^ ^ ^ ^
   ┼╝╚╗Г╔АБ╒═1  ^ ^ ^ ^ ^
.}
.}
.endform

.linkform 'OPSumPerPlan_001' prototype is 'OPSumPerPlan'
.NameInList '▐╚═╜ ╖═ ╞╔Ю╗╝╓'
!.group '▌БГ╔БК А А╝ЮБ╗Ю╝╒╙╝╘ ╞╝ ╜╝╛╔╜╙╚═БЦЮ╜╝╛Ц ╜╝╛╔ЮЦ'
.PAPER PA4
.ORIENT LANDSCAPE
.LL 80
.LM 10
.TM 10
.BM 10
.RM 10
.P 60
.fields
  sPlan
  dBegDate
  dEndDate
  sGrMC
  sGrUsl
  sAn1
  sAn2
  sAn3
  PosName
  SpKod
  SpObozn
  EdIzm
  fAnalSp1
  fAnalSp2
  fAnalSp3
  InvOnHand
  SumDem
  SumSup
  SR
  PIQ
  SZ
  ATP
  SumDem1
  SumSup1
  SR1
  PIQ1
  ATP1

.endfields

.{
.[H SKIP
Ъ≤                                                                                                                ▀╗АБЪ≤@NP@
Ъ≤ ддддддддддддддддддддддддбдддддддддддбдддддддддддбддддддддддбдддддддддддбдддддддддддбдддддддддддбддддддддддддддбддддддддддддддбддддддддддддддбддддддддддддддбддддддддддддддбддддддддддддддбддддддддддддддд
          (1)            Ё    (2)    Ё    (3)    Ё    (4)   Ё    (5)    Ё    (6)    Ё    (7)    Ё     (8)      Ё      (9)     Ё     (10)     Ё     (11)     Ё     (12)     Ё    (13)      Ё    (14)
 ддддддддддддддддддддддддадддддддддддадддддддддддаддддддддддадддддддддддадддддддддддадддддддддддаддддддддддддддаддддддддддддддаддддддддддддддаддддддддддддддаддддддддддддддаддддддддддддддадддддддддддддддЪ≤
.]H


Ъ│                  ▐▀─█ ┤─ ▐┘░┬▌└Ъ│

Ъ┬ ▌╞╔Ю═Б╗╒╜К╘ ╞╚═╜ : Ъ│^Ъ│
 └═Б═ ╞Ю╗╒О╖╙╗  : Ъ│^Ъ│
 └═Б═ ╝╙╝╜Г═╜╗О : Ъ│^Ъ│
 ┐ЮЦ╞╞═ ▄√      : Ъ│^Ъ┴
Ъ┬ ┐ЮЦ╞╞═ ЦА╚Цё   : Ъ│^Ъ┴
Ъ≤                                                                                                                                                                                 ▀╗АБЪ≤@NP@
Ъ≤ ддддддддддддддддддддддддбдддддддддддбдддддддддддбддддддддддбдддддддддддбдддддддддддбдддддддддддбддддддддддддддбдддддддддддддддддддддддддддддбддддддддддддддбддддддддддддддбддддддддддддддбддддддддддддддбдддддддддддддд
Ъ│  █═╗╛╔╜╝╒═╜╗╔           Ё █╝╛ ╜╝╛╔Ю Ё▌║╝╖╜═Г╔╜╗╔Ё ┘╓. ╗╖╛. Ё@@@@@@@@@@@Ё@@@@@@@@@@@Ё@@@@@@@@@@@Ё ▓╔╙. ╝АБ═Б╝╙ Ё                ▒╞Ю╝А(╒А╔ё╝) Ё ▐Ю╔╓╚.(╒А╔ё╝)Ё ▌╕╗╓. ╞╝Б╔Ю╗ Ё▐╚═╜╝╒К╘ ╖═╞═АЁ▒БЮ═Е╝╒. ╖═╞═АЁ   └░┤Ъ≥
Ъ≤ ддддддддддддддддддддддддедддддддддддедддддддддддеддддддддддедддддддддддедддддддддддедддддддддддеддддддддддддддедддддддддддддддддддддддддддддеддддддддддддддеддддддддддддддеддддддддддддддеддддддддддддддедддддддддддддд
          (1)            Ё    (2)    Ё    (3)    Ё    (4)   Ё    (5)    Ё    (6)    Ё    (7)    Ё     (8)      Ё                     (9)     Ё     (10)     Ё     (11)     Ё     (12)     Ё    (13)      Ё    (14)
 ддддддддддддддддддддддддадддддддддддадддддддддддаддддддддддадддддддддддадддддддддддадддддддддддаддддддддддддддадддддддддддддддддддддддддддддаддддддддддддддаддддддддддддддаддддддддддддддаддддддддддддддаддддддддддддддЪ≤
.{
Ъ≤
 @@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@ &&&&&&&&&&&.&& ┬АЕ╝╓╜К╘ ╞╚═╜: &&&&&&&&&&&.&& &&&&&&&&&&&.&& &&&&&&&&&&&.&& &&&&&&&&&&&.&& &&&&&&&&&&&.&& &&&&&&&&&&&.&&
                                                                                                                   █╝╒К╘ ╞╚═╜: &&&&&&&&&&&.&& &&&&&&&&&&&.&& &&&&&&&&&&&.&& &&&&&&&&&&&.&&                &&&&&&&&&&&.&&Ъ≤
Ъ│.Ъ│}

.}
.endform
