/*
╔═══════════════════════════════════════════════════════════════════════════╗
║                     (c) 2005    корпорация ГАЛАКТИКА                      ║
║ Проект        : ГАЛАКТИКА                                                 ║
║ Система       : Контур логистики                                          ║
║ Версия        : 7.12                                                      ║
║ Назначение    : Отчет "Погашение задолженностей по продажам"              ║
║ Ответственный : Кучуро И.И.                                               ║
╚═══════════════════════════════════════════════════════════════════════════╝
*/
#doc
Отчет "Погашение задолженностей по продажам"
#end
.set name 'IerDebPas'
.hide
.fields
  DateRepBeg
  DateRepEnd
  NameValut
  DateDOBeg
  DateDOEnd
  Days1  :longint     // дни просрочки
  Days21 :longint
  Days22 :longint
  Days3  :longint
  Groupororg
.endfields
дата периода с                ^
дата периода по               ^
валюта                        ^
дата периода ДО с             ^
дата периода ДО по            ^
^ Количество дней1
^ Количество дней2
^ Количество дней3
^ Количество дней4
^
.{
.if GroupKatorg
.fields
  GroupName
.endfields
^ наименование группы контрагентов
.end
.if Katorg
.fields
  KatorgNum :longint
  KatorgName
.endfields
^ Номер по порядку контрагента
^ Наименование контрагента
.end
.{CHECKENTER BaseDoc
.fields
  DocNo
  DateScheta
  DateOplat
  Sum1    : double
  Sum2    : double
  Sum3    : double
  Sum4    : double
  Sum5    : double
  Sum6    : double
  Sum7    : double
  Sum8    : double
  Sum9    : double
.endfields
^ Номер документа
^ Дата документа
^ Дата оплаты по документу
^ Сумма по счету
^ Сумма 1-го периода
^ Сумма 2-го периода
^ Сумма 3-го периода
^ Сумма ДЗ на начало отчетного периода
^ Сумма ПДЗ на начало отчетного периода
^ Сумма ДЗ на конец отчетного периода
^ Сумма ПДЗ на конец отчетного периода
^ Сумма 4-го периода
.}
.if ItogKatorg
.fields
  sNameKarorg
  Sum1Org : double
  Sum2Org : double
  Sum3Org : double
  Sum4Org : double
  Sum5Org : double
  Sum6Org : double
  Sum7Org : double
  Sum8Org : double
  Sum9Org : double
.endfields
^
^ Сумма по счету
^ Сумма 1-го периода
^ Сумма 2-го периода
^ Сумма 3-го периода
^ Сумма ДЗ на начало отчетного периода
^ Сумма ПДЗ на начало отчетного периода
^ Сумма ДЗ на конец отчетного периода
^ Сумма ПДЗ на конец отчетного периода
^ Сумма 4-го периода
.end
.if ItogGroupKatorg
.fields
  sNameGroup
  Sum1Grp : double
  Sum2Grp : double
  Sum3Grp : double
  Sum4Grp : double
  Sum5Grp : double
  Sum6Grp : double
  Sum7Grp : double
  Sum8Grp : double
  Sum9Grp : double
.endfields
^ Наименование группы
^ Сумма по счету
^ Сумма 1-го периода
^ Сумма 2-го периода
^ Сумма 3-го периода
^ Сумма ДЗ на начало отчетного периода
^ Сумма ПДЗ на начало отчетного периода
^ Сумма ДЗ на конец отчетного периода
^ Сумма ПДЗ на конец отчетного периода
^ Сумма 4-го периода
.end
.if ItogoRep
.fields
  Sum1Rep : double
  Sum2Rep : double
  Sum3Rep : double
  Sum4Rep : double
  Sum5Rep : double
  Sum6Rep : double
  Sum7Rep : double
  Sum8Rep : double
  Sum9Rep : double
.endfields
^ Сумма по счету
^ Сумма 1-го периода
^ Сумма 2-го периода
^ Сумма 3-го периода
^ Сумма ДЗ на начало отчетного периода
^ Сумма ПДЗ на начало отчетного периода
^ Сумма ДЗ на конец отчетного периода
^ Сумма ПДЗ на конец отчетного периода
^ Сумма 4-го периода
.end
.}
.endform

#doc
Отчет о погашении задолженности по продажам (развернутый)
#end
.linkform 'IerDebPas_1' prototype is 'IerDebPas'
.nameinlist 'Отчет о погашении задолженности по продажам (развернутый)'
.group 'Погашение дебиторской задолженности'
.fields
  CommonFormHeader
  DateRepBeg
  DateRepEnd
  NameValut
  DateDOBeg
  DateDOEnd
.endfields
 Б ^

                    ОТЧЕТ О ПОГАШЕНИИ ДЕБИТОРСКОЙ ЗАДОЛЖЕННОСТИ

  За период с ^ по ^ в ^
  по  документам основаниям продажи с ^ по ^

 Б  С Положительные задолженности соответствуют долгу контрагента, отрицательные - нашему долгу. С
.{
.if GroupKatorg
.fields
  GroupName
.endfields
 Б Группа ^ Б
.end
.if Katorg
.fields
  KatOrgNum KatOrgName
  Days1 (Days1 + 1) Days21 (Days21 + 1) Days22 Days3
.endfields
 Б ^.По контрагенту: ^ Б
 Ш┌─────────┬──────────┬──────────┬───────────────┬───────────────┬───────────────┬───────────────────────────────────────────────────────────────┬───────────────┬───────────────┐
│ № Счета │   Дата   │  Дата    │     Сумма     │  ДЗ на начало │ ПДЗ на начало │                    Суммы оплаты за отчетный период            │  ДЗ на конец  │ ПДЗ на конец  │
│         │   Счета  │ оплаты по│     Счета     │   отчетного   │   отчетного   ├───────────────┬───────────────┬───────────────┬───────────────┤   отчетного   │   отчетного   │
│         │          │ договору │               │    периода    │    периода    │ Срок до@~@@дн.│от@~@@до@~@@дн.│от@~@@до@~@@дн.│ более@~@@дней │    периода    │    периода    │
├─────────┼──────────┼──────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┤ Ш
.else
.fields
  Days1 (Days1 + 1) Days21 (Days21 + 1) Days22 Days3
.endfields
 Ш┌─────────┬──────────┬──────────┬───────────────┬───────────────┬───────────────┬───────────────────────────────────────────────────────────────┬───────────────┬───────────────┐
│ № Счета │   Дата   │  Дата    │     Сумма     │  ДЗ на начало │ ПДЗ на начало │                    Суммы оплаты за отчетный период            │  ДЗ на конец  │ ПДЗ на конец  │
│         │   Счета  │ оплаты по│     Счета     │   отчетного   │   отчетного   ├───────────────┬───────────────┬───────────────┬───────────────┤   отчетного   │   отчетного   │
│         │          │ договору │               │    периода    │    периода    │ Срок до@~@@дн.│от@~@@до@~@@дн.│от@~@@до@~@@дн.│ более@~@@дней │    периода    │    периода    │
├─────────┼──────────┼──────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┤ Ш
.end
.{CHECKENTER BaseDoc
.fields
  DocNo
  DateScheta
  DateOplat
  Sum1
  Sum5
  Sum6
  Sum2
  Sum3
  Sum4
  Sum9
  Sum7
  Sum8
.endfields
 Ш│@~@@@@@@@│@~@@@@@@@@│@~@@@@@@@@│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│ Ш
.}
.if ItogKatorg
.fields
  Sum1Org
  Sum5Org
  Sum6Org
  Sum2Org
  Sum3Org
  Sum4Org
  Sum9Org
  Sum7Org
  Sum8Org
.endfields
 Ш├─────────┴──────────┴──────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┤
│ Итого по контрагенту          │&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│
└───────────────────────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┘ Ш
.else
 Ш└───────────────────────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┘ Ш
.end
.if ItogGroupKatorg
.fields
  Days1 (Days1 + 1) Days21 (Days21 + 1) Days22 Days3
  sNameGroup
  Sum1Grp
  Sum5Grp
  Sum6Grp
  Sum2Grp
  Sum3Grp
  Sum4Grp
  Sum9Grp
  Sum7Grp
  Sum8Grp
.endfields
 Щ┌───────────────────────────────┬───────────────┬───────────────┬───────────────┬───────────────────────────────────────────────────────────────┬───────────────┬───────────────┐
│                               │    Сумма      │  ДЗ на начало │ ПДЗ на начало │         Суммы оплаты за отчетный период       │  ДЗ на конец  │ ПДЗ на конец  │               │
│                               │     всех      │    отчетного  │   отчетного   ├───────────────┬───────────────┬───────────────┬───────────────┤   отчетного   │   отчетного   │
│      Итого по группе          │    счетов     │     периода   │    периода    │ Срок до@~@@дн.│от@~@@до@~@@дн.│от@~@@до@~@@дн.│ более@~@@дней │    периода    │    периода    │
│        контрагентов:          ├───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┤
│ @~@@@@@@@@@@@@@@@@@@@@@@@@@@@ │&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│
└───────────────────────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┘ Щ


.end
.if ItogoRep
.fields
  Days1 (Days1 + 1) Days21 (Days21 + 1) Days22 Days3
  Groupororg
  Sum1Rep
  Sum5Rep
  Sum6Rep
  Sum2Rep
  Sum3Rep
  Sum4Rep
  Sum9Rep
  Sum7Rep
  Sum8Rep
.endfields
 Щ┌───────────────────────────────┬───────────────┬───────────────┬───────────────┬───────────────────────────────────────────────────────────────┬───────────────┬───────────────┐
│                               │    Сумма      │  ДЗ на начало │ ПДЗ на начало │         Суммы оплаты за отчетный период       │  ДЗ на конец  │ ПДЗ на конец  │               │
│                               │     всех      │    отчетного  │   отчетного   ├───────────────┬───────────────┬───────────────┬───────────────┤   отчетного   │   отчетного   │
│                               │    счетов     │     периода   │    периода    │ Срок до@~@@дн.│от@~@@до@~@@дн.│от@~@@до@~@@дн.│ более@~@@дней │    периода    │    периода    │
│      Итого по всем            ├───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┤
│ @~@@@@@@@@@@@@@@@@@@@@@@@@@@@ │&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│
└───────────────────────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┘ Щ
.end
.} С
 Й ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Ш
.endform С

 С
#doc
Отчет о погашении задолженности по продажам (свернутый)
#end
.linkform 'IerDebPas_2' prototype is 'IerDebPas'
.nameinlist 'Отчет о погашении задолженности по продажам (свернутый)'
.group 'Погашение дебиторской задолженности'
.fields
  CommonFormHeader
  DateRepBeg
  DateRepEnd
  NameValut
  DateDOBeg
  DateDOEnd
  Days1 (Days1 + 1) Days21 (Days21 + 1) Days22 Days3
.endfields
 Б ^

                    ОТЧЕТ О ПОГАШЕНИИ ДЕБИТОРСКОЙ ЗАДОЛЖЕННОСТИ

  За период с ^ по ^ в ^
  по  документам основаниям продажи с ^ по ^

 Б  С Положительные задолженности соответствуют долгу контрагента, отрицательные - нашему долгу. С
 Ш┌───────────────────────────────────────────┬───────────────┬───────────────┬───────────────┬───────────────────────────────────────────────────────────────┬───────────────┬───────────────┐
│                                           │     Сумма     │  ДЗ на начало │ ПДЗ на начало │         Суммы оплаты за отчетный период       │  ДЗ на конец  │ ПДЗ на конец  │               │
│ Контрагент                                │     Счетов    │   отчетного   │   отчетного   ├───────────────┬───────────────┬───────────────┬───────────────┤   отчетного   │   отчетного   │
│                                           │               │    периода    │    периода    │ Срок до@~@@дн.│от@~@@до@~@@дн.│от@~@@до@~@@дн.│ более@~@@дней │    периода    │    периода    │
├───────────────────────────────────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┤ Ш
.{
.if GroupKatorg
!.fields
!  Days1 (Days1 + 1) Days21 (Days21 + 1) Days22 Days3
!.endfields
 Ш!┌───────────────────────────────────────────┬───────────────┬───────────────┬───────────────┬───────────────────────────────────────────────────────────────┬───────────────┬───────────────┐
!│                                           │     Сумма     │  ДЗ на начало │ ПДЗ на начало │         Суммы оплаты за отчетный период       │  ДЗ на конец  │ ПДЗ на конец  │               │
!│ Контрагент                                │     Счетов    │   отчетного   │   отчетного   ├───────────────┬───────────────┬───────────────┬───────────────┤   отчетного   │   отчетного   │
!│                                           │               │    периода    │    периода    │ Срок до@~@@дн.│от@~@@до@~@@дн.│от@~@@до@~@@дн.│ более@~@@дней │    периода    │    периода    │
!├───────────────────────────────────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┤ Ш
.end
.if Katorg
.end
.{CHECKENTER BaseDoc
.}
.if ItogKatorg
.fields
  sNameKarorg
  Sum1Org
  Sum5Org
  Sum6Org
  Sum2Org
  Sum3Org
  Sum4Org
  Sum9Org
  Sum7Org
  Sum8Org
.endfields
 Ш│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│ Ш
.else
 Ш└───────────────────────────────────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┘ Ш
.end
.if ItogGroupKatorg
.fields
  sNameGroup
  Sum1Grp
  Sum5Grp
  Sum6Grp
  Sum2Grp
  Sum3Grp
  Sum4Grp
  Sum9Grp
  Sum7Grp
  Sum8Grp
.endfields
 Ш├───────────────────────────────────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┤
│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│
└───────────────────────────────────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┘ Ш
.end
.if ItogoRep
.fields
  Days1 (Days1 + 1) Days21 (Days21 + 1) Days22 Days3
  Groupororg
  Sum1Rep
  Sum5Rep
  Sum6Rep
  Sum2Rep
  Sum3Rep
  Sum4Rep
  Sum9Rep
  Sum7Rep
  Sum8Rep
.endfields
 Щ┌───────────────────── Б──────────── Б──────────┬───────────────┬───────────────┬───────────────┬───────────────────────────────────────────────────────────────┬───────────────┬───────────────┐
│                                           │    Сумма      │  ДЗ на начало │ ПДЗ на начало │         Суммы оплаты за отчетный период       │  ДЗ на конец  │ ПДЗ на конец  │               │
│                                           │     всех      │    отчетного  │   отчетного   ├───────────────┬───────────────┬───────────────┬───────────────┤   отчетного   │   отчетного   │
│                                           │    счетов     │     периода   │    периода    │ Срок до@~@@дн.│от@~@@до@~@@дн.│от@~@@до@~@@дн.│ более@~@@дней │    периода    │    периода    │
│      Итого по всем                        ├───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┤
│ @~@@@@@@@@@@@@@@@@@@@@@@@@@@@             │&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│
└───────────────────────────── Б──────────── Б──┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┘ Щ
.end
.} С
 Й ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Ш
.endform С

#doc
Отчет о погашении задолженности по закупкам (развернутый)
#end
.linkform 'IerDebPas_3' prototype is 'IerDebPas'
.nameinlist 'Отчет о погашении задолженности по закупкам (развернутый)'
.group 'Погашение кредиторской задолженности'
.fields
  CommonFormHeader
  DateRepBeg
  DateRepEnd
  NameValut
  DateDOBeg
  DateDOEnd
.endfields
 Б ^

                    ОТЧЕТ О ПОГАШЕНИИ КРЕДИТОРСКОЙ ЗАДОЛЖЕННОСТИ

  За период с ^ по ^ в ^
  по  документам основаниям закупки с ^ по ^

 Б  С Положительные задолженности соответствуют нашему долгу, отрицательные - долгу контрагента. С
.{
.if GroupKatorg
.fields
  GroupName
.endfields
 Б Группа ^ Б
.end
.if Katorg
.fields
  KatOrgNum KatOrgName
  Days1 (Days1 + 1) Days21 (Days21 + 1) Days22 Days3
.endfields
 Б ^.По контрагенту: ^ Б
 Ш┌─────────┬──────────┬──────────┬───────────────┬───────────────┬───────────────┬───────────────────────────────────────────────────────────────┬───────────────┬───────────────┐
│ № Счета │   Дата   │  Дата    │     Сумма     │  КЗ на начало │ ПКЗ на начало │                    Суммы оплаты за отчетный период            │  КЗ на конец  │ ПКЗ на конец  │
│         │   Счета  │ оплаты по│     Счета     │   отчетного   │   отчетного   ├───────────────┬───────────────┬───────────────┬───────────────┤   отчетного   │   отчетного   │
│         │          │ договору │               │    периода    │    периода    │ Срок до@~@@дн.│от@~@@до@~@@дн.│от@~@@до@~@@дн.│ более@~@@дней │    периода    │    периода    │
├─────────┼──────────┼──────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┤ Ш
.else
.fields
  Days1 (Days1 + 1) Days21 (Days21 + 1) Days22 Days3
.endfields
 Ш┌─────────┬──────────┬──────────┬───────────────┬───────────────┬───────────────┬───────────────────────────────────────────────────────────────┬───────────────┬───────────────┐
│ № Счета │   Дата   │  Дата    │     Сумма     │  КЗ на начало │ ПКЗ на начало │                    Суммы оплаты за отчетный период            │  КЗ на конец  │ ПКЗ на конец  │
│         │   Счета  │ оплаты по│     Счета     │   отчетного   │   отчетного   ├───────────────┬───────────────┬───────────────┬───────────────┤   отчетного   │   отчетного   │
│         │          │ договору │               │    периода    │    периода    │ Срок до@~@@дн.│от@~@@до@~@@дн.│от@~@@до@~@@дн.│ более@~@@дней │    периода    │    периода    │
├─────────┼──────────┼──────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┤ Ш
.end
.{CHECKENTER BaseDoc
.fields
  DocNo
  DateScheta
  DateOplat
  Sum1
  Sum5
  Sum6
  Sum2
  Sum3
  Sum4
  Sum9
  Sum7
  Sum8
.endfields
 Ш│@~@@@@@@@│@~@@@@@@@@│@~@@@@@@@@│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│ Ш
.}
.if ItogKatorg
.fields
  Sum1Org
  Sum5Org
  Sum6Org
  Sum2Org
  Sum3Org
  Sum4Org
  Sum9Org
  Sum7Org
  Sum8Org
.endfields
 Ш├─────────┴──────────┴──────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┤
│ Итого по контрагенту          │&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│
└───────────────────────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┘ Ш
.else
 Ш└───────────────────────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┘ Ш
.end
.if ItogGroupKatorg
.fields
  Days1 (Days1 + 1) Days21 (Days21 + 1) Days22 Days3
  sNameGroup
  Sum1Grp
  Sum5Grp
  Sum6Grp
  Sum2Grp
  Sum3Grp
  Sum4Grp
  Sum9Grp
  Sum7Grp
  Sum8Grp
.endfields
 Щ┌───────────────────────────────┬───────────────┬───────────────┬───────────────┬───────────────────────────────────────────────────────────────┬───────────────┬───────────────┐
│                               │    Сумма      │  КЗ на начало │ ПКЗ на начало │         Суммы оплаты за отчетный период       │  КЗ на конец  │ ПКЗ на конец  │               │
│                               │     всех      │    отчетного  │   отчетного   ├───────────────┬───────────────┬───────────────┬───────────────┤   отчетного   │   отчетного   │
│      Итого по группе          │    счетов     │     периода   │    периода    │ Срок до@~@@дн.│от@~@@до@~@@дн.│от@~@@до@~@@дн.│ более@~@@дней │    периода    │    периода    │
│        контрагентов:          ├───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┤
│ @~@@@@@@@@@@@@@@@@@@@@@@@@@@@ │&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│
└───────────────────────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┘ Щ


.end
.if ItogoRep
.fields
  Days1 (Days1 + 1) Days21 (Days21 + 1) Days22 Days3
  Groupororg
  Sum1Rep
  Sum5Rep
  Sum6Rep
  Sum2Rep
  Sum3Rep
  Sum4Rep
  Sum9Rep
  Sum7Rep
  Sum8Rep
.endfields
 Щ┌───────────────────────────────┬───────────────┬───────────────┬───────────────┬───────────────────────────────────────────────────────────────┬───────────────┬───────────────┐
│                               │    Сумма      │  КЗ на начало │ ПКЗ на начало │         Суммы оплаты за отчетный период       │  КЗ на конец  │ ПКЗ на конец  │               │
│                               │     всех      │    отчетного  │   отчетного   ├───────────────┬───────────────┬───────────────┬───────────────┤   отчетного   │   отчетного   │
│                               │    счетов     │     периода   │    периода    │ Срок до@~@@дн.│от@~@@до@~@@дн.│от@~@@до@~@@дн.│ более@~@@дней │    периода    │    периода    │
│      Итого по всем            ├───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┤
│ @~@@@@@@@@@@@@@@@@@@@@@@@@@@@ │&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│
└───────────────────────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┘ Щ
.end
.} С
 Й ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Ш
.endform С

 С
#doc
Отчет о погашении задолженности по закупкам (свернутый)
#end
.linkform 'IerDebPas_4' prototype is 'IerDebPas'
.nameinlist 'Отчет о погашении задолженности по закупкам (свернутый)'
.group 'Погашение кредиторской задолженности'
.fields
  CommonFormHeader
  DateRepBeg
  DateRepEnd
  NameValut
  DateDOBeg
  DateDOEnd
  Days1 (Days1 + 1) Days21 (Days21 + 1) Days22 Days3
.endfields
 Б ^

                    ОТЧЕТ О ПОГАШЕНИИ КРЕДИТОРСКОЙ ЗАДОЛЖЕННОСТИ

  За период с ^ по ^ в ^
  по  документам основаниям закупки с ^ по ^

 Б  С Положительные задолженности соответствуют нашему долгу, отрицательные - долгу контрагента. С
 Ш┌───────────────────────────────────────────┬───────────────┬───────────────┬───────────────┬───────────────────────────────────────────────────────────────┬───────────────┬───────────────┐
│                                           │     Сумма     │  КЗ на начало │ ПКЗ на начало │         Суммы оплаты за отчетный период       │  КЗ на конец  │ ПКЗ на конец  │
│ Контрагент                                │     Счетов    │   отчетного   │   отчетного   ├───────────────┬───────────────┬───────────────┬───────────────┤   отчетного   │   отчетного   │
│                                           │               │    периода    │    периода    │ Срок до@~@@дн.│от@~@@до@~@@дн.│от@~@@до@~@@дн.│ более@~@@дней │    периода    │    периода    │
├───────────────────────────────────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┤ Ш
.{
.if GroupKatorg
!.fields
!  Days1 (Days1 + 1) Days21 (Days21 + 1) Days22 Days3
!.endfields
 Ш!┌───────────────────────────────────────────┬───────────────┬───────────────┬───────────────┬───────────────────────────────────────────────────────────────┬───────────────┬───────────────┐
!│                                           │     Сумма     │  ДЗ на начало │ ПДЗ на начало │         Суммы оплаты за отчетный период       │  ДЗ на конец  │ ПДЗ на конец  │               │
!│ Контрагент                                │     Счетов    │   отчетного   │   отчетного   ├───────────────┬───────────────┬───────────────┬───────────────┤   отчетного   │   отчетного   │
!│                                           │               │    периода    │    периода    │ Срок до@~@@дн.│от@~@@до@~@@дн.│от@~@@до@~@@дн.│ более@~@@дней │    периода    │    периода    │
!├───────────────────────────────────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┤ Ш
.end
.if Katorg
.end
.{CHECKENTER BaseDoc
.}
.if ItogKatorg
.fields
  sNameKarorg
  Sum1Org
  Sum5Org
  Sum6Org
  Sum2Org
  Sum3Org
  Sum4Org
  Sum9Org
  Sum7Org
  Sum8Org
.endfields
 Ш│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│ Ш
.else
 Ш└───────────────────────────────────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┘ Ш
.end
.if ItogGroupKatorg
.fields
  sNameGroup
  Sum1Grp
  Sum5Grp
  Sum6Grp
  Sum2Grp
  Sum3Grp
  Sum4Grp
  Sum9Grp
  Sum7Grp
  Sum8Grp
.endfields
 Ш├───────────────────────────────────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┤
│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│
└───────────────────────────────────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┘ Ш
.end
.if ItogoRep
.fields
  Days1 (Days1 + 1) Days21 (Days21 + 1) Days22 Days3
  Groupororg
  Sum1Rep
  Sum5Rep
  Sum6Rep
  Sum2Rep
  Sum3Rep
  Sum4Rep
  Sum9Rep
  Sum7Rep
  Sum8Rep
.endfields
 Щ┌───────────────────── Б──────────── Б──────────┬───────────────┬───────────────┬───────────────┬───────────────────────────────────────────────────────────────┬───────────────┬───────────────┐
│                                           │    Сумма      │  КЗ на начало │ ПКЗ на начало │         Суммы оплаты за отчетный период       │  КЗ на конец  │ ПКЗ на конец  │               │
│                                           │     всех      │    отчетного  │   отчетного   ├───────────────┬───────────────┬───────────────┬───────────────┤   отчетного   │   отчетного   │
│                                           │    счетов     │     периода   │    периода    │ Срок до@~@@дн.│от@~@@до@~@@дн.│от@~@@до@~@@дн.│ более@~@@дней │    периода    │    периода    │
│      Итого по всем                        ├───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┼───────────────┤
│ @~@@@@@@@@@@@@@@@@@@@@@@@@@@@             │&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│&'&&&&&&&&&&.&&│
└───────────────────────────── Б──────────── Б──┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┘ Щ
.end
.} С
 Й ──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── Ш
.endform С
