/*
 ╔══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) Корпорация ГАЛАКТИКА, 1996,99                    ║
 ║ Проект        : ГАЛАКТИКА                                                ║
 ║ Система       : Оперативный контур                                       ║
 ║ Версия        : 5.70                                                     ║
 ║ Назначение    : Печать сопроводительных документов                       ║
 ║ Ответственный : Скороход Димтрий Владимирович (SDV)                      ║
 ╚══════════════════════════════════════════════════════════════════════════╝
*/
.set name='gAutoDoc'
.hide
.Group 'Документы'
.Group 'Кредитки'
.Group 'Контролируемые'
.fields
  _High _Tree Tip_docum  _Code _Name _Nrec _NOMER
  Persons_FIO Transp_Marka Transp_Nomer MarkaPTS
	KatPodr_Kod KatPodr_Name
  ActionBeg ActionEnd DriTo DriFrom OrgFrom OrgTo
  NDoc_post _nDoc KatState_Kod KatState_Name Country_Kod Country_Name
	AutoDoc_Summa
	AutoDoc_Valut
  AutoDoc_Notes AutoDoc_State

  Begin_Dvi Begin_Dvi_Time End_Dvi End_Dvi_Time Tip_Dvi Who_receive

  Rashod_name Date_opl Vodila_Opl Putlst_Opl Valuta_opl Kol_opl Chena Stoim Chena_nde
  Stoim_nde Tip_Kred_OPL
.endfields
.{
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.{
^ ^ ^ ^ ^ ^
.}
.{
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.}
.endform

.linkform 'gAutoDoc_01' prototype is 'gAutoDoc'
.NameInList 'Линейный отчет полный'
.Group 'Кредитки'
.fields
 CommonFormHeader
.endfields
^
.fields
  Tip_docum _Code _Name _NOMER _nDoc
  Persons_FIO
	Transp_Marka Transp_Nomer
	KatPodr_Name
  ActionBeg ActionEnd
	AutoDoc_Summa:'right'
	AutoDoc_Valut
	DriTo DriFrom OrgFrom OrgTo
  KatState_Kod KatState_Name Country_Kod Country_Name
  AutoDoc_Notes
.endfields
                               @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
───────┬────────────────────┬───────────┬─────────┬───────────────┬───────────────────────┬───────────────┬─────────────────────┬────────────────┬──────┬─────────────────────┬─────────────────────┬──────────────────┬───────────────────┬─────────────────
       │                    │  Номер    │  Номер  │               │ Транспортное средство │               │    Дата действия    │                │      │      Водитель       │     Организация     │ Страна действия  │Страна приобретения│
  Код  │    Наименование    │ документа │ реестра │   Водитель    ├───────────┬───────────│ Подразделение │──────────┬──────────│     Сумма      │Валюта├──────────┬──────────┼──────────┬──────────┼─────┬────────────┼─────┬─────────────│  Примечания
       │                    │           │  сдачи  │               │   Марка   │   Номер   │               │Начальная │Конечная  │                │      │  Принял  │   Сдал   │  Выдала  │ Приняла  │ Код │Наименование│ Код │Наименование │
───────┴────────────────────┴───────────┴─────────┴───────────────┴───────────┴───────────┴───────────────┴──────────┴──────────┴────────────────┴──────┴──────────┴──────────┴──────────┴──────────┴─────┴────────────┴─────┴─────────────┴─────────────────
.{
@@@@@@@ @@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@ @@@@@@@@@@@@ @@@@@ @@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@
.{
.}
.{
.}
.}
.endform

.linkform 'gAutoDoc_20' prototype is 'gAutoDoc'
.NameInList 'Линейный отчет полный'
.Group 'Контролируемые'
.fields
 CommonFormHeader
.endfields
^
.fields
  Tip_docum _Code _Name _NOMER _nDoc
  Persons_FIO Transp_Marka Transp_Nomer
  ActionBeg ActionEnd
	AutoDoc_Summa:'right'
	AutoDoc_Valut
  KatState_Kod KatState_Name Country_Kod Country_Name
  AutoDoc_Notes
.endfields
                               @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
────────┬─────────────────────┬───────────┬─────────┬──────────────────┬───────────────────────┬─────────────────────┬────────────────┬──────┬──────────────────────┬──────────────────────┬───────────────────
        │                     │  Номер    │  Номер  │                  │ Транспортное средство │    Дата действия    │                │      │   Страна действия    │   Страна получения   │
   Код  │     Наименование    │ документа │ реестра │    Водитель      ├───────────┬───────────┼──────────┬──────────│     Сумма      │Валюта├───────┬──────────────┼───────┬──────────────│  Примечания
        │                     │           │  сдачи  │                  │   Марка   │   Номер   │Начальная │Конечная  │                │      │  Код  │ Наименование │  Код  │ Наименование │
────────┴─────────────────────┴───────────┴─────────┴──────────────────┴───────────┴───────────┴──────────┴──────────┴────────────────┴──────┴───────┴──────────────┴───────┴──────────────┴───────────────────
.{
@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@ @@@@@@@@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@ @@@@@@@ @@@@@@@@@@@@@@ @@@@@@@ @@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@
.{
.}
.{
.}
.}
.endform

.linkform 'gAutoDoc_10' prototype is 'gAutoDoc'
.NameInList 'Линейный отчет полный'
.Group 'Документы'
.fields
 CommonFormHeader
.endfields
^
.fields
  Tip_docum _Code _Name _NOMER _nDoc
  Persons_FIO Transp_Marka Transp_Nomer
  ActionBeg ActionEnd
	DriTo DriFrom OrgFrom OrgTo
  KatState_Kod KatState_Name Country_Kod Country_Name
  AutoDoc_Notes
.endfields
                               @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
────────┬─────────────────────┬───────────┬─────────┬──────────────────┬───────────────────────┬─────────────────────┬─────────────────────┬─────────────────────┬──────────────────────┬──────────────────────┬───────────────────
        │                     │  Номер    │  Номер  │                  │ Транспортное средство │    Дата действия    │      Водитель       │     Организация     │   Страна действия    │ Страна приобретения  │
   Код  │     Наименование    │ документа │ реестра │    Водитель      ├───────────┬───────────┼──────────┬──────────┼──────────┬──────────┼──────────┬──────────┼───────┬──────────────┼───────┬──────────────│  Примечания
        │                     │           │  сдачи  │                  │   Марка   │   Номер   │Начальная │Конечная  │  Принял  │   Сдал   │  Выдала  │ Приняла  │  Код  │ Наименование │  Код  │ Наименование │
────────┴─────────────────────┴───────────┴─────────┴──────────────────┴───────────┴───────────┴──────────┴──────────┴──────────┴──────────┴──────────┴──────────┴───────┴──────────────┴───────┴──────────────┴───────────────────
.{
@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@ @@@@@@@@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@ @@@@@@@ @@@@@@@@@@@@@@ @@@@@@@ @@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@
.{
.}
.{
.}
.}
.endform

.linkform 'gAutoDoc_02' prototype is 'gAutoDoc'
.NameInList 'Линейный отчет краткий'
.Group 'Документы'
.Group 'Кредитки'
.Group 'Контролируемые'
.fields
  CommonFormHeader
.endfields
^
.fields
  Tip_docum _Code _Name _NOMER _nDoc
  Persons_FIO
	Transp_Nomer
	KatPodr_Name
  KatState_Name
.endfields
             @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
─────────┬────────────────────────┬────────────┬────────┬─────────────────────┬───────────┬─────────────────────┬─────────────────
   Код   │      Наименование      │   Номер    │ Реестр │       Водитель      │   Номер   │    Подразделение    │     Страна
─────────┴────────────────────────┴────────────┴────────┴─────────────────────┴───────────┴─────────────────────┴─────────────────
.{
@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@ @@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@
.{
.}
.{
.}
.}
.endform

.linkform 'gAutoDoc_03' prototype is 'gAutoDoc'
.NameInList 'Линейный отчет краткий с датами'
.Group 'Документы'
.Group 'Кредитки'
.Group 'Контролируемые'
.fields
  CommonFormHeader
.endfields
^
.fields
  Tip_docum _Code _Name _NOMER _nDoc
  Persons_FIO
	Transp_Nomer
	KatPodr_Name
  KatState_Name
  ActionBeg ActionEnd DriTo DriFrom OrgFrom OrgTo
.endfields
                                          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
─────────┬────────────────────────┬────────────┬────────┬─────────────────────┬───────────┬─────────────────────┬─────────────────┬───────────┬───────────┬───────────┬───────────┬───────────┬───────────
   Код   │      Наименование      │   Номер    │ Реестр │       Водитель      │   Номер   │    Подразделение    │     Страна      │ Начальная │ Конечная  │Вод. Принял│ Вод. Сдал │Орг. Выдала│Орг.Приняла
─────────┴────────────────────────┴────────────┴────────┴─────────────────────┴───────────┴─────────────────────┴─────────────────┴───────────┴───────────┴───────────┴───────────┴───────────┴───────────
.{
@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@ @@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@
.{
.}
.{
.}
.}
.endform

.linkform 'gAutoDoc_07' prototype is 'gAutoDoc'
.NameInList 'Отчет с движением'
.Group 'Документы'
.Group 'Кредитки'
.Group 'Контролируемые'
.fields
  CommonFormHeader
.endfields
^
.fields
  Tip_docum _Name _NOMER ActionBeg ActionEnd
  Begin_Dvi End_Dvi Tip_Dvi Who_receive
.endfields
        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
────────────────────────┬────────────┬───────────┬───────────┬─────────────┬────────────────────
      Наименование      │   Номер    │  Дата     │  Дата     │    Тип      │   Наименование
                        │            │закрепления│открепления│ закрепления │
────────────────────────┴────────────┴───────────┴───────────┴─────────────┴────────────────────
.{
@@@@@@@@@@@@@@@@@@@@@@@  @@@@@@@@@@@@  срок действия с  @@@@@@@@@@@ по @@@@@@@@@@@
.{
                                     @@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@
.}
.{
.}
.}
.endform

.linkform 'gAutoDoc_09' prototype is 'gAutoDoc'
.NameInList 'Оплата по документам'
.Group 'Кредитки'
.fields
  CommonFormHeader
.endfields
^
.fields
  Tip_docum _Name _NOMER  ActionBeg ActionEnd
  Rashod_name Date_opl Vodila_Opl Putlst_Opl Valuta_opl Kol_opl Chena Stoim Chena_nde
  Stoim_nde Tip_Kred_OPL
.endfields

                                     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
────────────────────────┬────────────┬─────────────────────────┬────────────┬──────────────────┬────────────┬────────┬───────────┬───────────┬───────────┬────────────┬───────────┬────────────────────
      Наименование      │   Номер    │       Наименование      │    Дата    │     Водитель     │   Номер    │ Валюта │  Кол-во   │    Цена   │  Стоимость│    Цена    │  Стоимость│ Была предусмотрена
                        │  документа │        расхода          │   оплаты   │                  │  путевого  │ оплаты │для оплаты │  в валюте │ в валюте  │   в НДЕ    │   в НДЕ   │ оплата по кредитке
────────────────────────┴────────────┴─────────────────────────┴────────────┴──────────────────┴────────────┴────────┴───────────┴───────────┴───────────┴────────────┴───────────┴────────────────────
.{
@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@ Срок действия с  @@@@@@@@@@@ по @@@@@@@@@@@
.{
.}
.{
                                      @@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@   @@@@@@@@@@@@@@@@@ @@@@@@@@@@@@ @@@@@@@@ &&#&&&&&.&& &&#&&&&&.&& &&#&&&&&.&&  &&#&&&&&.&& &&#&&&&&.&& @@@@@@@@@@@@@@@@@
.}
.}
.endform
