/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,97 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Автотранспорт                                             ║
 ║ Версия        : 7.10                                                      ║
 ║ Назначение    : Листы загрузки                                            ║
 ║ Ответственный : Лисица Наталья Михайловна                                 ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
.set name='lst_komp'
.hide
.fields
Nomer_LST Marka_TC Nomer_Tc
KolEz Dat_Beg Dat_obr
Kg_gruz Marka_Gruz Minus_Gruz
Lst_volume Marka_volume Minus_volume

Nomzak KatOrg_Name KatPodrFrom_Name KatPodrTo_Name
MassaGr VolumeGR NomerDoc Vid_doc
.endfields
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.{
^ ^ ^ ^ ^ ^ ^ ^
.}
.endform
.linkform 'Lst_Komp_01' prototype is 'Lst_Komp'
.NameInList 'Реестр заказов в листе загрузки'
.group 'Общие показатели'
.fields
Nomer_LST Marka_TC Nomer_Tc
Kg_gruz Marka_Gruz Minus_Gruz
Lst_volume Marka_volume Minus_volume

Nomzak KatOrg_Name KatPodrFrom_Name KatPodrTo_Name
MassaGr VolumeGR NomerDoc Vid_Doc
.endfields
                  Лист загрузки номер ^

для марки ТС @@@@@@@@@@@@@@@@@ номер ТС  @@@@@@@@@@@@@@@@@@@@
Суммарный  вес груза  &&&&&&&&.&&   Грузоподъемность ТС &&&&&&&&.&&  (&&&&&&&.&&)
Суммарный объем груза &&&&&&&&.&&   Вместимость ТС      &&&&&&&&.&&  (&&&&&&&.&&)

┌────────────┬────────────────────┬──────────────────┬──────────────────┬──────────┬──────────┬────────────┬──────────────────────┐
│ Номер      │   Организация      │   Подразделение  │  Подразделение   │  Масса   │  Объем   │   Номер    │         Тип          │
│ заказа     │                    │   отправитель    │  получатель      │  груза   │  груза   │  документа │      документа       │
├────────────┼────────────────────┼──────────────────┼──────────────────┼──────────┼──────────┼────────────┼──────────────────────┤
.{
│@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@│&&&&&&.&& │&&&&&&.&& │@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@│
.}
└────────────┴────────────────────┴──────────────────┴──────────────────┴──────────┴──────────┴────────────┴──────────────────────┘
.endform