/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                   (c) 1994,2007 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Автотранспорт                                             ║
 ║ Версия        : 7.12                                                      ║
 ║ Назначение    : Поправочные коэффициенты                                  ║
 ║ Ответственный : Лукашова Виктория                                         ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
.set name='PrintCorFact'
.hide
.if isDatePrint
.fields
FiltrBegDate FiltrEndDate
.endfields
Диапозон дат с ^ по  ^
.end
.if isEnterprise
.fields
EnterpriseKoefName EnterpriseValue EnterpriseBegin EnterpriseEnd
.endfields

.{
^ ^ ^ ^
.}
.end

.if isPodr
.fields
PodrKoefName PodrValue PodrBegin PodrEnd PodrName
.endfields

.{
^ ^ ^ ^ ^
.}
.end

.if isTransp
.fields
TranspKoefName TranspValue TranspBegin TranspEnd TranspName TranspName2
.endfields

.{
^ ^ ^ ^ ^ ^
.}
.end

.if isMark
.fields
MarkKoefName MarkValue MarkBegin MarkEnd MarkName
.endfields

.{
^ ^ ^ ^ ^
.}
.end

.if isMarAvt
.fields
MarAvtKoefName MarAvtValue MarAvtBegin MarAvtEnd MarAvtName
.endfields

.{
^ ^ ^ ^ ^
.}
.end

.endform


.linkform 'PrintCorFact_01' prototype is 'PrintCorFact'
.NameInList 'Справочник коэффициентов'

.if isDatePrint
.fields
FiltrBegDate FiltrEndDate
.endfields
  Диапозон дат с ^ по  ^
.end

.if isEnterprise
.fields
EnterpriseKoefName EnterpriseValue EnterpriseBegin EnterpriseEnd
.endfields

  По предприятию
┌─────────────────────────┬───────────┬────────────┬──────────┐
│      Наименование       │ Значение  │    Дата    │   Дата   │
│                         │           │   начала   │завершения│
├─────────────────────────┼───────────┼────────────┼──────────┤
.{
│@@@@@@@@@@@@@@@@@@@@@@@@@│&&#&&&&&.&&│@@@@@@@@@@@@│@@@@@@@@@@│
.}
└─────────────────────────┴───────────┴────────────┴──────────┘
.end

.if isPodr
.fields
PodrKoefName PodrValue PodrBegin PodrEnd PodrName
.endfields

  По подразделению
┌─────────────────────────┬───────────┬────────────┬───────────┬─────────────┐
│      Наименование       │ Значение  │    Дата    │   Дата    │Подразделение│
│                         │           │   начала   │завершения │             │
├─────────────────────────┼───────────┼────────────┼───────────┼─────────────┤
.{
│@@@@@@@@@@@@@@@@@@@@@@@@ │&&#&&&&&.&&│@@@@@@@@@@@@│@@@@@@@@@@@│@@@@@@@@@@@@@│
.}
└─────────────────────────┴───────────┴────────────┴───────────┴─────────────┘
.end

.if isTransp
.fields
TranspKoefName TranspValue TranspBegin TranspEnd TranspName TranspName2
.endfields

  Для ТС
┌───────────────────┬───────────┬──────────┬──────────┬─────────────┬──────────┐
│    Наименование   │ Значение  │   Дата   │   Дата   │Регистрацион-│ Гаражный │
│                   │           │  начала  │завершения│  ный номер  │  номер   │
├───────────────────┼───────────┼──────────┼──────────┼─────────────┴──────────┤
.{
│@@@@@@@@@@@@@@@@@@@│&&#&&&&&.&&│@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@@@@│@@@@@@@@@@│
.}
└───────────────────┴───────────┴──────────┴──────────┴─────────────┴──────────┘
.end

.if isMark
.fields
MarkKoefName MarkValue MarkBegin MarkEnd MarkName
.endfields

  Для марки ТС
┌─────────────────────────┬───────────┬────────────┬───────────┬────────────┐
│      Наименование       │ Значение  │    Дата    │   Дата    │  Марка ТС  │
│                         │           │   начала   │завершения │            │
├─────────────────────────┼───────────┼────────────┼───────────┼────────────┤
.{
│@@@@@@@@@@@@@@@@@@@@@@@@@│&&#&&&&&.&&│@@@@@@@@@@@@│@@@@@@@@@@@│@@@@@@@@@@@@│
.}
└─────────────────────────┴───────────┴────────────┴───────────┴────────────┘
.end

.if isMarAvt
.fields
MarAvtKoefName MarAvtValue MarAvtBegin MarAvtEnd MarAvtName
.endfields

  Для маршрута
┌─────────────────────────┬───────────┬────────────┬───────────┬────────────┐
│      Наименование       │ Значение  │    Дата    │   Дата    │  Название  │
│                         │           │   начала   │завершения │  маршрута  │
├─────────────────────────┼───────────┼────────────┼───────────┼────────────┤
.{
│@@@@@@@@@@@@@@@@@@@@@@@@@│&&#&&&&&.&&│@@@@@@@@@@@@│@@@@@@@@@@@│@@@@@@@@@@@@│
.}
└─────────────────────────┴───────────┴────────────┴───────────┴────────────┘
.end

.endform
