//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
// Галактика 8.1 - Бухгалтерский контур
// Приложения в операциях модуля ОС (НМА)
//------------------------------------------------------------------------------
#doc
  Форма для печати отчетов по приложениям в операциях модуля ОС (НМА).<br>
#end
.form 'OSOperPril'
.group 'Внутреннее перемещение'
.group 'Внутреннее перемещение. ВСМН.'
.hide
.fields
  Операция
  Поставщик                                            // 01
    Поставщик_ОКПО
    Поставщик_УНН
    Поставщик_Адрес
    Поставщик_ТЕЛ
    Поставщик_ОКОНХ
    Поставщик_БАНК_Имя
    Поставщик_БАНК_Счет
    Поставщик_БАНК_Мфо
  Получатель                                           // 02
    Получатель_ОКПО
    Получатель_УНН
    Получатель_Адрес
    Получатель_Тел
    Получатель_ОКОНХ
    Получатель_БАНК_Имя
    Получатель_БАНК_Счет
    Получатель_БАНК_Мфо
  Грузополучатель
    Грузополучатель_ОКПО
    Грузополучатель_УНН
    Грузополучатель_Адрес
    Грузополучатель_Тел
    Грузополучатель_ОКОНХ
    Грузополучатель_БАНК_Имя
    Грузополучатель_БАНК_Счет
    Грузополучатель_БАНК_Мфо
  ТТН_АвтоОрг_Имя
    ТТН_АвтоОрг_ОКПО
    ТТН_АвтоОрг_УНН
    ТТН_АвтоОрг_Адрес
    ТТН_АвтоОрг_ТЕЛ
    ТТН_АвтоОрг_ОКОНХ
    ТТН_АвтоОрг_БАНК_Имя
    ТТН_АвтоОрг_БАНК_Счет
    ТТН_АвтоОрг_БАНК_Мфо

  НомерАкта                                            // 03
  ДатаАкта                                   : date    // 04

  НомерНакладной                                       // 05
  ДатаНакладной                              : date    // 06
  Номер_с_дескриптором

  Руководитель_nRec                          : comp
  Руководитель
  Руководитель_Должность

  ГлавныйБухгалтер_nRec                      : comp
  ГлавныйБухгалтер
  ГлавныйБухгалтер_Должность

  НомерДоверенности
  ДатаДоверенности                           : date
  ФИОДовер
  Примечание
  ОснованиеОтпуска
  КомуВыдано

  Автомобиль
  НомерАвтомобиля
  НомерПутевогоЛиста
  ВладелецТранспорта
  Водитель

  ПунктПогрузки
  ПунктРазгрузки
  Прицеп1
  Прицеп1Марка
  Прицеп1ГосНомер
  Прицеп1ГаражныйНомер
  Прицеп2


  Склад                                                // 09
  Назначение                                           // 10
  Через                                                // 11

  НаимВалюты                                           // 12

  Метод_учета

  NastrOsNRec                                : comp
  MoveOsNRec                                 : comp
  SpMoveNRec                                 : comp

  Структурное_подразделение_Поставщика_nRec  : comp
  Структурное_подразделение_Поставщика

  Структурное_подразделение_Получателя_nRec  : comp
  Структурное_подразделение_Получателя

  МОЛ_Поставщика_nRec                        : comp
  МОЛ_Поставщика
  Табельный_номер_Поставщика
  МОЛ_Поставщика_Должность

  МОЛ_Получателя_nRec                        : comp
  МОЛ_Получателя
  Табельный_номер_Получателя
  МОЛ_Получателя_Должность

  kolFormat                                  : string          // формат вывода количества

  КоличествоПозиций                          : word

// .{ start cycle
  KatOsNrec                                  : comp
  KatOscMc                                   : comp
  ЭлементарныйОбъект                         : boolean
  СложныйОбъект                              : boolean
  ПодчиненныйОбъект                          : boolean
  НоменклатурныйНомерСложногоОбъекта                   // 13
  НоменклатурныйНомер                                  // 14
  КодОборудования                                      // 15
  НаименованиеОС                                       // 16
  ЕдИзм                                                // 17
  Количество                                 : double  // 18
  Износ                                      : double  // 20
  СуммаИзноса                                : double  // 21
  СуммаИзносаЗаМесяц                         : double
  Цена                                       : double  // 22
  Сумма                                      : double  // 23
  Стоимость_за_единицу                       : double
  NewStoim                                   : double
  Год_вып                                    : date
  Дата_пост                                  : date

  ВидТары
  КоличествоУпаковок
  КоличествоВУпаковке
  МассаБрутто                                : double

// .{ CheckEnter OsOperPrilMemo
  ХарактеристикаОбъекта
// .}
// .} end cycle

  КоличествоНаименований                     : double  // 24
  СуммаИзносаИтого                           : double  // 25
  СуммаИтого                                 : double  // 26
  NewStoimItogo                              : double
  СуммаИтогоПрописью                                   // 27
  КоличествоИтого                            : double
  КоличествоУпаковокИтого
  МассаБруттоИтого                           : double
! В формах не используется
  Характеристика
.endfields
.var
  СложныйНоменклатурныйНомер                 : string;
.endvar

.{ OsOperObjLoop // цикл по объектам
  Операция                                   - ^
  Поставщик                                  - ^
    Поставщик_ОКПО                           - ^
    Поставщик_УНН                            - ^
    Поставщик_Адрес                          - ^
    Поставщик_Тел                            - ^
    Поставщик_ОКОНХ                          - ^
    Поставщик_БАНК_Имя                       - ^
    Поставщик_БАНК_Счет                      - ^
    Поставщик_БАНК_Мфо                       - ^
  Получатель                                 - ^
    Получатель_ОКПО                          - ^
    Получатель_УНН                           - ^
    Получатель_Адрес                         - ^
    Получатель_Тел                           - ^
    Получатель_ОКОНХ                         - ^
    Получатель_БАНК_Имя                      - ^
    Получатель_БАНК_Счет                     - ^
    Получатель_БАНК_Мфо                      - ^

  Грузополучатель                            - ^
    Грузополучатель_ОКПО                     - ^
    Грузополучатель_УНН                      - ^
    Грузополучатель_Адрес                    - ^
    Грузополучатель_Тел                      - ^
    Грузополучатель_ОКОНХ                    - ^
    Грузополучатель_БАНК_Имя                 - ^
    Грузополучатель_БАНК_Счет                - ^
    Грузополучатель_БАНК_Мфо                 - ^

  ТТН_АвтоОрг_Имя                            - ^
    ТТН_АвтоОрг_ОКПО                         - ^
    ТТН_АвтоОрг_УНН                          - ^
    ТТН_АвтоОрг_Адрес                        - ^
    ТТН_АвтоОрг_ТЕЛ                          - ^
    ТТН_АвтоОрг_ОКОНХ                        - ^
    ТТН_АвтоОрг_БАНК_Имя                     - ^
    ТТН_АвтоОрг_БАНК_Счет                    - ^
    ТТН_АвтоОрг_БАНК_Мфо                     - ^

  НомерАкта                                  - ^
  ДатаАкта                                   - ^

  НомерНакладной                             - ^
  ДатаНакладной                              - ^
  Номер_с_дескриптором                       - ^

  Руководитель_nRec                          - ^
  Руководитель                               - ^
  Руководитель_Должность                     - ^

  ГлавныйБухгалтер_nRec                      - ^
  ГлавныйБухгалтер                           - ^
  ГлавныйБухгалтер_Должность                 - ^

  НомерДоверенности                          - ^
  ДатаДоверенности                           - ^
  ФИОДовер                                   - ^
  Примечание                                 - ^
  ОснованиеОтпуска                           - ^
  КомуВыдано                                 - ^

  Автомобиль                                 - ^
  НомерАвтомобиля                            - ^
  НомерПутевогоЛиста                         - ^
  ВладелецТранспорта                         - ^
  Водитель                                   - ^

  ПунктПогрузки                              - ^
  ПунктРазгрузки                             - ^
  Прицеп1                                    - ^
  Прицеп1Марка                               - ^
  Прицеп1ГосНомер                            - ^
  Прицеп1ГаражныйНомер                       - ^
  Прицеп2                                    - ^

  Склад                                      - ^
  Назначение                                 - ^
  Через                                      - ^

  НаимВалюты                                 - ^

  Метод_учета                                - ^

  NastrOsNRec                                - ^
  MoveOsNRec                                 - ^
  SpMoveNRec                                 - ^

  Структурное_подразделение_Поставщика_nRec  - ^
  Структурное_подразделение_Поставщика       - ^

  Структурное_подразделение_Получателя_nRec  - ^
  Структурное_подразделение_Получателя       - ^

  МОЛ_Поставщика_nRec                        - ^
  МОЛ_Поставщика                             - ^
  Табельный_номер_Поставщика                 - ^
  МОЛ_Поставщика_Должность                   - ^

  МОЛ_Получателя_nRec                        - ^
  МОЛ_Получателя                             - ^
  Табельный_номер_Получателя                 - ^
  МОЛ_Получателя_Должность                   - ^

  kolFormat                                  - ^

  КоличествоПозиций                          - ^

.{ OSOperPrilGoodsLoop
  KatOsNrec                                  - ^
  KatOscMc                                   - ^
  ЭлементарныйОбъект                         - ^
  СложныйОбъект                              - ^
  ПодчиненныйОбъект                          - ^
  НоменклатурныйНомерСложногоОбъекта         - ^
  НоменклатурныйНомер                        - ^
  КодОборудования                            - ^
  НаименованиеОС                             - ^
  ЕдИзм                                      - ^
  Количество                                 - ^
  Износ                                      - ^
  СуммаИзноса                                - ^
  СуммаИзносаЗаМесяц                         - ^
  Цена                                       - ^
  Сумма                                      - ^
  Стоимость_за_единицу                       - ^
  NewStoim                                   - ^
  Год_вып                                    - ^
  Дата_пост                                  - ^
  ВидТары                                    - ^
  КоличествоУпаковок                         - ^
  КоличествоВУпаковке                        - ^
  МассаБрутто                                - ^
.begin
  СложныйНоменклатурныйНомер := if ( НоменклатурныйНомерСложногоОбъекта <> '',
                                     НоменклатурныйНомерСложногоОбъекта + '/', '')
                                + НоменклатурныйНомер;
end.
.{ CheckEnter OsOperPrilMemo
  ХарактеристикаОбъекта                      - ^
.}
.}

  КоличествоНаименований                    - ^
  СуммаИзносаИтого                          - ^
  СуммаИтого                                - ^
  NewStoimItogo                             - ^
  СуммаИтогоПрописью                        - ^
  КоличествоИтого                           - ^
  КоличествоУпаковокИтого                   - ^
  МассаБруттоИтого                          - ^
! В формах не используется
  Характеристика                            - ^
.if PageSymbol
.end
.}
.endform



.linkform 'OSOperPril_01' prototype is 'OSOperPril'
.NameInList 'Приложение к акту'
.group 'Приложения к акту'
.{ OsOperObjLoop
.fields
    Поставщик
                                                         НомерАкта     ДатаАкта
If (Операция = 51, 'Общая корректировка', 'Сумма износа')
.endfields

 Щ  ^
                                              приложение к Акту № ^ от @@@@@@@@@@

  ───────────────────────┬────────────────┬─────────┬──────────────────────────────────────────────────┬─────┬────────┬──────────────────┬──────────────────
        Инвентарный      │ Дополнительный │   Код   │            Наименование оборудования             │ЕдИзм│ Кол-во │  @@@@@@@@@@@@@   │    Стоимость
           номер         │  инвентарный   │ оборуд. │                                                  │     │        │                  │
                         │     номер      │         │                                                  │     │        │                  │
  ───────────────────────┼────────────────┼─────────┼──────────────────────────────────────────────────┼─────┼────────┼──────────────────┼────────────────── Щ
.{ OSOperPrilGoodsLoop
.{?INTERNAL; (СложныйОбъект)
.fields
  НоменклатурныйНомерСложногоОбъекта
  НоменклатурныйНомер
  КодОборудования
  НаименованиеОС
  ЕдИзм
  DoubleToStr(Количество,kolFormat)
  СуммаИзноса
  NewStoim
.endfields
 Щ  @@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@│@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@│&&&&&&&&│&&&&&&&&&&&&&&&.&&│&&&&&&&&&&&&&&&.&& Щ
.}
.{?INTERNAL; (ЭлементарныйОбъект)
.fields
  НоменклатурныйНомерСложногоОбъекта
  НоменклатурныйНомер
  КодОборудования
  if (ПодчиненныйОбъект, '  ', '') + НаименованиеОС: 'T:-'
  ЕдИзм
  DoubleToStr(Количество,kolFormat)
  СуммаИзноса
  NewStoim
.endfields
 Ш  @@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@│@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@│&&&&&&&&│&&&&&&&&&&&&&&&.&&│&&&&&&&&&&&&&&&.&& Ш
.}
.{ CheckEnter OsOperPrilMemo
.}
.}
 Ш  ───────────────────────┴────────────────┴─────────┴──────────────────────────────────────────────────┴─────┴────────┴──────────────────┴──────────────────
.fields
  СуммаИзносаИтого
  NewStoimItogo
  'true':'s'
.endfields
 Б                                                                                                          Итого:       &&&&&&&&&&&&&&&.&& &&&&&&&&&&&&&&&.&& Б


                                                    Сдал _________________________                        Принял _______________________
.if PageSymbol
 ^
.end
                                                   Ш
.}
.endform



! ============================================================================
! Накладная на отпуск материалов на сторону. Форма М-15
! ============================================================================
.linkform 'OSOperPril_M15' prototype is 'OSOperPril'
.NameInList 'Накладная на отпуск материалов на сторону. Форма М-15'
.group 'Накладные'
.DEFP PA4
.DEFO LANDSCAPE
.PAPER PA4
.ORIENT PORTRAIT
.LL 80
.ORIENT LANDSCAPE
.LL 51
#include mfo.frn
.{ OsOperObjLoop
.fields
НомерНакладной
Поставщик
  + unn_         + Поставщик_УНН
  + ' Адрес:'    + Поставщик_Адрес
  + ' Банк:'     + Поставщик_БАНК_Имя
  + ' р/с '      + Поставщик_БАНК_Счет
  + mfo_         + Поставщик_БАНК_Мфо
Поставщик_ОКПО
ДатаНакладной
Склад
ОснованиеОтпуска
Грузополучатель
  + ' ОКПО '     + Грузополучатель_ОКПО
  + unn_         + Грузополучатель_УНН
  + ' Адрес:'    + Грузополучатель_Адрес
  + ' Банк:'     + Грузополучатель_БАНК_Имя
  + ' р/с '      + Грузополучатель_БАНК_Счет
  + mfo_         + Грузополучатель_БАНК_Мфо
ФИОДовер
НаименованиеОС

СложныйНоменклатурныйНомер     // ???

ЕдИзм
DoubleToStr(Количество,kolFormat)
DoubleToStr(Количество,kolFormat)
Цена
Сумма
double(0)
Сумма
КоличествоНаименований
СуммаИтогоПрописью
''
.endfields
 Ш
                                                                                                                                      Типовая межотраслевая форма N М-15
                                                                                                                                      Утверждена постановлением Госкомстата России
                                                                                                                                      от 30.10.97 № 71а
                                                      НАКЛАДНАЯ   № @@@@@@@@
                                               на отпуск материалов на сторону                                                                                          ┌─────────┐
                                                                                                                                                                        │ Коды    │
                                                                                                                                                                        ├─────────┤
                                                                                                                                                          Форма по ОКУД │ 0315007 │
                                                                                                                                                                        ├─────────┤
Организация : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@        по ОКПО │@@@@@@@@@│
                                                                                                                                                                        └─────────┘
                                                       ╔══════════╦═══════╦═══════════════════════════╦═════════════════════════════════╦═════════════════════════════════════════╗
                                                       ║   Дата   ║Код ви-║      Отправитель          ║        Получатель               ║   Ответственный за поставку             ║
                                                       ║  состав- ║да опе-╟──────────────┬────────────╫────────────────────┬────────────╫─────────────┬──────────────┬────────────╢
                                                       ║   ления  ║рации  ║ Структурное  │    вид     ║     Структурное    │    Вид     ║Структурное  │     Вид      │    код     ║
                                                       ║          ║       ║подразделение │деятельности║    подразделение   │деятельности║подразделение│ деятельности │исполнителя ║
                                                       ║          ║       ║              │            ║                    │            ║             │              │            ║
                                                       ╠══════════╬═══════╬══════════════╪════════════╬════════════════════╪════════════╬═════════════╪══════════════╪════════════╣
                                                       ║@@@@@@@@@@║       ║@@@@@@@@@@@@@@│            ║                    │            ║             │              │            ║
                                                       ╚══════════╩═══════╩══════════════╧════════════╩════════════════════╧════════════╩═════════════╧══════════════╧════════════╝
Основание № ^

Кому : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  Через кого : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{ OSOperPrilGoodsLoop;(ЭлементарныйОбъект)
.[H
╔══════════════════════╦═════════════════════════════╦═════════════════╦═══════════════════════╦═════════════╦═══════════════╦═════════════╦═══════════════╦════════════╦═════════╗
║Корреспондирующий счет║    Материальные ценности    ║Единица измерения║      Количество       ║   Цена,     ║    Сумма      ║   Сумма     ║    Всего      ║    Номер   ║Порядко- ║
╟──────────┬───────────╫──────────────────┬──────────╫───┬─────────────╫───────────┬───────────╢  руб.коп.   ║  без учета    ║    НДС,     ║   с учетом    ╟──────┬─────╢вый номер║
║   счет,  │ код ана-  ║  наименование    │  номенк- ║Код│наименование ║ надлежит  │ отпущено  ║             ║     НДС       ║  руб.коп.   ║     НДС,      ║инвен-│пас- ║записи по║
║  субсчет │литического║сорт,размер,марка │ латурный ║   │             ║ отпустить │           ║             ║   руб.коп.    ║             ║   руб.коп.    ║ тар- │порта║складской║
║          │   учета   ║                  │  номер   ║   │             ║           │           ║             ║               ║             ║               ║ ный  │     ║картотеке║
╟──────────┼───────────╫──────────────────┼──────────╫───┼─────────────╫───────────┼───────────╫─────────────╫───────────────╫─────────────╫───────────────╫──────┼─────╫─────────╢
║    1     │     2     ║        3         │    4     ║ 5 │      6      ║    7      │    8      ║     9       ║      10       ║     11      ║     12        ║  13  │ 14  ║    15   ║
╠══════════╪═══════════╬══════════════════╪══════════╬═══╪═════════════╬═══════════╪═══════════╬═════════════╬═══════════════╬═════════════╬═══════════════╬══════╪═════╬═════════╣
.]H
║          │           ║@@@@@@@@@@@@@@@@@@│@@@@@@@@@@║   │@@@@@@@@@@@@@║&&&&&&&.&&&│&&&&&&&.&&&║&&&&&&&&&&.&&║&&&&&&&&&&&&.&&║&&&&&&&&&&.&&║&&&&&&&&&&&&.&&║      │     ║         ║
.{ CheckEnter OsOperPrilMemo
.}
.[F
╚══════════╧═══════════╩══════════════════╧══════════╩═══╧═════════════╩═══════════╧═══════════╩═════════════╩═══════════════╩═════════════╩═══════════════╩══════╧═════╩═════════╝
.]F
.}

  Всего отпущено ^ наименований
  На сумму ^   в том числе сумма НДС ^

  Отпуск разрешил _____________  __________  __________________________                              Главный бухгалтер      __________  _______________________
                    должность      подпись      расшифровка подписи                                                           подпись     расшифровка подписи

  Отпустил        _____________  __________  __________________________                              Получил _____________  __________  _______________________
                    должность      подпись      расшифровка подписи                                            должность      подпись     расшифровка подписи Ш
.if PageSymbol
.end
.}
.endform


! ============================================================================
! Товарная накладная форма ТОРГ-12
! ============================================================================
.LinkForm 'OSOperPril_12' prototype is 'OSOperPril'
.NameInList 'Товарная накладная(форма №ТОРГ-12)'
.group 'Накладные'
.DEFO LANDSCAPE
.p 55
.Set Filler = '-'
.var
  Nom,Nom0 :Word;
  KolItog, MassaBrItog, MassaNetItog, Sum1Itog, Sum2Itog,Sum3Itog :Double;
  KolItog0, MassaBrItog0, MassaNetItog0, Sum1Itog0, Sum2Itog0,Sum3Itog0 :Double;
.endvar
#include mfo.frn
.{ OsOperObjLoop
.fields
  CommonFormHeader
  Поставщик                     // KatOrg.Name
  Поставщик_ОКПО                // KatOrg.OKPO
  Склад
  Поставщик_ОКОНХ               // KatOrg.OKONH

Поставщик
  + unn_         + Поставщик_УНН
  + ' Адрес:'    + Поставщик_Адрес
  + ' Банк:'     + Поставщик_БАНК_Имя
  + ' р/с '      + Поставщик_БАНК_Счет
  + mfo_         + Поставщик_БАНК_Мфо
  + ' тел.: '    + Поставщик_ТЕЛ
Поставщик_ОКПО
Грузополучатель
  + unn_         + Грузополучатель_УНН
  + ' Адрес:'    + Грузополучатель_Адрес
  + ' Банк:'     + Грузополучатель_БАНК_Имя
  + ' р/с '      + Грузополучатель_БАНК_Счет
  + mfo_         + Грузополучатель_БАНК_Мфо
  + ' тел.: '    + Грузополучатель_ТЕЛ
Грузополучатель_ОКПО
Поставщик
  + unn_         + Поставщик_УНН
  + ' Адрес:'    + Поставщик_Адрес
  + ' Банк:'     + Поставщик_БАНК_Имя
  + ' р/с '      + Поставщик_БАНК_Счет
  + mfo_         + Поставщик_БАНК_Мфо
  + ' тел.: '    + Поставщик_ТЕЛ
Поставщик_ОКПО
Получатель
  + unn_         + Получатель_УНН
  + ' Адрес:'    + Получатель_Адрес
  + ' Банк:'     + Получатель_БАНК_Имя
  + ' р/с '      + Получатель_БАНК_Счет
  + mfo_         + Получатель_БАНК_Мфо
  + ' тел.: '    + Получатель_ТЕЛ
Получатель_ОКПО

 ОснованиеОтпуска
 ''
 ''
 НомерНакладной
 ДатаНакладной

!.{
 Nom

 НаименованиеОС
 СложныйНоменклатурныйНомер
 ЕдИзм
 ВидТары
 КоличествоВУпаковке
 КоличествоУпаковок
 double(0)
 DoubleToStr(Количество,kolFormat)
 Цена
 Сумма
 double(0)
 double(0)
 Сумма
!.}
!.[F
  KolItog
  MassaBrItog
  MassaNetItog
  Sum1Itog
  Sum2Itog
  Sum3Itog
!.]F
  KolItog0
  MassaBrItog0
  MassaNetItog0
  Sum1Itog0
  Sum2Itog0
  Sum3Itog0

  Nom0
  DoubleToStr(MassaNetItog0, '\0p4')
  DoubleToStr(KolItog0, '\0p4')
  DoubleToStr(MassaBrItog0, '\0p4')

  if(НомерДоверенности <> '', НомерДоверенности, '__________')
  if(LongInt(ДатаДоверенности) <> LongInt(0),
     DateToStr(ДатаДоверенности, 'DD mon YYYY'), '__________________')
  ФИОДовер
  СуммаИтогоПрописью
  '_______________________'
  '______________________________'
.endfields
 ^
.begin
  Nom0          :=0;
  KolItog0      :=0;
  MassaBrItog0  :=0;
  MassaNetItog0 :=0;
  Sum1Itog0     :=0;
  Sum2Itog0     :=0;
  Sum3Itog0     :=0;
end.
 Р                                                                                                                                               Унифицированная форма № ТОРГ-12 Р
 Р                                                                                                                                               Утверждена постановлением Госкомстата Р
 Р                                                                                                                                               России от 25.12.1998  № 132 Р
 Р                                                                                                                                                              _____________________  Р
 Р                                                                                                                                                              Д│         Код         │ Д Р
 Р                                                                                                                                               Форма по ОКУД  Д│       0330212       │ Д Р
 РОрганизация    З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З по ОКПО  Д│@~@@@@@@@@@@@@@@@@@@@│ Д Р
 РПодразделение  З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З Д│                     │ Д Р
 Р                                                                                                                                    Вид деятельности по ОКДП  Д│@~@@@@@@@@@@@@@@@@@@@│ Д Р
 РГрузоотправитель  З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З по ОКПО  Д│@~@@@@@@@@@@@@@@@@@@@│ Д Р
 РГрузополучатель   З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З по ОКПО  Д│@~@@@@@@@@@@@@@@@@@@@│ Д Р
 РПоставщик         З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З по ОКПО  Д│@~@@@@@@@@@@@@@@@@@@@│ Д Р
 РПлательщик        З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З  Дпо ОКПО │@~@@@@@@@@@@@@@@@@@@@│ Д Р
 РОснование         З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З  Д│ номер │@~@@@@@@@@@@@@@@@@@@@│ Д Р
 Р                                                                                                                                                      Д│  дата │@~@@@@@@@@@@@@@@@@@@@│ Д Р
 Р                                                                                                                             Транспортная накладная   Д│ номер │                     │ Д Р
 Р                                                                                                                                                      Д│  дата │                     │ Д Р
 Р                                                                                                                                                Вид операции  Д│                     │ Д Р
                                                     ┌────────────┬───────────┐
                                                     │   Номер    │   Дата    │
                                                     │ документа  │составления│
                                                     ├────────────┼───────────┤
                                 ТОВАРНАЯ НАКЛАДНАЯ  │@~@@@@@@@@@@│ @@@@@@@@@@│
                                                     └────────────┴───────────┘
 Ш┌───┬─────────────────────────────────────────────────┬─────────────────┬─────────┬───────────────────────┬─────────────┬─────────────┬───────────────┬──────────────────┬─────────────────────┬──────────────────┐ Ш
 Ш│   │                     Товар                       │ Един. измерения │         │      Количество       │             │             │               │                  │         НДС         │                  │ Ш
 Ш│ № ├───────────────────────────────────┬─────────────┼─────────┬───────┤   Вид   ├───────────┬───────────┤    Масса    │ Количество  │      Цена,    │    Сумма без     ├─────┬───────────────┤  Сумма с учетом  │ Ш
 Ш│п/п│   наименование, характеристика,   │     код     │  наиме- │ код по│упаковки │  в одном  │   мест,   │   брутто    │   (масса    │    руб.коп.   │    учета НДС     │став-│     сумма     │       НДС,       │ Ш
 Ш│   │      сорт, артикул товара         │             │ нование │  ОКЕИ │         │   месте   │   штук    │             │    нетто)   │               │     руб.коп.     │ка, %│    руб.коп.   │     руб.коп.     │ Ш
 Ш├───┼───────────────────────────────────┼─────────────┼─────────┼───────┼─────────┼───────────┼───────────┼─────────────┼─────────────┼───────────────┼──────────────────┼─────┼───────────────┼──────────────────┤ Ш
 Ш│ 1 │               2                   │      3      │    4    │   5   │    6    │     7     │     8     │      9      │     10      │      11       │        12        │ 13  │      14       │        15        │ Ш
 Ш├───┼───────────────────────────────────┼─────────────┼─────────┼───────┼─────────┼───────────┼───────────┼─────────────┼─────────────┼───────────────┼──────────────────┼─────┼───────────────┼──────────────────┤ Ш
.{ OSOperPrilGoodsLoop;(ЭлементарныйОбъект)
.[h Skip
.begin
!  Nom          :=0;
  KolItog      :=0;
  MassaBrItog  :=0;
  MassaNetItog :=0;
  Sum1Itog     :=0;
  Sum2Itog     :=0;
  Sum3Itog     :=0;
end.
 Ш                                                                                                                                                                                  Оборотная сторона формы № ТОРГ-12 Ш
 Ш┌───┬─────────────────────────────────────────────────┬─────────────────┬─────────┬───────────────────────┬─────────────┬─────────────┬───────────────┬──────────────────┬─────────────────────┬──────────────────┐ Ш
 Ш│   │                     Товар                       │ Един. измерения │         │      Количество       │             │             │               │                  │         НДС         │                  │ Ш
 Ш│ № ├───────────────────────────────────┬─────────────┼─────────┬───────┤   Вид   ├───────────┬───────────┤    Масса    │ Количество  │      Цена,    │    Сумма без     ├─────┬───────────────┤  Сумма с учетом  │ Ш
 Ш│п/п│   наименование, характеристика,   │     код     │  наиме- │ код по│упаковки │  в одном  │   мест,   │   брутто    │   (масса    │    руб.коп.   │    учета НДС     │став-│     сумма     │       НДС,       │ Ш
 Ш│   │      сорт, артикул товара         │             │ нование │  ОКЕИ │         │   месте   │   штук    │             │    нетто)   │               │     руб.коп.     │ка, %│    руб.коп.   │     руб.коп.     │ Ш
 Ш├───┼───────────────────────────────────┼─────────────┼─────────┼───────┼─────────┼───────────┼───────────┼─────────────┼─────────────┼───────────────┼──────────────────┼─────┼───────────────┼──────────────────┤ Ш
 Ш│ 1 │               2                   │      3      │    4    │   5   │    6    │     7     │     8     │      9      │     10      │      11       │        12        │ 13  │      14       │        15        │ Ш
 Ш├───┼───────────────────────────────────┼─────────────┼─────────┼───────┼─────────┼───────────┼───────────┼─────────────┼─────────────┼───────────────┼──────────────────┼─────┼───────────────┼──────────────────┤ Ш
.]h
.begin
  Nom :=Nom + 1;
  KolItog      :=KolItog + double(КоличествоУпаковок);
  MassaBrItog  :=MassaBrItog + 0;
  MassaNetItog :=MassaNetItog + double(Количество);
  Sum1Itog     :=Sum1Itog + Сумма;
  Sum2Itog     :=Sum2Itog + 0;
  Sum3Itog     :=Sum3Itog + Сумма;
  Nom0 :=Nom0 + 1;
  KolItog0      :=KolItog0 + double(КоличествоУпаковок);
  MassaBrItog0  :=MassaBrItog0 + 0;
  MassaNetItog0 :=MassaNetItog0 + double(Количество);
  Sum1Itog0     :=Sum1Itog0 + Сумма;
  Sum2Itog0     :=Sum2Itog0 + 0;
  Sum3Itog0     :=Sum3Itog0 + Сумма;
end.
 Ш│@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@│@~@@@@@@@│       │@~@@@@@@@│&#'&&&&.&&&│&#'&&&&.&&&│&#'&&&&&&.&&&│&#'&&&&&&.&&&│&#'&&&&&&&&&.&&│&#'&&&&&&&&&&&&.&&│&&.&&│&#'&&&&&&&&&.&&│&#'&&&&&&&&&&&&.&&│ Ш
.{ CheckEnter OsOperPrilMemo
.}
.[f
 Ш└───┴───────────────────────────────────┴─────────────┴─────────┴───────┴─────────┴───────────┼───────────┼─────────────┼─────────────┼───────────────┼──────────────────┼─────┼───────────────┼──────────────────┤ Ш
 Ш                                                                                        Итого │&#'&&&&.&&&│&#'&&&&&&.&&&│&#'&&&&&&.&&&│               │&#'&&&&&&&&&&&&.&&│     │&#'&&&&&&&&&.&&│&#'&&&&&&&&&&&&.&&│ Ш
 Ш                                                                                              └───────────┴─────────────┴─────────────┴───────────────┴──────────────────┴─────┴───────────────┴──────────────────┘ Ш
.]f
.}
 Ш                                                                                              ┌───────────┬─────────────┬─────────────┬───────────────┬──────────────────┬─────┬───────────────┬──────────────────┐ Ш
 Ш                                                                           Всего по накладной │&#'&&&&.&&&│&#'&&&&&&.&&&│&#'&&&&&&.&&&│               │&#'&&&&&&&&&&&&.&&│     │&#'&&&&&&&&&.&&│&#'&&&&&&&&&&&&.&&│ Ш
 Ш                                                                                              └───────────┴─────────────┴─────────────┴───────────────┴──────────────────┴─────┴───────────────┴──────────────────┘ Ш
 Товарная накладная имеет приложение на _______________________________________
 и содержит  З  ^   З порядковых номеров записей
 Р                                                                                                                                                           ┌───────────────────────┐ Р
 Р                                                                     Масса груза (нетто)   З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З │                       │ Р
 Р                                                                                                                                                           ├───────────────────────┤ Р
 Р                                                                                                                                                           │                       │ Р
 РВсего мест  З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З Масса груза (брутто)  З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З └───────────────────────┘ Р
 РПриложение (паспорта, сертификаты и т.п.) на __________________________ листах      │По доверенности № З^ З от  З^ З г. Р
 Р                                                                                    │выданной  З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З Р
 РВсего отпущено на сумму  З@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З │ Р
 Р                                                                                    │ Р
 РОтпуск разрешил  З@~@@@@@@@@@@@@@@@@@@@@@ З __________  З@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ З │Груз принял                   З ______________________ З __________  З ______________________________ З Р
 Р                       должность         подпись          расшифровка подписи       │                                    должность          подпись        расшифровка подписи Р
 Р                                                                                    │ Р
 Р                _______________________ __________ ________________________________ │Груз получил грузополучатель _______________________ __________ _______________________________ Р
 Р                       должность         подпись          расшифровка подписи       │                                    должность          подпись        расшифровка подписи Р
 Р                                                                                    │ Р
 Р                          М.П.                                                      │                                      М.П. Р
.if PageSymbol
.end
.}
.endform


! ============================================================================
! Товарная накладная в тыс руб.
! ============================================================================
.linkform 'OSOperTNTysRub' prototype is 'OSOperPril'
.group 'Накладные'
.hide
.NameInList 'ТОВАРНАЯ НАКЛАДНАЯ в тыс.руб.'
#include mfo.frn
.var
  Total_Количество : double;
.endvar
.{ OsOperObjLoop
.begin
  Total_Количество := 0.0;
end.
 Ш







.fields
                                                             Поставщик_УНН     Получатель_УНН
                                                             Поставщик_ОКПО    Получатель_ОКПО
.endfields
                                                             @@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@

                                                             @@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@


.fields
                                                                                   НомерНакладной
.endfields
                                                                                   ^



.fields
       ДатаНакладной
.endfields
 дата: ^

.fields
Поставщик
  + ' ОКПО '     + Поставщик_ОКПО
  + unn_         + Поставщик_УНН
  + ' Адрес:'    + Поставщик_Адрес
  + ' Банк:'     + Поставщик_БАНК_Имя
  + ' р/с '      + Поставщик_БАНК_Счет
  + mfo_         + Поставщик_БАНК_Мфо
Получатель
  + ' ОКПО '     + Получатель_ОКПО
  + unn_         + Получатель_УНН
  + ' Адрес:'    + Получатель_Адрес
  + ' Банк:'     + Получатель_БАНК_Имя
  + ' р/с '      + Получатель_БАНК_Счет
  + mfo_         + Получатель_БАНК_Мфо
Примечание
ОснованиеОтпуска
КомуВыдано НомерДоверенности ДатаДоверенности
.endfields
 Отправитель: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Получатель: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Примечание: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Основание отпуска: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Кому выданы МЦ: ^ доверенность № ^ ^
─────────────────────────────────────────────────────────────────────────┬──────┬─────────┬─────────────┬────────────────┬──────────┬────────┬──────────
                         Наименование товара               Номенклатурный│ Ед.  │Кол-во   │Цена единицы │   Стоимость    │Вид тары, │Кол-во  │Кол-во
                                                               номер     │ изм. │продукции│ продукции   │   продукции    │упаковки  │упаковок│продукции
                                                                         │      │         │  тыс.руб.   │   тыс.руб.     │          │        │в упаковке
─────────────────────────────────────────────────────────────────────────┴──────┴─────────┴─────────────┴────────────────┴──────────┴────────┴──────────
.{ OSOperPrilGoodsLoop;(ЭлементарныйОбъект)
.fields
НаименованиеОС                                        СложныйНоменклатурныйНомер ЕдИзм  DoubleToStr(Количество,kolFormat) Цена/1000    Сумма/1000       ВидТары    КоличествоУпаковок
                                                                                                                                              КоличествоВУпаковке
.endfields
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@ @@@@@@ &&&&&&&.& &&&&&&&&&&&.& &&&&&&&&&&&&&&.& @@@@@@@@@@ &#&&&.&& &&#&&&&.&&
.begin
  Total_Количество := Total_Количество + Double(Количество)
end.
.{ CheckEnter OsOperPrilMemo
.}
.}
.fields
!КоличествоИтого
                                                                                Total_Количество          СуммаИтого/1000             КоличествоУпаковокИтого
.endfields
                                                                                ┌─────────┐             ┌────────────────┐          ┌────────┐
Итого...........................................................................│&&&&&&&.&│.............│&&&&&&&&&&&&&&.&│..........│&&#&&.&&│
                                                                                └─────────┘             └────────────────┘          └────────┘
.fields
                        СуммаИтогоПрописью
                            КоличествоНаименований
.endfields
Всего отпущено на сумму @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Всего отпущено наименований @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ N пломбы ________
С товаром переданы документы ___________________________________________________________________________________________________________________________
Отпуск разрешил ________________________________________________________________________________________________________________________________________
Отпуск произвел ________________________________________________________________________________________________________________________________________
Товар получил __________________________________________________________________________________________________________________________________________
Указаный товар сдал ____________________________________________________________________________________________________________________________________
Принятое количество и стоимость товара_____________________________________________________________________ N Пломбы ___________________________________
Принял _________________________________________________________________________________________________________________________________________________
 Ш
.if PageSymbol
.end
.}
.endform


! ============================================================================
! Товарная накладная в руб.
! ============================================================================
.linkform 'OSOperTNRub' prototype is 'OSOperPril'
.NameInList 'ТОВАРНАЯ НАКЛАДНАЯ в руб.'
.group 'Накладные'
.hide
#include mfo.frn
.var
  Total_Количество : double;
.endvar
.{ OsOperObjLoop
.begin
  Total_Количество := 0.0;
end.
 Ш







.fields
                                                             Поставщик_УНН     Получатель_УНН
                                                             Поставщик_ОКПО    Получатель_ОКПО
.endfields
                                                             @@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@

                                                             @@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@


.fields
                                                                                   НомерНакладной
.endfields
                                                                                   ^



.fields
       ДатаНакладной
.endfields
 дата: ^

.fields
Поставщик
  + ' ОКПО '     + Поставщик_ОКПО
  + unn_         + Поставщик_УНН
  + ' Адрес:'    + Поставщик_Адрес
  + ' Банк:'     + Поставщик_БАНК_Имя
  + ' р/с '      + Поставщик_БАНК_Счет
  + mfo_         + Поставщик_БАНК_Мфо
Получатель
  + ' ОКПО '     + Получатель_ОКПО
  + unn_         + Получатель_УНН
  + ' Адрес:'    + Получатель_Адрес
  + ' Банк:'     + Получатель_БАНК_Имя
  + ' р/с '      + Получатель_БАНК_Счет
  + mfo_         + Получатель_БАНК_Мфо
Примечание
ОснованиеОтпуска
КомуВыдано НомерДоверенности ДатаДоверенности
.endfields
 Отправитель: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Получатель: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Примечание: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Основание отпуска: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Кому выданы МЦ: ^ доверенность № ^ ^
─────────────────────────────────────────────────────────────────────────┬──────┬─────────┬─────────────┬────────────────┬──────────┬────────┬──────────
                         Наименование товара               Номенклатурный│ Ед.  │Кол-во   │Цена единицы │   Стоимость    │Вид тары, │Кол-во  │Кол-во
                                                               номер     │ изм. │продукции│ продукции   │   продукции    │упаковки  │упаковок│продукции
                                                                         │      │         │    руб.     │     руб.       │          │        │в упаковке
─────────────────────────────────────────────────────────────────────────┴──────┴─────────┴─────────────┴────────────────┴──────────┴────────┴──────────
.{ OSOperPrilGoodsLoop;(ЭлементарныйОбъект)
.fields
НаименованиеОС                                        СложныйНоменклатурныйНомер ЕдИзм  DoubleToStr(Количество,kolFormat) Цена         Сумма            ВидТары    КоличествоУпаковок
                                                                                                                                              КоличествоВУпаковке
.endfields
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@ @@@@@@ &&&&&&&.& &&&&&&&&&&&.& &&&&&&&&&&&&&&.& @@@@@@@@@@ &#&&&.&& &&#&&&&.&&
.begin
  Total_Количество := Total_Количество +Double(Количество)
end.
.{ CheckEnter OsOperPrilMemo
.}
.}
.fields
!КоличествоИтого
                                                                               Total_Количество          СуммаИтого                  КоличествоУпаковокИтого
.endfields
                                                                                ┌─────────┐             ┌────────────────┐          ┌────────┐
Итого...........................................................................│&&&&&&&.&│.............│&&&&&&&&&&&&&&.&│..........│&&#&&.&&│
                                                                                └─────────┘             └────────────────┘          └────────┘
.fields
                        СуммаИтогоПрописью
                            КоличествоНаименований
.endfields
Всего отпущено на сумму @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
Всего отпущено наименований @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ N пломбы ________
С товаром переданы документы ___________________________________________________________________________________________________________________________
Отпуск разрешил ________________________________________________________________________________________________________________________________________
Отпуск произвел ________________________________________________________________________________________________________________________________________
Товар получил __________________________________________________________________________________________________________________________________________
Указаный товар сдал ____________________________________________________________________________________________________________________________________
Принятое количество и стоимость товара_____________________________________________________________________ N Пломбы ___________________________________
Принял _________________________________________________________________________________________________________________________________________________
 Ш
.if PageSymbol
.end
.}
.endform


.linkform 'OSOperTTNRub' prototype is 'OSOperPril'
.NameInList 'ТОВАРНО-ТРАНСПОРТНАЯ НАКЛАДНАЯ'
.group 'Накладные'
.hide
#include mfo.frn
 Ш

.{ OsOperObjLoop
.fields
                                              Поставщик_УНН               Получатель_УНН
                                              Поставщик_ОКПО              Получатель_ОКПО
.endfields
                                              @@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@

                                              @@@@@@@@@@@@@@@@@@@@@@@@    @@@@@@@@@@@@@@@@@@@@@@@@@@

.fields
                                                                            Номер_с_дескриптором
.endfields
                                                                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@
                                                                                                                                            ┌──────────────────────────┐
                                                                                                                                            │           Коды           │
                                                                                                                                            ├──────────────────────────┤
.fields
if (longint(ДатаНакладной)<>0,DateToStr(ДатаНакладной,'"DD" Month YYYY'),'')    Автомобиль                                                 НомерПутевогоЛиста
                    ВладелецТранспорта                        Водитель

Получатель
  + ' ОКПО '     + Получатель_ОКПО
  + unn_         + Получатель_УНН
  + ' Адрес:'    + Получатель_Адрес
  + ' Банк:'     + Получатель_БАНК_Имя
  + ' р/с '      + Получатель_БАНК_Счет
  + mfo_         + Получатель_БАНК_Мфо

Поставщик
  + ' ОКПО '     + Поставщик_ОКПО
  + unn_         + Поставщик_УНН
  + ' Адрес:'    + Поставщик_Адрес
  + ' Банк:'     + Поставщик_БАНК_Имя
  + ' р/с '      + Поставщик_БАНК_Счет
  + mfo_         + Поставщик_БАНК_Мфо

Грузополучатель
  + ' ОКПО '     + Грузополучатель_ОКПО
  + unn_         + Грузополучатель_УНН
  + ' Адрес:'    + Грузополучатель_Адрес
  + ' Банк:'     + Грузополучатель_БАНК_Имя
  + ' р/с '      + Грузополучатель_БАНК_Счет
  + mfo_         + Грузополучатель_БАНК_Мфо

                 ПунктПогрузки                                    ПунктРазгрузки
                                                                                    Прицеп1
                                                                                    Прицеп2
.endfields
@@@@@@@@@@@@@@@@@@ г. Автомобиль @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ К путевому листу № @@@@@@@@@@@@@@@@@ │__________________________│
Владелец транспорта @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Водитель @@@@@@@@@@@@@@@@@@@@@@@@@ Вид перевозки _____________________________________│__________________________│
Заказчик (плательщик) @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│__________________________│
Грузоотправитель @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│__________________________│
Грузополучатель @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│__________________________│
Пункт погрузки  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Пункт разгрузки @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Маршрут № ___________________________ │__________________________│
Переадресовка   _________________________________________________________  1. Прицеп @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Гар. № ________________ │__________________________│
                наименование и адрес нового грузополучат.,подпись          2. Прицеп @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Гар. № ________________ │                          │
───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┴──────────────────────────┴
                                                 СВЕДЕНИЯ_О_ГРУЗЕ
───────────────────────────────────────┬───────────┬───────────┬────────────┬────────────────┬────────┬───────────┬─────────────┬────────┬───────┬─────────┬────────────
                                       │           │           │            │                │        │           │             │        │       │         │
      Наименование                     │  Единица  │  Кол-во   │   Цена     │    Стоимость,  │  Вид   │ Кол-во    │  Кол-во     │   Код  │ Класс │  Масса  │С грузом
                                       │ измерения │ продукции │ тыс.руб    │     тыс.руб    │ тары   │грузовых   │ продукц. в  │ груза  │ груза │ брутто, │следуют
                                       │           │           │            │                │        │ мест      │ груз.месте  │ по ООН │       │  тонн   │документы
           1                           │   2       │    3      │     4      │        5       │  6     │    7      │    8        │  9     │  10   │  11     │   12
───────────────────────────────────────┼───────────┼───────────┼────────────┼────────────────┼────────┼───────────┼─────────────┼────────┼───────┼─────────┼────────────
.{ OSOperPrilGoodsLoop;(ЭлементарныйОбъект)
.fields
НаименованиеОС      СложныйНоменклатурныйНомер ЕдИзм       DoubleToStr(Количество,kolFormat)  Цена/1000    Сумма/1000       ВидТары  КоличествоУпаковок
                                                                                                                   КоличествоВУпаковке            МассаБрутто/1000
.endfields
@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@│@@@@@@@@@@@│&&&&&&&&&&&│&#&&&&&&&.&&│&#&&&&&&&&&&&.&&│@@@@@@@@│&#&&&&&&&&&│&#&&&&&&&&.&&│        │       │&#&&&.&&&│
.{ CheckEnter OsOperPrilMemo
.}
.}
───────────────────────────────────────┴───────────┴───────────┴────────────┼────────────────┼────────┼───────────┼─────────────┴────────┴───────┼─────────┼────────────
.fields
                                                                             СуммаИтого/1000           КоличествоУпаковокИтого                    МассаБруттоИтого/1000
.endfields
 ИТОГО                                                                      │&#&&&&&&&&&&&.&&│        │&#&&&&&&&&&│                              │&#&&&.&&&│
────────────────────────────────────────────────────────────────────────────┴────────────────┴────────┴───────────┴──────────────────────────────┴─────────┴────────────

.fields
                         СуммаИтогоПрописью
                                                                                                                                                       НомерДоверенности
                                                                                                                                             ДатаДоверенности
                                                                                                                                           ('выданной ' + ФИОДовер)
.endfields
Всего отпущено на сумму: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  │ При приеме МЦ
                                                                      Отпуск разрешил __________________________________________________ │ по довер № @@@@@@@@@@@@@@@@@
Указанный груз за исправной пломбой № _____________________________   Указанный груз за исправной пломбой № ____________________________ │
тарой и упаковкой, к-во мест ______________________________________   тарой и упаковкой, к-во мест _____________________________________ │ от ^
Груз массой брутто, т _____________________________________________   Груз массой брутто, т ____________________________________________ │ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                             прописью                                                                  прописью                          │ _____________________________
Сдал отправитель __________________________________________________   Сдал водитель(экспедитор)_________________________________________ │ груз получил ________________
                    должность, ф.и.о., подпись                                           подпись                                         │              должн.подпись
Принял водитель ___________________________________________________   Принял получатель ________________________________________________ │ ─────────────────────────────
                     ф.и.о., подпись                                                                должность, ф.и.о., подпись           │
Штамп отправителя                                                     Штамп получателя                                                   │ ─────────────────────────────
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── │   ф.и.о. грузополучателя
                          ПОГРУЗОЧНО-РАЗГРУЗОЧНЫЕ_ОПЕРАЦИИ                                                                               │
──────────┬────────────────┬──────────┬────────┬────────────────────────────────┬─────────────────────────────────────────┬───────────── │
Операция  │ Исполнит.      │ Способ   │        │ Дата,время(час.мин.)           │ Дополнительные операции                 │  Подпись     │     Транспортные услуги
          │ (АТП,отпр.     ├──────────┤ Код    ├──────────┬──────────┬──────────┼─────────────┬───────────────────────────┤  отв.лица    │
          │  получат.)     │руч.мех.  │        │прибытия  │убытия    │простоя   │ время, мин  │ наимен.колич              │              │ ─────────────────────────────
          │   13           │  14      │ 15     │  16      │  17      │   18     │     19      │      20                   │     21       │
──────────┼────────────────┼──────────┼────────┼──────────┼──────────┼──────────┼─────────────┼───────────────────────────┼───────────── │ ─────────────────────────────
Погрузка  │                │          │        │          │          │          │             │                           │              │
Разгрузка │                │          │        │          │          │          │             │                           │              │ ─────────────────────────────
──────────┴────────────────┴──────────┴────────┴──────────┴──────────┴──────────┴─────────────┴───────────────────────────┴───────────── │
                          ПРОЧИЕ СВЕДЕНИЯ (заполняется перевозчиком)                                                                     │ Отметка о составленых актах
────────────────────────────────────────────────┬─────────┬────────────────────┬────────────────────────────┬────────────────┬────────── │
Расст.перевоз по груп.дорог,км                  │ Код     │ За трансп.услуги   │     Поправоч.коэф.         │  Штраф         │           │ ─────────────────────────────
─────────────┬────────┬────────┬────────┬───────┤эксп.    │   с заказчика      ├──────────────┬─────────────┤                │           │
всего        │в гор.  │1 гр.   │2 гр.   │3 гр.  │         │                    │ расц.водит.  │ осн.тариф   │                │           │ ─────────────────────────────
   22        │  23    │  24    │  25    │ 26    │  27     │       28           │     29       │    30       │   31           │   32      │
─────────────┼────────┼────────┼────────┼───────┼─────────┼────────────────────┼──────────────┼─────────────┼────────────────┼────────── │ ─────────────────────────────
             │        │        │        │       │         │                    │              │             │                │           │
─────────────┴────────┴────────┴────────┴───────┴─────────┴────────────────────┴──────────────┴─────────────┴────────────────┴────────── │ ─────────────────────────────
─────────┬───────┬──────────┬──────────┬─────────┬──────────┬───────────────────┬─────────┬───────────┬───────────────────────────────── │
Расст.   │за     │за расст. │За спец.  │За тран. │Погр/Зазгр│Сверхнорм простоя  │Прочие   │Дополн.    │    К оплате                      │ ─────────────────────────────
стоимости│тонны  │перевозки │транспорт │услуги   │ работы   ├─────────┬─────────┤доплаты  │услуги     ├──────────────┬────────────────── │
         │       │          │          │         │          │погруз   │загрузка │         │           │Итого         │в числе ТЭП        │
         │  33   │   34     │   35     │   36    │   37     │   38    │   39    │   40    │  41       │   42         │  43               │ Таксировка __________________
─────────┼───────┴──────────┴──────────┴─────────┴──────────┴─────────┼─────────┼─────────┼───────────┼──────────────┼────────────────── │
по заказу│                                                            │         │         │           │              │                   │ ─────────────────────────────
Выполнено│                                                            │         │         │           │              │                   │
Расценка │                                                            │         │         │           │              │                   │ ─────────────────────────────
К оплате │                                                            │         │         │           │              │                   │
─────────┴────────────────────────────────────────────────────────────┴─────────┴─────────┴───────────┴──────────────┴────────────────── │ ─────────────────────────────
                                                                         Подпись таксировщика __________________________________________ Ш
.if PageSymbol
.end
.}
.endform

#include Form_OS_02_Rus.frn

#include Form_OS_02_Bel.frn
