//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
//------------------------------------------------------------------------------
// Галактика - Бухгалтерский контур
// Аналитическая ведомость (оборотно-сальдовая)
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Внимание! Существуют Slk-отчеты (копии всех присоединенных форм)
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Информация о замене полей (в порядке убывания дат)
//
//  ----------------------------------------------------------------------------
//  DD-MM-YYYY
//  ----------------------------------------------------------------------------
//  10-08-2005
//
//    Из прототип _удалены_ поля:
//      NameOper - было полной копией поля O_ObSod
//
//------------------------------------------------------------------------------
#include FeeSigners.frn
#doc
Базовая форма отчета "Аналитическая ведомость (оборотно-сальдовая)"
#end
.set name='AnFrm_N'
.hide
.fields
 MainSchet      // счет
 PlanSchet_Capt // код и описание текущего плана счетов
 MainPeriod     // строка содержащая период формирования
 GroupTuneName  // наименование настройки группировки
 BuhName
 //--------- поля описаний фильтров (An_Filters)
 FilterTitle
 FilterName
//---------- поля заголовока (AN_HEADER)

// !!! при добавлении полей в заголовок, обязательно изменить строку AnFrm.SkipFormat в AnVedPrn.vpp !!!

 H_Space1     // пробелы для печати "лесенкой"
 H_Name   : String:'t:r'    // наименование группировки
 H_Space2     // пробелы для корректного сдвига сумм под нужные колонки
 H_Space2A    // символы "─" для подчекривания итогов "лесенкой"
 H_Sum1       // сальдо входящее по дебету (НДЕ)
 H_Sum2       // сальдо входящее по дебету (Валюта отчетов)
 H_Sum3       // сальдо входящее по дебету (Валюта документа)
 H_Sum4       // сальдо входящее по кредиту (НДЕ)
 H_Sum5       // сальдо входящее по кредиту (Валюта документа)
 H_Sum6       // сальдо входящее по кредиту (Валюта отчетов)
 H_SumObNdeDb      // сумма оборотов по дебету (НДЕ)
 H_SumObDocDb      // сумма оборотов по дебету (Валюта документа)
 H_SumObValDb      // сумма оборотов по дебету (Валюта отчетов)
 H_SumObNdeKr      // сумма оборотов по кредиту (НДЕ)
 H_SumObDocKr      // сумма оборотов по кредиту (Валюта документов)
 H_SumObValKr      // сумма оборотов по кредиту (Валюта отчетов)
 H_SumSalOutNdeDb  // сальдо исходящее по дебету (НДЕ)
 H_SumSalOutNdeKr  // сальдо исходящее по кредиту (НДЕ)
 H_SumSalOutDocDb  // сальдо исходящее по дебету (Валюта документов)
 H_SumSalOutDocKr  // сальдо исходящее по крудиту (Валюта документов)
 H_SumSalOutValDb  // сальдо исходящее по дебету (Валюта отчетов)
 H_SumSalOutValKr  // сальдо исходящее по кредиту (Валюта отчетов)
//---------- поля основного цикла (AN_OBOROT) собственно проводки
 O_NRec       // Oborot.nRec
 O_Kol        // Oborot.Kol

 O_Name       // наименование оборота в иерархии
 O_Dat        // дата проводки
 O_SchO       // счет дебета
 O_SubSchO    // субсчет

 O_KAUDb      // КАУ по дебету
 O_DPodr      // подразделение по дебету проводки
 O_ObSod      // содержание проводки
 O_ObN        // номер документа
 O_ObName     // наименование документа

 O_SchetK     // счет кредита
 O_SubSchK    // его субсчет
 O_KAUKr      // КАУ по кредиту
 O_KPodr      // подразделение по кредиту проводки
 O_Sum1       // сумма оборота по дебету (НДЕ)
 O_Sum2       // сумма оборота по дебету (Валюта документа)
 O_Sum3       // сумма оборота по дебету (Валюта отчетов)
 O_Sum4       // сумма оборота по кредиту (НДЕ)
 O_Sum5       // сумма оборота по кредиту (Валюта документов)
 O_Sum6       // сумма оборота по кредиту (Валюта отчетов)
 PlatPol      // контрагент-плательщик
 DatDoc       // дата обработки платежки
//---------- поля подножия (AN_FOOTER)
 F_Space1     // пробелы для печати лесенкой
 F_Name       // наименование уровня группировки
 F_Space2     // пробелы для сдвига итогов под нужные колонки
 F_Space2A    // символы "─" для подчекривания итогов "лесенкой"
 HF_Sum1      // сальдо входящее по дебету (НДЕ)
 HF_Sum2      // сальдо входящее по дебету (Валюта отчетов)
 HF_Sum3      // сальдо входящее по дебету (Валюта документа)
 HF_Sum4      // сальдо входящее по кредиту (НДЕ)
 HF_Sum5      // сальдо входящее по кредиту (Валюта документа)
 HF_Sum6      // сальдо входящее по кредиту (Валюта отчетов)
 F_Sum1       // сумма оборотов по дебету (НДЕ)
 F_Sum2       // сумма оборотов по дебету (Валюта документа)
 F_Sum3       // сумма оборотов по дебету (Валюта отчетов)
 F_Sum4       // сумма оборотов по кредиту (НДЕ)
 F_Sum5       // сумма оборотов по кредиту (Валюта документов)
 F_Sum6       // сумма оборотов по кредиту (Валюта отчетов)
 F_Sum7       // сальдо исходящее по дебету (НДЕ)
 F_Sum8       // сальдо исходящее по кредиту (НДЕ)
 F_Sum9       // сальдо исходящее по дебету (Валюта документов)
 F_Sum10      // сальдо исходящее по крудиту (Валюта документов)
 F_Sum11      // сальдо исходящее по дебету (Валюта отчетов)
 F_Sum12      // сальдо исходящее по кредиту (Валюта отчетов)
#FeeSignersCycleFields
.endfields
Счет ^ 
План счетов ^ 
Период ^
Группировка ^
Главный бухгалтер ^
.if Filt
.{ An_Filters CheckEnter
^
.{ An_Detail
^
.}
.}
.end
.{
.{ An_Header
-<Header>-----------------------------------------------------------------------
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.{ An_Oborot CheckEnter
-<oborot>-----------------------------------------------------------------------
O_NRec ^
O_Kol  ^
O_Name ^ O_Dat  ^
O_SchO/O_SubSchO/O_KAUDb/O_DPodr: ^ / ^ / ^ / ^
O_ObSod  ^
O_ObN    ^
O_ObName ^
O_SchetK/O_SubSchK/O_KAUKr/O_KPodr: ^ / ^ / ^ / ^
O_Sum1-O_Sum6: ^ / ^ / ^ / ^ / ^ / ^
PlatPol ^
DatDoc  ^
.}
.{ An_Footer CheckEnter
-<Footer>-----------------------------------------------------------------------
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.if Divider
.end
.}
.}
#FeeSignersCycle(AnFrm_N)
-<End>--------------------------------------------------------------------------
.endform

.linkform 'AnFrm_N01' prototype is 'AnFrm_N'
.nameinlist 'Иерархическая аналитическая ведомость'
.defo LANDSCAPE
.nonextheader
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
CommonFormHeader PlanSchet_Capt
MyOrg
MainSchet MainPeriod
FilterTitle FilterName
H_Space1 H_Name
O_Dat O_SchO O_SubSchO
O_KAUDb      // КАУ по дебету
O_DPodr      // подразделение по дебету проводки
O_Sum1 O_Sum4 O_SchetK O_SubSchK O_KAUKr O_KPodr
O_ObSod      // содержание проводки
O_ObN        // номер документа
O_ObName     // наименование документа
F_Space1
F_Space1 WordWrap(F_Name,1,27)  F_Space2 HF_Sum1 HF_Sum4
F_Space1 WordWrap(F_Name,28,54) F_Space2 F_Sum1 F_Sum4
F_Space1 WordWrap(F_Name,55,80) F_Space2 F_Sum7 F_Sum8
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
^ [^]
 Р^ Р
 Р                                                                        Аналитическая ведомость по счету ^
                                                                        @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.if Filt
 ВПрименен фильтр... В
.{ An_Filters CheckEnter
 В   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ В
.{ An_Detail
 В     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ В
.}
.}
.end
.{
.[H
──────────┬───────────────────────────────────────┬───────────────────┬───────────────────┬───────────────────────────────────────┬──────────────────────┬──────┬───────────────────
          │             Основной счет             │                   │                   │        Корреспондирующий счет         │      Содержание      │Номер │    Наименование
 Д А Т А  ├────┬────┬──────────────┬──────────────┤      Оборот       │     Оборот        ├────┬────┬──────────────┬──────────────┤       операции       │доку- │     документа
 проводки/│Счет│Суб-│     КАУ      │Подразделение │       дебет       │     кредит        │Счет│Суб-│     КАУ      │Подразделение │                      │мента │
 сальдо   │    │сч. │              │              │                   │                   │    │сч. │              │              │                      │      │
──────────┴────┴────┴──────────────┴──────────────┴───────────────────┴───────────────────┴────┴────┴──────────────┴──────────────┴──────────────────────┴──────┴───────────────────
.]H
.{ An_Header
 Б^^ Б
.}
.{ An_Oborot CheckEnter
@@@@@@@@@@ @@@@ @@@@ @@@@@@@@@@@@@@ @@@@@@@@@@@@@@  &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&&& @@@@ @@@@ @@@@@@@@@@@@@@ @@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@ @@@@@@ @@@@@@@@@@@@@@@@@@@
.}
.{  An_Footer CheckEnter
 Б^Итого по:
^@@@@@@@@@@@@@@@@@@@@@@@@@@@ ^Вход.сальдо: &'&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
^@@@@@@@@@@@@@@@@@@@@@@@@@@@ ^     Оборот: &'&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&
^@@@@@@@@@@@@@@@@@@@@@@@@@@ ^Исход.сальдо: &'&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&& Б
.if Divider
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.}

.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnFrm_N
.{checkenter FeeSignersCycle_AnFrm_N
 Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д  __________________   Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                         подпись
.}
.else
.fields
BuhName
.endfields
Главный бухгалтер  ___________________   ^
                          подпись
.end
 Р
.endform

.linkform 'AnFrm02_N' prototype is 'AnFrm_N'
.nameinlist 'Аналитическая ведомость'
.defo LANDSCAPE
.nonextheader
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
CommonFormHeader PlanSchet_Capt
MyOrg
MainSchet MainPeriod
FilterTitle FilterName
H_Space1 H_Name H_Space2
O_Dat O_ObN O_SchetK O_SubSchK O_KPodr O_KAUKr O_Sum1 O_Sum4
F_Space1 F_Name F_Space2 HF_Sum1 HF_Sum4 F_Sum1 F_Sum4 F_Sum7 F_Sum8
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
^ [^]
 Ш^ Ш
 Ш                                                                       Аналитическая ведомость по счету ^
                                                                       @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.if Filt
 ВПрименен фильтр... В
.{ An_Filters CheckEnter
 В   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ В
.{ An_Detail
 В     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ В
.}
.}
.end
.{
.[H
 Б──────────┬───────┬───────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────────────────────────────────────────────────────
          │       │            Корреспондирующий счет             │                                                    С у м м а
          │       ├────┬─────┬───────────────┬────────────────────┼─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
  Д а т а │ Номер │Счет│Суб- │               │                    │                Сальдо               │               Обороты               │               Сальдо
          │ доку- │    │счет │ Подразделение │  Наименование КАУ  │               входящее              │                                     │              исходящее
          │ мента │    │     │               │                    ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
          │       │    │     │               │                    │       Дебет      │     Кредит       │       Дебет      │      Кредит      │       Дебет      │      Кредит
──────────┴───────┴────┴─────┴───────────────┴────────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴────────────────── Б
.]H
.{ An_Header
 Б^ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ ^ Б
.}
.{ An_Oborot CheckEnter
@@@@@@@@@@ @@@@@@@ @@@@ @@@@@  @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@                                       &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&&
.}
.{  An_Footer CheckEnter
 Б^ Итого @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ ^ &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.if Divider
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.}

.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnFrm_N
.{checkenter FeeSignersCycle_AnFrm_N
 Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д  __________________   Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                         подпись
.}
.else
.fields
BuhName
.endfields
Главный бухгалтер  ___________________   ^
                          подпись
.end
 Ш
.endform

.linkform 'AnFrm03_N' prototype is 'AnFrm_N'
.nameinlist 'Аналитическая ведомость (дебет)'
.defo LANDSCAPE
.nonextheader
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
CommonFormHeader PlanSchet_Capt
MyOrg
MainSchet  MainPeriod
FilterTitle FilterName
H_Space1 H_Name H_Space2
O_Dat O_ObN O_SchetK O_SubSchK O_KPodr O_KAUKr O_Sum1 O_Sum3
F_Space1 F_Name F_Space2 HF_Sum1 HF_Sum2 F_Sum1 F_Sum3 F_Sum7 F_Sum11
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 ^ [^]
  Ш^ Ш
 Ш                                                                       Аналитическая ведомость по счету ^
                                                                       @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.if Filt
 ВПрименен фильтр... В
.{ An_Filters CheckEnter
 В   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ В
.{ An_Detail
 В     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ В
.}
.}
.end
.{
.[H
 Б──────────┬──────┬─────────────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────────────────────────────────────────────────────
          │      │                  Корреспондирующий счет             │                                                    С у м м а
          │      ├────────┬─────────┬───────────────┬──────────────────┼─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
  Д а т а │ Номер│  Счет  │Субсчет  │               │                  │                Сальдо               │               Обороты               │               Сальдо
          │ доку-│        │         │ Подразделение │ Наименование КАУ │               входящее              │                                     │              исходящее
          │ мента│        │         │               │                  ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
          │      │        │         │               │                  │     Дебет (руб)  │     Дебет  (вал) │   Дебет (руб)    │  Дебет (вал)     │   Дебет (руб)    │  Дебет (вал)
──────────┴──────┴────────┴─────────┴───────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴────────────────── Б
.]H
.{ An_Header
 Б^ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ ^ Б
.}
.{ An_Oborot CheckEnter
@@@@@@@@@@ @@@@@@ @@@@@@@@ @@@@@@@@@  @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@                                       &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&&
.}
.{  An_Footer CheckEnter
 Б^ Итого @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ ^         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.if Divider
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.}

.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnFrm_N
.{checkenter FeeSignersCycle_AnFrm_N
 Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д  __________________   Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                         подпись
.}
.else
.fields
BuhName
.endfields
Главный бухгалтер  ___________________   ^
                          подпись
.end
 Ш
.endform

.linkform 'AnFrm04_N' prototype is 'AnFrm_N'
.nameinlist 'Аналитическая ведомость (кредит)'
.defo LANDSCAPE
.nonextheader
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
CommonFormHeader PlanSchet_Capt
MyOrg
MainSchet MainPeriod
FilterTitle FilterName
H_Space1 H_Name H_Space2
O_Dat O_ObN O_SchetK O_SubSchK O_KPodr
O_KAUDb
O_Sum4 O_Sum6
F_Space1 F_Name F_Space2 HF_Sum4 HF_Sum6 F_Sum4 F_Sum6 F_Sum8 F_Sum12
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 ^ [^]
  Ш^ Ш
 Ш                                                                       Аналитическая ведомость по счету ^
                                                                       @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.if Filt
 ВПрименен фильтр... В
.{ An_Filters CheckEnter
 В   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ В
.{ An_Detail
 В     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ В
.}
.}
.end
.{
.[H
 Б──────────┬──────┬─────────────────────────────────────────────────────┬─────────────────────────────────────────────────────────────────────────────────────────────────────────────────
          │      │                  Корреспондирующий счет             │                                                    С у м м а
          │      ├────────┬─────────┬───────────────┬──────────────────┼─────────────────────────────────────┬─────────────────────────────────────┬─────────────────────────────────────
  Д а т а │ Номер│  Счет  │Субсчет  │               │                  │                Сальдо               │               Обороты               │               Сальдо
          │ доку-│        │         │ Подразделение │ Наименование КАУ │               входящее              │                                     │              исходящее
          │ мента│        │         │               │                  ├──────────────────┬──────────────────┼──────────────────┬──────────────────┼──────────────────┬──────────────────
          │      │        │         │               │                  │     Кредит(руб)  │     Кредит (вал) │   Кредит(руб)    │  Кредит(вал)     │   Кредит(руб)    │  Кредит(вал)
──────────┴──────┴────────┴─────────┴───────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴──────────────────┴────────────────── Б
.]H
.{ An_Header
 Б^ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ ^ Б
.}
.{ An_Oborot CheckEnter
@@@@@@@@@@ @@@@@@ @@@@@@@@ @@@@@@@@@  @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@                                       &#'&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&&
.}
.{  An_Footer CheckEnter
 Б^ Итого @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ ^         &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&& Б
.if Divider
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.}

.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnFrm_N
.{checkenter FeeSignersCycle_AnFrm_N
 Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д  __________________   Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                         подпись
.}
.else
.fields
BuhName
.endfields
Главный бухгалтер  ___________________   ^
                          подпись
.end
 Ш
.endform
!-------------------------------------------------------------------------------
.linkform 'AnFrm_N_TaxReg' prototype is 'AnFrm_N'
.nameinlist 'Аналитический регистр налогового учета'
.var
  MyOrg   :string;
  iKatOrg : KatOrg;
.endvar
.fields
CommonFormHeader PlanSchet_Capt
MyOrg
MainSchet MainPeriod
FilterTitle FilterName
H_Space1 H_Name
O_Dat
O_ObN        // номер документа
O_ObName     // наименование документа
O_ObSod      // содержание проводки
O_Sum1 O_Sum4
F_Space1 F_Name F_Space2 F_Sum1 F_Sum4
.endfields
.begin
  MyOrg := iKatOrg.GetKatOrgName(coGetTune('Myorg'), koOnTune);
end.
 Р^ [^]
^
                               БАналитический регистр налогового учета по счету ^ Б
                                  @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.if Filt
 ВПрименен фильтр... В
.{ An_Filters CheckEnter
 В  ^ В
.{ An_Detail
 В      ^ В
.}
.}
.end
.{
.[H
──────────┬──────┬───────────────────────────────┬───────────────────────────────────────────┬───────────────────────────────────────
          │Номер │             Тип               │               Содержание                  │         Сумма операции
  Дата    │доку- │          документа            │                операции                   ├───────────────────┬───────────────────
 операции │мента │                               │                                           │       дебет       │      кредит
          │      │                               │                                           │                   │
──────────┴──────┴───────────────────────────────┴───────────────────────────────────────────┴───────────────────┴───────────────────
.]H
.{ An_Header
 Б^ ^ Б
.}
.{ An_Oborot CheckEnter
@@@@@@@@@@ @@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &#'&&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&&&
.}
.{  An_Footer CheckEnter
 Б^ Итого по @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ ^  &'&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&& Б
.if Divider
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.end
.}
.}

.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_AnFrm_N
.{checkenter FeeSignersCycle_AnFrm_N
 Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д  __________________   Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                         подпись
.}
.else
.fields
BuhName
.endfields
Главный бухгалтер  ___________________   ^
                          подпись
.end
 Р
.endform
