//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
//------------------------------------------------------------------------------
// Галактика 5.0 - ФРО
// Обороты в разрезе структурных подразделений
//------------------------------------------------------------------------------
#include FeeSigners.frn

#doc
Базовая форма отчета "Обороты в разрезе структурных подразделений"
#end
.set name = 'oborstr'
.group 'oborstr_f1'
.nameinlist 'Базовая форма OborStr'
.hide
.var
   FrmUserName,
   MainBuhName : string;
.endvar
.fields
c0p1 c0p2 c0p3 c0p4 c0p5 c0p6 c0p7
cCurPS sCurPS
c1f1
c2f1 c2f2
c2p1
c3p1 c3p2 c3p3 c3p4 c3p5 c3p6 c3p7 c3p8 c3p8v c3p9 c3p9v
c3_p1 c3_p1v c3_p2 c3_p2v
c2_p1 c2_p1v c2_p2 c2_p2v
c1_p1 c1_p1v c1_p2 c1_p2v
#FeeSignersCycleFields
.endfields
.begin
  MainBuhName := sGetTune('MainBuh');
  FrmUserName    := sGetTune('User.Fio');
end.
c0p1    Счет N         ^
c0p2    Интервал начало  ^
c0p3             конец   ^
c0p4    Нац ДЕ (имя)   ^
c0p5    Нац ДЕ (симв)  ^
c0p6    Валюта отчетов (имя)   ^
c0p7    Валюта отчетов (симв)  ^
cCurPS  Текущий план счетов (nrec) ^
sCurPS  Текущий план счетов (имя)  ^
.if OkFilOstr
.{
c1f1 ^
.{
c2f1 ^
c2f2 ^
.}
.}
.end
.{
.{
c2p1    Подразделение      ^
.{
c3p1     дата         ^
c3p2     субсчет осн  ^
c3p3     N док        ^
c3p4     Плательщик/получатель  ^
c3p5     операция     ^
c3p6     кор счет     ^
c3p7     субсчет кор  ^
c3p8     обороты по дебету      ^
c3p8v                          ^
c3p9     обороты по кредиту     ^
c3p9v                          ^
.}
Сумма по подразделению
c3_p1     обороты по дебету      ^
c3_p1v                           ^
c3_p2     обороты по кредиту     ^
c3_p2v                           ^
.}
Сумма по субсчету
c2_p1     обороты по дебету      ^
c2_p1v                           ^
c2_p2     обороты по кредиту     ^
c2_p2v                           ^
.}
Итого по счету
c1_p1     обороты по дебету      ^
c1_p1v                           ^
c1_p2     обороты по кредиту     ^
c1_p2v                           ^
#FeeSignersCycle(OborStr)
.endform
!==============================================================================
.linkform 'oborstr_01' prototype is 'oborstr'
.group 'oborstr_f1'
.NameInList '1. Обороты в разрезе структурных подразделений'
.p 80
.defo portrait
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p2 c0p3 c0p4
sCurPS
c1f1
c2f1 c2f2
c2p1
c3p1 c3p2 c3p3 c3p4 c3p5 c3p6 c3p7 c3p8 c3p9
c3_p1  c3_p2
c2_p1  c2_p2
c1_p1  c1_p2
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Ш^
^
            БОборотная ведомость в разрезе структурных подразделений по счету ^ Б
            Б                        с ^ г.  по ^ г. Б
Ведомость сформирована в  Б^ Б
План счетов  Б^ Б
.if OkFilOstr
 БПрименен фильтр... Б
.{
   ^
.{
      ^ ^
.}
.}
.end
.{
.[h
                                                                                                             лист @np@
──────────┬─────┬─────────┬─────────────────────────────────┬──────────────────────────────┬─────────────┬─────────────────────────────────────────
          │Суб- │         │                                 │                              │Корреспонд.  │
          │счет │ Номер   │           Плательщик /          │          Содержание          ├──────┬──────┤                 Обороты
   ДАТА   │осн. │ доку-   │            Получатель           │           операции           │ Счет │ Суб- ├────────────────────┬────────────────────
          │ сч. │ мента   │                                 │                              │      │ счет │       Дебет        │       Кредит
──────────┴─────┴─────────┴─────────────────────────────────┴──────────────────────────────┴──────┴──────┴────────────────────┴────────────────────
.]h
.{
  БПодразделение: ^ Б
.{
@@@@@@@@@@ @@@@@  @@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@ @@@@@@ &#'&&&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&&&&
.}
 Б Сумма по подразделению                                                                                   &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& Б
 ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
 Б Сумма по субсчету                                                                                        &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& Б
 ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
 Б Итого по счету                                                                                           &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& Б
 ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_OborStr
.{checkenter FeeSignersCycle_OborStr
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
MainBuhName
FrmUserName
.endfields
 БГлавный бухгалтер Б       ^
 БОтветственный за выпуск Б ^
.end Ш
.endform
!==============================================================================
.linkform 'oborstr_02' prototype is 'oborstr'
.group 'oborstr_f2'
.NameInList '2. Обороты в разрезе структурных подразделений в валюте'
.p 80
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p2 c0p3 c0p6
c1f1
c2f1 c2f2
c2p1
c3p1 c3p2 c3p3 c3p4 c3p5 c3p6 c3p7 c3p8v c3p9v
c3_p1v  c3_p2v
c2_p1v  c2_p2v
c1_p1v  c1_p2v
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Ш^
^
            БОборотная ведомость в разрезе структурных подразделений по счету ^ Б
            Б                        с ^ г.  по ^ г. Б
 БВедомость сформирована в ^ Б
.if OkFilOstr
 БПрименен фильтр... Б
.{
   ^
.{
      ^ ^
.}
.}
.end
.{
.[h
                                                                                                             лист @np@
──────────┬─────┬─────────┬─────────────────────────────────┬──────────────────────────────┬─────────────┬─────────────────────────────────────────
          │Суб- │         │                                 │                              │Корреспонд.  │
          │счет │ Номер   │           Плательщик /          │          Содержание          ├──────┬──────┤                 Обороты
   ДАТА   │осн. │ доку-   │            Получатель           │           операции           │ Счет │ Суб- ├────────────────────┬────────────────────
          │ сч. │ мента   │                                 │                              │      │ счет │       Дебет        │       Кредит
──────────┴─────┴─────────┴─────────────────────────────────┴──────────────────────────────┴──────┴──────┴────────────────────┴────────────────────
.]h
.{
 Б Подразделение: ^ Б
.{
@@@@@@@@@@ @@@@@  @@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@ @@@@@@ &#'&&&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&&&&
.}
 Б Сумма по подразделению                                                                                   &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& Б
 ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
 Б Сумма по субсчету                                                                                        &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& Б
 ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
 Б Итого по счету                                                                                           &'&&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&&& Б
 ───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_OborStr
.{checkenter FeeSignersCycle_OborStr
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
MainBuhName
FrmUserName
.endfields
 БГлавный бухгалтер Б       ^
 БОтветственный за выпуск Б ^
.end Ш
.endform
!==============================================================================
.linkform 'oborstr_03' prototype is 'oborstr'
.group 'oborstr_f3'
.NameInList '1. Обороты в разрезе структурных подразделений в НДЕ и валюте'
.p 60
.defo landscape
.nonextheader
.var
  MyOrg   :string;
  oHistory : iOldHistory;
.endvar
.fields
CommonFormHeader
MyOrg
c0p1 c0p2 c0p3
c1f1
c2f1 c2f2
c0p5 c0p7 c0p5 c0p7
c2p1
c3p1 c3p2 c3p3 c3p4 c3p5 c3p6 c3p7 c3p8 c3p8v c3p9 c3p9v
c3_p1  c3_p1v  c3_p2  c3_p2v
c2_p1  c2_p1v  c2_p2  c2_p2v
c1_p1  c1_p1v  c1_p2  c1_p2v
.endfields
.begin
  MyOrg := oHistory.sGetField(coKatOrg, coGetTune('Myorg'), 'REP.KATORGNAME', StrToDate(c0p3,'DD/MM/YYYY'));
end.
 Р^
^
            БОборотная ведомость в разрезе структурных подразделений по счету ^ Б
            Б                        с ^ г.  по ^ г. Б
.if OkFilOstr
 БПрименен фильтр... Б
.{
   ^
.{
      ^ ^
.}
.}
.end
──────────┬─────┬───────┬─────────────────────────────────┬──────────────────────────┬──────────┬───────────────────────────────────────┬───────────────────────────────────────
          │Суб- │       │                                 │                          │Корреспон.│                                       │
          │счет │ Номер │           Плательщик /          │         Содержание       ├─────┬────┤           Обороты по дебету           │            Обороты по кредиту
   ДАТА   │осн. │ доку- │            Получатель           │          операции        │ Счет│Суб-├───────────────────┬───────────────────┼───────────────────┬───────────────────
          │ сч. │ мента │                                 │                          │     │счет│      в @@@@@@     │      в @@@@@@     │     в @@@@@@      │     в @@@@@@
──────────┴─────┴───────┴─────────────────────────────────┴──────────────────────────┴─────┴────┴───────────────────┴───────────────────┴───────────────────┴───────────────────
.{
.{
 Б Подразделение: ^ Б
.{
@@@@@@@@@@ @@@@@  @@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@ @@@@ &#'&&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&&& &#'&&&&&&&&&&&&&&&&
.}
 Б Сумма по подразделению                                                                          &'&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&& Б
 ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
 Б Сумма по субсчету                                                                               &'&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&& Б
 ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.}
 Б Итого по счету                                                                                  &'&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&& &'&&&&&&&&&&&&&&&&& Б
 ────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.fields
if(Подписант_Роль <> '', Подписант_Роль, Подписант_должность)
Подписант_ФИО
.endfields
.if ExistFeeSigners_OborStr
.{checkenter FeeSignersCycle_OborStr
 Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б                            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
----------------------------------     --------------------   -----------------------------------------------------
             (должность)                    (подпись)                        (расшифровка подписи)

.}
.else
.fields
MainBuhName
FrmUserName
.endfields
 БГлавный бухгалтер Б       ^
 БОтветственный за выпуск Б ^
.end Ш
.endform
!==============================================================================
