//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 7.12 - Спецодежда
// Протокол пакетного формирования требований
//------------------------------------------------------------------------------

#doc
Протокол пакетного формирования требований из отчета "Анализ потребности в СФО".<br>
#end
.Form ProtocolSFO
.Fields
  Head
  TypeError
  ErrorStr
.EndFields
^
.{
^ ^
.}
.EndForm
