//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.50 - Бухгалтерский контур
// Реестр переданных на инкассо платежных документов
//------------------------------------------------------------------------------

#doc
Реестр переданных на инкассо платежных документов
#end
.set name = 'PrReePlI'
.nameinlist 'Базовая форма'
.hide
.fields
  RNom  RDate
  Post  PostBank 
  RKol  RSum  RSumStr
.endfields
.var
  NPP : LongInt
.endVar
  ^  ^
  ^  ^
  ^  ^  ^
.begin
  NPP := 0
end.
.{
.begin
  NPP := NPP + 1;
end.
.fields
  Prizn  DNom  DDate  DocSum  PlatBIK  PlatSchet 
.endfields
  ^  ^  ^  ^  ^  ^
.}
.endform

//-------------------------------------------------------------------------

.linkform 'PrReePlI_01' prototype is 'PrReePlI'
.group 'Реестр переданных на инкассо платежных документов ЦБРФ'
.fields
  ' '+RNom+' '  ' '+RDate+' '
  GroupWrap(Post, 1, 63)
  GroupWrap(Post, 2, 63)
  GroupWrap(PostBank, 1, 67)
  GroupWrap(PostBank, 2, 67)
  RKol  RSum  RSumStr
.endfields
 И  

                                                                                ┌───────┐
                                                                                │0401014│
                                                                                └───────┘

                                            БРЕЕСТР
                         ПЕРЕДАННЫХ НА ИНКАССО РАСЧЕТНЫХ ДОКУМЕНТОВ Б

                               N  Д^ Д от  Д^ Д

   Поставщик (взыскатель)  Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д

    Д                       @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д

   Обслуживающий банк  Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д

    Д                   @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д

   Представляем на инкассо платежные документы в количестве                Д@~@@@@@@@@@@@@ Д

   на сумму  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д

   Сумма прописью  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д

.{
.[h
   ┌───┬───┬─────────────────┬──────────────┬────────────────────┬──────────────────────┐
   │ N │Вид│     N и дата    │     Сумма    │      БИК банка     │   Счет плательщика   │
   │п/п│оп.│    документа    │   документа  │     плательщика    │                      │
   ├───┼───┼─────────────────┼──────────────┼────────────────────┼──────────────────────┤
   │ 1 │ 2 │        3        │       4      │         5          │         6            │
   ├───┼───┼─────────────────┼──────────────┼────────────────────┼──────────────────────┤
.]h
.fields
  NPP  Prizn  dNom  DDate  DocSum  PlatBIK  PlatSchet
.endfields
   │@@@│&&&│@@@@@@ @@@@@@@@@@│&#'&&&&&&&&&&&│@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@│
.[f
   └───┴───┴─────────────────┴──────────────┴────────────────────┴──────────────────────┘
.]f
.}
 
                                               Подписи                     Отметки банка

            
                 М.П.        ─────────────────────────


                             ─────────────────────────
             И
.endForm


