//------------------------------------------------------------------------------
//                                                      (c) Корпорация ГАЛАКТИКА
// Галактика 8.1 - Бухгалтерский контур
// Каталог признаков собственности
//------------------------------------------------------------------------------
#doc
  Форма для печати каталога признаков собственности
#end
.set name = 'PrSb'
.NameInList ' Каталог признаков собственности ОС(НМА) базовая форма '
.hide
.fields
  КОД1 НАИМЕНОВАНИЕ1
  КОД2 НАИМЕНОВАНИЕ2
.endfields

.{ CheckEnter
.case
.when PrSbMaster
^^
.when PrSbSlave
^^
.end
.}
.endform

!------------------------------------------------------------------------------------------------------------------------------------------------------
.linkform 'PrSb_01' prototype is 'PrSb'
.NameInList ' Каталог признаков собственности ОС(НМА) '
.fields
 CommonFormHeader
  КОД1 НАИМЕНОВАНИЕ1
  КОД2 НАИМЕНОВАНИЕ2
.endfields
.[H Skip
                                                                           лист @np@
──────────┬──────────────────────────────────────────────────────────────────────────
    Код   │             Наименование
──────────┼──────────────────────────────────────────────────────────────────────────
.]H
^
                    Б Каталог признаков собственности ОС(НМА) Б
                                                                           лист @np@
──────────┬──────────────────────────────────────────────────────────────────────────
    Код   │             Наименование
──────────┼──────────────────────────────────────────────────────────────────────────
.{ CheckEnter
.case
.when PrSbMaster
 Б@@@@@@@@@@ Б│  Б@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Б
.when PrSbSlave
@@@@@@@@@@│ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.end
.}
.endform

