/*
╔═════════════════════════════════════════════════════════════╗
║             (c) 1994-2001  Корпорация ГАЛАКТИКА             ║
║ Проект:     Галактика                                       ║
║ Система:    Производственный контур                         ║
║ Версия:     7.1                                             ║
║ Назначение: Акт на брак                                     ║
║ Автор:      Сахаров С.А.                                    ║
║ Параметры:  Есть                                            ║
║ Изменения:                                                  ║
╚═════════════════════════════════════════════════════════════╝
*/
.set name = 'aktbrak'
.hide
.fields

 Номер_акта
 Дата
 Наименование
 Накладная
 Заказ
 Подразделение

  Тип_объекта
  Составл_акта
  Подразделение1
  Причина
  Виновник
  Ед_изм
  Кол_брака
  Кол_годных

.endfields

 ^ ^ ^ ^ ^ ^
.{
 ^ ^ ^ ^ ^ ^ ^ ^
.}


.endform

.linkform 'aktbrak_01' prototype is 'aktbrak'
.NameInList ' Акт на брак'
.fields
CommonFormHeader

 Номер_акта
 Дата
 Наименование
 Накладная
 Заказ
 Подразделение

  Тип_объекта
  Составл_акта
  Подразделение1
  Причина
  Виновник
  Ед_изм
  Кол_брака
  Кол_годных

.endfields
^
               Акт на брак № @@@@@@@@@@@@@ от @@@@@@@@@@@
           @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
           по  накладной @@@@@@@@@@@@  заказу  @@@@@@@@@@@@@@
           в подразделении  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

───────┬─────────────────────────┬───────────────┬──────────────────┬───────────┬─────────┬───────────────┬──────────────
  Тип  │    Составляющая         │ Подразделение │     Причина      │ Виновник  │ Единица │  Количество   │  Количество
объекта│        акта             │               │                  │           │измерения│    брака      │    годных
───────┴─────────────────────────┴───────────────┴──────────────────┴───────────┴─────────┴───────────────┴──────────────
.{
 @@@@@  @@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@ &'&&&&&&&&&&.&& &'&&&&&&&&&.&&
.}
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.endform

.LinkForm 'AKTBRAK_01' Prototype is aktbrak
.NameInList 'Акт на брак'
.fields
  CommonFormHeader

 Номер_акта
 Дата
 Наименование
 Накладная
 Заказ
 Подразделение

  Тип_объекта
  Составл_акта
  Подразделение1
  Причина
  Виновник
  Ед_изм
  Кол_брака
  Кол_годных

.endfields
^
               Акт на брак № @@@@@@@@@@@@@ от @@@@@@@@@@@
           @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
           по  накладной @@@@@@@@@@@@  заказу  @@@@@@@@@@@@@@
           в подразделении  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

───────┬─────────────────────────┬───────────────┬──────────────────┬───────────┬─────────┬───────────────┬──────────────
  Тип  │    Составляющая         │ Подразделение │     Причина      │ Виновник  │ Единица │  Количество   │  Количество
объекта│        акта             │               │                  │           │измерения│    брака      │    годных
───────┴─────────────────────────┴───────────────┴──────────────────┴───────────┴─────────┴───────────────┴──────────────
.{
 @@@@@  @@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@ &'&&&&&&&&&&.&& &'&&&&&&&&&.&&
.}
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
.endform