/*
 ╔════════════════════════════════════════════════════════════════════════════╗
 ║                     (c) Корпорация ГАЛАКТИКА, 1996,97                      ║
 ║ Проект        : ГАЛАКТИКА                                                  ║
 ║ Система       : Оперативный контур                                         ║
 ║ Версия        : 5.73                                                       ║
 ║ Назначение    : Отчет от отпущенных МЦ в производство с учет. партий       ║
 ║                  (дооценка)                                                ║
 ║ Ответственный : Зайцев Александр Владимирович (AXE)                        ║
 ╚════════════════════════════════════════════════════════════════════════════╝
*/
.set name = 'Doocprn'
.hide
.fields
  dateStart dateRec
  dateparty1 dateparty2
  mc bar edizm kol cenaspis stoimspis dateparty nameparty cenaparty stiomparty summadop prim
  summaspis summaparty summadopall
.endfields
^ ^
^ ^
.{
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
^ ^ ^
.endform
.linkform 'Doocprn_1' prototype is 'Doocprn'
.NameInList 'Отчет от отпущенных МЦ в производство с учет. партий'
.fields
  dateStart dateRec
  dateparty1 dateparty2
  mc bar edizm kol cenaspis stoimspis dateparty nameparty cenaparty stiomparty summadop prim
  summaspis summaparty summadopall
.endfields

      БОтчет об отпущенных МЦ в производство за период с: Б @@@@@@@@@@@@@@@@  Бпо: Б @@@@@@@@@@@@@@@@@@
            Би партий поступления за период с: Б @@@@@@@@@@@@@@@@  Бпо: Б @@@@@@@@@@@@@@@@

 Р─────────────────────────┬──────────┬──────────┬──────────────┬─────────────┬────────────┬──────────────┬─────────────┬────────────┬──────────────┬─────────────┬────────────┐
                         │          │          │              │             │            │     Дата     │             │    Цена    │  Стоимость   │             │            │
   Наименование МЦ       │ Номенкл. │  Ед.изм. │  Количество  │    Цена     │  Стоимость │ максимальной │ Наименование│ за единицу │   по цене    │   Сумма     │ Примечание │
                         │  номер   │          │              │             │            │    партии    │   партии    │   партии   │   партии     │  дооценки   │            │
─────────────────────────┼──────────┼──────────┼──────────────┼─────────────┼────────────┼──────────────┼─────────────┼────────────┼──────────────┼─────────────┼────────────┤ Р
.{
 Р@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@│@@@@@@@@@@│&'&&&&&&&.&&&&│&'&&&&&&&&.&&│&'&&&&&&&.&&│@@@@@@@@@@@@@@│@@@@@@@@@@@@@│&'&&&&&&&.&&│&'&&&&&&&&&.&&│&'&&&&&&&&.&&│@@@@@@@@@@@@│ Р
.}
 С─────────────────────────┼──────────┼──────────┼──────────────┼─────────────┼────────────┼──────────────┼─────────────┼────────────┼──────────────┼─────────────┼────────────┤
      ИТОГО:             │          │          │              │             │&'&&&&&&&.&&│              │             │            │&'&&&&&&&&&.&&│&'&&&&&&&&.&&│            │
─────────────────────────┴──────────┴──────────┴──────────────┴─────────────┴────────────┴──────────────┴─────────────┴────────────┴──────────────┴─────────────┴────────────┘ С
.endform