//********************************************************************************
//                                                        (c) корпорация Галактика
// Галактика 7.12 - Управление производственной логистикой
// Групповые отчеты по производственным заказам
//********************************************************************************

//=== МАТЕРИАЛЬНЫЙ ОТЧЕТ ===

.set name = 'GrMatOtZk'
.hide
.fields
  dateRec dateEnd      //1,2
  hdr                  //3
	nacenka : Double     //31
  zk_nrec              //4
  zk_number zk_name zk_date //5,6,7
  podr                 //8
//---
  izd sizd izdkol      //9,10,11
  mc bar gr typ        //12,13,14,15
  vhost svhost :Double //16,17
  ost sost :Double     //18,19
  res sres :Double     //20,21
//---
 prodcena
 calccena
 prodstoim
 calcstoim
 otklon
//---
 sumprod
 sumcalc
 sumotklon
 sumvhost
 sumprih
 sumperer
//---
  sItogo stN stP stO   //22,23,24,25
  sEndPos              //26
.endfields

^ ^
^
^
.{
^
^ ^ ^
.{
^
.if GIzd_OT_0
.{
^ ^ ^
.}
.end
.{
^ ^ ^ ^
^ ^ ^ ^ ^ ^
.}
.if Cena_Yes_0
 ^ ^
 ^ ^ ^
.end
.}
.if Cena_Yes_1
 ^ ^ ^
 ^ ^ ^
.end
^ ^ ^ ^
^
.}
.endform

.linkform 'GrMatOtZk_01' prototype is 'GrMatOtZk'
.NameInList 'Материальный отчет (кол-во)'
.Group 'MatOtch'

.fields
  dateRec dateEnd           //1,2
  hdr                       //3
  zk_number zk_name zk_date //5,6,7
  podr                      //8
//---
  izd sizd izdkol:'P:R'     //9,10,11
  mc bar gr typ             //12,13,14,15
  vhost svhost ost sost res sres //16,17,18,19,20,21
  sItogo stN stP stO        //22,23,24,25
  sEndPos                   //26
.endfields

                   БМАТЕРИАЛЬНЫЙ ОТЧЕТ Б
                      в период
           с: @@@@@@@@@@@@@@@@ по: @@@@@@@@@@@@@@@@@@
           ^
 С────────────────────────────┬───────────────┬────────────────────┬─────────────┬───────────────────┬───────────────┬─────────────────
       Наименование         │ Кол-во        │ Стоимость          │  Кол-во     │ Стоимость         │ Отклонение    │ Отклонение
         сырья              │ по норме      │                    │  по факту   │                   │ (количество)  │ (стоимость)
────────────────────────────┴───────────────┴────────────────────┴─────────────┴───────────────────┴───────────────┴───────────────── С
.{
 Й ^ ^ ^ Й
.{
 Й   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Й
.if GIzd_OT_0
.{
 Л      @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@ Л
.}
.end
.{
 Р @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                           &'&&&&&&&&&&&.&&& &'&&&&&&&&&&&&&&&.&& &'&&&&&&&.&&& &'&&&&&&&&&&&&&&.&& &'&&&&&&&&&.&&& &'&&&&&&&&&&&&.&& Р
.}
.if Cena_Yes_0
.end
.}
.if Cena_Yes_1
.end
  С@@@@@@@@@                             &'&&&&&&&&&&&&&&&&&&&&.&&         &'&&&&&&&&&&&&&&&&&&&&.&&         &'&&&&&&&&&&&&&&&&&&&&.&& С
 С@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ С
.}
.endform

.linkform 'GrMatOtZk_02' prototype is 'GrMatOtZk'
.NameInList 'Материальный отчет (со стоимостью МЦ)'
.Group 'MatOtch'

.fields
  dateRec dateEnd           //1,2
  hdr                       //3
  zk_number zk_name zk_date //5,6,7
  podr                      //8
//---
  izd sizd izdkol:'P:R'     //9,10,11
  mc bar gr typ             //12,13,14,15
  vhost svhost ost sost res sres //16,17,18,19,20,21
//---
 prodcena
 calccena
 prodstoim
 calcstoim
 otklon
//---
 sumprod
 sumcalc
 sumotklon
 sumvhost
 sumprih
 sumperer
//---
  sEndPos                   //26
.endfields

                   БМАТЕРИАЛЬНЫЙ ОТЧЕТ Б
                      в период
           с: @@@@@@@@@@@@@@@@ по: @@@@@@@@@@@@@@@@@@
           ^
 С────────────────────────────┬───────────────┬────────────────────┬─────────────┬───────────────────┬───────────────┬─────────────────
       Наименование         │ Кол-во        │ Стоимость          │  Кол-во     │ Стоимость         │ Отклонение    │ Отклонение
         сырья              │ по норме      │                    │  по факту   │                   │ (количество)  │ (стоимость)
────────────────────────────┴───────────────┴────────────────────┴─────────────┴───────────────────┴───────────────┴───────────────── С
.{
 Й ^ ^ ^ Й
.{
 Й   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Й
.if GIzd_OT_0
.{
 Л      @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@@ Л
.}
.end
.{
 Р @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                           &'&&&&&&&&&&&.&&& &'&&&&&&&&&&&&&&&.&& &'&&&&&&&.&&& &'&&&&&&&&&&&&&&.&& &'&&&&&&&&&.&&& &'&&&&&&&&&&&&.&& Р
.}

.if Cena_Yes_0
 Р Цена изделия: продажная &'&&&&&&&&&&&&&&&&.&& по калькуляции &'&&&&&&&&&&&&&&&&.&&
 Стоимость:    продажная &'&&&&&&&&&&&&&&&&.&& по калькуляции &'&&&&&&&&&&&&&&&&.&&  Отклонение &'&&&&&&&&&&&&&&&&.&& Р
.end

.}

.if Cena_Yes_1
 С Стоимость:    продажная &'&&&&&&&&&&&&&&&&.&& по калькуляции &'&&&&&&&&&&&&&&&&.&&  Отклонение &'&&&&&&&&&&&&&&&&.&&
 Стоимость норма/факт:                 &'&&&&&&&&&&&&&&&&&&&&.&&         &'&&&&&&&&&&&&&&&&&&&&.&&         &'&&&&&&&&&&&&&&&&&&&&.&& С
.end
 С@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ С
.}
.endform

//=== ДВИЖЕНИЕ, ВЫПУСК ИЗДЕЛИЙ ===

.set name = 'GrDvigZk'
.hide
.fields
  dateRec dateEnd            //1,2
  hdr                        //3
  zk_nrec                    //4
  zk_number zk_name zk_date  //5,6,7
  podr                       //8
//---
  izd sizd izdkol            //9,10,11
  mc bar gr typ              //12,13,14,15
  sEd                        //16
	potrM                      //24
  vhost svhost ost sost res sres :Double  //17,18,19,20,21,22
  sEndPos                    //23
.endfields
^ ^
^
.{
^
^ ^ ^
.{
^
.if GIzd_OT_1
.{
^ ^ ^
.}
.end
.{
^ ^ ^ ^
^
^
^ ^ ^ ^ ^ ^
.}
.}
^
.}
.endform
.linkform 'GrDvigZk_01' prototype is 'GrDvigZk'
.NameInList 'Отчет движения сырья по заказам (кол-во).'
.Group 'Dvig'
.fields
  dateRec dateEnd            //1,2
  hdr                        //3
  zk_number zk_name zk_date  //5,6,7
  podr                       //8
//---
  izd sizd izdkol:'P:R'      //9,10,11
  mc bar gr typ              //12,13,14,15
  potrM vhost svhost ost sost res sres //24,17,18,19,20,21,22
  sEndPos                    //23
.endfields


               БОТЧЕТ О ДВИЖЕНИИ СЫРЬЯ Б
                     в период
           с: @@@@@@@@@@@@@@@@ по: @@@@@@@@@@@@@@@@@@
           ^
 С─────────────────────────────┬───────────────┬───────────────┬───────────────┬───────────────┬───────────────┬───────────────┬───────────────┬
       Наименование          │     по        │  входящий     │  отпущено     │ переработано  │  перемещено   │  возвращено   │  исходящий    │
         сырья               │    норме      │   остаток     │               │               │               │               │   остаток     │
─────────────────────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴───────────────┴ С
.begin
end.
.{
 Й ^ ^ ^ Й
.begin
end.
.{
 Й   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Й
.if GIzd_OT_1
.{
 Л        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@@ Л
.}
.end
.{
 Р@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                              &'&&&&&&&&.&&&& &'&&&&&&&&.&&&& &'&&&&&&&&.&&&& &'&&&&&&&&.&&&& &'&&&&&&&&.&&&& &'&&&&&&&&.&&&& &'&&&&&&&&.&&&& Р
.begin
end.
.}
.}
.fields
.endfields
 С@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ С
.}
.endform

.linkform 'GrDvigZk_02' prototype is 'GrDvigZk'
.NameInList 'Отчет о выпуске изделий по заказам (кол-во).'
.Group 'Gotovaya'
.fields
  dateRec dateEnd             //1,2
  hdr                         //3
  zk_number zk_name zk_date   //5,6,7
  podr                        //8
//---
  izd sizd izdkol:'P:R'       //9,10,11
  mc bar gr typ               //12,13,14,15
  sEd                         //16
  vhost svhost ost sost res sres  //17,18,19,20,21,22
  sEndPos                     //23
.endfields

               БОТЧЕТ О ВЫПУСКЕ ГОТОВОЙ ПРОДУКЦИИ Б
                        в период
           с: @@@@@@@@@@@@@@@@ по: @@@@@@@@@@@@@@@@@@
           ^
 С────────────────────────────────┬─────────────────┬─────────────────────────────────────┬─────────────────────┬
       Наименование             │  План по заказу │                 Выпущено            │ Осталось выпустить  │
         изделия                │─────────────────│─────────────┬────────────────┬──────│──────────────┬──────│
                                │     Кол-во      │    Кол-во   │     Сумма      │  %   │    Кол-во    │  %   │
────────────────────────────────┴─────────────────┴─────────────┴────────────────┴──────┴──────────────┴──────┴ С
.begin
end.
.{
 Й ^ ^ ^ Й
.begin
end.
.{
 Й   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Й
.if GIzd_OT_1
.{
 Л        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@ @@@@@@@@@@@@ Л
.}
.end
.begin
end.
.{
 Р@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ Р
 Т@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&.&&&& &'&&&&&&&&.&&&& &'&&&&&&&&&.&&&& &&&.&& &'&&&&&&&.&&&& &&&.&& Т
.}
.}
 С@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ С
.}
.endform

//=== ОТПУСК, ПЕРЕРАБОТКА ===

.set name = 'GrOtpZk'
.hide
.fields
  dateRec dateEnd    //1,2
  hdr                //3
  zk_nrec            //4
  zk_number zk_name zk_date //5,6,7
  podr               //8
//---
  izd sizd izdkol    //9,10,11
  mc bar gr typ      //12,13,14,15
  normaO :Double     //16a
  normaK :Double     //16
  normaS :Double     //17
  OtpuskK :Double    //18
  otpuskS :Double    //19
  otpuskPr :Double   //20
  OstatokK :Double   //21
  OstatokS :Double   //22
  OstatokPr :Double  //23
  NalSklK :Double    //24
  NalSklPr :Double   //25   процент наличия на складах от кол-ва в цехе
  NalSklPrO:Double   //25a  процент наличия на складах от общего
  DozakK :Double     //26
  DozakPr :Double    //27
  sEndPos            //28
.endfields
^ ^
^
.{
^
^ ^ ^
.{
^
.if GIzd_OT_2
.{
^ ^ ^
.}
.end
.{
^ ^ ^ ^
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
.}
^
.}
.endform
.linkform 'GrOtpZk_01' prototype is 'GrOtpZk'
.NameInList 'Отчет о кол-ве отпущенного сырья по заказам (кол-во).'
.Group 'Otpusk'
.fields
  dateRec dateEnd              //1,2
  hdr                          //3
  zk_number zk_name zk_date    //5,6,7
  podr                         //8
//---
  izd sizd izdkol:'P:R'        //9,10,11
  mc bar gr typ                //12,13,14,15
  normaO normaK:'P:L' normaS OtpuskK otpuskS otpuskPr OstatokK OstatokS OstatokPr NalSklK NalSklPr NalSklPrO:'P:L' DozakK DozakPr  //16a,16,17,18,19,20,21,22,23,24,25,25a,26,27
  sEndPos                      //28
.endfields

                  БОТЧЕТ О КОЛИЧЕСТВЕ ОТПУЩЕННОГО СЫРЬЯ Б
                              в период
                 с: @@@@@@@@@@@@@@@@ по: @@@@@@@@@@@@@@@@@@
                 ^
 С─────────────────────────────┬───────────────────────────────┬──────────────────────────────────────┬──────────────────────────────────────┬──────────────────────┬──────────────────────┬
       Наименование          │          Норма расхода        │                Отпущено              │         Осталось отпустить           │  Наличие на складах  │      Дозакупить      │
         сырья               │───────────────┬───────────────│───────────────┬───────────────┬──────│───────────────┬───────────────┬──────│──────────────┬───────│───────────────┬──────│
                             │    Кол-во     │  Стоимость    │    Кол-во     │  Стоимость    │  %   │    Кол-во     │  Стоимость    │  %   │    Кол-во    │   %   │    Кол-во     │  %   │
─────────────────────────────┴───────────────┴───────────────┴───────────────┴───────────────┴──────┴───────────────┴───────────────┴──────┴──────────────┴───────┴───────────────┴──────┴ С
.begin
end.
.{
 Й ^ ^ ^ Й
.begin
end.
.{
 Й   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Й
.if GIzd_OT_2
.{
 Л        @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@ @@@@@@@@@@@@ Л
.}
.end
.{
.begin
OtpuskPr:=OtpuskK/NormaK*100
OstatokK:=NormaO-OtpuskK
OstatokS:=NormaS-OtpuskS
OstatokPr:=100-OtpuskK/NormaO*100
NalSklPr:=NalSklK/NormaO*100
NalSklPrO:=NalSklK/NormaK*100
DozakPr:=DozakK/NormaO*100
end.
 Р@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
                              &&&&&.&/&&&&&.& &'&&&&&&&&.&&&& &'&&&&&&&&.&&&& &'&&&&&&&&.&&&& &&&.&& &'&&&&&&&&.&&&& &'&&&&&&&&.&&&& &&&.&& &'&&&&&&&.&&&& &&&/&&& &'&&&&&&&&.&&&& &&&.&& Р
.}
.}
 С@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ С
.}
.endform

.linkform 'GrOtpZk_02' prototype is 'GrOtpZk'
.NameInList 'Отчет о кол-ве переработанного сырья по заказам (кол-во).'
.Group 'Pererab'
.fields
  dateRec dateEnd            //1,2
  hdr                        //3
  zk_number zk_name zk_date  //5,6,7
  podr                       //8
//---
  izd sizd izdkol:'P:R'      //9,10,11
  mc bar gr typ              //12,13,14,15
  normaK normaS OtpuskK otpuskS otpuskPr //16,17,18,19,20
  sEndPos                    //28
.endfields

                  БОТЧЕТ О КОЛИЧЕСТВЕ ПЕРЕРАБОТАННОГО СЫРЬЯ Б
                              в период
                 с: @@@@@@@@@@@@@@@@ по: @@@@@@@@@@@@@@@@@@
                 ^
 С─────────────────────────────┬───────────────┬──────────────────────┬──────────────────────┬
       Наименование          │ Норма расхода │     Переработано     │    Неизрасходовано   │
         сырья               │───────────────│───────────────┬──────│───────────────┬──────│
                             │    Кол-во     │    Кол-во     │  %   │    Кол-во     │  %   │
─────────────────────────────┴───────────────┴───────────────┴──────┴───────────────┴──────┴ С
.begin
end.
.{
 Й ^ ^ ^ Й
.begin
end.
.{
 Й   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Й
.if GIzd_OT_2
.{
 Л     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@@ Л
.}
.end
.{
 Р@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@
                              &'&&&&&&&&.&&&& &'&&&&&&&&.&&&& &&&.&& &'&&&&&&&&.&&&& &&&.&& Р
.}
.}
 С@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ С
.}
.endform
