//********************************************************************************
//                                                        (c) корпорация Галактика
// Галактика 7.12 - Управление производственной логистикой
// Печать накладной на внутреннее перемещение
//********************************************************************************

.set name = 'printinmovnak2'
!.hide
.var
  God :String[4];
  KolZnak :String;
.endvar
.begin
  God :=DateToStr(Cur_Date, 'YYYY');
end.
.fields
 НрекДокумента
 Nom
 Дескриптор
 Номер_с_дескриптором
 Организация
 УНН
 ОКПО
 Dat:date
 ДатаДень
 ДатаМесяц
 ДатаГод
 Примечание
 To
 From
 Назначение
 Дов_Лицо
 МОЛ_Откуда
 МОЛ_Куда
 МОЛ_Откуда_Должность
 МОЛ_Куда_Должность
   мой_ИМЯ
   мой_УНН
   мой_ОКПО
   мой_Адрес
   мой_БАНК_Имя
   мой_БАНК_Счет
   мой_БАНК_Мфо


  Грузоотправительт
  Грузоотправитель_УНН
  Грузоотправитель_ОКПО
  Грузоотправитель_Адрес
  Грузоотправитель_БАНК_Имя
  Грузоотправитель_БАНК_Счет
  Грузоотправитель_БАНК_Мфо

  Грузополучатель
  Грузополучатель_УНН
  Грузополучатель_ОКПО
  Грузополучатель_Адрес
  Грузополучатель_БАНК_Имя
  Грузополучатель_БАНК_Счет
  Грузополучатель_БАНК_Мфо
#include ttn_prn.pro

  Кол_число_знаков :word

!.{
 НрекПозиции
 Npp
 NomMC
 NameMC
 ТНВЭД
 Масса:double
 Брутто:double
 Объем:double
 SizeX:double
 SizeY:double
 SizeZ:double
 Ресурс_хранения
 Код_группы
 Название_группы
 ed
 EDUCH
 KOEF:double
 Партия
 Кол_Док
 kol:double
 price:double
 vprice:double
 sim1
 sumpr:double
 vsumpr:double
 sim2
 Сум_БН:double
 СумВ_БН:double
 priceuch:double
 vpriceuch:double
 аттр1
 аттр2
 аттр3
 аттр4
 аттр5
 аттр1_МЦ
 аттр2_МЦ
 аттр3_МЦ
 аттр4_МЦ
 аттр5_МЦ
!******************************************************
#ifdef _MOVENAKL_
  Налог1Р:double Налог1В:double
  Налог2Р:double Налог2В:double
  Налог3Р:double Налог3В:double
  Налог4Р:double Налог4В:double
  Налог5Р:double Налог5В:double
  Налог6Р:double Налог6В:double
  Налог_прочие_Р:double Налог_прочие_В:double
  ЦНакБН:double ЦНацБН:double ЦВалБН:double ЦНакБНУч:double ЦНацБНУч:double ЦВалБНУч:double
  ЦНакСН:double ЦНацСН:double ЦВалСН:double ЦНакСНУч:double ЦНацСНУч:double ЦВалСНУч:double
  ставка_первого_налога:double
  ЦНДСНак:double ЦАкцизНак:double ЦНПродНак:double ЦНАЛНак:double
  ЦНДСНац:double ЦАкцизНац:double ЦНПродНац:double ЦНАЛНац:double
  ЦНДСВал:double ЦАкцизВал:double ЦНПродВал:double ЦНАЛВал:double
  СтНакБН:double СтНацБН0:double СтВалБН:double СтНакСН:double СтНацСН0:double СтВалСН:double
  СтНДСНак:double СтАкцизНак:double СтНПродНак:double СтНАЛНак:double
  СтНДСНац0:double СтАкцизНац:double СтНПродНац:double СтНАЛНац:double
  СтНДСВал:double СтАкцизВал:double СтНПродВал:double СтНАЛВал:double
  ПрНДС:double ПрАкциз:double ПрНПрод:double ПрНАЛ:double
#end
!******************************************************
!.}
 Sum:double
 VSum:double
 Sim3
 Count:integer
 Sdat
 Prin

 НОМЕРДОВ
 ДАТАДОВ:date
 ДОВЕРЛИЦО
  СпТТН_ПунктР_Дата_С
  СпТТН_ПунктР_Время_С
  СпТТН_ПунктР_Дата_По
  СпТТН_ПунктР_Время_По

  СпТТН_ПунктР_Орг_Имя
  СпТТН_ПунктР_Орг_Тип
  СпТТН_ПунктР_Орг_Адрес
  СпТТН_ПунктР_Орг_ОКПО
  СпТТН_ПунктР_Орг_ОКОНХ
  СпТТН_ПунктР_Орг_ТЕЛ
  СпТТН_ПунктР_Орг_СТРАНА_КОД
  СпТТН_ПунктР_Орг_СТРАНА_ИМЯ
  СпТТН_ПунктР_Орг_СТРАНА_НАЛОГИ
  СпТТН_ПунктР_Орг_ГОРОД_КОД
  СпТТН_ПунктР_Орг_ГОРОД_ИМЯ
  СпТТН_ПунктР_Орг_ГОРОД_ТЕЛ
  СпТТН_ПунктР_Орг_ГОРОД_СТРАНА_КОД
  СпТТН_ПунктР_Орг_ГОРОД_СТРАНА_ИМЯ
  СпТТН_ПунктР_Орг_ГОРОД_СТРАНА_НАЛОГИ
  СпТТН_ПунктР_Орг_КОРПОРАЦИЯ
  СпТТН_ПунктР_Орг_УНН
  СпТТН_ПунктР_Орг_БАНК_Имя
  СпТТН_ПунктР_Орг_БАНК_Комментарий
  СпТТН_ПунктР_Орг_БАНК_Адрес
  СпТТН_ПунктР_Орг_БАНК_Мфо
  СпТТН_ПунктР_Орг_БАНК_Ркц
  СпТТН_ПунктР_Орг_БАНК_Счет
  СпТТН_ПунктР_Орг_БАНК_Счет_Ркц
  СпТТН_ПунктР_Орг_БАНК_Счет_Плат
  СпТТН_ПунктР_Орг_БАНК_Тип_Счета
  СпТТН_ПунктР_Орг_БАНК_Вид_Счета

  СпТТН_ПунктР_Доп_Имя
  СпТТН_ПунктР_Доп_Колич
  СпТТН_ПунктР_Доп_Время

  СпТТН_ПунктП_Дата_С
  СпТТН_ПунктП_Время_С
  СпТТН_ПунктП_Дата_По
  СпТТН_ПунктП_Время_По

  СпТТН_ПунктП_Орг_Имя
  СпТТН_ПунктП_Орг_Тип
  СпТТН_ПунктП_Орг_Адрес
  СпТТН_ПунктП_Орг_ОКПО
  СпТТН_ПунктП_Орг_ОКОНХ
  СпТТН_ПунктП_Орг_ТЕЛ
  СпТТН_ПунктП_Орг_СТРАНА_КОД
  СпТТН_ПунктП_Орг_СТРАНА_ИМЯ
  СпТТН_ПунктП_Орг_СТРАНА_НАЛОГИ
  СпТТН_ПунктП_Орг_ГОРОД_КОД
  СпТТН_ПунктП_Орг_ГОРОД_ИМЯ
  СпТТН_ПунктП_Орг_ГОРОД_ТЕЛ
  СпТТН_ПунктП_Орг_ГОРОД_СТРАНА_КОД
  СпТТН_ПунктП_Орг_ГОРОД_СТРАНА_ИМЯ
  СпТТН_ПунктП_Орг_ГОРОД_СТРАНА_НАЛОГИ
  СпТТН_ПунктП_Орг_КОРПОРАЦИЯ
  СпТТН_ПунктП_Орг_УНН
  СпТТН_ПунктП_Орг_БАНК_Имя
  СпТТН_ПунктП_Орг_БАНК_Комментарий
  СпТТН_ПунктП_Орг_БАНК_Адрес
  СпТТН_ПунктП_Орг_БАНК_Мфо
  СпТТН_ПунктП_Орг_БАНК_Ркц
  СпТТН_ПунктП_Орг_БАНК_Счет
  СпТТН_ПунктП_Орг_БАНК_Счет_Ркц
  СпТТН_ПунктП_Орг_БАНК_Счет_Плат
  СпТТН_ПунктП_Орг_БАНК_Тип_Счета
  СпТТН_ПунктП_Орг_БАНК_Вид_Счета

  СпТТН_ПунктП_Доп_Имя
  СпТТН_ПунктП_Доп_Колич
  СпТТН_ПунктП_Доп_Время

!-- Поля для ТТН и Ж/д

  СпТтнЖд_ЕдПодвСост_Имя
  СпТтнЖд_ЕдПодвСост_Номер
  СпТтнЖд_ЖдКвит_Номер
  СпТтнЖд_ЖдТариф          :double
  СпТтнЖд_ЖдТариф_Вал
  СпТтнЖд_ЕдВеса
  СпТтнЖд_СпособОпрВеса
  СпТтнЖд_ВесНетто         :double
  СпТтнЖд_ВесБрутто        :double
  СпТтнЖд_РесОтгрузки
  СпецСимвол

.endfields
.{
 Нрек ^
 Номер накладной ^ Дескриптор ^ Номер_с_дескриптором ^
 Организация ^ УНН ^  ОКПО ^
 Дата ^ ДатаДень ^  ДатаМесяц ^  ДатаГод ^
 Название накладной ^ Куда ^ Откуда ^ Назначение ^
 Доверенное лицо ^ МОЛ откуда ^ МОЛ куда ^
 МОЛ Откуда Должность ^  МОЛ Куда Должность ^
   мой_ИМЯ ^
   мой_УНН  ^
   мой_ОКПО ^
   мой_Адрес ^
   мой_БАНК_Имя ^
   мой_БАНК_Счет ^
   мой_БАНК_Мфо ^

  Грузоотправительт ^
  Грузоотправитель_УНН ^
  Грузоотправитель_ОКПО ^
  Грузоотправитель_Адрес ^
  Грузоотправитель_БАНК_Имя ^
  Грузоотправитель_БАНК_Счет ^
  Грузоотправитель_БАНК_Мфо  ^

  Грузополучатель  ^
  Грузополучатель_УНН  ^
  Грузополучатель_ОКПО ^
  Грузополучатель_Адрес ^
  Грузополучатель_БАНК_Имя ^
  Грузополучатель_БАНК_Счет ^
  Грузополучатель_БАНК_Мфо  ^
#include ttn_prn.frl

  Кол_число_знаков ^
.begin
  Case Кол_число_знаков of
    2 : KolZnak := '88';
    3 : KolZnak := '888';
    4 : KolZnak := '8888';
    5 : KolZnak := '88888';
    6 : KolZnak := '888888';
    7 : KolZnak := '8888888';
    8 : KolZnak := '88888888';
    9 : KolZnak := '888888888';
  else
    KolZnak := '8';
  End;
end.
.{
 НрекПозиции ^
 Н п/п ^ Номенкл. номер ^ Наименование ^ ТНВЭД ^ Масса ^ Брутто ^
 Объем ^ SizeX ^ SizeY ^ SizeZ ^
 Ресурс_хранения ^ Код_группы ^ Название группы ^
 Единица измерения ^ EDuch ^ koef ^ Партия ^
 Количество по ДО ^
 Количество ^ Цена в нац. ^ Цена в вал. ^ ^
 Стоимость в нац ^ Стоимость в вал ^ ^
 Стоим_без_налога ^  Стоим_без_налога_валюта ^
 Уч_цена_нац ^ Уч_цена_вал ^
 аттр1 ^ аттр2 ^ аттр3 ^ аттр4 ^ аттр5 ^
 аттр1_МЦ ^ аттр2_МЦ ^ аттр3_МЦ ^ аттр4_МЦ ^ аттр5_МЦ ^
!*************************************************
#ifdef _MOVENAKL_
  Налог1Р ^ Налог1В ^
  Налог2Р ^ Налог2В ^
  Налог3Р ^ Налог3В ^
  Налог4Р ^ Налог4В ^
  Налог5Р ^ Налог5В ^
  Налог6Р ^ Налог6В ^
  Налог_прочие_Р ^ Налог_прочие_В ^
  ЦНакБН ^ ЦНацБН ^ ЦВалБН ^ ЦНакБНУч ^ ЦНацБНУч ^ ЦВалБНУч ^
  ЦНакСН ^ ЦНацСН ^ ЦВалСН ^ ЦНакСНУч ^ ЦНацСНУч ^ ЦВалСНУч ^
  ставка_первого_налога ^
  ЦНДСНак ^ ЦАкцизНак ^ ЦНПродНак ^ ЦНАЛНак ^
  ЦНДСНац ^ ЦАкцизНац ^ ЦНПродНац ^ ЦНАЛНац ^
  ЦНДСВал ^ ЦАкцизВал ^ ЦНПродВал ^ ЦНАЛВал ^
  СтНакБН ^ СтНацБН0 ^ СтВалБН ^ СтНакСН ^
  СтНацСН0 ^
  СтВалСН ^
  СтНДСНак ^ СтАкцизНак ^ СтНПродНак ^ СтНАЛНак ^
  СтНДСНац0 ^
  СтАкцизНац ^ СтНПродНац ^ СтНАЛНац ^
  СтНДСВал ^ СтАкцизВал ^ СтНПродВал ^ СтНАЛВал ^
  ПрНДС ^ ПрАкциз ^ ПрНПрод ^ ПрНАЛ ^
#end
!*************************************************
.}
 Сумма в нац ^  Сумма в вал ^ ^ Количество наименований ^  Сдал ^  Принял ^

 НОМЕРДОВ^
 ДАТАДОВ^
 ДОВЕРЛИЦО^
  СпТТН_ПунктР_Дата_С                  ^
  СпТТН_ПунктР_Время_С                 ^
  СпТТН_ПунктР_Дата_По                 ^
  СпТТН_ПунктР_Время_По                ^

  СпТТН_ПунктР_Орг_Имя                 ^
  СпТТН_ПунктР_Орг_Тип                 ^
  СпТТН_ПунктР_Орг_Адрес               ^
  СпТТН_ПунктР_Орг_ОКПО                ^
  СпТТН_ПунктР_Орг_ОКОНХ               ^
  СпТТН_ПунктР_Орг_ТЕЛ                 ^
  СпТТН_ПунктР_Орг_СТРАНА_КОД          ^
  СпТТН_ПунктР_Орг_СТРАНА_ИМЯ          ^
  СпТТН_ПунктР_Орг_СТРАНА_НАЛОГИ       ^
  СпТТН_ПунктР_Орг_ГОРОД_КОД           ^
  СпТТН_ПунктР_Орг_ГОРОД_ИМЯ           ^
  СпТТН_ПунктР_Орг_ГОРОД_ТЕЛ           ^
  СпТТН_ПунктР_Орг_ГОРОД_СТРАНА_КОД    ^
  СпТТН_ПунктР_Орг_ГОРОД_СТРАНА_ИМЯ    ^
  СпТТН_ПунктР_Орг_ГОРОД_СТРАНА_НАЛОГИ ^
  СпТТН_ПунктР_Орг_КОРПОРАЦИЯ          ^
  СпТТН_ПунктР_Орг_УНН                 ^
  СпТТН_ПунктР_Орг_БАНК_Имя            ^
  СпТТН_ПунктР_Орг_БАНК_Комментарий    ^
  СпТТН_ПунктР_Орг_БАНК_Адрес          ^
  СпТТН_ПунктР_Орг_БАНК_Мфо            ^
  СпТТН_ПунктР_Орг_БАНК_Ркц            ^
  СпТТН_ПунктР_Орг_БАНК_Счет           ^
  СпТТН_ПунктР_Орг_БАНК_Счет_Ркц       ^
  СпТТН_ПунктР_Орг_БАНК_Счет_Плат      ^
  СпТТН_ПунктР_Орг_БАНК_Тип_Счета      ^
  СпТТН_ПунктР_Орг_БАНК_Вид_Счета      ^

  СпТТН_ПунктР_Доп_Имя                 ^
  СпТТН_ПунктР_Доп_Колич               ^
  СпТТН_ПунктР_Доп_Время               ^

  СпТТН_ПунктП_Дата_С                  ^
  СпТТН_ПунктП_Время_С                 ^
  СпТТН_ПунктП_Дата_По                 ^
  СпТТН_ПунктП_Время_По                ^

  СпТТН_ПунктП_Орг_Имя                 ^
  СпТТН_ПунктП_Орг_Тип                 ^
  СпТТН_ПунктП_Орг_Адрес               ^
  СпТТН_ПунктП_Орг_ОКПО                ^
  СпТТН_ПунктП_Орг_ОКОНХ               ^
  СпТТН_ПунктП_Орг_ТЕЛ                 ^
  СпТТН_ПунктП_Орг_СТРАНА_КОД          ^
  СпТТН_ПунктП_Орг_СТРАНА_ИМЯ          ^
  СпТТН_ПунктП_Орг_СТРАНА_НАЛОГИ       ^
  СпТТН_ПунктП_Орг_ГОРОД_КОД           ^
  СпТТН_ПунктП_Орг_ГОРОД_ИМЯ           ^
  СпТТН_ПунктП_Орг_ГОРОД_ТЕЛ           ^
  СпТТН_ПунктП_Орг_ГОРОД_СТРАНА_КОД    ^
  СпТТН_ПунктП_Орг_ГОРОД_СТРАНА_ИМЯ    ^
  СпТТН_ПунктП_Орг_ГОРОД_СТРАНА_НАЛОГИ ^
  СпТТН_ПунктП_Орг_КОРПОРАЦИЯ          ^
  СпТТН_ПунктП_Орг_УНН                 ^
  СпТТН_ПунктП_Орг_БАНК_Имя            ^
  СпТТН_ПунктП_Орг_БАНК_Комментарий    ^
  СпТТН_ПунктП_Орг_БАНК_Адрес          ^
  СпТТН_ПунктП_Орг_БАНК_Мфо            ^
  СпТТН_ПунктП_Орг_БАНК_Ркц            ^
  СпТТН_ПунктП_Орг_БАНК_Счет           ^
  СпТТН_ПунктП_Орг_БАНК_Счет_Ркц       ^
  СпТТН_ПунктП_Орг_БАНК_Счет_Плат      ^
  СпТТН_ПунктП_Орг_БАНК_Тип_Счета      ^
  СпТТН_ПунктП_Орг_БАНК_Вид_Счета      ^

  СпТТН_ПунктП_Доп_Имя                 ^
  СпТТН_ПунктП_Доп_Колич               ^
  СпТТН_ПунктП_Доп_Время               ^

!-- Поля для ТТН и Ж/д

  СпТтнЖд_ЕдПодвСост_Имя               ^
  СпТтнЖд_ЕдПодвСост_Номер             ^
  СпТтнЖд_ЖдКвит_Номер                 ^
  СпТтнЖд_ЖдТариф                      ^
  СпТтнЖд_ЖдТариф_Вал                  ^
  СпТтнЖд_ЕдВеса                       ^
  СпТтнЖд_СпособОпрВеса                ^
  СпТтнЖд_ВесНетто                     ^
  СпТтнЖд_ВесБрутто                    ^
  СпТтнЖд_РесОтгрузки                  ^
  СпецСимвол                           ^
.}
.endform

.linkform 'printinmovnak2_01' prototype is 'printinmovnak2'
.NameInList '1. Стандартная накладная на внутреннее перемещение'
.Group 'Vnut'
.DEFP PA4
.fields
 CommonFormHeader
 Номер_с_дескриптором Dat From To
 Npp NomMC NameMC ed kol price sumpr
 Sum Count
 if (МОЛ_Откуда_Должность <> '',Sdat+' ('+МОЛ_Откуда_Должность+')',Sdat)
 if (МОЛ_Куда_Должность   <> '',Prin+' ('+МОЛ_Куда_Должность  +')',Prin)
 СпецСимвол
.endfields
.{
 ^

               НАКЛАДНАЯ НА ВНУТРЕННЕЕ ПЕРЕМЕЩЕНИЕ
                  №   Б^ Б от  Б^ Б

  Куда   : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
  Откуда : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

 Р
┌─────┬────────────┬─────────────────────────────────────┬───────────┬──────────────┬───────────────┬──────────────┐
│№ п/п│ Номенклат. │      Название МЦ                    │  Единица  │  Количество  │     Цена      │   Стоимость  │
│     │   номер    │                                     │ измерения │              │               │              │
├─────┼────────────┼─────────────────────────────────────┼───────────┼──────────────┼───────────────┼──────────────┤
.{
│@@@@@│@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@│&&&&&&&&&&&&&&│&&&&&&&&&&&&&&&│&&&&&&&&&&&&&&│
.}
└─────┴────────────┴─────────────────────────────────────┴───────────┴──────────────┴───────────────┴──────────────┘
 Б Итого :                                                                                            &&&&&&&&&&&&&&& Р
 С Количество наименований : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

 Сдал            @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Принял          @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 Отпуск разрешил ___________________________________________________________________________________________________
 Отпуск произвел ___________________________________________________________________________________________________
 Товар получил   ___________________________________________________________________________________________________
 Гл.бухгалтер    ___________________________________________________________________________________________________
 Р
  ^
.}
.endform
