/*
 ษอออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
 บ                     (c) 1994, 2001 ชฎเฏฎเ ๆจ๏ €€’€                   บ
 บ เฎฅชโ        : €€’€                                                 บ
 บ ‘จแโฅฌ        : “—…’  ‘’…                                       บ
 บ ฅเแจ๏        : 7.10                                                      บ
 บ  งญ ็ฅญจฅ    : €ชโ ญ  กเ ช (”ฎเฌ๋)                                       บ
 บ โขฅโแโขฅญญ๋ฉ : ‘ ๅ เฎข ‘ฅเฃฅฉ €ญ โฎซ์ฅขจ็ (SSA)                          บ
 บ  เ ฌฅโเ๋     :                                                           บ
 ศอออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
*/
.Set name = 'ManufAktBrak'
.NameInList ' งฎข ๏ ไฎเฌ '
.Hide
.Fields

BaseDocNRec:comp
KatSoprNRec:comp
N_TTN
ORG
OKPO
F_KUDA
field_DATE
   //7
field_NAME
KatNaznaNrec field_KOGO
fUserFil HisValue
Vijvlen_Brak Po_Nakladnoi
   //7 field`ฎข

fVal1 fNDE1 fVal2 fNDE2

SpSoprNRec NPP NOMENKL NAME_TOVAR ED_IZM Name_Party KOL_DOC KOL_FACT PRICE VPRICE SUMMA VSUMMA
    AHarakt APrichina APodrazd AVinovn AKolBrak
ITOGO VITOGO
   //23 field`ฎข

KOL_TOV ALL_KOL_TOV ALL_WAGA_TOV ALL_VOLUME_TOV
NA_SUMMU NDESimvol VNA_SUMMU VSimvol
filed_PO_CURSU CURS field_ZA NAME_DENGA
SUMMA_PROPISU
VSUMMA_PROPISU
            //14    field`ฎข
.endfields      //38
.{
^ ^
                       €’ € € ü  ^ ^ ^ ^
                       ฎโ ^
 ^
 ^ ^
 ^ ^
 ^ ^
ฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤ
ฎฌฅเณ ฎฌฅญชซ โใเ-ณ                                             ณ          ณ             ณ                        ณ                   ณ
     ณ     ญ๋ฉ     ณ           จฌฅญฎข ญจฅ กเ ช                  ณ          ณ             ณ        ฎซจ็ฅแโขฎ      ณ      –ฅญ          ณ      ‘ใฌฌ 
 ฏ/ฏ ณ    ญฎฌฅเ    ณ                                             ณ …ค. จงฌ. ณ    เโจ๏    ณ       ฏฎ คฎชใฌฅญโใ     ณ  ^             ^  ณ  ^              ^
ฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤ
.{
^ &&&&&ณ@@@@@@@@@@@@@ณ@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ณ@@@@@@@@@@ณ@@@@@@@@@@@@@ณ&'&&&&&&&&&&ณ&'&&&&&&&&&ณ&'&&&&&&&&&&&&&&& ^ณ&'&&&&&&&&&&&&&&&& ^
.{
     ณ@@@@@@@@@@@@@ณ@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ณ@@@@@@@@@@ณ@@@@@@@@@@@@@ณ&'&&&&&&&&&&ณ           ณ                   ณ
.}
.}
ฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤ

                                                                                                                      โฎฃฎ:&'&&&&&&&&&&&&&&&&&
                                                                                                                            &'&&&&&&&&&&&&&&&&&
แฅฃฎ ง กเ ชฎข ญฎ ญ จฌฅญฎข ญจฉ ^ ข ชฎซจ็ฅแโขฅ ^ ฎก้จฌ ขฅแฎฌ ^ จ ฎก๊ฅฌฎฌ^
      ญ  แใฌฌใ  ^ ^ ^ ^
      ^^^^

                 (^)
                 (^)

 โฏใแช เ งเฅ่จซ ___________          ซ.(แโ เ่จฉ) กใๅฃ ซโฅเ ___________

 โฏใแโจซ _______________               ฎซใ็จซ _____________________
:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
.}
.endform
!=============================================================================


.linkform 'MnAktBrk1' prototype is 'ManufAktBrak'
.NameInList '1. €ชโ ญ  กเ ช.'
!.group N501
.DEFP PA4
.P 40
.PAPER PA4
.ORIENT PORTRAIT
.LL 80

!.DEFP PCUSTOM
!.CLENGTH 148
!.CWIDTH 210
!.P 40
.VAR
  Tire : string CurP,kounter : word
  PrintPic: boolean
.ENDVAR
.fields
N_TTN Tire CurP field_DATE
field_NAME field_KOGO
Vijvlen_Brak Po_Nakladnoi

  NPP NOMENKL NAME_TOVAR ED_IZM Name_Party KOL_FACT
      AHarakt APrichina APodrazd AVinovn AKolBrak
.endfields
ÿ
.{
.BEGIN
CurP := -1;
Tire := ' ';
kounter:=2;
END.
.{
.[H
.{?INTERNAL;(kounter mod 2)=0
.Begin
    CurP := CurP + 1;
    if (CurP>0) Tire:='-';
END.

                                      €’ € € N @@@@@@@@@@@ @ @#@@ ’ @@@@@@@@@@

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 งญ ็ฅญจฅ : @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

ษอออออออัออออออออออออออออออออัอออออออออออออออออออออออออออออออออออออออออออออออออัอออออออออออออออัอออออออออออออออออออัออออออออออออออออออออออออออป
บ ฎฌฅเ ณ   ฎฌฅญชซ โใเญ๋ฉ   ณ              จฌฅญฎข ญจฅ กเ ช                   ณ   …คจญจๆ      ณ       เโจ๏       ณ    ฎซจ็ฅแโขฎ กเ ช       บ
บ  ฏ/ฏ  ณ      ญฎฌฅเ         ณ                                                 ณ   จงฌฅเฅญจ๏   ณ                   ณ    ฏฎ คฎชใฌฅญโใ          บ
วฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤถ
บ   1   ณ        2           ณ                     3                           ณ       4       ณ         5         ณ              6           บ
ฬอออออออุออออออออออออออออออออุอออออออออออออออออออออออออออออออออออออออออออออออออุอออออออออออออออุอออออออออออออออออออุออออออออออออออออออออออออออน
.}
.{?INTERNAL;(kounter mod 2)<>0
                                                                                                                        กฎเฎโญ ๏ แโฎเฎญ   ชโ 
ษอออออออัออออออออออออออออออออัอออออออออออออออออออออออออออออออออออออออออออออออออัอออออออออออออออัอออออออออออออออออออัออออออออออออออออออออออออออป
บ ฎฌฅเ ณ   ฎฌฅญชซ โใเญ๋ฉ   ณ              จฌฅญฎข ญจฅ กเ ช                   ณ   …คจญจๆ      ณ       เโจ๏       ณ    ฎซจ็ฅแโขฎ กเ ช       บ
บ  ฏ/ฏ  ณ      ญฎฌฅเ         ณ                                                 ณ   จงฌฅเฅญจ๏   ณ                   ณ    ฏฎ คฎชใฌฅญโใ          บ
วฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤถ
บ   1   ณ        2           ณ                     3                           ณ       4       ณ         5         ณ              6           บ
ฬอออออออุออออออออออออออออออออุอออออออออออออออออออออออออออออออออออออออออออออออออุอออออออออออออออุอออออออออออออออออออุออออออออออออออออออออออออออน
.}
.]H
บ&&&&&&&ณ@@@@@@@@@@@@@@@@@@@@ณ@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ณ@@@@@@@@@@@@@@@ณ@@@@@@@@@@@@@@@@@@@ณ&'&&&&&&&&&&&&&&&&&&&&&.&&บ
.{
.[H
บ       ภฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤถ
.]H
บจค คฅไฅชโ :@@@@@@@@@@@@@@ เจ็จญ :@@@@@@@@@@@@@@@@@@@@ ฎคเ.:@@@@@@@@@@@@@@@@@@@@@@ จญฎขญจช:@@@@@@@@@@@@@@@@@@@@ ฎซ.:&'&&&&&&&&&&&&&&&&.&&บ
.[F
วฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤถ
.]F
.}
.[F
.{?INTERNAL;(kounter mod 2)=0
.Begin PrintPic:=true  End.
ศอออออออฯออออออออออออออออออออฯอออออออออออออออออออออออออออออออออออออออออออออออออฯอออออออออออออออฯอออออออออออออออออออฯออออออออออออออออออออออออออผ

.}
.{?INTERNAL;(kounter mod 2)<>0
.Begin PrintPic:=false  End.
ศอออออออฯออออออออออออออออออออฯอออออออออออออออออออออออออออออออออออออออออออออออออฯอออออออออออออออฯอออออออออออออออออออฯออออออออออออออออออออออออออผ

 ‘ฎแโ ขจซ : _____________  _________  ______________________
            คฎซฆญฎแโ์      ฏฎคฏจแ์    เ แ่จไเฎขช  ฏฎคฏจแจ

.}
.Begin
  kounter:=kounter+1
 End.
.]F
.}
.{?INTERNAL;PrintPic
                                                                                                                        กฎเฎโญ ๏ แโฎเฎญ   ชโ 
ษอออออออัออออออออออออออออออออัอออออออออออออออออออออออออออออออออออออออออออออออออัอออออออออออออออัอออออออออออออออออออัออออออออออออออออออออออออออป
บ ฎฌฅเ ณ   ฎฌฅญชซ โใเญ๋ฉ   ณ              จฌฅญฎข ญจฅ กเ ช                   ณ   …คจญจๆ      ณ       เโจ๏       ณ    ฎซจ็ฅแโขฎ กเ ช       บ
บ  ฏ/ฏ  ณ      ญฎฌฅเ         ณ                                                 ณ   จงฌฅเฅญจ๏   ณ                   ณ    ฏฎ คฎชใฌฅญโใ          บ
วฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤถ
บ   1   ณ        2           ณ                     3                           ณ       4       ณ         5         ณ              6           บ
ฬอออออออุออออออออออออออออออออุอออออออออออออออออออออออออออออออออออออออออออออออออุอออออออออออออออุอออออออออออออออออออุออออออออออออออออออออออออออน
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
บ       ณ                    ณ                                                 ณ               ณ                   ณ                          บ
ศอออออออฯออออออออออออออออออออฯอออออออออออออออออออออออออออออออออออออออออออออออออฯอออออออออออออออฯอออออออออออออออออออฯออออออออออออออออออออออออออผ

 ‘ฎแโ ขจซ : _____________  _________  ________________________
            คฎซฆญฎแโ์      ฏฎคฏจแ์    เ แ่จไเฎขช  ฏฎคฏจแจ

.}
.}ÿ
.Endform