/*
 ╔════════════════════════════════════════════════════════════════════════════╗
 ║                     (c) Корпорация ГАЛАКТИКА, 1996,97                      ║
 ║ Проект        : ГАЛАКТИКА                                                  ║
 ║ Система       : Оперативный контур                                         ║
 ║ Версия        : 5.70                                                       ║
 ║ Назначение    : Просмотр наличия остатков МЦ в производстве по МОЛ         ║
 ║ Ответственный : Зайцев Александр Владимирович (AXE)                        ║
 ╚════════════════════════════════════════════════════════════════════════════╝
*/
.set name = 'TekMCMol'
.hide
.fields
  hdr
  dateRec
  podr1
  mol
  party
  mc bar gr typ
  ost:Double
  res:Double
  svob:Double
.endfields
^
^
.{
^ ^ ^
^ ^ ^ ^ ^ ^ ^
.}
.endform
.linkform 'TekMCMol_1' prototype is 'TekMCMol'
.var
 SumKol :Double;
 SumKolPr:double;
.endvar
.begin
 SumKol:=0;
 SumKolPr:=0;
end.
.fields
  dateRec
  podr1
  mol
  party
  mc bar gr typ ost res svob
.endfields
.var
 itogo:Double
 itogores:Double
 itogosvob:Double
.endVar
.begin
itogo:=0;
itogores:=0;
itogosvob:=0;
end.

          БВЕДОМОСТЬ НАЛИЧИЯ ОСТАТКОВ НА ПРОИЗВОДСТВЕ Б

                 На дату: @@@@@@@@@@@@@@@@@@

 Р─────────────────────────────┬──────────┬───────────────┬───────────────┬───────────────┬────────────────┬────────────────
   Наименование матценности  │  Баркод  │     Группа    │      Тип      │    Остаток    │    Цена един.  │      Сумма
─────────────────────────────┴──────────┴───────────────┴───────────────┴───────────────┴────────────────┴──────────────── Р
.{
 Й @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Й
 Р @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@ &'&&&&&&&&&.&&& &'&&&&&&&&&&.&&& &'&&&&&&&&&&&.&&& Р
.begin
sumKol:=sumKol+ost;
itogores:=itogores+res;
itogosvob:=itogosvob+svob;
itogo:=sumKol;
end.
.}
.fields
itogo
itogores
itogosvob
.endfields
 СИтого по разрезу:                                                         &'&&&&&&&&&.&&& &'&&&&&&&&&&.&&& &'&&&&&&&&&&&.&&& С
.endform