/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,97 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Производство                                              ║
 ║ Версия        : 5.70                                                      ║
 ║ Назначение    : Ведомость операций по отпуску МЦ в производство           ║
 ║                 сверх лимита в разрезе лимитир. МЦ                        ║
 ║ Ответственный : Зайцев Александр Владимирович                             ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
.set name = 'VedLimit'
.hide
.fields
  dateRec  dateend
  Sklad  Podr
  NameMC  BarKod Party NumDO NumNkl  EI  KolLimit KolOst  UchSumma   NumTr  Otv  Prichina  Prim
  mcitogo  limititogo  kolOstitogo  stoimitogo
.endfields
^ ^
.{

^ ^
.{
^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^
.}
^ ^ ^ ^
.}
.endform
.linkform 'VedLimit_1' prototype is 'VedLimit'
.fields
  dateRec dateend
.endfields


     Отчет об отпуске МЦ сверх количественного лимита в разрезе склад отгрузки - подразделение
                              за период с ^ по ^
 P────────────────────────┬────────────┬────────────────────────┬─────────┬─────────┬──────────┬──────────────┬──────────────┬────────────────┬─────────┬──────────┬────────────────┬─────────────────────────────
 Наименование МЦ        │   Номен.   │       Партия           │  Номер  │  Номер  │ Единица  │ Лимит по ДО  │  Перерасход  │  Стоимость     │  Номер  │    Отв.  │ Причина        │       Примечание
 (спецификация ДО-ЛЗК)  │   номер    │  (спецификация ДО-ЛЗК) │   ДО    │  наклад.│ измерения│              │              │ перерасхода    │ требов. │          │ списания       │
────────────────────────┴────────────┴────────────────────────┴─────────┴─────────┴──────────┴──────────────┴──────────────┴────────────────┴─────────┴──────────┴────────────────┴─────────────────────────────
.{
.fields
                    Sklad                                    Podr
.endfields
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{
.fields
      NameMC              BarKod            Party                NumDO    NumNkl      EI          KolLimit        KolOst       UchSumma         NumTr      Otv        Prichina           Prim
.endfields
@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@ @@@@@@@@@ @@@@@@@@@@ &'&&&&&&&.&&&& &'&&&&&&&.&&&& &'&&&&&&&&&&&.&& @@@@@@@@@ @@@@@@@@@@ @@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.fields
     mcitogo                                                                                    limititogo     kolOstitogo   stoimitogo
.endfields
Итого по: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@                                                &'&&&&&&&.&&&& &'&&&&&&&.&&&& &'&&&&&&&&&&&.&&
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- P
.}

.endform
