#doc
Дефициты
#end
.Form 'Protokol_Zak'
.NameInList 'Дефициты'
.Fields
  реалНач
  реалКон
  поставщик
  норма
  фильтр
  округл1
  округл2
  сезон
  пошлиФильтры
.Endfields
  Р ПРИЛОЖЕНИЕ К ОТЧЕТУ ПО ДЕФИЦИТАМ

    Использованые фильтры

    Анализируемый период   с  @@@@@@@@@@  по  @@@@@@@@@@
    Поставщик   @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
    Период пополнения запасов (дней)    @@@@@@@@@@
    Фильтр по: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
    Округление до ^:@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
    Сезонный коэффициент: .@@@@@@@
.{
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.}
.endform
