//******************************************************************************
//                                                      (с) корпорация ГАЛАКТИКА
// Галактика 7.12 - Заработная плата
// Справка о доходах и обязательных пенсионных взносах с него
//   для Казахстан (Приложение 28)
//******************************************************************************

#doc
Справка о доходах и обязательных пенсионных взносах с него
для Казахстан (Приложение 28)
#end
.set name='PensKaz'
.hide
.fields
  YearBeg
  YearEnd
  LastName
  FirstName
  GrandName
  Document
  TabN
  Sik
  RNN
  Fond
  Address
  Year
  Mon1 Incom1 Sum11 Sum12 Prim1
  Itog1 Itog2 Itog3
  KolMes SumStr

.endfields
.{
  ^
  ^
  ^
  ^
  ^
  ^
  ^
  ^
  ^
  ^
  ^
.{
  ^
.{
  ^ ^ ^ ^ ^
.}
  ^ ^ ^
.}
  ^
  ^
.}
.endform
