/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,97 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Заработная плата                                          ║
 ║ Версия        : 6.0 и выше...                                             ║
 ║ Назначение    : Отчет по социальному налогу                               ║
 ║ Ответственный : Мелех   Василий  Евгеньевич                               ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
#doc
Отчет по социальному налогу
#end
.set name = 'socnot3'
.hide
.DEFO LANDSCAPE
.fields
MonthR
Year
ZaPeriod
NaimECH
Npp
TabN
FIO
SumDoh
.endfields
^^^^
  ┌────────┬───────────────┬────────────────────────────┬─────────────────────┐
  │    N   │   Табельный   │          Ф.И.О.            │ Сумма дохода, руб.  │
  │   п/п  │     номер     │                            │                     │
  ├────────┼───────────────┼────────────────────────────┼─────────────────────┤
.{ MonthSumCir3 CheckEnter
  │@~@@@@@@│@~@@@@@@@@@@@@@│@~@@@@@@@@@@@@@@@@@@@@@@@@@@│ &#&&&&&&&&&&&&&&&.&&│
.}
  ├────────┼───────────────┼────────────────────────────┼─────────────────────┤
  │        │               │         ИТОГИ:             │                     │
  └────────┴───────────────┴────────────────────────────┴─────────────────────┘

.endform
!*****************************************************************************
.Linkform 'socnot3_L' Prototype is 'socnot3'
.nameinlist 'Статистический отчет для расчета фактической средней величины'
.DEFO LANDSCAPE
.var
 SumN   : LongInt;
 SumSum : Double;
.endvar
.fields
MonthR
Year
ZaPeriod
NaimECH
Npp
TabN
FIO
SumDoh
.endfields
.begin
SumN := 0;
SumSum := 0;
end.
          Статистический отчет по работникам с ненулевой налоговой базой,
              исключенным из расчета фактической средней величины,

                   для расчетного месяца @@@@@@@@@ @@@@ года
                   за период  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
               @~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
  ┌────┬───────────────┬───────────────────────────────────────┬──────────────┐
  │ N  │   Табельный   │             Ф.И.О.                    │ Сумма дохода,│
  │п/п │     номер     │                                       │  руб.        │
  ├────┼───────────────┼───────────────────────────────────────┼──────────────┤
.{ MonthSumCir3 CheckEnter
.begin
   SumN := SumN + 1;
   SumSum := SumSum + Double(SumDoh);
end.
  │@~@@│@~@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&&&&&&&&&&&.&&│
.}
.fields
SumN
SumSum
.endfields
  ├────┼───────────────┼───────────────────────────────────────┼──────────────┤
  │@~@@├───────────────┤           ИТОГО  :                    │&&&&&&&&&&&.&&│
  └────┴───────────────┴───────────────────────────────────────┴──────────────┘
.endform
!
!