/*
 ษอออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
 บ                     (c) 1994,2004 ชฎเฏฎเ ๆจ๏ €€’€                    บ
 บ เฎฅชโ        : €€’€                                                 บ
 บ ‘จแโฅฌ        :  เ กฎโญ ๏ ฏซ โ                                           บ
 บ ฅเแจ๏        : 5.74                                                      บ
 บ  งญ ็ฅญจฅ    : จๆฅขฎฉ แ็ฅโ (ฎข ๏ ไฎเฌ  N ’-54  ฎโ 06.04.2001)          บ
 บ โขฅโแโขฅญญ๋ฉ :  แซ ชฎข  ’ โ์๏ญ  ซ คจฌจเฎขญ                             บ
 ศอออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
*/
#doc
จๆฅขฎฉ แ็ฅโ (ฎข ๏ ไฎเฌ  N ’-54  ฎโ 06.04.2001)
#end
.set name='T54aNew'
.DEFO LANDSCAPE
.DEFP PA4
.hide
.fields
 
 Pred
 Name_Podr

 ” TabN  โ _เฎฆค
 NomDoc Data1 Data2 Kateg INN ‘โเ ๅฎขฎฉ_ญฎฌฅเ ฎค_แโเ ญ๋ ‘ฅฌฅฉญฎฅ_ฏฎซฎฆฅญจฅ
 ฎซ_คฅโ DataPos DataUv

 จค_ญ คก ขชจ
  โ _ฏเจช1 ฎฌฅเ_ฏเจช1 Podr1 Dolg1 ใแซ_โเใค 1  ฎชซ ค1 ญ คก ขช 11 ญ คก ขชจ12
 ขจค_ฎโฏ1  โ _ฎโฏ1 เจช ง_ฎโฏ1  โ _ฎโฏ11  โ _ฎโฏ21
 ฎซ_ญ_ฎโฏ1 ฅเจฎค11 ฅเจฎค21 ๋็ฅโ1

  โ _ฏเจช2 ฎฌฅเ_ฏเจช2 Podr2 Dolg2 ใแซ_โเใค 2  ฎชซ ค2 ญ คก ขช 21 ญ คก ขชจ22
 ขจค_ฎโฏ2  โ _ฎโฏ2 เจช ง_ฎโฏ2  โ _ฎโฏ12  โ _ฎโฏ22
 ฎซ_ญ_ฎโฏ2 ฅเจฎค12 ฅเจฎค22 ๋็ฅโ2

 VidUd1  โ _ใคฅเ_แ1  โ _ใคฅเ_ฏฎ1 SumUd1 SumUdMes1
 VidUd2  โ _ใคฅเ_แ2  โ _ใคฅเ_ฏฎ2 SumUd2 SumUdMes2
 คฅญ์3 ฌฅแ๏ๆ3 ฃฎค3
.endfields
.{
 ^
 ^
 ^^
 ^^^
 ^^^^^^^
 ^^^

 ^
 ^^^^^^^^ ^^^^^^^^ ^
.{ T54AP CheckEnter
 ^^^^^^^^ ^^^^^^^^ ^
.}
.{
 ^^^^^ ^^^^^
.if Flsch3New
.else
.end
.}
 ^^^
.If Page54aNew
.end
.}
.endform
!
!
!
.linkform 'T54aNew_01' prototype is 'T54aNew'
.nameinlist 'จๆฅขฎฉ แ็ฅโ N ’-54  ฎโ 05.01.2004 N 1'
.DEFO LANDSCAPE
.DEFP PA4
.p 75
.fields
 
 Pred
 Name_Podr
 ” TabN  โ _เฎฆค
 NomDoc Data1 Data2 Kateg INN ‘โเ ๅฎขฎฉ_ญฎฌฅเ ฎค_แโเ ญ๋ ‘ฅฌฅฉญฎฅ_ฏฎซฎฆฅญจฅ
 ฎซ_คฅโ DataPos DataUv

 จค_ญ คก ขชจ
  โ _ฏเจช1 ฎฌฅเ_ฏเจช1 Podr1 Dolg1 ใแซ_โเใค 1 ฎชซ ค1  ญ คก ขช 11 ญ คก ขชจ12
 ขจค_ฎโฏ1  โ _ฎโฏ1 เจช ง_ฎโฏ1  โ _ฎโฏ11  โ _ฎโฏ21 ฎซ_ญ_ฎโฏ1 ฅเจฎค11 ฅเจฎค21
 ๋็ฅโ1
  โ _ฏเจช2 ฎฌฅเ_ฏเจช2 Podr2 Dolg2 ใแซ_โเใค 2 ฎชซ ค2  ญ คก ขช 21 ญ คก ขชจ22
 ขจค_ฎโฏ2  โ _ฎโฏ2 เจช ง_ฎโฏ2  โ _ฎโฏ12  โ _ฎโฏ22 ฎซ_ญ_ฎโฏ2 ฅเจฎค12 ฅเจฎค22
 ๋็ฅโ2
 VidUd1  โ _ใคฅเ_แ1  โ _ใคฅเ_ฏฎ1 SumUd1 SumUdMes1
 VidUd2  โ _ใคฅเ_แ2  โ _ใคฅเ_ฏฎ2 SumUd2 SumUdMes2
 คฅญ์3 ฌฅแ๏ๆ3 ฃฎค3
 'true':'s'
.endfields
.{
ÿ                                                                                                                                                                                           “ญจไจๆจเฎข ญญ ๏ ไฎเฌ  ü ’-54 
                                                                                                                                                                                           “โขฅเฆคฅญ  ฏฎแโ ญฎขซฅญจฅฌ ฎแชฎฌแโ โ 
                                                                                                                                                                                           ฎแแจจ ฎโ 05.01.2004 ü 1
                                                                                                                                                                                                          ฺฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ
                                                                                                                                                                                                          ณ       ฎค           ณ
                                                                                                                                                                                                          รฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤด
                                                                                                                                                                                           ”ฎเฌ  ฏฎ “  ณ       0301013       ณ
                                                                                                                                                                                                          รฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤด
                                                                                                                                                                                                 ฏฎ   ณ@~@@@@@@@@@@@@@@@@@@@ณ
 ÿ…@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ÿ…  รฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤด
                                                                                         ญ จฌฅญฎข ญจฅ ฎเฃ ญจง ๆจจ                                                                                         ณ                     ณ
 ÿ…@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ÿ…  ภฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤู
                                                                                  ญ จฌฅญฎข ญจฅ แโเใชโใเญฎฃฎ ฏฎคเ งคฅซฅญจ๏                                                      ฺฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ                ฺฤฤฤฤฤฤฤฤฤฤฤฤฤฟ
                                                                                                                                                                               ณ ’ กฅซ์ญ๋ฉ ญฎฌฅเ ณ                ณ             ณ
                                                                                                                                                                               รฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤด                รฤฤฤฤฤฤฤฤฤฤฤฤฤด
 ” ฌจซจ๏, จฌ๏, ฎโ็ฅแโขฎ ÿ@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ÿ  ณ  @~@@@@@@@@@@@  ณ   โ  เฎฆคฅญจ๏ ณ  @@@@@@@@@@ ณ
                                                                                                                                                                               ภฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤู                ภฤฤฤฤฤฤฤฤฤฤฤฤฤู
                                                             ฺฤฤฤฤฤฤฤฤฤฤฤฟ ฺฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฟ
                                                             ณ   ฎฌฅเ   ณ ณ        แ็ฅโญ๋ฉ       ณ                    ณ คฅญโจไจช -   ณ ฎฌฅเ แโเ ๅฎขฎฃฎ ณ    ฎค ฌฅแโ      ณ ‘ฎแโฎ๏ญจฅ ณ ฎซจ็ฅ- ณ             โ            ณ
                                                             ณ คฎชใฌฅญโ  ณ ณ        ฏฅเจฎค         ณ      โฅฃฎเจ๏      ณ ๆจฎญญ๋ฉ ญฎ-   ณ  แขจคฅโฅซ์แโข    ณ   ฆจโฅซ์แโข      ณ ข กเ ชฅ   ณ แโขฎ    รฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤด
                                                             ณ           ณ รฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤด     ฏฅเแฎญ ซ       ณ ฌฅเ ญ ซฎฃฎ-   ณ ฃฎแใค เแโขฅญญฎฃฎ ณ                  ณ           ณ คฅโฅฉ   ณ ฏฎแโใฏซฅญจ๏ ณ ใขฎซ์ญฅญจ๏  ณ
                                                             ณ           ณ ณ    แ      ณ   ฏฎ      ณ                    ณ ฏซ โฅซ์้จช    ณ   ฏฅญแจฎญญฎฃฎ    ณ                  ณ           ณ         ณ     ญ       ณ             ณ
                                                             ณ           ณ ณ           ณ           ณ                    ณ               ณ   แโเ ๅฎข ญจ๏    ณ                  ณ           ณ         ณ   เ กฎโใ    ณ             ณ
                                                             รฤฤฤฤฤฤฤฤฤฤฤด ณฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤด
                                        ÿ–…  ‘—…’ (‘’)ÿ  ณ&~&&&&&&&&&ณ ณ&~&&&&&&&&&ณ&~&&&&&&&&&ณ@~@@@@@@@@@@@@@@@@@@ณ @~@@@@@@@@@@@ ณ @~@@@@@@@@@@@@@@ ณ @~@@@@@@@@@@@@@@ ณ @~@@@@@@@ ณ &#~&    ณ&~&&&&&&&&&  ณ &~&&&&&&&&& ณ
                                                             ภฤฤฤฤฤฤฤฤฤฤฤู ภฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤมฤฤฤฤฤฤฤฤฤฤฤฤฤู
 ษอออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออัออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออัอออออออออออออออป
 บ                โฌฅโช  ฎ ฏเจฅฌฅ ญ  เ กฎโใ, ฏฅเฅขฎค ๅ, ใขฎซ์ญฅญจจ, จงฌฅญฅญจจ ข ฎฏซ โฅ โเใค               ณ                                     โฌฅโชจ ฎก จแฏฎซ์งฎข ญจจ ฎโฏใแช                                ณ    ‘ใฌฌ       บ
 วฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤดฏเฅคฎแโ ขซ๏ฅ-  บ
 บ       ฏเจช ง           ณ    แโเใชโใเญฎฅ      ณ  คฎซฆญฎแโ์    ณ   ใแซฎขจ๏   ณโ เจไญ ๏ ณ แใฌฌ  ญ คก ขฎช,  ณ          ขจค         ณ  ฏเจช ง (เ แฏฎเ๏ฆฅญจฅ)  ณ      ง  ฏฅเจฎค      ณชฎซจ็ฅ-ณ        ค โ          ณ  ฌ๋ๅ ซ์ฃฎโ    บ
 บ   (เ แฏฎเ๏ฆฅญจฅ)       ณ   ฏฎคเ งคฅซฅญจฅ     ณ(แฏฅๆจ ซ์ญฎแโ์,ณ    โเใค     ณแโ ขช    ณ คฎฏซ โ, เใก      ณ        ฎโฏใแช        ณ                         ณ                     ณ แโขฎ  ณ                     ณ (แใฌฌ  แโ ญ-  บ
 วฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤด                     ณ ฏเฎไฅแแจ๏)    ณ             ณ(็ แฎข ๏,รฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤด                      รฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤดช ซฅญ- รฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤด ค เโญ๋ๅ ญ ซฎ- บ
 บ   ค โ    ณ    ญฎฌฅเ    ณ                     ณ               ณ             ณคญฅขญ ๏),ณ        ณ         ณ                      ณ   ค โ    ณ    ญฎฌฅเ     ณ     แ    ณ    ฏฎ    ณค เญ๋ๅ ณ  ญ ็ ซ   ณฎชฎญ็ ญจ๏ ณฃฎข๋ๅ ข๋็ฅโฎข),บ
 บ          ณ             ณ                     ณ               ณ             ณ (ฎชซ ค) ณ@~@@@@@@ณ         ณ                      ณ          ณ              ณ          ณ          ณ คญฅฉ  ณ          ณ          ณ     เใก       บ
 บ          ณ             ณ                     ณ               ณ             ณ  เใก    ณ        ณ         ณ                      ณ          ณ              ณ          ณ          ณ       ณ          ณ          ณ               บ
 บ          ณ             ณ                     ณ               ณ             ณ         ณ        ณ         ณ                      ณ          ณ              ณ          ณ          ณ       ณ          ณ          ณ               บ
 วฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤถ
 บ    1     ณ      2      ณ        3            ณ       4       ณ      5      ณ    6    ณ   7    ณ    8    ณ         9            ณ    10    ณ     11       ณ    12    ณ   13     ณ 14    ณ    15    ณ   16     ณ      17       บ
 ฬออออออออออุอออออออออออออุอออออออออออออออออออออุอออออออออออออออุอออออออออออออุอออออออออุออออออออุอออออออออุออออออออออออออออออออออุออออออออออุออออออออออออออุออออออออออุออออออออออุอออออออุออออออออออุออออออออออุอออออออออออออออน
 บ&&&&&&&&&&ณ@~@@@@@@@@@@@ณ@~@@@@@@@@@@@@@@@@@@@ณ@~@@@@@@@@@@@@@ณ@~@@@@@@@@@@@ณ@~@@@@@@@ณ&#&&&&&&ณ&#&&&&&& ณ@~@@@@@@@@@@@@@@@@@@@@ณ&&&&&&&&&&ณ@~@@@@@@@@@@@@ณ&&&&&&&&&&ณ&&&&&&&&&&ณ &#&&  ณ&&&&&&&&&&ณ&&&&&&&&&&ณ&#&&&&&&&&&&&&&บ
.{ T54AP CheckEnter
 บ&&&&&&&&&&ณ@~@@@@@@@@@@@ณ@~@@@@@@@@@@@@@@@@@@@ณ@~@@@@@@@@@@@@@ณ@~@@@@@@@@@@@ณ@~@@@@@@@ณ&#&&&&&&ณ&#&&&&&&&ณ@~@@@@@@@@@@@@@@@@@@@@ณ&&&&&&&&&&ณ@~@@@@@@@@@@@@ณ&&&&&&&&&&ณ&&&&&&&&&&ณ &#&&  ณ&&&&&&&&&&ณ&&&&&&&&&&ณ&#&&&&&&&&&&&&&บ
.}
 ศออออออออออฯอออออออออออออฯอออออออออออออออออออออฯอออออออออออออออฯอออออออออออออฯอออออออออฯออออออออฯอออออออออฯออออออออออออออออออออออฯออออออออออฯออออออออออออออฯออออออออออฯออออออออออฯอออออออฯออออออออออฯออออออออออฯอออออออออออออออผ
 ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออหอออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
 บ                                                      “คฅเฆ ญจ๏ จ ขงญฎแ๋                                      บ                                                     “คฅเฆ ญจ๏ จ ขงญฎแ๋                                        บ
 วฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤืฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤถ
 บ                   ขจค ใคฅเฆ ญจ๏                    ณ   ฏฅเจฎค  ใคฅเฆ ญจ๏   ณแใฌฌ  ใคฅเฆ ญจ๏,ณเ งฌฅเ ใคฅเฆ ญจ๏บ               ขจค ใคฅเฆ ญจ๏                       ณ    ฏฅเจฎค ใคฅเฆ ญจ๏   ณแใฌฌ  ใคฅเฆ ญจ๏, ณเ งฌฅเ ใคฅเฆ ญจ๏ บ
 บ             (ญฎฌฅเ จ ค โ  คฎชใฌฅญโ )               รฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤด      เใก,      ณ    ง  ฌฅแ๏ๆ    บ         (ญฎฌฅเ จ ค โ  คฎชใฌฅญโ )                  รฤฤฤฤฤฤฤฤฤฤฤยฤฤฤฤฤฤฤฤฤฤฤด      เใก,       ณง  ฌฅแ๏ๆ         บ
 บ                                                    ณ    แ      ณ    ฏฎ     ณ   จซจ ฏเฎๆฅญโ  ณ(ฏฅเจฎค), เใก   บ                                                   ณ      แ    ณ    ฏฎ     ณ  จซจ ฏเฎๆฅญโ    ณ(ฏฅเจฎค), เใก    บ
 วฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤืฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤถ
 บ                     18                             ณ    19     ณ    20     ณ       21       ณ      22        บ                       18                          ณ    19     ณ    20     ณ       21        ณ       22        บ
 ฬออออออออออออออออออออออออออออออออออออออออออออออออออออุอออออออออออุอออออออออออุออออออออออออออออุออออออออออออออออฮอออออออออออออออออออออออออออออออออออออออออออออออออออุอออออออออออุอออออออออออุอออออออออออออออออุอออออออออออออออออนÿ
.{
ÿ บ@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ณ&&&&&&&&&& ณ&&&&&&&&&& ณ&'#&&&&&&&&&&&&&ณ&'#&&&&&&&&&&&&&บ@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ณ&&&&&&&&&& ณ&&&&&&&&&& ณ&'#&&&&&&&&&&&&& ณ&'#&&&&&&&&&&&&&&บÿ
.if Flsch3New
ÿ ศออออออออออออออออออออออออออออออออออออออออออออออออออออฯอออออออออออฯอออออออออออฯออออออออออออออออฯออออออออออออออออสอออออออออออออออออออออออออออออออออออออออออออออออออออฯอออออออออออฯอออออออออออฯอออออออออออออออออฯอออออออออออออออออผÿ
.else
ÿ วฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤืฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤลฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤถÿ
.end
.}
ÿ                          ใๅฃ ซโฅเ
                                     ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤ     ฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤฤ          "ÿ&&ÿ" ÿ@@@@@@@@ÿ  ÿ&&&&ÿ ฃ.
                                         ซจ็ญ ๏ ฏฎคฏจแ์             เ แ่จไเฎขช  ฏฎคฏจแจ

ÿ.if Page54aNew
^
.end
.}
.endform