/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,2004 корпорация ГАЛАКТИКА                    ║
 ║ Проект       : ГАЛАКТИКА                                                  ║
 ║ Система      : Заработная плата                                           ║
 ║ Версия       : 7.11                                                       ║
 ║ Назначение   : Ведомость реестров по перечислениям                        ║
 ║                vedrees.vip                                                ║
 ║ Ответственный: Маслакова Татьяна Владимировна                             ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
#doc
Ведомость реестров по перечислениям
vedrees.vip
#end
.set name='vedrees'
.p 60
.hide
.fields
 За_месяц
 За_год
 Pred
 Bank
 Bank_Tek KolRab:word Summa:double
 Рук_пред Глав_бух
.endfields
^^^^
.{ vedrees_01 CheckEnter
.{ vedrees_02 CheckEnter
 ^ ^ ^
.}
.}
^^
.endform
!
!
!
.Linkform 'vedrees_01' Prototype is 'vedrees'
.nameinlist 'Ведомость реестров по перечислениям'
.p 60
.var KolList: integer
     SumList: double
     RabList: longint
     ItogSum: double
     ItogRab: longint
.endvar
.fields
CommonFormHeader
.endfields
^
.fields
 За_месяц
 За_год
 Pred
 Bank
.endfields
.begin  KolList:= 0
        SumList:= 0
        RabList:= 0
        ItogSum:= 0
        ItogRab:= 0
        end.
 Р                                           БВЕДОМОСТЬ Б
           реестров по перечислениям за ^ &&&& г.
           работникам @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
           Платежное поручение N ___________ от ____  ____________  2004 г.
           Получатель @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
.{ vedrees_01 CheckEnter
.[h OverWrite
.begin KolList:=KolList+1 end.
 ────────────────────────────────────────────────────┬────────────┬─────────────────────────────
              Наименование банка                     │Кол. человек│   Сумма (руб.)
 ────────────────────────────────────────────────────┼────────────┼─────────────────────────────
.]h Р
.{ vedrees_02 CheckEnter
.fields
  Bank_Tek KolRab Summa
.endfields
.begin SumList:= SumList + Summa
       RabList:= RabList + KolRab
       ItogSum:= ItogSum + Summa
       ItogRab:= ItogRab + KolRab
end.
 Р @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│&'~&&&&&&&&&│&'&&&&&&&&&&&&&&&&&&&&&&&&.&& Р
.}
.[f OverWrite
.fields
 KolList
 RabList
 SumList
.endfields
 Р ────────────────────────────────────────────────────┴────────────┴──────────────────────────────
 Итого по листу &&&:                                  &'~&&&&&&&&& &'&&&&&&&&&&&&&&&&&&&&&&&&.&& Р
.begin SumList:=0; RabList:= 0 end.
.]f
.}
.fields
 ItogRab
 ItogSum
 KolList
 DoubleToString(0, ItogSum)
 Рук_пред Глав_бух
.endfields
 С                                  ИТОГО ПО ВЕДОМОСТИ  &'~&&&&&&&&& &'&&&&&&&&&&&&&&&&&&&&&&&&.&& С
 Р Количество листов &&&
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

  Руководитель предприятия  ____________________ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

  Главный бухгалтер         ____________________ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Р

.endform
