/*
 ╔═══════════════════════════════════════════════════════════════════════════╗
 ║                     (c) 1994,97 корпорация ГАЛАКТИКА                      ║
 ║ Проект        : ГАЛАКТИКА                                                 ║
 ║ Система       : Заработная плата                                          ║
 ║ Версия        : 5.70                                                      ║
 ║ Назначение    : Классификатор условных обозначений                        ║
 ║ Ответственный : Погосский Константин Владимирович                         ║
 ╚═══════════════════════════════════════════════════════════════════════════╝
*/
#doc
Классификатор условных обозначений
#end
.set name = 'Zar_UO'
.hide
.fields
 Nyea
 Npred
 PayStr
 KGr
 VhT
 VhSS
.endfields
.{
^ ^ ^ ^ ^ ^
.}
.endform


.linkform 'Zar_UO_1' prototype is 'Zar_UO'
.nameinlist 'Классификатор условных обозначений (краткая)'
.p 80
.fields
 Nyea
 Npred
.endfields
    Классификатор условных обозначений
┌────────┬────────────────────────────────────┐
│  Код   │     Наименование                   │
│        │                                    │
│        │                                    │
├────────┼────────────────────────────────────┤
.{
│@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│
.}
└────────┴────────────────────────────────────┘
.endform


.linkform 'Zar_UO_2' prototype is 'Zar_UO'
.nameinlist 'Классификатор условных обозначений (полная)'
.defo landscape
.p 40
.fields
 Nyea
 Npred
 PayStr
 KGr
 VhT
 VhSS
.endfields
 Р     БКлассификатор условных обозначений Б
┌────────┬────────────────────────────────────┬────────────────────────────────────┬────────────────────────────────────┬──────────────────┐
│   БКод Б   │      БНаименование Б                   │            БВид оплаты Б               │            БКод группы Б               │     БВходимость Б    │
│        │                                    │                                    │                                    ├────────┬─────────┤
│        │                                    │                                    │                                    │ Бв отраб. Б│ Бв расчет Б │
│        │                                    │                                    │                                    │  Бвремя Б  │ Бс/c числ. Б│
├────────┼────────────────────────────────────┼────────────────────────────────────┼────────────────────────────────────┼────────┼─────────┤ Р
.{
 Р│@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@│  @@@@  │  @@@@   │ Р
.}
 Р└────────┴────────────────────────────────────┴────────────────────────────────────┴────────────────────────────────────┴────────┴─────────┘ Р
.endform
