//------------------------------------------------------------------------------
//                                                      (c) корпорация Галактика
// Галактика 5.84 - Отчеты контура логистики
// Показатели наличия ТМЗ
//------------------------------------------------------------------------------

#doc
Показатели наличия ТМЗ
#end
.set name = 'reestravans'
.hide
.fields
 fbDate feDate:date
 fDogovor:string
 fSrokpl:string
 fPlan:Double
 fFact:Double
 fVipisano:Double
.endfields
 ^^
.{
  ^^^^^
.}
.endform

#doc
Реестр поступления авансовых платежей по договорам сбыта
#end
.linkform 'reestr1' prototype is 'reestravans'
.group 'reestr1'
.NameInList 'Реестр поступления авансовых платежей по договорам сбыта'
.fields
 fbDate
 feDate
 fDogovor
 fSrokpl
 fPlan fFact fFact/fPlan*100
.endfields

                                  БРеестр поступления авансов,
                                 предусмотренных договорами сбыта
                              за период с @@@@@@@@@@@@ по @@@@@@@@@@@@ Б
┬──────────────────────────────────────────────────┬─────────────────────┬───────────────┬───────────────┬───────────┬
│                                                  │    Срок платежа     │      План     │  Фактически   │     %     │
│                                                  │                     │               │               │поступлений│
┴──────────────────────────────────────────────────┴─────────────────────┴───────────────┴───────────────┴───────────┴
.{
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&.&&  &'&&&&&&&&&.&& &'&&&&&&.&&
.}
.EndForm


#doc
Накопительный реестр поступления авансовых платежей по договорам сбыта
#end
.linkform 'reestr2' prototype is 'reestravans'
.group 'reestr2'
.NameInList 'Накопительный реестр поступления авансовых платежей по договорам сбыта'
.fields
 fbDate
 fDogovor
 fSrokpl
 fPlan fFact fFact/fPlan*100
.endfields

                           БНакопительный реестр поступления авансов,
                                 предусмотренных договорами сбыта
                                        на @@@@@@@@@@@@ Б
┬──────────────────────────────────────────────────┬─────────────────────┬───────────────┬───────────────┬───────────┬
│                                                  │    Срок платежа     │      План     │  Фактически   │     %     │
│                                                  │                     │               │               │поступлений│
┴──────────────────────────────────────────────────┴─────────────────────┴───────────────┴───────────────┴───────────┴
.{
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&.&&  &'&&&&&&&&&.&&  &'&&&&&&.&&
.}
.EndForm

#doc
Реестр неоплаченных авансов по договорам закупки
#end
.linkform 'reestr3' prototype is 'reestravans'
.group 'reestr3'
.NameInList 'Реестр неоплаченных авансов по договорам закупки'
.fields
 fbDate
 fDogovor
 fSrokpl
 fPlan fFact fPlan-fFact fVipisano
.endfields

                                  БРеестр неоплаченных авансов,
                                 по состоянию на @@@@@@@@@@@@ Б
┬──────────────────────────────────────────────────┬─────────────────────┬───────────────┬──────────────┬──────────────┬─────────────┬
│                                                  │    Срок платежа     │      План     │    Оплачен   │ Неоплаченный │   Выписано  │
│                                                  │                     │               │              │   остаток    │             │
┴──────────────────────────────────────────────────┴─────────────────────┴───────────────┴──────────────┴──────────────┴─────────────┴
.{
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@ &'&&&&&&&&&.&& &'&&&&&&&&&.&& &'&&&&&&&&&.&& &'&&&&&&&&&.&&
.}
.EndForm


#doc
Реестр плановых авансов по договорам закупки
#end
.linkform 'reestr4' prototype is 'reestravans'
.group 'reestr4'
.NameInList 'Реестр плановых авансов по договорам закупки'
.fields
 fbDate
 feDate
 fDogovor
 fSrokpl
 fPlan-fFact fVipisano
.endfields

                                  БРеестр плановых авансов,
                              предусмотренных договорами закупки
                           на период с @@@@@@@@@@@@ по @@@@@@@@@@@@ Б
┬──────────────────────────────────────────────────┬─────────────────────┬───────────────┬───────────────┬
│                                                  │    Срок платежа     │     Сумма     │   Выписано    │
│                                                  │                     │               │               │
┴──────────────────────────────────────────────────┴─────────────────────┴───────────────┴───────────────┴
.{
 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@@  &'&&&&&&&&&.&&  &'&&&&&&&&&&.&&
.}
.EndForm
